{
    "page_url": "https://steamrip.com/5d-chess-with-multiverse-time-travel-free-download-p1/",
    "title": "5D Chess With Multiverse Time Travel",
    "description": "5D Chess begins each game with an ordinary chess setup. As the game progresses, pieces can, following specific rules, be moved onto a past version of the board. To prevent time-travel-related paradoxes, instead of changing the “original” past, time travel in 5D chess results in the creation of an alternate timeline or “parallel universe”, for which the starting position is the same as the corresponding time-point in the original timeline but with the time-traveling piece added. Pieces can also be sent between these different “ timelines ” and, when moving across timelines, can move into that timeline’s “past”, “present”, or “future”. Car Dealership Simulator\nBoth players have to make a move on each existing active timeline e.g. if there are 3 separate active timelines, each turn consists of 3 moves. All timelines are active except those created consecutively by the same player, so that if one player creates two or more timelines before the opposing player creates any, all but the first of the created timelines become inactive; making a move on inactive timelines is optional. The game ends in stalemate if the latter condition is met but the player’s king is not in check; in this case, the result is a draw. In general, the more moves have elapsed, the more complicated the game becomes due to the creation of new timelines.\nThe rules of piece movement are generalized from standard chess rules, with time and timelines being axes of movement, as with ranks and files. For example, a rook can move any number of spaces along one axis, so a player can send the rook into its current position, but any number of turns in the past, using time as an axis of movement. Bishops move any number of spaces in exactly two axes, so it is possible, for example, to move a bishop three squares vertically and three turns into the past. Knights move two spaces on one axis and one on another axis – for example, a knight may move to any adjacent space into a timeline that is two timelines away. Kings move one space in any number of axes. For example, a valid move for a king is to simultaneously go one space over horizontally.\nQueens move any number of spaces equally on any number of axes. A valid move for a queen could be moving 4 spaces vertically, 4 horizontally, into a timeline that is 4 timelines away, and 4 turns into that timeline’s past. Pawns can move through time and timelines under certain conditions. In addition to the standard six chess pieces, the game includes its own fairy chess pieces, the unicorn and dragon (which can move any number of spaces equally through exactly three or four dimensions, respectively) and the princess (which moves like a Queen but is restricted to a maximum of two dimensions of movement). These pieces can be used in alternate board configurations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/5d-chess-with-multiverse-time-travel-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/5d-chess-with-multiverse-time-travel-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 8.1, 8, or 7. 64-bit.",
        "Processor": "2Ghz or better.",
        "Memory": "512 MB RAM",
        "Graphics": "OpenGL 3.3 compatibility (everything since about 2010).",
        "Storage": "50 MB available space"
    },
    "game_info": {
        "Genre": "Indie",
        "Developer": "Conor Petersen, Thunkspace, LLC",
        "Platform": "PC",
        "Game Size": "51 MB",
        "Released By": "N/A",
        "Version": "v1.1.00f-7-16 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hxmon0l4hdi3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/5d-chess-with-multiverse-time-travel-preinstalled-steamrip.jpg"
}