{
    "page_url": "https://steamrip.com/60-seconds-reatomized-free-download-1k/",
    "title": "60 Seconds! Reatomized Free Download",
    "description": "Get 60 Seconds! Reatomized PC game for free instantly and play pre-installed on SteamRiP\nDolores, Ted, Mary Jane and Timmy return to face the nuclear apocalypse in this new, remastered edition of the classic atomic adventure – 60 Seconds! Reatomized, featuring 4K support, refreshed 2D graphics and hand-drawn 3D textures, new interactive menu, improved UI system, a technical refresh, and of course. New content With only 60 seconds left to impact, go on a mad dash through the house in search of family members and useful supplies.\nEverything will be against you: time, your very own furniture, a house that’s different every time you play, and the fundamental question what to take with you and who to leave behind? Reaching the fallout shelter in time, alive, is only the beginning. Whatever you scavenged and whoever you saved will play a vital role in your survival. Each survival story will be different, with every day surprising you with unexpected events. Will all of these stories end well? It’s up to you. Ration food and water, make best use of your supplies, face difficult choices and even venture into the wasteland. In the game 60 Seconds you get 60 seconds to scavenge. Whatever items (and people) you manage to get in those 60 seconds will determine your fate. Outlast 2",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/60-seconds-reatomized-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/60-seconds-reatomized-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64 Bit",
        "Processor": "i5-2430M",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GT540",
        "DirectX": "Version 10",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Strategy",
        "Developer": "Robot Gentleman",
        "Platform": "PC",
        "Game Size": "616 MB",
        "Repack By": "Mr_GOLDBERG (cs.rin.ru)",
        "Version": "v1.1.5.32 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p0gxkfbyt9pp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/60-seconds-reatomized-free-download-preinstalled-steamrip.jpg"
}