{
    "page_url": "https://steamrip.com/9-kings-free-download/",
    "title": "9 Kings",
    "description": "Build your city into the most powerful of all kingdoms through endless combinations of buildings , units, spells, and positioning. Take advantage of chaotic combos and powerful perks to break the game and become overpowered. Grow your kingdom in strategic ways, prepare for dozens of unique events, and show the world your kingdom can outlast all others. Survive the Fall\nFrom humble village to massive citadel , your capital recruits your units and grows their power. Expand your kingdom strategically over time and build it to survive decades of war and strife.\nFrom sturdy knights and warlocks, to glass cannon wizards and bombers , to hordes of fiendish imps and sentient mushrooms, there are dozens of units to lead and fight. Stockpile gold to hire thousands of mercenaries to your cause, use dark magic to raise the dead, and harness nature itself to bring down your enemies!\nEach of the kings has a different starting deck of buildings, troops , and spells, but you can loot the rival kings who attack your lands to access cards from their unique decks. Make peace with those whose units don’t fit your playstyle, and declare war against kings with the powers and units you covet, deploying the tools acquired from your enemy to unlock countless combinations of stacking buffs and modifiers to build an invincible army.\nCombine your cards in endless ways – try out insane builds and watch massive armies fight for your crown, survive as long as you can against increasingly powerful enemies, or break the game and watch all challengers crumble before you",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/9-kings-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/9-kings-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64-bit)",
        "Processor": "Intel® Core™ i5-750 (quad-core) / AMD® Phenom™ II X4 965 (quad-core)",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GT 630 (2 GB) / AMD® Radeon™ HD 6670 (2 GB)",
        "DirectX": "Version 11",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy, Early Access",
        "Developer": "Sad Socket",
        "Platform": "PC",
        "Game Size": "129 MB",
        "Released By": "Mr_GOLDBERG emu | Ty democefepime csrin",
        "Version": "v0.7.17 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fmf4bf12ooy6",
        "https://buzzheavier.com/70ysox4pnebe"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/9-kings-preinstalled-steamrip.jpg"
}