{
    "page_url": "https://steamrip.com/9-years-of-shadows-free-download-n1/",
    "title": "9 Years of Shadows Directly Download",
    "description": "9 Years of Shadows is a side-scrolling Metroidvania by Halberd Studios. Travel alongside Europa, a brave warrior determined to enter the mechanical giant Talos and stop the corruption within before it swallows the world in darkness. Battle through tainted creatures, meet charismatic musicians and uncover the truth behind the curse that robbed the land of all color. Deflector\nMany have tried to venture inside the twisted depths of Talos, a dormant fortress where several civilizations have settle over centuries. And, after losing everything she held dear, Europa has nothing holding her back from attempting what others could not achieve. As a noble fighter who refuses to be bound by the curse, she must enter the castle, find the source of corruption, and return the color once and for all.\nThis adventure is not for Europa to face alone. Inside the giant, she befriends Apino, a cute floating bear who seems to possess magical abilities that can restore color and replenish the health of his allies. He is also able to shield his companions from the multiple dangers that roam Talos’ hallways. Use the elements to your advantage to travel the map dynamically.\nAcquire the elemental armors that were once treasures to ancient civilizations and change on the fly and unlock special abilities to traverse your way: from swimming against waterfalls to traveling underground tunnels or gliding through warm air currents. Harness the power of lightning, water, earth, and fire. Surprise bosses while you switch armors, perform strong halberd combos, and exploit your foes’ weaknesses to pave your way through the heart of the shadows .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/9-years-of-shadows-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/9-years-of-shadows-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-9100F",
        "Memory": "8 GB RAM",
        "Graphics": "GT 730",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Halberd Studios",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.41 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rtz18o4s5wkm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/9-years-of-shadows-preinstalled-steamrip.jpg"
}