{
    "page_url": "https://steamrip.com/911-operator-free-download-y1/",
    "title": "911 Operator",
    "description": "In 911 OPERATOR, you take on the role of an emergency dispatcher, who has to rapidly deal with the incoming reports. Your task is not just to pick up the calls, but also to react appropriately to the situation – sometimes giving first aid instructions is enough, at other times a police, fire department or paramedics’ intervention is a necessity.\nKeep in mind, that the person on the other side of the line might turn out to be a dying daughter’s father, an unpredictable terrorist, or just a prankster . Can you handle all of this? Check out thousands of cities from all around the world. Riftbound\nThe Free Play mode lets you choose a city to play on – the game will download its map, along with real streets, addresses and the emergency infrastructure . You can also try the Career mode, which contains 6 cities with unique events – survive an earthquake in San Francisco and save Washington, D.C. from bomb attacks.\nA number of police, fire department and paramedic units are at your disposal . The forces may use a variety of vehicles (from common ambulances to police helicopters), essential equipment (e.g., bulletproof vests, first aid kits and technical tools) and consist of team members with different abilities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/911-operator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/911-operator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2 GHz",
        "Memory": "1024 MB RAM",
        "Graphics": "512 Mb",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Jutsu Games",
        "Platform": "PC",
        "Game Size": "910 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 7533741 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3h2mtq21dxpg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/911-operator-preinstalled-steamrip.jpg"
}