{
    "page_url": "https://steamrip.com/a-few-quick-matches-free-download/",
    "title": "A Few Quick Matches",
    "description": "A fast-paced, easy to play, tiny platform fighter for 1-4 players, built to honor the era where stick fights ruled the internet Gatekeeper\nSTYLE ON EVERYONE We wanted A FEW QUICK MATCHES to feel like an old-school stick fight, which means flashy animations and impactful moments! To attain this feel, we made it so that most successful hits can be cancelled into air dashes, meaning your follow-up routes are nearly infinite. Deep- diving into this combo system is incredibly rewarding, and landing a well-executed chain of attacks feels uniquely satisfying. While this mechanic is not necessary to enjoy your battles , those who choose to embrace it will push the game to its limits!\nFIGHT ANYONE! We designed our game with online play in mind. A FEW QUICK MATCHES harnesses the amazing magic of ROLLBACK NETCODE to ensure smooth, lag-free battles across the internet. Host lobbies to challenge your friends, or hop into quickplay to match up with any player in your region .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/a-few-quick-matches-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/a-few-quick-matches-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Microsoft® Windows® 7 / 8 / 10 / 11",
        "Processor": "1.2GHz processor",
        "Memory": "512 MB RAM",
        "Graphics": "DirectX Compatible graphics card with at least 32MB of video memory",
        "DirectX": "Version 9.0c",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "Studio Bidou",
        "Platform": "PC",
        "Game Size": "133 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.3.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9h0vcso9woa6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/a-few-quick-matches-preinstalled-steamrip.jpg"
}