{
    "page_url": "https://steamrip.com/game-of-thrones-the-board-game-digital-edition-free-download-n1/",
    "title": "A Game of Thrones The Board Game – Digital Edition Download",
    "description": "A Game of Thrones: The Board Game – Digital Edition is the digital adaptation of the top-selling strategy board game from Fantasy Flight Games. During the game, players spread their influence across Westeros through a combination of strategic planning, masterful diplomacy, and military might.\nAs one of the Great Houses, will you conquer with force, forge alliances, rally your townsfolk, or cunningly coerce your way to the Iron Throne? Based on the best-selling A Song of Ice and Fire series of fantasy novels by George R.R. Martin, A Game of Thrones: The Board Game – Digital Edition allows up to six players to play online, or a single player with up to five AI opponents to play locally. SANABI\nThe game is set after the death of King Robert Baratheon and allows each player to assume the role of one of the Great Houses of the Seven Kingdoms in an attempt to assault King’s Landing and claim the Iron Throne. To be declared ruler of the Seven Kingdoms, you have 10 rounds to use diplomacy and warfare to your advantage to control as many strategic areas of the map.\nConquer with care as your resources are scarce and your troops are not expendable. Muster your army, plan your orders wisely and seize strategical lands with your Footmen, Knights, Siege Engine and ships. During the turmoil of a battle, use well-known characters from your house to take the upper hand and vanquish your enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/a-game-of-thrones-the-board-game-digital-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/a-game-of-thrones-the-board-game-digital-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8.1, Windows 10 (64bit version only)",
        "Processor": "Intel Pentium D or AMD Athlon 64 X2",
        "Memory": "2 GB RAM",
        "Graphics": "card with DX11 or OpenGL 3.x capabilities",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Dire Wolf",
        "Platform": "PC",
        "Game Size": "158 MB",
        "Released By": "GOG",
        "Version": "v1.0.1.1330 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lfoks6bn2h28"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/a-game-of-thrones-the-board-game-digital-edition-preinstalled-steamrip.jpg"
}