{
    "page_url": "https://steamrip.com/a-total-war-saga-thrones-of-britannia-free-download-1s/",
    "title": "A Total War Saga THRONES OF BRITANNIA Free Download",
    "description": "The year is 878 AD, the embattled English king Alfred the Great has mounted a heroic defence at the battle of Edington, and blunted the Viking invasion. Chastened – but not yet broken – the Norse warlords have settled across Britain. For the first time in nearly 80 years, the land is in a fragile state of peace. Throughout this sceptred isle, the kings of England, Scotland, Ireland and Wales sense a time of change approaching; a time of opportunity. There will be treaties. Bread & Fred\nThere will be turns of fortune that become the stuff of legend, in a saga that charts the ascent of one of history’s greatest nations. Thrones of Britannia is a standalone Total War game which will challenge you to re-write a critical moment in history, one that will come to define the future of modern Britain. With ten playable factions, you must build and defend a kingdom to the glory of Anglo-Saxons, Gaelic clans, Welsh tribes or Viking settlers. Forge alliances, manage burgeoning settlements, raise armies and embark on campaigns of conquest across the most detailed Total War map to date.\nThe Grand Campaign offers multiple routes to a glorious Victory; aggressively expand your territory through force of arms, acquire renown through construction, advanced technology and influence, or complete a series of unique objectives based on your chosen faction’s history. Once completed, steady yourself for a significant late-game challenge and the final, Ultimate victory condition. From the snowy highlands of Scotland to the orchards and meadows of Kent, push back the fog-of-war and unveil the extent of Anglo-Saxon Britain. Varied towns, cities and rural settings inspire a host of different battlefield environments.\nExperiment with the strategic opportunities afforded by newly capturable minor settlements. Throttle your enemies’ trade routes and coax them out of strong, defensible positions. Each faction will face a series of unique events and branching dilemmas, often based on authentic historical events and issues of the time. Embark on Viking expeditions, manage the Anglo-Saxon peasant economy, each faction feels and plays differently. Carve out unique roles for your King and Nobles, customise their impact by making meaningful choices about their development and determine how their story will unfold.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/a-total-war-saga-thrones-of-britannia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/a-total-war-saga-thrones-of-britannia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64Bit",
        "Processor": "Intel® Core™ 2 Duo 3.0Ghz",
        "Memory": "5 GB RAM",
        "Graphics": "NVIDIA GTX 460 1GB | AMD Radeon HD 5770 1GB | Intel HD4000 @720p",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "CREATIVE ASSEMBLY",
        "Platform": "PC",
        "Game Size": "6.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.2.3 | Full  + Blood, Sweat and Spears DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/eDv6Hk",
        "https://buzzheavier.com/80td50qdqgf7",
        "https://megadb.net/epitdhtobi5m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/a-total-war-saga-thrones-of-britannia-preinstalled-steamrip.jpg"
}