{
    "page_url": "https://steamrip.com/a-way-out-free-download-p1/",
    "title": "A Way Out Free",
    "description": "Get A Way Out pc game for free instantly and play pre-installed on SteamRiP\nFrom the creators of Brothers – A Tale of Two Sons comes A Way Out, an exclusively co-op adventure where you play the role of one of two prisoners making their daring escape from prison. What begins as a thrilling breakout quickly turns into an unpredictable, emotional adventure unlike anything seen or played before. A Way Out is an experience that must be played with two players. Each player controls one of the main characters, Leo and Vincent, in a reluctant alliance to break out of prison and gain their freedom. Nickelodeon\nA hardened inmate with escape in his sights, Leo isn’t the type to make friends. No matter the obstacle, Leo is willing to get his hands dirty and do whatever it takes to get the job done. VINCENT – Even though he’s fresh off the prison bus, Vincent is determined to break out. With quick wits and nothing left to lose, he’ll prove that he’s not to be underestimated by anyone, inside prison or out. Escaping prison with a complete stranger isn’t ideal circumstances, but Leo and Vincent have too much riding on it to second-guess themselves now. As freedom gets closer and closer, they’ll have to learn to trust each other if they want to make it to the other side. Use teamwork to solve puzzles and overcome obstacles . Sneak, fight, run, drive, even go for a little fishing along the way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/a-way-out-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/a-way-out-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit, 8.1 64-bit or Windows 10 64-bit",
        "Processor": "Intel core i3-2100T @ 2.5GHz/AMD FX 6100, or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650Ti 2GB, AMD Radeon HD 7750 2GB",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Hazelight",
        "Platform": "PC",
        "Game Size": "21 GB",
        "Repack By": "CPY",
        "Version": "v1.0.62 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/a7vdhmfunn2h",
        "https://gofile.io/d/FdT2mL",
        "https://datanodes.to/c2a6ofcb9zhi/A-Way-Out-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/a-way-out-free-download-preinstalled-steamrip.jpg"
}