{
    "page_url": "https://steamrip.com/abiotic-factor-free-download/",
    "title": "Abiotic Factor",
    "description": "Home to the world’s greatest minds, GATE operates a global network of secretive research laboratories, spanning every field of scientific study – and the realms beyond. Chrono Ark\nAs a GATE employee you extend the bounds of human knowledge, and seek to explain the unexplainable including anomalies and paranormal entities: from gravity-distorting artifacts to supernatural creatures with an unbridled instinct for violence. Safety, security, and secrecy are of the utmost importance usually.\nAfter a catastrophic containment breach, your workplace has become a cosmic battle zone: anomalous entities are on the loose, enemies from other dimensions are invading via portals , and an arcane military sect known as The Order is targeting personnel and entities indiscriminately, aiming to seize artifacts and put an end to the chaos.\nContainment procedures have failed and help isn’t on the way. Stranded miles beneath the surface, it’s up to you and your fellow scientists to band together, plan your escape, and make this underground complex your new home – for now.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/abiotic-factor-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/abiotic-factor-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later",
        "Processor": "i5-8th Gen CPU or similar",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 950 or Radeon HD 7970",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Simulation",
        "Developer": "Deep Field Games",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.0.20513 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ber3g2rw5vt6",
        "https://buzzheavier.com/7ml4ju8v3ksp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/abiotic-factor-preinstalled-steamrip.jpg"
}