{
    "page_url": "https://steamrip.com/above-snakes-free-download-1l/",
    "title": "Above Snakes",
    "description": "Experience a mixture of creation and mild survival elements in this isometric Wild West-inspired adventure RPG. Build your own world piece by piece while navigating various biomes and battling against the elements or – even worse – dangerous Lost Souls. Gather resources, construct bases, and craft weapons and tools to hunt, fish, farm, and fight. Unleash your creativity and create the world of your dreams from different biomes .\nEach biome offers various materials and resources that you can use to progress through your adventure and to build your equipment and base. Find food, make nourishing meals and craft necessities. Landlord’s Super\nExpand your base and build essential workstations such as a workbench, a saw mill, a furnace, or an anvil. Enhance your crafting skills to create more advanced gear and tools that help you advance Create your very own outpost and base with a simple but clever modular building system. Make it your own with hand-crafted furniture and beautiful gardens. Enjoy a relaxed sundown in a rocking chair on your porch.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/above-snakes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/above-snakes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10-64 bit",
        "Processor": "Intel Core i3-10100 or AMD Ryzen 3 3100",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 1030",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Simulation",
        "Developer": "Square Glade Games",
        "Platform": "PC",
        "Game Size": "871 MB",
        "Released By": "TENOKE",
        "Version": "v1.4.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gfqp6nlrkol6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/above-snakes-preinstalled-steamrip.jpg"
}