{
    "page_url": "https://steamrip.com/absolver-free-download-w1/",
    "title": "Absolver Free",
    "description": "Absolver v1.31 game for free instantly and play pre-installed on SteamRiP\nIn the ruins of the fallen Adal Empire, you awaken with a mysterious mask on your face, and faint recollections of an esoteric ceremony. Freeing you from hunger, thirst, and even death, the mask is the creation of the Guides, the rulers of these lands, who have placed you here to determine whether you are worthy of becoming part of the elite corps of Absolvers .\nAs you wander these forsaken lands, encountering other Prospects like you, you will learn new combat styles, acquire weapons, gear and armor, and build a team of warriors with whom to fight side by side in Arenas of combat. Fluid Real-Time Combat: Position yourself in one of four tactical stances during real-time battles and execute devastating attacks, dodges, and parries.\nMovement becomes your weapon as you engage in solo duels or intense multiplayer battles. Customizable Style and Flow: Players will define their character’s playstyle by picking a combat style, a weapon of choice, and arranging attacks in their Combat Deck to design their unique and personal attack flow. Online Multiplayer Action and Narrative: Prospects and Absolvers will seamlessly encounter others in the world, generating unique stories that emerge through player interaction and choices.\nThese moments are filled with tension as intentions to battle or befriend are never clear: trust is always a leap of faith. Encounters will have lasting consequences and transform into meaningful relationships as you make friends or enemies and find mentors or disciples.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/absolver-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/absolver-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/8.1/10 x64",
        "Processor": "Intel Core i7-950 (4 * 3000) or equivalent / AMD Phenom II X4 965 (4 * 3400) or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 480 (1536 MB) / Radeon HD 7850 (2048 MB)",
        "DirectX": "Version 9.0",
        "Network": "Broadband Internet connection",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Sloclap",
        "Platform": "PC",
        "Game Size": "10.4 GB",
        "Co-op By": "Online-fix.me",
        "Version": "v1.31 | Full  (Latest) + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q0b9q5mge9dk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/absolver-preinstalled-steamrip.jpg"
}