{
    "page_url": "https://steamrip.com/academia-school-simulator-free-download-t1/",
    "title": "Academia School Simulator",
    "description": "Build a high school with fantastic facilities like science labs, basketball courts, and art rooms, or do the bare minimum and live off government subsidies Will you offer your delinquent students counseling, or simply send them to detention to let them waste their lives away?\nWill you hire the best teachers or cheap out and build giant classrooms with a 1:100 teacher to student ratio? Will you build enough toilets, or snicker as your students are forced to relieve themselves in the bushes? The choice is yours Academia : School Simulator is a cheerful yet challenging management game from the artist of Prison Architect and the studio that brought you Political Animals. United Offensive\nStudent motivation is driven by various needs, including hygiene, hunger, and discipline, and they’ll become even more complex as time goes on, eventually competing in school competitions like spelling bees and even falling in love. Teachers are unique, with different subject specialties and degrees. Eventually they will also have their own motivations that need to be satisfied so they can keep teaching at the highest level.\nBuild Canteens, Clinics , Computer Labs, Common Areas and much more as you create your dream Educational Complex. Do you think the janitors aren’t doing a good job? Plot out their routes yourself in order to ensure maximum efficiency.\nFrom potted plants to statues and fountains , we have everything to make your school the envy of all And we’ll keep adding decorative objects so that you can have a completely unique school. Students that look like zombies and eat brains? why not? Want to run a school where the students are literally prisoners? Whatever floats your boat Image mods are available now, and language and other mods will follow in the future.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/academia-school-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/academia-school-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7,8,8.1,10 64-bit",
        "Processor": "2.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "onboard",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Squeaky Wheel Studio Inc",
        "Platform": "PC",
        "Game Size": "186 MB",
        "Released By": "Mr Goldberg (cs.rin.ru)",
        "Version": "v1.0.42 (Build 7279601) | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0zx0mttkbzip"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/academia-school-simulator-pre-installed-steamrip.jpg"
}