{
    "page_url": "https://steamrip.com/actraiser-renaissance-free-download-o1/",
    "title": "Actraiser Renaissance Free direct Download",
    "description": "Get Actraiser Renaissance for free instantly and play pre-installed on SteamRiP\nRealm Acts: Strategically cast powerful fire, ice, and other magic in these 2D action stages. Humans return to reclaim the realm after you conquer these stages, allowing you to begin cultivating your settlements. New magic that was not available in the original game has been added along with the ability to dodge. Players can also attack with upward and downward motions for a more dynamic action experience. You will need every new trick in your arsenal to defeat stronger bosses at the end of the new action stages.\nRealm Management : Help humanity flourish by cultivating your settlements and offering guidance. Use your miraculous powers to summon lightning and trigger earthquakes to remove obstacles such as trees and boulders that impede the growth of your chosen. Play as the Lord of Light’s angel and use your mighty bow and arrows to drive back the evil monsters that prey on your people. No Man’s Sky\nProtect your settlements from enemy raids in real-time strategic battles. The placement of your forts and timing of your miracles is key to achieving victory in these engagements. Experience all-new tales of humanity’s struggles to overcome their flaws and failings as they learn to love one another and together grow stronger. Altogether, these new scenarios amount to more than twice the story present in the original. Explore the vast new realm and enjoy building your settlements for longer than ever before.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/actraiser-renaissance-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/actraiser-renaissance-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 8.1 64-bit / Windows® 10 64-bit",
        "Processor": "AMD A8-7600, Intel® Core™ i3-3210",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ R7 240,NVIDIA® GeForce® GT 730",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Simulation, Strategy",
        "Developer": "Square Enix, Sonic Powered",
        "Platform": "PC",
        "Game Size": "3.63 GB",
        "Repack By": "CODEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kvps8fu9fisq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/actraiser-renaissance-free-download-preinstalled-steamrip.jpg"
}