{
    "page_url": "https://steamrip.com/adaca-free-download-1q/",
    "title": "ADACA",
    "description": "Fresh out of a Cryo-Pod, you find your arm replaced with a robotic prosthetic capable of force-manipulating loose objects, including enemy weapons. This may come in rather handy, considering the law isn’t quite fond of you or your new friends ADACA is a strange and old world, full of dark mysteries. There are powerful, dangerous secrets out there in the rust, and many factions are looking to uncover them for their own ends. ADACA is an episodic sandbox FPS heavily inspired by story-driven titles of the late 90’s and early 2000’s.\nThis game features a heavy emphasis on exploration and manipulation of the environment to defeat your foes and solve puzzles using your gravity-manipulating robotic arm Fight overwhelming odds as Jessy Thorn in a story-driven, campaign adventure broken up into multiple Episodes. Team up with new found comrades to survive a planet’s dark past reemerging. Patrol the Exclusion Zone as Sgt. Lexi Abrams in an alternate Non-linear Exploration experience, featuring its own unique Quests and Missions Delve into the enigmatic Calico Valley Exclusion Zone to uncover the dark secrets of the company that once controlled it. Cartel Tycoon",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/adaca-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/adaca-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7-10 (64 bit)",
        "Processor": "2.3 GHz (or faster) Quad-core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "Dedicated graphics card, with at least 2gb of V-ram.",
        "DirectX": "Version 12",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Siris Pendrake",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "TiNYiSO",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vqr28h4wlf9h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/adaca-preinstalled-steamrip.jpg"
}