{
    "page_url": "https://steamrip.com/aerial_knights-never-yield-free-download-1g/",
    "title": "Aerial_Knight’s Never Yield",
    "description": "Take the role of Wally. A mysterious character that has recovered what was taken from him. Hopefully, you’re fast enough to outrun your enemies. Expose the truth and try to uncover the mystery of what happened to them. With an average runtime of an action movie (about an hour and a half on Normal), a first run of this action-packed adventure can be enjoyed in an afternoon. Afterwards you can improve your score. Aerial_Knight’s Never Yield is a 3D side-scroller that plays much like a classic endless runner . The game has an interesting story that keeps players always in motion. Fobia – St. Dinfna Hotel\nRun, Jump, Slide or “Dash” for acrobatic variants leading to dope combinations and avoid the challenges that await. Aerial_Knight’s Never Yield is being built for players wholove to speedrun games while being an experience that casual players will enjoy as well. This Soundtrack for Aerial_Knight’s Never Yield is being done by “ Danime -Sama” A Detroit artist with vocals from artists from all over the world.\nThis project began as just a passion project I started on my own to create something familiar but new for this generation of gamers while highlighting aspects of a culture that is often overlooked . I really hope you enjoy the game once its released and follow my journey to create new and interesting games",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/aerial-knights-ever-yield-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/aerial-knights-ever-yield-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP SP2",
        "Processor": "2.6 GHz single core",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX 9.0c compatible graphics card",
        "DirectX": "Version 9.0c",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Aerial_Knight",
        "Platform": "PC",
        "Game Size": "593 MB",
        "Released By": "DARKSiDERS",
        "Version": "Build 8333347 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/koyr0xmog1d3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/aerial-knights-ever-yield-preinstalled-steamrip.jpg"
}