{
    "page_url": "https://steamrip.com/afterlove-ep-free-download/",
    "title": "Afterlove EP",
    "description": "Afterlove EP is a blend of visual novel, narrative adventure and rhythm game elements from the creator of Coffee Talk and What Comes After. Night Slashers: Remake\nStep into the shoes of Rama, a young musician struggling to move on with life after the death of his girlfriend, Cinta.\nWhilst his close friends and bandmates are all determined to help him move on, Rama has been stuck for more than a year. He’s neglecting his music, his mental health and his relationships.\nMaking things harder, he’s hearing Cinta’s voice inside his head, unsure if she is a spirit or part of his imagination.\nRama’s band has a critical gig in one month’s time. Either he gets serious about his music and delivers the new songs he has been promising or the band will move on without him.\nOver twenty -eight days and nights it will be your choices that determine the path Rama takes. Explore the city, choose which relationships to repair and which new ones to pursue. Come to terms with the past, rediscover your creative voice and help Rama shape a future for himself.\nDiscover modern day Jakarta through side-scrolling exploration, engage in deep and meaningful conversations with the characters of your choosing and jam with your band in rhythm game sections.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/after-love-ep-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/after-love-ep-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7+",
        "Processor": "2GHz Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible GPU",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Pikselnesia",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.18 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ntc5jb8c7arz",
        "https://buzzheavier.com/61dsfobu9zg1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/after-love-ep-preinstalled-steamrip.jpg"
}