{
    "page_url": "https://steamrip.com/afterimage-free-download-1l/",
    "title": "Afterimage Directly Download",
    "description": "A great deity created the world named Engardin , leaving four goliaths before her departure. The Goliaths abided by their different divine callings and upheld the order and flow of this world. Hence, the lives in Engardin reincarnated and multiplied. Humans were the last creation, and their ever-expanding ambitions led to a protracted war against the Goliaths . Engardin was engulfed in flames, until a huge explosion known as “The Razing” devastated the Holy Grounds of mankind and brought a swift end to the conflict. But the divine order was broken, and lives withered away. The age of mankind came to an end. Roots of Pacha\nThe survivors of the conflict scattered across Engardin. Severed from the Well of Mankind and unable to reincarnate, they banded together to form settlements. Years have passed since this great cataclysm, and the remaining human settlements have been suddenly assaulted by mystic forces. Renee, a young amnesiac girl and student of Aros, was the lone survivor of the attack on her village.\nDetermined to recover her forgotten memories and locate her lost mentor, she bids farewell to her destroyed village to embark on a journey that will inexplicably set into motion a series of events that will determine the fate of this new world. Engardin is not only filled with sublime beauty but also plagued by crises. The ruins of Engardin are home to many treasures and secrets, but the Corrupted are waiting for their next prey and ancient deadly traps are ready to kill the careless.\nWith humanity in retreat, nature and the creatures that inhabit it have reclaimed Engardin as their own. Battle through over 170 varieties of enemies and 30 tough boss encounters that stand between you and your goal. Bountiful rewards await those who can weather these brutal combat trials. Harness and channel the power of defeated enemies to unlock powerful skills and upgrade a diverse arsenal of weaponry. Become the master of your own fighting style with over 200 different equipment to collect and choose from including 6 classes of main weapon, sub weapon, armor, and accessories .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/afterimage-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/afterimage-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64bit)",
        "Processor": "Intel Core 2 Duo E4500 | AMD Athlon 64 X2 5600+",
        "Memory": "4 GB RAM",
        "Graphics": "Intel UHD  630",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Aurogon Shanghai",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "TENOKE emu",
        "Version": "Build 11375425 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jas6j37b19b5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/afterimage-preinstalled-steamrip.jpg"
}