{
    "page_url": "https://steamrip.com/against-the-storm-free-download-a1/",
    "title": "Against the Storm",
    "description": "You are the Viceroy – a leader charged by the Scorched Queen to reclaim the wilderness and discover lost riches for the Smoldering City, civilization’s last bastion against the Blightstorm that destroyed the old world. Unlike most survival city builders where your focus is on a single city, in Against the Storm you must build a vast, prosperous network of settlements populated by diverse fantasy races, each with their own specializations and needs.\nThe wilderness holds many hidden dangers, and never-ending storms will batter your population into submission. If your settlements should fall, then the expedition may end – but not the game. Against the Storm is a roguelite city builder, meaning you will carry forward the resources, upgrades, and experience of your past expeditions each time you set off for a new journey into the wild. Born of Bread\nFoxes, Beavers, and lizards stand alongside humans and harpies in the struggle to survive. Utilize each group’s strengths as you balance their varying needs, from housing and culinary preferences to taste in luxuries and recreation. Will you manufacture raincoats, brew ale, and bake pies to boost morale in the face of the oppressive hostility of the forest, or will you prioritize the needs of one species over another to operate more swiftly for the Scorched Queen?\nExperience core city builder gameplay enhanced by roguelite replayability . Build and manage multiple settlements spread out across a large world map, all while collecting valuable meta-progression resources to upgrade the Smoldering City.\nFeel the pressure of an expectant monarch as the Scorched Queen demands constant progress while recurring Blightstorms pose an inevitable threat to your settlements. Manage your reputation to secure your success at any one settlement before moving on to establish another, constantly seeking new opportunities for growth, taking on unique challenges across multiple biomes, and bracing for the inevitable destruction of everything but the Smoldering City itself. How will you maximize each cycle to not just ensure the best fate for the Smoldering City, but for your career as Viceroy as well?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/against-the-storm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/against-the-storm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64-bit)",
        "Processor": "Intel® Core™ i3-530 (dual-core) / AMD® Phenom™ II X4 965 (quad-core)",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTS 450 (1 GB) / AMD® Radeon™ HD 7750 (1 GB)",
        "DirectX": "Version 10",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Eremite Games",
        "Platform": "PC",
        "Game Size": "4.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.8.4R | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/7yqg50qdxsfr",
        "https://megadb.net/yja6uqaavr2h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/against-the-storm-preinstalled-steamrip.jpg"
}