{
    "page_url": "https://steamrip.com/age-of-history-3-free-download/",
    "title": "Age of History 3",
    "description": "Embark on an epic journey with Age of History 3, which takes you through the vast timeline of human history. From the Age of Civilization to the realms of the far future, play as various Civilizations ranging from dominant empires to small tribes. Forgive Me Father 2\nTechnology Advance in the technology tree to unlock better buildings and stronger units, improving your Civilization. Each technological breakthrough opens up new possibilities, reflecting the evolution and growth of your Civilization through History.\nArmy Composition The choice of units in the front and second line is vital. Front-line units need to be resilient and capable of dealing with direct combat, while second-line units should provide support, range attacks , or specialized functions.\nWith more than 63 unique unit types available, you have a vast array of army compositions to select from, offering a diverse range of strategic options.\nNew Battle System Each day, the front-line units of both armies engage in combat with the enemy’s front-line, provided they are within attack range. Simultaneously, the second-line units also participate by attacking the enemy’s front-line units if they fall within their range.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/age-of-history-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/age-of-history-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/8/10/11 64-bit",
        "Processor": "2.7 GHz Single Core",
        "Memory": "3 GB RAM",
        "Graphics": "Hardware Accelerated  with dedicated memory",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Łukasz Jakowski",
        "Platform": "PC",
        "Game Size": "707 MB",
        "Released By": "Mr_GOLDBERG (Ty Dound csrin)",
        "Version": "Build 10345765 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/eYBnDn",
        "https://megadb.net/342kgg6hyws8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/age-of-history-3-preinstalled-steamrip.jpg"
}