{
    "page_url": "https://steamrip.com/age-of-darkness-final-stand-free-download-p1/",
    "title": "Age of Darkness: Final Stand Download",
    "description": "Get Age of Darkness Final Stand for free instantly and play pre-installed on SteamRiP\nBuild, Gather and Fight in a Desperate Last Stand Against an Onslaught of Never Ending Evil The darkness is an entity of evil. Some say it is the manifestation of human fear and nightmares, others say it is a wandering mass of damned souls haunting us. The origin of the darkness itself is unknown, but one thing for certain is that we can keep it at bay through the power of light and fire. Brace yourself against huge tidal waves of Nightmares .\nLeveraging an internally developed technology called ‘SwarmTech’ allows the game to render over 70,000 enemy units on the screen at one time. These enemy legions claw their way up through seething fissures in the earth to reinforce ‘The Veil’. Light up a rich, complex, procedurally generated map to claim territory back from ‘The Veil’. A dynamic living death fog that conceals enemies and drains life from your troops .\nHolding the line against this terror is not for the faint of heart. Borrowing from the the roguelite genre, Malices are random afflictions placed on the player during every Death Night, unraveling the best made plans. Conversely, if a Death Night is survived, you may decide between three randomly selected Blessings , enriching the experience and giving your army a much needed edge .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/age-of-darkness-final-stand-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/age-of-darkness-final-stand-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3-3220 (3.30 GHz) / AMD A8-7600 (3.1 GHz)",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 750 Ti / AMD Radeon R7 265",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "PlaySide",
        "Platform": "PC",
        "Game Size": "7.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j6hc1jx50etf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/age-of-darkness-final-stand-free-download-preinstalled-steamrip.jpg"
}