{
    "page_url": "https://steamrip.com/age-of-grit-free-download-k1/",
    "title": "Age of Grit",
    "description": "Step into the dusty boots of Jebediah Rockwell the grizzled captain of a beat-up, steam-powered airship. You and your ship’s crew will adventure across a vast, Wild West world in a story rich RPG Upgrade your airship with sharpshooting rifles, menacing Gatling guns, devastating cannons , and countless other steampunk gear. Build your fortune with each job you do and with each outlaw your blast out of the sky. Try yer hand at bounty hunting, dueling outlaws, smuggling contraband ’bout anything to pay the bills and keep yer ship in the sky\nExplore a vast, original world known simply as The West. Travel to dozens of hand-crafted towns, discovering The West’s lore and uncovering its hidden secrets. You play as Captain Jebediah Rockwell. As the game’s story unfolds you’ll uncover his mysterious past and determine his destiny. Inspired by the story rich CRPGs of old, Age of Grit features deep, character-driven dialog. Crowns and Pawns: Kingdom of Deceit\nYou’ll chin wag with countless unique and engaging characters. Conversate with the townsfolk to hear the latest gossip, fetch yerself a swell gig, or if yer chat goes south things might end with a duel in the sky When trouble comes sniffin’ yer way you’ll settle things in the sky. Battle enemy airships using a deeply strategic , turn-based combat system. Allocate yer steam wisely or this fight might could be yer last Buy or scavenge loot to upgrade yer old, beat-up, steam-powered freighter. Upgrade your ship’s armor, engines, and sensors. Outfit yer ship with the finest weaponry The West has to offer rifles, Gatling-guns, cannons, flamethrowers and more",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/age-of-grit-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/age-of-grit-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/ 8 / 7",
        "Processor": "2 GHz",
        "Memory": "1 GB RAM",
        "Graphics": "1280×720 minimum resolution; 1 GB video memory; NVIDIA GeForce GT 220 or ATI Radeon HD 5450"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "IQ Soup",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "DOGE",
        "Version": "Build 8665747 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3ndkablh86fg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/age-of-grit-preinstalled-steamrip.jpg"
}