{
    "page_url": "https://steamrip.com/age-of-mythology-extended-edition-free-download-1g/",
    "title": "Age of Mythology: Extended Edition",
    "description": "The classic real time strategy game that transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortals. Use mythological creatures like Minotaurs and Cyclopes to bolster your armies’ strength. Call upon the gods for assistance in flattening enemy towns with meteors or scatter opposing troops with lightning storms. DRAGON BALL Z: KAKAROT Age of Mythology (Age of Mythology) is a strategy where all actions will take place in real time, and the gameplay will be based on the mythology of various world countries. Your main task is the complete destruction of all supporters of the enemy forces who dare to stand in your way. There is no mercy here, and that is why try to pay as much attention as possible to improving your combat skills .\nIn order to achieve the task more effectively, you will need to develop and improve your combat army, with which you will embark on the path of resistance. Your army will basically consist of mythological creatures, and each of its members will have distinctive features, a corvette can greatly influence the outcome of a battle. The game project was presented as a re-release of the classic game, which has been improved in all aspects, and will also give a lot of positive emotions to the user. Go to a dangerous mythical world where you must do everything possible in order to destroy as many supporters of evil as possible, thereby giving hope for prosperity.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/age-of-mythology-extended-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/age-of-mythology-extended-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista, 7, 8.1+",
        "Processor": "1.6 Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "Direct X 10+ Capable GPU",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "SkyBox Labs, Ensemble Studios",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Released By": "ALI213",
        "Version": "v2.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nq7dldhy64yj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/age-of-mythology-extended-edition-preinstalled-steamrip.jpg"
}