{
    "page_url": "https://steamrip.com/aircraft-carrier-survival-free-download-1k/",
    "title": "Aircraft Carrier Survival",
    "description": "Take control of the aircraft carrier, its crew, officers and planes during WW2 . Give an example of military prowess by choosing the right equipment, crew, and escort for the mission. Remember that your success will depend greatly on your flexibility in managing the available fleet resources. Assign a crew and choose what your officers should focus on. Winter Ember\nYour ship has many stations to man, and proper management will be the key to executing your plan, whether by taking on an enemy directly, sneaking past them, or taking an alternative route to completely avoid contact. Your damage control teams can handle fire outbreaks, torpedo strikes, hull flooding, enemy bombardment, airstrikes, and suicide attacks from enemy planes, but not all of them at once.\nAssess which threats need to be dealt with first in order to survive . Use maneuvers, aircraft, anti-aircraft turrets, and whatever else you can to survive the enemy attack. Make sure that any enemy who dares to attack you will end up in the depths of the Pacific. Will you risk all lives on the vessel to save the one in need? Do you have what it takes to make a decision on the spot?\nNo matter what, some sacrifices will be necessary and the only source of redemption is victory. Use intel collected during recon missions to prepare pilots and aircraft for large operations. Target enemy land bases and even their entire fleets. Identify opponents before choosing attack directions and deciding the sequence of targets and maneuvers.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/aircraft-carrier-survival-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/aircraft-carrier-survival-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "windows 7,8 10",
        "Processor": "Intel Core i3-2100 / AMD Phenom II X4 965",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 550 Ti / Intel HD 620",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Simulation",
        "Developer": "Gambit Games Studio",
        "Platform": "PC",
        "Game Size": "4.4 GB",
        "Released By": "FLT",
        "Version": "Build 8589024 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ycfqck36drer"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/aircraft-carrier-survival-preinstalled-steamrip.jpg"
}