{
    "page_url": "https://steamrip.com/airport-ceo-free-download-1x/",
    "title": "Airport CEO  Link",
    "description": "Airport CEO game for free instantly and play pre-installed on SteamRiP\nAirport CEO is a tycoon and management game where you take the seat as a CEO of your own airport. You will build the airport’s infrastructure with everything from runways and taxiways, gates and aprons to constructing terminals with check-in, security, restaurants and shops. You will manage the business perspective of the airport by hiring employees and executives, making deals with airline companies and making sure that ends meet by keeping an eye on budget and resources. Candy Disaster Tower Defense\nYou will have to cater to the passengers by keeping waiting time to a minimum, by having friendly and helpful staff around and by making passengers feel secure, keeping any potential incidents at bay; a happy passenger is a spending passenger. Hopefully you won’t run into any problems such as stressed out employee , equipment breakdowns or bad weather which can cause massive delays or even emergency landings. You will be held accountable when things go wrong and filthy rich when things go right.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/airport-ceo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/airport-ceo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit)",
        "Processor": "Intel: Intel Core 2 Duo 2.4 GHz | AMD: 3 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Any (minimum 2 GB dedicated VRAM)",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Apog Labs",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.1 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/eew92hre2zff"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/airport-ceo-preinstalled-steamrip.jpg"
}