{
    "page_url": "https://steamrip.com/alan-wake-2-free-download-v12/",
    "title": "Alan Wake 2 Directly Download",
    "description": "Alan Wake, a lost writer trapped in a nightmare beyond our world, writes a dark story in an attempt to shape the reality around him and escape his prison. With a dark horror hunting him, Wake is trying to retain his sanity and beat the devil at his own game. Anderson and Wake are two heroes on two desperate journeys in two separate realities, connected at heart in ways neither of them can understand: reflecting each other, echoing each other, and affecting the worlds around them. Fears to Fathom – Ironbark Lookout\nFueled by the horror story, supernatural darkness invades Bright Falls, corrupting the locals and threatening the loved ones of both Anderson and Wake. Light is their weapon—and their safe haven — against the darkness they face. Trapped in a sinister horror story where there are only victims and monsters , can they break out to be the heroes they need to be?\nSolve a Deadly Mystery What begins as a small-town murder investigation rapidly spirals into a nightmare journey. Uncover the source of the supernatural darkness in this psychological horror story filled with intense suspense and unexpected twists.\nPlay As Two Characters Experience both Alan Wake’s and Saga Anderson’s stories and see events unfold from different perspectives. Switch between Anderson’s life-or-death race to solve the case and Wake’s desperate attempts to rewrite his reality to escape the depths of the Dark Place.\nExplore Two Worlds Experience two beautiful yet terrifying worlds, each with its own rich cast of characters and deadly threats. Discover majestic landscapes of Cauldron Lake in the Pacific Northwest and the idyllic towns of Bright Falls and Watery. Contrasting sharply, attempt to escape the nightmarish cityscape of the Dark Place.\nSurvive With Light With limited resources, take on powerful supernatural enemies in desperate close-combat situations. It takes more than just a gun to survive: light is the ultimate weapon in the fight against the darkness and will be your refuge when enemies threaten to overwhelm you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/alan-wake-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/alan-wake-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or 11 (64-bit)",
        "Processor": "Intel i5-7600K or AMD equivalent",
        "RAM": "16 GB",
        "Video card": "GeForce RTX 2060 or Radeon RX 6600, 6 GB",
        "HDD": "82 GB"
    },
    "game_info": {
        "Genre": "Action-Adventure, Horror, Shooter",
        "Developer": "Remedy Entertainment",
        "Platform": "PC",
        "Game Size": "102 GB",
        "Released By": "RUNE emu",
        "Version": "v1.2.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/63541FA837",
        "https://buzzheavier.com/xy2sm8ez5ult"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/alan-wake-2-preinstalled-steamrip.jpg"
}