{
    "page_url": "https://steamrip.com/alice-madness-returns-free-download-v1/",
    "title": "Alice Madness Returns",
    "description": "Eleven years ago a horrific fire took Alice’s family from her and left her mind horrifically scarred. Afterwards she was confined to Rutledge Asylum, where she struggled to confront her demons by slipping further into her fantasy world of Wonderland. Now, after ten years, she has finally secured her release yet she still bears the heavy psychological burden of that tragic event.\nWith her mind in tatters, she is unable to resolve the fear prompted by her strange memories, dreams, and visions. Perhaps she’ll do better in Wonderland. She always has. She travels there, seeking what the “real” world can’t provide: security, knowledge, and the truth about the past.\nBut in her absence, Wonderland too has suffered. Something has gone horribly wrong, and now a great evil is descending upon what once was her beautiful refuge. Can Alice save Wonderland —and herself—from the madness that consumes them both? International Basketball Manager 23",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/alice-madness-returns-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/alice-madness-returns-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1, Windows Vista with SP2, Windows XP with SP3",
        "Processor": "Intel Core2 Duo (or equivalent) running at 1.60GHz",
        "Memory": "2048MB or greater",
        "Hard Disk Space": "8.5 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Spicy Horse Games",
        "Platform": "PC",
        "Game Size": "6.5 GB",
        "Released By": "Steamless EXE",
        "Version": "Build 7889667 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CpTHMq",
        "https://buzzheavier.com/s88lbr8cktiq",
        "https://megadb.net/gc9mln52s23k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/alice-madness-returns-preinstalled-steamrip.jpg"
}