{
    "page_url": "https://steamrip.com/alien-rogue-incursion-vr-free-download/",
    "title": "Alien: Rogue Incursion",
    "description": "Experience the universe of the Alien films like never before: in terrifyingly immersive single-player VR. An all-new action-horror entry into the classic franchise, Alien: Rogue Incursion transforms you into Zula Hendricks –the ex-Colonial Marine hellbent on exposing Weyland-Yutani’s black-site experiments–on an extremely dangerous mission to the uncharted planet Purdan. A Day Out\nWith her synth companion Davis 01 for guidance, Zula must infiltrate the infested Gemini Exoplanet Solutions research facility and survive the ever-present threat of the most cunning Xenomorphs ever encountered, with both skilled stealth and serious firepower at her disposal. And when the threat she discovers has extinction-level consequences, Zula suddenly finds herself with humanity’s fate on her shoulders.\nPART ONE OF A TWO-PART STORY\nZula’s Fight Begins Here: Part One of this gripping two-part story thrusts you into the violent world of ALIEN, where you will uncover the secrets lurking within the GES facility on LV-354, the enigmatic planet Purdan. This installment stands alone as a complete story yet leaves you hanging on a thrilling cliffhanger, eager to dive deeper into Zula’s unfolding story in Part Two, where she will face new challenges and deadlier enemies.\nThis game requires a VR headset in order to play.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/alien-rogue-incursion-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/alien-rogue-incursion-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-10700K / AMD Ryzen 7 5800X",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce RTX 2080 Super / Radeon RX 6700-XT",
        "DirectX": "Version 12",
        "Storage": "45 GB available space",
        "VR Support": "Meta Quest 2, Meta Quest 3, Index, Rift S"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Survios",
        "Platform": "PC",
        "Game Size": "36.6 GB",
        "Released By": "RUNE emu",
        "Version": "Build 16805697 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Q2Hg2s",
        "https://buzzheavier.com/mz71gab9zyvj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/alien-rogue-incursion-preinstalled-steamrip.jpg"
}