{
    "page_url": "https://steamrip.com/aliens-fireteam-elite-free-download-1m/",
    "title": "Aliens: Fireteam Elite Free Download",
    "description": "Get Aliens: Fireteam Elite PC game for free instantly and play pre-installed on SteamRiP\nSet in the iconic Alien universe, Aliens: Fireteam Elite is a cooperative third-person survival shooter that drops your fireteam of hardened marines into a desperate fight to contain the evolving Xenomorph threat. Face off against waves of terrifying Xenomorph and Weyland-Yutani Synthetic foes alongside two players or AI teammates, as you and your fireteam desperately fight your way through four unique campaigns that introduce new storylines to the Alien universe.\nCreate and customize your own Colonial Marine, choosing from an extensive variety of classes, weapons, gear and perks, battling overwhelming odds in this heart-pounding survival shooter experience. Play a pivotal role in the epic events that occur 23 years after the original Alien trilogy as a Colonial Marine stationed aboard the UAS Endeavor, battling terrifying Xenomorph threats. Serin Fate\nStunning visuals, iconic enemies, realistic environments, powerful weapons, futuristic equipment, and an eerie soundscape , combined with new storylines in a series of replayable campaigns, expand upon the story from the blockbuster films. Choose from five unique classes – Gunner , Demolisher, Technician, Doc and Recon – each with their own special abilities and character perks.\nUtilize an extensive arsenal of 30+ weapons and 70+ mods/attachments in your effort to eradicate the Alien threat. An innovative Perk Board modifies and improves your abilities, while a unique Challenge Card system alters the approach to each Campaign mission, offering a new experience with every playthrough.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/aliens-fireteam-elite-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/aliens-fireteam-elite-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD Athlon X4 950 / Intel i5-2500K",
        "Memory": "8 GB RAM",
        "Graphics": "AMD R9 285 4GB / Nvidia GTX 760 4GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Cold Iron Studios",
        "Platform": "PC",
        "Game Size": "16 GB",
        "Released By": "FLT",
        "Version": "v1.0.5.101570 (Pathogen Update) | Full  + 7 DLCs + Win7 Fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/5lkr9tbcpi25",
        "https://datanodes.to/y60wa0d8u74k/Aliens-Fireteam-Elite-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/aliens-fireteam-elite-free-download-preinstalled-steamrip.jpg"
}