{
    "page_url": "https://steamrip.com/alien-isolation-free-download-1x/",
    "title": "Alien: Isolation Directly Download",
    "description": "Discover the true meaning of fear in Alien: Isolation, a survival horror set in an atmosphere of constant dread and mortal danger. Fifteen years after the events of Alien, Ellen Ripley’s daughter, Amanda enters a desperate battle for survival, on a mission to unravel the truth behind her mother’s disappearance. As Amanda, you will navigate through an increasingly volatile world as you find yourself confronted on all sides by a panicked, desperate population and an unpredictable, ruthless Alien. L.A. Noire\nUnderpowered and underprepared, you must scavenge resources, improvise solutions and use your wits, not just to succeed in your mission, but to simply stay alive. Overcome an ever-present deadly threat Experience persistent fear as a truly dynamic and reactive Alien uses its senses to hunt you down and respond to your every move. Improvise to survive Hack systems, scavenge for vital resources and craft items to deal with each situation.\nWill you evade your enemies, distract them or face them head on? Explore a world of mystery and betrayal – Immerse yourself in the detailed setting of Sevastopol , a decommissioned trading station on the fringes of space. Encounter a rich cast of inhabitants in a world scarred by fear and mistrust. When she left Earth, Ellen Ripley promised her daughter Amanda she would return home for her 11th birthday.\nAmanda never saw her again. Fifteen years later, Amanda, now a Weyland-Yutani employee, hears that the flight recorder of her mother’s ship, the Nostromo , has been recovered at the remote trading station Sevastopol. The temptation for her to finally understand what happened is too much to resist. When the crew arrive at Sevastopol, they find something is desperately wrong. It all seems to be connected to an unknown menace, stalking and killing deep in the shadows .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/alien-isolation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/alien-isolation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (32bit)",
        "Processor": "3.16Ghz Intel Core 2 Duo E8500",
        "Memory": "4 GB RAM",
        "Graphics": "1GB (AMD Radeon HD 5550 or Nvidia GeForce GT 430)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Creative Assembly, Feral Interactive (Mac), Feral Interactive (Linux)",
        "Platform": "PC",
        "Game Size": "18.7 GB",
        "Released By": "GOG",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://1fichier.com/?bppg58ws6xsqt8sfpq59",
        "https://buzzheavier.com/8wpuen8l9eqq",
        "https://datanodes.to/lah5seahikpd/Alien-Isolation-SteamRIP.com.rar",
        "https://megadb.net/o8t7646h5z3c"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/alien-isolation-preinstalled-steamrip.jpg"
}