{
    "page_url": "https://steamrip.com/aloft-free-download/",
    "title": "Aloft",
    "description": "Aloft is a feel-good, cozy survival game set in the clouds, where you can transform any island into a flying ship and explore the vast skies. Navigate the world, discover new islands, gather resources, build your dream home, and take care of your animals , solo or as a group of up to 8 friends. Tales of Graces f Remastered\nYet within nature’s beauty, a corruption spreads. Root it out and cure the fungi threat that devours all other life. Uncover lost knowledge, brew powerful antidotes, enrich the biodiversity of the islands, and restore balance to the airborne ecosystem.\nAloft’s feel-good survival is more about rewarding positive action than punishing mistakes. The sky provides everything you need; cook up delicious meals for buffs, gather resources to craft tools, and explore to find new technology. Soar the open sky freely and discover ancient ruins to uncover the secrets of the past.\nBuild and customize it into your personal home. With a helm, rudder, and sails constructed, you are ready to sail the winds and explore the skies. You are the captain of your adventure!\nThe wind is an ever-present ally in Aloft.\nInstall windmills and a network of cables and pulleys to automate your machines and production . Fly into strong winds to supercharge your crafting power and sailing speed, but make sure your sails can handle it",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/aloft-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/aloft-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10+, 64-bit",
        "Processor": "Intel® Core™ i5-8600K / AMD Ryzen™ 5 3600",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 1060 6GB / AMD Radeon™ RX 580 / Intel® Arc™ A750",
        "DirectX": "Version 11",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Early Access",
        "Developer": "Astrolabe Interactive Inc.",
        "Platform": "PC",
        "Game Size": "6.5w GB",
        "Released By": "Ty Rabbit54, ⎝⎝✧GͥOͣDͫ✧⎠⎠ (csrin) | CreamAPI emu",
        "Version": "v0.3.1.5 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/aEb8e9",
        "https://megadb.net/3q7qbxstbfgb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/aloft-preinstalled-steamrip.jpg"
}