{
    "page_url": "https://steamrip.com/amanda-the-adventurer-free-download-1p/",
    "title": "Amanda the Adventurer",
    "description": "Having inherited their Aunt Kate’s house, Riley Park starts exploring what the reclusive woman left behind. In the attic, Riley is surprised to find a stack of VHS tapes next to an old TV set. The tapes seem to be episodes of an early 2000’s era children’s cartoon they have never seen before. Intrigued, Riley pops the first tape into the VCR.\nNot the highest budget production from the looks of it. It appears to have been made locally and features a little girl named Amanda and her loyal yet shy best friend, Wooly the Sheep. While the episode appears charming and simple on the surface, an uneasiness starts to settle in as Riley realizes that Amanda and Wooly seem to be communicating directly through the television set. The Last Case of Benedict Fox\nA gnawing feeling in the back of their mind presses them to stop, but Riley is compelled to continue watching the tapes. It’s almost as if Amanda needs something, and Riley becomes fascinated with finding out what that something may be.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/amanda-the-adventurer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/amanda-the-adventurer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or higher",
        "Processor": "Dual-core Intel or AMD processor, 2.0 GHz or Faster",
        "Memory": "4 GB RAM MB RAM",
        "Graphics": "NVIDIA GeForce 470 GTX or MD Radeon 6870 HD Series",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie",
        "Developer": "MANGLEDmaw Games",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.6.17b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m6d2p7iolhr2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/amanda-the-adventurer-preinstalled-steamrip.jpg"
}