{
    "page_url": "https://steamrip.com/american-truck-simulator-free-download-3a/",
    "title": "American Truck Simulator Free Download Direct Link",
    "description": "Experience legendary American trucks and deliver various cargoes across sunny California, sandy Nevada, and the Grand Canyon State of Arizona. American Truck Simulator takes you on a journey through the breathtaking landscapes and widely recognized landmarks around the States. Game mechanics are based on the highly successful model from Euro Truck Simulator 2 and have been expanded with new features, creating the most captivating game experience from SCS Software. American Truck Simulator puts you in the seat of a driver for hire entering the local freight market, making you work your way up to become an owner-operator, and go on to create one of the largest transportation companies in the United States.\nDrive highly detailed truck models officially licensed from iconic truck manufacturers . Your truck is your new home. Make it yours by changing cabins, chassis, paintjobs, adding tuning accessories or more powerful engines. Lots of different cargoes to choose: From food to machinery to hazard cargoes. Multiple types of trailers – from reefers to flatbeds, from dumpers to lowboys and goosenecks. The longest trailers (up to 53 ft) will challenge your skills and patience while hauling and during parking .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/american-truck-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/american-truck-simulator-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Dual core CPU 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTS 450-class (Intel HD 4000)",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "SCS Software",
        "Platform": "PC",
        "Game Size": "21.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.55.2.1s | Full  (Latest) + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/lq8w7q7hnih6",
        "https://buzzheavier.com/engkc0eqbgw2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/american-truck-simulator-free-download-pc-steamrip.jpg"
}