{
    "page_url": "https://steamrip.com/ancestors-the-humankind-odyssey-free-download-1s/",
    "title": "Ancestors: The Humankind Odyssey",
    "description": "Ancestors: The Humankind Odyssey is a third-person open world survival game where you Explore, Expand, and Evolve to advance your clan to the next generation in this exhilarating new adventure from Panache Digital Games.\nEmbark on the most incredible odyssey known to humankind: human evolution. Spanning from 10 million to 2 million years ago, begin your journey, before us, in Neogene period Africa. Explore a beautiful yet ruthless world, from swinging through tree branches in the jungle to stalking prey across the golden savannah grasslands.\nDecide what attributes to learn and hone in order to pass down knowledge to future generations, from crafting tools to enhancing evasive tactics against predators. Just like real life, make sure to eat, drink, and sleep to stay alive and have the energy to face any danger that may come your way. Grow your clan and find strength in numbers as you progress through critical evolutionary stages of human evolution. Your choices will write your clan’s story and determine if you can survive your evolution. BIGFOOT",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/ancestors-the-humankind-odyssey-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/ancestors-the-humankind-odyssey-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 Sp1 64-bit",
        "Processor": "Intel Core i5-2500K or AMD Phenom II X6 1100T",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 760 (4GB) or Radeon HD 7950 (3GB)"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Panache Digital Games",
        "Platform": "PC",
        "Game Size": "8 GB",
        "Released By": "GOG",
        "Version": "v1.4.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/30xwwnkw7yn5",
        "https://megadb.net/wpu2k60nh2uu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/ancestors-the-humankind-odyssey-preinstalled-steamrip.jpg"
}