{
    "page_url": "https://steamrip.com/ancient-warfare-3-free-download-q1/",
    "title": "Ancient Warfare 3 Free Download",
    "description": "Ancient Warfare 3 Download PC Game In Direct Link for free on SteamRIP\nAncient Warfare 3 is a complete redevelopment of the second part to improve the experience from the core of the game. Dive into a huge sandbox full of action and customization Choose from different game modes like Deathmatch, reach point, conquest, king of the hill, zombie survival and more.\nCreate you own scenarios in the custom battle editor. Choose your rules, change the environment, place units, objects or traps, choose your equipment or just relax and spectate a battle Explore content from different eras ranging from stone age, medieval ages, WWI, WWII to the future.\nFight your enemies on the ground, in the air or on the ocean, it’s your choice Your player and other units can use a very advanced and mixed equipment which allows dynamic combat . Use a sword to cut your enemies into pieces, a baton to punch them down, guns or bows to shoot at them, or an rpg to blow them up. Protect yourself with a shield and wear armor to get some protection for different kind of weapons.\nTo support you and your mates, you can carry different grenades, health packs or ammo supplies. The custom battle editor allows you to create your very own scenarios. Adjust the biome , environment, objects, equipment, units, Create compositions of objects that can be placed in custom battles",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/ancient-warfare-3-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/ancient-warfare-3-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Quad Core 2.5GHz+",
        "Memory": "3 GB RAM",
        "DirectX": "Version 11",
        "Storage": "3000 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy, Early Access",
        "Developer": "Jannik Nickel",
        "Platform": "PC",
        "Game Size": "497 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.46.0.1 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/saf3y6z33pzj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/ancient-warfare-3-free-download-preinstalled-steamrip.jpg"
}