{
    "page_url": "https://steamrip.com/ancient-cities-free-download/",
    "title": "Ancient Cities",
    "description": "You will have to guide your people through generations, discovering and improving technologies , managing resources and population, building your city organically and facing other tribes in a fully simulated world and ecosystem. Our Adventurer Guild\nTake your time to build your ancient city, step into our ancestors footsteps and get immersed in the ancient times.\nIn Ancient Cities you can play at any time and place of the European Stone Age. From the warm Mediterranean to cold Scandinavia and from the end of the Ice Age to the end of the Neolithic.\nIn each time and place you will have historically accurate forests , animals, buildings, tools, resources and knowledge of each culture that you will have to manage to survive in the harsh ancient times.\nAncient Cities reduces micromanagement through intelligent automation. Organise and build while your citizens perform the tasks that best suit their specific skills and knowledge.\nIn the regional game layer, you will be able to trade or attack neighbouring tribes or perhaps decide to migrate elsewhere if resources become scarce.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/07/ancient-cities-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/07/ancient-cities-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64-bit)",
        "Processor": "Intel® i7-6700 / AMD® Ryzen 5 1600",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 1050 (2 GB) / AMD® Radeon™ RX-560 (4 GB)",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation, Strategy",
        "Developer": "Uncasual Games",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "TENOKE",
        "Version": "v1.7.34 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n0elrf7voayg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/ancient-cities-preinstalled-steamrip.jpg"
}