{
    "page_url": "https://steamrip.com/animal-shelter-free-download-1u/",
    "title": "Animal Shelter Family Bundle",
    "description": "Your main goal in Animal Shelter will be to look after, treat, and give shelter to those under your care. You will have plenty of work to do with the shelter, which will become a refuge for any creature in need and will certainly help in finding suitable future owners. Keep in mind that the future owner-pet duo must complement each other. Your main goal? Finding a suitable home for your pets Who doesn’t love taking pictures of their pets? We provide you with your own photo room, where you can create extraordinary photo sessions. Unpacking\nBe creative , play around, and finally use the photos as decorations for the shelter. This will surely attract the attention of new visitors The adoption process is very lengthy and can give your pets a hard time. Remember to monitor their needs: from hunger and health to willingness to play and love. Special name cards will certainly come in useful. Their job will be to indicate the current needs of your little ones.\nAn entertained pet is a happy pet Your pets will spend most of their stay at the facility in comfy boxes, which is why you have to take care of the right amount of daily entertainment and exercise to keep them strong, healthy , and relaxed. Pet them, hand out treats, play with balls or lasers, and they will surely repay you with great trust and a happy muzzle.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/animal-shelter-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/animal-shelter-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 Bit / Windows 8 64 Bit / Windows 10 64 Bit",
        "Processor": "Intel Core i3 3.0 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 780",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "Games Incubator",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.3.6 | Full  + All DLCs + OST",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8rzj0fddj01o",
        "https://pixeldrain.com/u/boxEv6W5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/animal-shelter-preinstalled-steamrip.jpg"
}