{
    "page_url": "https://steamrip.com/anno-mutationem-free-download-z1/",
    "title": "ANNO Mutationem",
    "description": "Welcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements you become Ann: a highly-skilled combat -trained lone wolf on a personal mission in the giant Metropolis, full of sinister mega-corporations, mysterious fringe groups and creatures more bizarre than words can express. This is a world full of surprises waiting for you to find out While going thru the main story you can chat with a Cyborg corgi, take on a part-time bartender job, hunt down vicious criminals reveal the true face of a trending V-streamer TUNIC\nBy exploring diverse locations such as neon Noctis Town, an off-shore cargo ship and huge underground structures, players are free to go as they please and act as they want. Unique 2D-to-3D gameplay, seamless switching between 2D Action n’ Platforming and 3D Exploration to interact with the world and its inhabitants . Let’s dive into pixel gaming from another perspective Ann will slash, shoot, combo, grenade-throw & ground pound her way through hordes of enemies and huge bosses. From great swords to double blades, from pistols to rocket launchers and uppercuts, time to become the one-girl army you always knew you had in you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/anno-mutationem-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/anno-mutationem-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1(64 bit)",
        "Processor": "Intel i3 4130 / AMD FX 4100",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 750 / Radeon HD 7750",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Uuvana Studios",
        "Platform": "PC",
        "Game Size": "8.4 GB",
        "Released By": "CODEX Emu",
        "Version": "v1.1.02.30 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yciqb7hps9wi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/anno-mutationem-preinstalled-steamrip.jpg"
}