{
    "page_url": "https://steamrip.com/another-crabs-treasure-free-download/",
    "title": "Another Crab’s Treasure",
    "description": "Another Crab’s Treasure is a soulslike adventure set in a crumbling underwater world. As Kril the hermit crab, you’ll need to wear the trash around you as shells to withstand attacks from enemies many times your size. Embark on an epic treasure hunt to buy back your repossessed shell, and discover the dark secrets behind the polluted ocean. Eiyuden Chronicle: Hundred Heroes\nTRASH OR TREASURE? In this undersea society, trash is not only a way of life, but a valuable resource, used for everything from fashion to firearms. But with the presence of trash comes a mysterious infection known as the Gunk, which could spell doom for the entire ocean.\nLEARN FROM NATURE As Kril explores the ocean, he’ll gain a variety of Umami Techniques—powerful attacks learned from the denizens of the seas. Punch your enemies with the overwhelming might of a Mantis Shrimp, ensnare them with the horrifying Bobbit Worm, and much more.\nUNEXPLORED DEPTHS The ocean goes deeper than one can imagine. Fight your way through kelp forests, coral reefs, sand castle cities, and even the unfathomable darkness of the deep-sea trenches, all in the name of getting back your prized shell.\nPLAY AT YOUR OWN PACE Designed to be an approachable experience for newer soulslike players as well as provide a challenge for hardcore fans, Another Crab’s Treasure offers something for any level of skill or time commitment. Assist options are provided for those seeking a less frustrating experience, but gluttons for punishment are sure to find the default game a challenge.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/another-crabs-treasure-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/another-crabs-treasure-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or newer",
        "Processor": "2.5 GHz or faster",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 970 or equivalent",
        "DirectX": "Version 10",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Aggro Crab",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "RUNE emu",
        "Version": "v2.0.000.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jwsw7tleh249",
        "https://buzzheavier.com/m18zyqvyevph",
        "https://1fichier.com/?m0kmq4ll5mbczu9xg8id"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/another-crabs-treasure-preinstalled-steamrip.jpg"
}