{
    "page_url": "https://steamrip.com/ants-took-my-eyeball-free-download/",
    "title": "Ants Took My Eyeball",
    "description": "Destroy hostile insects and other creatures with a variety of guns, melee weapons, gadgets and trinkets. Use your exceptional mobility to run, jump and dash around your enemies to avoid damage and to gain positional advantage. FlyKnight\nPROCEDURALLY GENERATED LEVELS Explore procedurally generated levels of the mysterious ant hill, with various diverse biomes with their own unique enemies, traps and loot. No run will be the same, as each adventure into the ant hill provides you with new challenges and opportunities.\nLOOT, LOOT, LOOT Find as many new melee weapons, guns, gadgets and trinkets as possible to improve your odds against the powerful enemies that await you. Scrap items for gold and components, upgrade your weapons to more powerful variants, and hoard as many trinkets as possible\n1-4 PLAYER LOCAL CO-OP Fight your way through the ant hill either alone or together with friends! Play with full controller support or get hands-on with keyboard and mouse. Steam Remote Play is also supported\nPERMANENT PROGRESSION Spend gems between runs to upgrade your base with furniture that gives you a nice little head start for your future runs. And who knows, there could also be other permanent unlocks to be found somewhere deep inside the ant hill.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/ants-took-my-eyeball-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/ants-took-my-eyeball-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "7, 8 or 10",
        "Processor": "Dual Core CPU",
        "DirectX": "Version 9.0",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Bosmic Forge",
        "Platform": "PC",
        "Game Size": "158 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.7.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cstppz4p5hre"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/ants-took-my-eyeball-preinstalled-steamrip.jpg"
}