{
    "page_url": "https://steamrip.com/anvil-saga-free-download-1h/",
    "title": "Anvil Saga",
    "description": "Turn a ramshackle blacksmith shop into a successful enterprise in a challenging and endlessly varied world! Deal with local bandits, merchants, priests, as well as French and English soldiers. Manage workers with various quirks, improve facilities and tools to create better merchandise, decorate your smithy to attract high-paying customers and most importantly – try not to get yourself beheaded Prototype 2\nConstruct new rooms and underground facilities in order to expand your smithy and take on the more challenging orders. From a simple kitchen to living quarters, to logging or woodcarving workshops – each room needs to be outfitted with the appropriate furniture and décor . Customers, relationships and decisions – they all matter! Maintain your reputation with conflicting factions, each one offering protection and bonuses for your budding enterprise.\nThe orders which you decide to fulfil and the way you deal with each faction influences the game world and leads to a variety of tragic , fun or bewildering outcomes. Manage orders and try to increase your prestige level to attract the rich and the famous. Look out for unique orders that pay a premium, such as a baron’s request to create the most beautiful ring for his daughter or a wandering knight demanding you forge a one-of-a-kind sword.\nTake charge of employees with different skill sets, salary levels, needs and personalities . Keep them happy by building special facilities, installing amenities and decorating their rooms. Equip your workers with special tools for faster work and help improve their craft by adding new books to your library.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/anvil-saga-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/anvil-saga-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® 7 SP1 or higher, 64-bit",
        "Processor": "64-bit, with clock frequency higher than 1.6GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Memory size larger than 2 GB and DirectX® 10/OpenGL 3.0 support",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "Pirozhok Studio",
        "Platform": "PC",
        "Game Size": "352 MB",
        "Released By": "GOG",
        "Version": "v1.0.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ok4uyzwwj9qf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/anvil-saga-preinstalled-steamrip.jpg"
}