{
    "page_url": "https://steamrip.com/aquatico-free-download-k1/",
    "title": "Aquatico",
    "description": "Aquatico is an underwater survival city- builder set on the ocean floor. The Earth’s surface has become a barren wasteland, forcing humanity to pour any remaining hope for a new beginning into the depths of the sea. Upon discovering a world below the tides, the opportunity to start over is within reach. Despite the new beginning, the dangers and challenges that lie ahead won’t make surviving under the sea a simple task Build a unique city underwater to escape a dying world. Hyper Light Drifter\nSurvive the challenges of the sea and construct your base over multiple levels. Use the seabed to build core infrastructure and production facilities, while the domed layers above will house your people from the dangers of the depths. Discover diverse biomes, gather resources, secure temperature readings and manage the multiple levels of your underwater base. Just be wary of natural sea life, as provoking creatures as you build and harvest may trigger dangerous events.\nSharks and whales swarming your city may not be ideal Unlock new technologies and buildings through a vast research tree to determine how you construct your underwater city. From defense grids to sushi houses and oxygen extractors. The route you take will determine the city you create .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/aquatico-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/aquatico-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64-bit)",
        "Processor": "Intel® Core™ i5-3470 or AMD Ryzen™ 3 1200",
        "Memory": "10 GB RAM",
        "Graphics": "GeForce GTX 1050 3 GB or AMD Radeon™ RX 560 4 GB",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Digital Reef Games0",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "codex EMU",
        "Version": "v1.007.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/w6u0nnlciwxc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/aquatico-preinstalled-steamrip.jpg"
}