{
    "page_url": "https://steamrip.com/arcade-paradise-free-download-1t/",
    "title": "Arcade Paradise",
    "description": "Welcome to Arcade Paradise, the 90’s- fuelled retro arcade adventure. Rather than washing rags for a living, you decide to turn the family laundromat into the ultimate arcade. Play, profit, and purchase new arcade machines, with over 35 to choose from, to build your very own Arcade Paradise\nRags to riches literally Take the laundromat business made up of dull chores from washing clothes to throwing out the trash, and turn it into a booming arcade with the coolest games in town raking in all the money\nInsert Coin Over 35 arcade games, each fully realized with its own gameplay, stories, missions, and high scores to set! Inspired by 3 decades of gaming, from early vector games right up to the 32-bit era.\nHere comes a new challenger Insert a second coin and play against a friend in a number of co-operative & competitive arcade games with up to 4 players locally. Marvel’s Spider-Man Remastered\nSet the high scores Prove yourself across each game, set your high scores, make your favourite arcade game more popular and upload to the online leaderboards .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/arcade-paradise-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/arcade-paradise-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 32bit",
        "Processor": "Intel Core i3 or equivalent AMD",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660, AMD Radeon HD 6770",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation",
        "Developer": "Nosebleed Interactive",
        "Platform": "PC",
        "Game Size": "2,8 GB",
        "Released By": "GOG",
        "Version": "v1.3.20230515.143309 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lnzijssp10n6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/arcade-paradise-preinstalled-steamrip.jpg"
}