{
    "page_url": "https://steamrip.com/ark-survival-evolved-free-download-r1/",
    "title": "ARK Survival Evolved Free Download Direct Link (v341.19)",
    "description": "As a man or woman stranded naked, freezing and starving on the shores of a mysterious island called ARK, you must hunt, harvest resources, craft items, grow crops, research technologies, and build shelters to withstand the elements. Use your cunning and resources to kill or tame & breed the leviathan dinosaurs and other primeval creatures roaming the land, and team up with or prey on hundreds of other players to survive, dominate… and escape Once tamed, you can issue commands to your tames, which it may follow depending on how well you’ve tamed and trained it. PES\nTames, which can continue to level-up and consume food, can also carry Inventory and Equipment such as Armor, carry prey back to your settlement depending on their strength, and larger tames can be ridden and directly controlled! Fly a Pterodactyl over the snow-capped mountains, lift allies over enemy walls, race through the jungle with a pack of Raptors, tromp through an enemy base along a gigantic brontosaurus , or chase down prey on the back of a raging T-Rex! Take part in a dynamic ecosystem life-cycle with its own predator & prey hierarchies, where you are just one creature among many species struggling for dominance and survival. Tames can also be mated with the opposite gender , to selectively breed successive generations using a trait system based on recombinant genetic inheritance.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/ark-survival-evolved-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8.1/10 (64-bit versions)",
        "Processor": "Intel Core i5-2400/AMD FX-8320 or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 670 2GB/AMD Radeon HD 7870 2GB or better",
        "DirectX": "Version 10",
        "Storage": "400 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Massively Multiplayer, RPG",
        "Developer": "Studio Wildcard, Instinct Games, Efecto Studios, Virtual Basement LLC",
        "Platform": "PC",
        "Game Size": "116 GB",
        "Repack By": "FITGIRL (thanks to CriminalTalent!)",
        "Version": "v358.25 + ALL DLCS + BONUS SOUNDTRACKS",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/03900C3BE6",
        "https://buzzheavier.com/xngsn4w56za0",
        "https://1fichier.com/?s2ywe5faaneb5b6iml6w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/ark-survival-evolved-free-download-torrent-steamrip.jpg"
}