{
    "page_url": "https://steamrip.com/arma-reforger-free-download-g1/",
    "title": "Arma Reforger",
    "description": "Powered by the new Enfusion engine, Arma Reforger lets you fight for supremacy over 51 km2 of incredible island terrain in an authentic Cold War setting, or create unique scenarios in real-time with the Game Master curation mode. Return to Everon, the war-driven microstate from the hit game that started it all, Arma: Cold War  Arma Reforger is the first step towards Arma 4 and a versatile, creative, fully-moddable platform for the future, offering a glimpse of things to come. APICO\nReturn to Everon, a 51 km² mid-Atlantic island in the Malden archipelago . Revisit familiar locales from Operation Flashpoint and revel in the natural beauty of a massive open-world; a stunning landscape of pine and broadleaf forests, flowing rivers, ponds, idyllic towns, and austere mountains, surrounded by pebble beaches and rocky coastlines.\nJoin players online and experience realistic Cold War combat as a US or Soviet Army soldier. Capture strategic positions, dominate the battlefield , and work with others to secure objectives in a dynamic, unforgiving environment. With a selection of period-authentic weapons and vehicles, recreated in meticulous detail, Arma Reforger’s multiplayer game mode returns you to war.\nControl events, create unique missions, and guide players towards victory in Game Master or submit yourself to the challenges devised by all-powerful creators and fight your way through a responsive sandbox where anything can happen.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/arma-reforger-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/arma-reforger-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-4460 / AMD FX-4300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 or similar",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Simulation, Strategy, Early Access",
        "Developer": "Bohemia Interactive",
        "Platform": "PC",
        "Game Size": "7.6 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.9.6.55 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/befbv9bcvhqo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/arma-reforger-preinstalled-steamrip.jpg"
}