{
    "page_url": "https://steamrip.com/arons-adventure-free-download-r1/",
    "title": "Aron’s Adventure Directly Download",
    "description": "Aron’s Adventure is a Third Person Action Adventure Game set in the new fantasy world of Elor. An ancient evil re-awakens and so the fate of the land is thrown into Aron’s hands. In Aron’s Adventure you are tasked with fighting back this evil. Flyout\nYou will be accompanied by an ancient spirit that will help you understand your new abilities and guide you in the right direction. Take on your enemies from a distance with a bow or bring it up close and personal! In Aron’s Adventure you get to choose the way you take on your enemies\nAs you get better at fighting enemies and as Aron grows stronger, more difficult weapons become easier to use! Difficult weapons may offer you a chance at more damage but they also require you to time your dodges and roles better while keeping a solid grip on your stamina\nDozens of different grunts that will challenge you in different combinations. Big boss fights and mini boss fights, every region will throw multiple challenges at you to overcome! From small spiders to zombies and even a dragon",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/arons-adventure-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/arons-adventure-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "I5 – 2500",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 970",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Tim van Kan, Tom Raudys",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Released By": "TENOKE",
        "Version": "v2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gn1v1c1a1w8t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/arons-adventure-preinstalled-steamrip.jpg"
}