{
    "page_url": "https://steamrip.com/art-reborn-painting-connoisseur-free-download-1j/",
    "title": "Art Reborn (Painting Connoisseur)",
    "description": "Dear curator, you are about to embark on a journey to captivate the audience You will be in charge of an art gallery that is on the verge of bankruptcy and taking challenges of the declining painting industry. You will work with different partners, collect artwork, and embark on an adventure. There are plenty of world-famous paintings for you to collect, appreciate, and understand. Blasphemous 2\nImpress the museum curators around the world with these masterpieces, collect badges, apply for support funds, and learn the value of art Collect, appreciate, solve puzzles , and engage in battles to explore various art museums and discover the charm of famous paintings Simple Elimination Game Choose from a hundred famous paintings for battles, and use their charm to impress the audience Link the Painters Linking paintings from the same painters can trigger effects to increase interest points\nArt Appreciation Explore and understand each painting , and label the appropriate tags Favourite Painting Determine the audience’s favourite painting through the tags and achieve victory in one strike",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/art-reborn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/art-reborn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows7 32 equivalent or better",
        "Processor": "Intel® i3-3220, AMD FX 6300 equivalent or better",
        "Memory": "2 GB RAM",
        "Graphics": "ATI Radeon 2400 or higher / NVIDIA 8600M or higher / Intel HD  3000",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Casual, RPG",
        "Developer": "MuccyGames",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v20230818 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/oviybs3bpmo5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/art-reborn-preinstalled-steamrip.jpg"
}