{
    "page_url": "https://steamrip.com/artist-life-simulator-free-download-1q/",
    "title": "Artist Life Simulator",
    "description": "Welcome to decadent , art-loving 19th century alternative history Europe, and a roguelite game about finding inspiration, dealing with feelings, and painting masterpieces. You will be challenged by more than 66 unique feelings (each with a different effect), along with poverty and other wordly troubles.\nHundreds of cards represent the complex psyche of your artist’s mind, and life in Nova Oportunia, the city known as the capital of contemporary art. All these artistic, amusing, horrible or lustful details of life are represented as lovingly painted cards that can be combined, collected, talked or thought about, visited, read or interacted and so on, resulting in a vast diversity of results, creating new cards and new opportunities of interaction.\nThe creation of this game was inspired by a cult classic of similar format, but different vibes. Life of the artist is not easy. Poverty, physical ailments, sanity loss and other challenges regularly result in permadeath (a variety of permadeaths, beginning with dying to disease and ending with drinking oneself to death), followed by a tactful overview of your life (often miserable, addiction-fuelled, yet passionate) and legacy.\nDuring your life, unpleasant feelings will evolve from bad to worse if not dealt with. You will have to battle conditions like frustration, anxiety, anger, guilt, sadness , suicidal thoughts, and multitudes of other issues, including habits, addictions and temptations of various kind. River City Girls 2",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/artist-life-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/artist-life-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1+) and Windows 10",
        "Processor": "x64 architecture with SSE2 instruction set support",
        "Memory": "4 GB RAM",
        "Graphics": "Any old card at least DX10 capable and supports 1280×720 resolution.",
        "DirectX": "Version 10",
        "Storage": "1500 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "Interactive Fate",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rpx5wgv9glgj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/artist-life-simulator-preinstalled-steamrip.jpg"
}