{
    "page_url": "https://steamrip.com/arto-free-download-1g/",
    "title": "Arto",
    "description": "Arto is a colorful hack-n-slash action -RPG, a fast-paced journey into a desolate, desaturated world that you bring back to life with every step you take. Arm yourself with a varied arsenal of weapons and spells to unlock and upgrade, and the magic ability to shoot beams of paint. You’ll begin a journey through wildly different biomes each is presented in different perspectives and art styles and brings different gameplay mechanics to the experience The Chromaclysm has broken and desaturated the world. Desta: The Memories Between\nThe Chromatic Divinities are enfeebled, powerless to restore Color, the fabric of all life and expression. The Apostles, who serve the Divinities, have proven unfit to lead without their gods. Their respective biomes, called Artos, have descended into chaos . Your choices will determine whether the world will continue on this path of destruction or be saved.\nYour very presence brings back Color to the world, step by step but you’ll need more than walking to overcome the challenges that lie in front of you. Luckily, you have a vast array of weapons and magical powers at your disposal that you can unlock and upgrade, on top of your ability to shoot beams of Color and create your own spells, to aid you in your journey.\nEach biome in this world introduces unique themes, playstyles, and creatures: from Warhol-esque pop-art worlds, pixel-art neon-lit scenarios or cubist vector landscapes, you’ll fight against insect swarms, face demons, ghosts, and shadows, or explore impossible, dreamlike places as you avoid deadly tornadoes. What kind of world is this, and what happened to all the Color? Who are you, who has the power to refill the world’s vibrant hues? Unveil the mysteries of this world and its history interacting with many original characters, exploring a sprawling branching narrative with multiple endings.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/arto-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/arto-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-Bit)",
        "Graphics": "NVDIA Geforce GTX-650 1GB",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "OrionGames",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "TENOKE emu",
        "Version": "Build 11126835 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m0xaj8fnhsem"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/arto-preinstalled-steamrip.jpg"
}