{
    "page_url": "https://steamrip.com/assassins-creed-origins-free-download-v4/",
    "title": "Assassin’s Creed Origins Free",
    "description": "Get Assassin’s Creed Origins for free instantly and play pre-installed on SteamRiP\nAncient Egypt, a land of majesty and intrigue , is disappearing in a ruthless fight for power. Unveil dark secrets and forgotten myths as you go back to the one founding moment: The Origins of the Assassin’s Brotherhood . Sail down the Nile, uncover the mysteries of the pyramids or fight your way against dangerous ancient factions and wild beasts as you explore this gigantic and unpredictable land. Motor Town: Behind The Wheel\nEngage into multiple quests and gripping stories as you cross paths with strong and memorable characters, from the wealthiest high-born to the most desperate outcasts. Experience a completely new way to fight.\nLoot and use dozens of weapons with different characteristics and rarities. Explore deep progression mechanics and challenge your skills against unique and powerful bosses. In general, in comparison with other games in the series, this one is simply overflowing with innovations. First, the combat system has been completely and completely redesigned. Now the player can attack all enemies within the radius of the attack animation, and not just one selected one, and the attacks themselves have become completely different.\nSecondly, the setting has changed – but this has already been said so. And thirdly, graphics and physics have moved to a new level, thanks to the refinement of an already ideal engine. And don’t forget, this is Egypt, which means the Nile is nearby. Take control of a boat and sail and embark on a journey down the Nile.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/assassins-creed-origins-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/assassins-creed-origins-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1, Windows 8.1, Windows 10 (64-bit versions only)",
        "Processor": "Intel Core i5-2400s @ 2.5 GHz or AMD FX-6350 @ 3.9 GHz or equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660 or AMD R9 270 (2048 MB VRAM with Shader Model 5.0 or better)",
        "DirectX": "Version 11",
        "Storage": "42 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Ubisoft Montreal",
        "Platform": "PC",
        "Game Size": "56.1 GB",
        "Version": "v1.51 | full version (Latest) + all add-ons and The Curse of the Pharaohs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/F777D1540A.html",
        "https://buzzheavier.com/bsft1whjwsie",
        "https://1fichier.com/?22vjay13nuxebg1ogr4m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/assassins-creed-origins-free-download-preinstalled-steamrip.jpg"
}