{
    "page_url": "https://steamrip.com/assassins-creed-valhalla-free-download-3s/",
    "title": "Assassin’s Creed Valhalla Free Download Direct Link (v1.7.0)",
    "description": "Assassin’s Creed Valhalla (Assassin’s Creed Valhalla) is another game in the series, but now dedicated to the Vikings. Go to Norway , gather your own clan, and go with him to England to find a new home there The plot of the game revolves around a Viking named Eivor, in whose role you just have to get used to. From childhood he was prepared for battles, they made him a real fearless warrior , but now everything has changed, and he will have to be puzzled by a much more important matter.\nYou and Eyvor will have to lead your clan from cold Norway to England , where you can possibly find and find a new home. In general, a difficult, but very interesting adventure awaits you. England in those distant times (IX century) is in ruins, chaos reigns there, battles take place at every step, kingdoms are trying to swallow each other. So, be prepared for the fact that there you will have to face such obstacles from which your hair will stand on end, but first, download the Assassin’s Creed Valhalla torrent. As for the gameplay, in this game it is unique in all directions, and is literally replete with different mechanics and capabilities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/assassins-creed-valhalla-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/assassins-creed-valhalla-free-download-crack-steamrip-scaled.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 10 (64 bit)",
        "Processor": "Intel Core i5-4460 (3.2 GHz) / AMD Ryzen 3 1200 (3.1 GHz)",
        "RAM": "8 GB",
        "Video card": "NVIDIA GeForce GTX 960 / AMD Radeon R9 380 (4 GB)",
        "Disk space": "64 GB"
    },
    "game_info": {
        "Genre": "Action, RPG, Stealth, Open World, 3rd Person",
        "Developer": "Ubisoft Montreal",
        "Platform": "PC",
        "Game Size": "145 GB",
        "Repack By": "EMPRESS",
        "Version": "v1.7.0 | Complete Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/1EC46198C1",
        "https://buzzheavier.com/u31t4e6ce6pj",
        "https://1fichier.com/?v1e887fzmjekqw3t9dck"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/assassins-creed-valhalla-free-download-preinstalled-steamrip.jpg"
}