{
    "page_url": "https://steamrip.com/assetto-corsa-free-download-1u/",
    "title": "Assetto Corsa Free",
    "description": "Get Assetto Corsa PC Game In Direct Link and play pre-installed on SteamRiP\nAssetto Corsa features an advanced DirectX 11 graphics engine that recreates an immersive environment, dynamic lighthing and realistic materials and surfaces . The advanced physics engine is being designed to provide a very realistic driving experience, including features and aspects of real cars, never seen on any other racing simulator such as tyre flat spots, heat cycles including graining and blistering, very advanced aerodynamic simulation with active movable aerodynamics parts controlled in real time by telemetry input channels, hybrid systems with kers and energy recovery simulation .\nExtremely detailed with single player and multiplayer options, exclusive licensed cars reproduced with the best accuracy possible, thanks to the official cooperation of Car Manufacturers. ASSETTO CORSA has been developed at the KUNOS Simulazioni R&D office, located just inside the international racing circuit of Vallelunga, allowing the team to develop the game with the cooperation of real world racing drivers and racing teams.\nLEGENDARY TRACKS The circuits have been developed using Laser scan technology, in order to guarantee the highest level of accuracy possible in reproducing real world motor racing environments. Monza, Silverstone, Imola, Mugello, Spa, Brands Hatch and many more tracks , including the historical reproduction of Monza, that brings again to life the legendary Sopraelevata, the high-speed oval where races were staged until 1961.\nEXCLUSIVE CARS The Assetto Corsa physics engine is all new, using practical knowledge acquired from working closely with the elite of motorsport in order to engineer the best possible accuracy of physics and tactility of feeling. A physics engine like this begs to be used with officially licensed contents: Abarth, Audi, BMW , Classic Team Lotus, Ferrari, KTM, Lamborghini, Lotus cars, McLaren, Mercedes , Scuderia Glickenhaus, Pagani, Porsche, Tatuus and many more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/assetto-corsa-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/assetto-corsa-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 Sp1 – 8 – 8.1 – 10",
        "Processor": "AMD Athlon X2 2.8 GHZ, Intel Core 2 Duo 2.4 GHZ",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 10.1 (e.g. AMD Radeon HD 6450, Nvidia GeForce GT 460)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Racing, Simulation, Sports",
        "Developer": "Kunos Simulazioni",
        "Platform": "PC",
        "Game Size": "17.2 GB",
        "Released By": "3DM",
        "Version": "v1.16.4 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/B4F5089761",
        "https://buzzheavier.com/qydb83rgncsa",
        "https://megadb.net/dr73ln5tgo8v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/assetto-corsa-free-download-preinstalled-steamrip.jpg"
}