{
    "page_url": "https://steamrip.com/assetto-corsa-evo-free-download/",
    "title": "Assetto Corsa EVO",
    "description": "Assetto Corsa EVO raises the bar of realism that has made the franchise one of the most popular driving simulations of the last decade even higher.\nAs with its predecessor, Assetto Corsa EVO will include cars from different classes spanning across years of motoring history. From road cars, classics, hypercars , and race cars. The most iconic representation of the automotive and motorsport world. Each vehicle is reproduced through Kunos in-house physics and graphic engine simulating mechanical, electronic, and aerodynamic performance, combined with the fidelity of the circuits created using Laserscan technology.\nIn Early Access 1 you will be able to experience a range of vehicles, tracks and game modes that will evolve on the road to our full 1.0 launch. DYNASTY WARRIORS: ORIGINS\nWith the launch of a new KUNOS Simulazioni proprietary, high-performance photorealistic engine, VR and triple screen support have become first-class features and the new mathematical model meticulously simulates asphalt performance in different dynamic weather conditions that guarantees an authentic and realistic experience which will redefine the standards that have made Assetto Corsa globally renowned.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/assetto-corsa-evo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/assetto-corsa-evo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i7 8700k / AMD 1500X",
        "Memory": "16 GB RAM",
        "Graphics": "GTX 1070, RX 580",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "100 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Simulation, Sports, Early Access",
        "Developer": "KUNOS Simulazioni",
        "Platform": "PC",
        "Game Size": "17 GB",
        "Released By": "Mr_GOLDBERG emu | Ty Ksenia, csrin",
        "Version": "v0.2.2 Hotfix | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/HMMTus",
        "https://buzzheavier.com/4yc54dnutuzc",
        "https://datanodes.to/mu98eb0rmqqa/Assetto-Corsa-EVO-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/assetto-corsa-evo-preinstalled-steamrip.jpg"
}