{
    "page_url": "https://steamrip.com/assetto-corsa-competizione-free-download-f3/",
    "title": "Assetto Corsa Competizione Free Download Direct Link",
    "description": "Assetto Corsa Competizione is the new official GT World Challenge videogame. Thanks to the extraordinary quality of simulation, the game will allow you to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races will come to life with an incredible level of realism, in both single and multiplayer modes. Assetto Corsa Competizione will feature Blancpain GT Series’ 2018 and 2019 seasons.\nAssetto Corsa Competizione is born from KUNOS Simulazioni’s long-term experience, and it takes advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models. Designed to innovate, Assetto Corsa Competizione will be set to promote eSports, bringing players at the heart of the GT World Challenge and putting them behind the wheel of Ferraris, Lamborghinis, McLarens and many other prestigious GT racing cars, all reproduced with outstanding level of detail.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/assetto-corsa-competizione-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/assetto-corsa-competizione-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit Service Pack 1",
        "Processor": "Intel Core i5-4460 or AMD FX-8120",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 460 2GB, Radeon HD 7770",
        "DirectX": "Version 11",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Simulation, Sports",
        "Developer": "Kunos Simulazioni",
        "Platform": "PC",
        "Game Size": "18.3 GB",
        "Released By": "Mr_Goldberg + CCL from Rat431",
        "Version": "v1.10.3 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/tpbkzx8te339",
        "https://gofile.io/d/oiocNk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/assetto-corsa-competizione-free-download-torrent-steamrip.jpg"
}