{
    "page_url": "https://steamrip.com/asterigos-curse-of-the-stars-free-download-1i/",
    "title": "Asterigos: Curse of the Stars Directly Download",
    "description": "Discover the long forgotten secrets and hidden paths in this high fantasy world, featuring exhilarating battle encounters, interconnected maps full of places to explore, and an immersive story where every choice matters. Play as Hilda – a brave young warrior from the Northwind Legion who embarks on a journey to the cursed city in order to save her lost father. The gameplay elements inspired by soulslike games alongside a lighter, dynamic combat system, create a fresh take on the modern action RPG genre, providing you with a harmonious difficulty and exploration balance. Train Valley 2\nWelcome to Aphes – a city-state full of magic and wonder inspired by ancient Rome and classical Greek designs. From the mist-covered bazaar streets to gloomy sewers, the enigmatic forests at the city’s outskirts to deep chasms full of glittering crystals, the landscapes of Aphes are full of beauty and dangers. Choose from a variety of ranged and melee weapons on the go and combine them as you wish The talent system allows you to pick and expand your combat style by choosing two out of six completely different weapons: sword and shield, dual blades, spear, hammer , staff or even magic bracelets. Equip a magical staff to obliterate your foes from the distance or switch to a gigantic battle hammer to squish them in a close combat.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/asterigos-curse-of-the-stars-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/asterigos-curse-of-the-stars-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win10 64-bits Version 21H2",
        "Processor": "Intel i7-6700 or AMD Ryzen5 1500X or faster processor",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX960 4GB or AMD 380X 4GB or Higher",
        "DirectX": "Version 12",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Acme Gamestudio",
        "Platform": "PC",
        "Game Size": "10.3 GB",
        "Released By": "CODEX emu",
        "Version": "v01.06.0000 | Full  + 2 DLCs + Bonus Content + Windows 7 Fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j51frukbm8s7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/asterigos-curse-of-the-stars-preinstalled-steamrip.jpg"
}