{
    "page_url": "https://steamrip.com/astor-blade-of-the-monolith-free-download/",
    "title": "Astor: Blade of the Monolith",
    "description": "Explore the vibrant planet of Gliese, once inhabited by an ancient race, and now home to their sentient creations – the Diokek. After the ancients’ disappearance, the Diokek lived in peace until malevolent creatures, the Hiltsik, started wreaking havoc among their settlements. With threats of a more sinister force at play, Astor – a young Diokek warrior, must journey across Gliese to solve the mysterious disappearance of his creators thousands of years ago, believing that they may have left behind the key to their salvation. Pine Hearts\nLearn new attacks, abilities and combos , unlock magical powers, and collect legendary weapons as you crush hordes of enemies. Find your way towards the Monolith, an ancient structure holding immense power, and confront the source of the planet’s haunting evil. Will you join Astor on his journey to become the planet’s savior?\nExplore the mystical planet of Gliese and search for a lost history hidden throughout the planet’s majestic landscapes, ancient ruins, and old temples left by past civilizations. Using your newfound runic power, shift into the spirit realm to solve puzzles, reveal secret passages , and uncover the answers to save the future.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/astor-blade-of-the-monolith-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/astor-blade-of-the-monolith-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-2500k",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950 or GTX 960",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG",
        "Developer": "C2 Game Studio",
        "Platform": "PC",
        "Game Size": "6.8 GB",
        "Released By": "TENOKE",
        "Version": "Build 14526536 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/z3s43nml0ope"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/astor-blade-of-the-monolith-preinstalled-steamrip.jpg"
}