{
    "page_url": "https://steamrip.com/astroneer-free-download-r2/",
    "title": "ASTRONEER Free Download Direct Link",
    "description": "Explore and reshape distant worlds Astroneer is set during the 25th century Intergalactic Age of Discovery, where Astroneers explore the frontiers of outer space, risking their lives in harsh environments to unearth rare discoveries and unlock the mysteries of the universe. In this space sandbox adventure , players can work together to build custom bases above or below ground, create vehicles to explore a vast solar system, and use terrain to create anything they can imagine. A player’s creativity and ingenuity are the key to thriving on exciting planetary adventures\nIn Astroneer you canIn Astroneer, players use their deform tool to dig, collect, shape and build anything they wish. Use this ability to dig to the center of the planet, build a ramp into the sky, or make megaliths just by using terrain Survive on and explore carefully crafted planets that can be entirely deformed and traversed . Our vast solar system includes 7 wondrous planets that players can travel between and explore every inch of, from the entire spherical surface, through treacherous layers of caves, all the way down to the mysterious core. Each of those planets has unique and challenging surface and cave biomes that offer a multitude of challenges for players on their journey.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/astroneer-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/astroneer-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 (64 bit only), Windows 8 (64 bit only), Windows 10 (64 bit only)",
        "Processor": "X64 Dual Core CPU, 2+ GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Discrete Non Mobile GPU with 1 GB Ram",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "System Era Softworks",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Co-op By": "OFME + AR-81, cs.rin.ru",
        "Version": "v1.34.47.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ccovsvb11hj6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/astroneer-free-download-preinstalled-steamrip.jpg"
}