{
    "page_url": "https://steamrip.com/at-dead-of-night-free-download/",
    "title": "At Dead Of Night",
    "description": "At Dead Of Night is part horror film, part horror game and part ghost hunt. It seamlessly blends live-action and graphics to create a unique immersive horror experience like no other.\nMaya is a student trapped in a remote hotel run by a psychopath called Jimmy Hall. Jimmy has tied up Maya’s friends and locked them in their rooms, with evil intentions. Maya has managed to escape, but Jimmy is on the prowl looking for her. However, to get him to release her friends, Maya must uncover Jimmy’s dark secret. Using an ancient ghost voice receiver she finds, Maya must communicate with the ghosts of Jimmy’s past, who materialise around the hotel and gradually reveal their story. Borderlands 2\nBETA options\nRight click on the game in your library, then go to Properties > Betas, where you’ll find two alternative versions of the game, one specifically for Steam Deck and one updated for 2024 – use this if you have any issues with the default download.\nOUR OTHER GAMES\nIf you’re into murder, filthy liars and spooky cults, why not try our other game Contradiction – Spot The Liar – check out our home page at for more info.\nAUDIO LATENCY\nBecause of the way sound is synced to the video in this game, some users may notice some audio latency, affecting lip-sync. This can be improved a lot in Windows 10/11 – not just in this game but lots of games – in Windows 11 by navigating to System > Sound > More sound settings > Speakers or headphones (on the Playback tab) > Properties > Advanced tab, then unticking the ‘Give exclusive mode applications priority’ option.\nREVIEWERS!\nDue to the very high number of requests for review keys we now have a limit of a single key per request.\nMERCH!\nWe’ve added some new ADoN designs to our RedBubble page – check them out on our website",
    "screenshots": [
        "https://shared.cloudflare.steamstatic.com/store_item_assets/steam/apps/1450830/ss_2120c4cb138609d64fedc2bb6d3947889061c950.600x338.jpg",
        "https://gofile.io/d/un7vGc",
        "https://buzzheavier.com/xwokwubx18cj"
    ],
    "system_requirements": {
        "OS *": "Windows 8 64bit",
        "Processor": "Any Intel or AMD processor",
        "Memory": "2 GB RAM",
        "Graphics": "Any",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Strategy",
        "Developer": "Baggy Cat Ltd.",
        "Platform": "PC",
        "Game Size": "4.82 GB",
        "Released By": "Tao | cs.rin.ru",
        "Version": "Build 14844637",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/un7vGc",
        "https://buzzheavier.com/xwokwubx18cj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/At-Dead-Of-Night_featured_final.jpg"
}