{
    "page_url": "https://steamrip.com/atelier-ryza-3-alchemist-of-the-end-the-secret-key-free-download-i1/",
    "title": "Atelier Ryza 3 Alchemist of the End & the Secret Key",
    "description": "The story begins when a group of islands called Kark Isles appear near Ryza’s—the protagonist’s—hometown. Seeing this as a threat to their home, Ryza and her friends investigate the isles and discover ruins with a huge gate. Just as Ryza approaches the gate, a strange voice echoes in her head, telling her to reach the Code of the Universe. Fable Anniversary\nWhat is it that lies beyond the gate, and what does the “Code of the Universe ” mean? In hopes of finding a way to save their home, Ryza and her friends set off on a great adventure that revolves around a Key and the roots of alchemy .\nIn this title, multiple maps are connected seamlessly, allowing players to move between different areas without the loading screen transition. Enjoy exploring in a vast, living world with a greater degree of freedom. Reunite with characters from previous games and meet new key characters essential to the story. Embark on your adventure with a wide range of friends —one of the largest in the series.\nUse the “Keys” with unknown powers to unlock various gameplay features In the heart of this title will be the new “Key” system. Keys have various types and effects that can be used in exploration, synthesis, and combat . Make good use of them while adventuring to enjoy a more satisfying",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/atelier-ryza-3-alchemist-of-the-end-the-secret-key-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/atelier-ryza-3-alchemist-of-the-end-the-secret-key-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10, Windows® 11 64bit",
        "Processor": "Intel Core i5 6600 or over, AMD Ryzen 3 1200 or over",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 or over, AMD Radeon RX 560 or over, 1280×720",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, RPG, Simulation",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "26.6 GB",
        "Released By": "TENOKE",
        "Version": "v1.6.0.0 | Full  + 15 DLCs + Bonus OSTs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/EF031C9B49",
        "https://buzzheavier.com/rdqyfr5y2sy7",
        "https://datanodes.to/x6wic8jixjzo/Atelier-Ryza-3-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/atelier-ryza-3-alchemist-of-the-end-the-secret-key-preinstalled-steamrip.jpg"
}