{
    "page_url": "https://steamrip.com/atelier-yumia-the-alchemist-of-memories-the-envisioned-land-free-download/",
    "title": "Atelier Yumia The Alchemist of Memories & the Envisioned Land Download",
    "description": "The continent is an unexplored land where the player can use a wide range of items and actions to forge their path forward. Look Outside\n– Battle Ranges and items allow for a captivating variety of actions in combat . You will be tested on your ability to make split-second decisions during real-time combat. Fight strategically utilizing two types of attack ranges which change your skills as your switch between them. Additionally, synthesized items will transform into weapons like swords and spears, which can be used to attack. Items can be reused any number of times, so don’t hesitate to deploy them while driving away enemies that stand in your way.\n– Synthesis Weave together mana to create items. Manipulate the mana contained within ingredients to create new items based on recipes. The items you craft will exhibit powerful effects in various situations, such as exploration and combat. The strength of an item’s power depends on the ingredients used during synthesis , so select ingredients carefully while assessing the power of their contained mana.\n– Create items while out in the field and customize bases however you like! You can use Simple Synthesis to create exploration tools for opening the path forward, as well as items that will benefit you during combat and synthesis. You can also use the Building feature to construct bases and then decorate them with furniture to your liking .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/atelier-yumia-the-alchemist-of-memories-the-envisioned-land-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/atelier-yumia-the-alchemist-of-memories-the-envisioned-land-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10, Windows® 11 64bit",
        "Processor": "Intel Core i3 8100 以上, AMD Ryzen 3 3200G 以上",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 以上, AMD Radeon RX 570 以上, VRAM 4GB 以上",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "16.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/sffr2f",
        "https://buzzheavier.com/aiym7380jcty"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/atelier-yumia-the-alchemist-of-memories-the-envisioned-land-preinstalled-steamrip.jpg"
}