{
    "page_url": "https://steamrip.com/atom-rpg-post-apocalyptic-indie-game-free-download-1c/",
    "title": "ATOM RPG: Post-apocalyptic indie game Download",
    "description": "ATOM RPG is a post-apocalyptic indie game, inspired by classic CRPGs : Fallout, Wasteland, System Shock, Deus Ex, Baldur’s Gate and many others. In 1986 both the Soviet Union and the Western Bloc were destroyed in mutual nuclear bombings. You are one of the survivors of the nuclear Holocaust. Your mission – to explore the wild and wondrous world of the Soviet Wasteland . To earn your place under the sun. And to investigate a shadowy conspiracy, aimed at destroying all that is left of life on Earth. ATOM RPG is: A powerful character creation tool, aimed at making the wasteland hero you want to portray A balanced roleplaying system inspired by GURPS .\nEach stat combination provides a unique gaming experience, unique dialogues, and new ways to solve some of the quests Dozens of skills, from lockpicking to gambling Many hours of gameplay on all sorts of locations. Meet the other survivors in a brave new settlement, built from the dust of the old world. Venture into the wilds, where mutated creatures and savage bandits lurk. Work out the secrets of an old military bunker . Or simply lose yourself, fishing at a scenic pond Turn-based combat, inspired by Fallout 1 and 2. Random encounters with the dwellers of the Soviet Wasteland – both friendly and dangerous. Sometimes all at the same time Many deep, multiple-choice dialogues that feel like real conversations with the unique NPCs of the game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/atom-rpg-post-apocalyptic-indie-game-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/atom-rpg-post-apocalyptic-indie-game-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 64-bit (7 SP1/8/8.1/10)",
        "Processor": "Intel Core 2 Duo / AMD Phenom II",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 260 / Radeon HD 4670 1GB / Intel HD 4600",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "AtomTeam",
        "Platform": "PC",
        "Game Size": "5.7 GB",
        "Repack By": "GOG",
        "Version": "v1.190 | Full  + DLC: Supporter Pack",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/764vlvz55zl1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/atom-rpg-post-apocalyptic-indie-game-free-download-preinstalled-steamrip.jpg"
}