{
    "page_url": "https://steamrip.com/attack-on-titan-2-final-battle-free-download-1s/",
    "title": "Attack on Titan 2 Final Battle Free Download",
    "description": "Attack on Titan 2 Final Battle Download PC Game In Direct Link for free on SteamRIP\nAbandon all fear. Attack on Titan 2 is the gripping sequel to the action game based on the worldwide hit anime series “Attack on Titan.” Experience the immense story of the anime alongside Eren and his companions, as they fight to save humanity from the threat of the deadly human devouring Titans. Try your hand in operating the omni-directional mobility gear, maneuvering and flying through the sky to counter the Titans, and feel the thrill and satisfaction of battling giant opponents . The latest title in the “Attack on Titan” series is available for Windows.\nPlayers engage in battle in the world of “Attack on Titan” from the perspective of a single soldier. Experience the most extreme and evolved Titan-hunting action yet The thrill of hunting Titans with omni-directional mobility gear action The thrill of freely soaring through the skies has been taken to the next level We’ve included moves that allow you to instantly close in on far-off Titans and slice them with “Sneak Attacks,” quickly circle behind Titans and deal large amounts of damage with “Hook Drive” attacks, and more. Achieve evolved omni-directional mobility gear action that is rich with variety .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/attack-on-titan-2-final-battle-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/attack-on-titan-2-final-battle-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 8.1/10 64bit",
        "Processor": "Core I5 2400 or over",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660 VRAM 1GB or over",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "34.88 GB",
        "Repack By": "SKIDROW",
        "Version": "v1.0.0 | Updated version (Latest) + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/1F157537FB",
        "https://buzzheavier.com/031o81xwavuq",
        "https://1fichier.com/?nkfbhc73ylpcdc59kbhz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/attack-on-titan-2-final-battle-free-download-preinstalled-steamrip.jpg"
}