{
    "page_url": "https://steamrip.com/automation-the-car-company-tycoon-2j/",
    "title": "Automation The Car Company Tycoon Free",
    "description": "Get Automation The Car Company Tycoon for free instantly and play pre-installed on SteamRiP\nAutomation will allow the player to become an armchair CEO – to build their own car company from the ground up. Create and run anything from a boutique supercar manufacturer to a mass-market multinational mogul. With powerful tools like the Engine Designer, the player can create cars and their engines in mind-boggling detail. The grand campaign will start in the year 1946 and run until 2020, with the main goal being to build a successful, renowned car company from scratch. All types of car manufacturers can be led to success if managed properly; building the right image over the years is key.\nThe player’s tasks are to design engines and cars, to manage factories, production, Research and Development, as well as advertising campaigns. In game, time advances at the pace the player chooses and pauses automatically for events and occurrences. Automation is comprised of three major game components – the Engine Designer, the Car Designer and the Company Manager . These components are naturally strung together by the game’s goals, made to be user-friendly and intuitive to use. A multitude of tutorial missions and descriptive texts help car novices become experts. Almost infinite options give the player all the creative freedom to create unique cars with vastly different engines.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/automation-the-car-company-tycoon-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/automation-the-car-company-tycoon-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 10 – 64 bit",
        "Processor": "Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "Support Shader Model 5.0 (Intel HD4000 Integrated",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Camshaft Software Ltd",
        "Platform": "PC",
        "Game Size": "10.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 13388767 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/1DB45420CF",
        "https://buzzheavier.com/qhqjixyxumrt",
        "https://megadb.net/1e94mhjh5s46"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/automation-the-car-company-tycoon-free-download-preinstalled-steamrip.jpg"
}