{
    "page_url": "https://steamrip.com/automobilista-2-free-download-z1/",
    "title": "Automobilista 2 Directly Download",
    "description": "Automobilista 2 is a celebration of motorsports a comprehensive simulator powered by genre-leading technology placing you right at the center of the thrills the sport has provided over the decades, with an uniquely immersive experience and unmatched variety of cars, tracks and features you won´t find in any other racing game; it is an advanced simulator that never forgets to remain fun and accessible.\nWithin a few clicks, you can jump from a rental kart for modern day race in downtown Sao Paulo to a historic Grand Prix car for a blast around Monzas famous banking as if it were the 1960s; Run one of the championship seasons offered within the game, or create your own custom season setting up classes, tracks, points system, weather to your preference We Happy Few\nTravel through the history of motorsports driving legendary machines such as the Lotus 72E, the mighty Group C Porsche 962c or the Mclaren F1 GTR on the tracks they actually belonged; enjoy the unique driving experiences of exotic race cars equipped with ingenious devices that made motorsports folklore never before modeled in a racing simulator\nSuch as the Brabham BT46B fan car or the Mclaren MP4-12 with its ingenuous brake steer system; explore the freedom that Automobilista 2 provides to create great events that never were, or even really crazy ones that never could be. There is more still to come in the years ahead new cars & tracks, more historical content, different racing modes, enhanced gameplay features, better racing for both single and multiplayer ; AMS2 continues to be an ever-evolving, ever-expanding project that will continue to get bigger and better.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/automobilista-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/automobilista-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (+ specific versions of 7)",
        "Processor": "3.5 GHz Intel Core i5 3450 or AMD FX-8350",
        "Memory": "8 GB RAM",
        "Graphics": "GTX680 or equivalent",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Simulation, Sports",
        "Developer": "Reiza Studios",
        "Platform": "PC",
        "Game Size": "117 GB",
        "Released By": "RUNE",
        "Version": "v1.6.6.0 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/5ux6uae03wn7",
        "https://datanodes.to/c9lmoja86icm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/automobilista-2-preinstalled-steamrip.jpg"
}