{
    "page_url": "https://steamrip.com/avowed-free-download/",
    "title": "Avowed",
    "description": "Welcome to the Living Lands, a mysterious island filled with adventure and danger. Set in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. The Executive\nThe Living Lands is an island where the air hums with ancient magic, the flora seems to move with a mind of its own, and the ground beneath your feet shifts with secrets waiting to be unearthed. Now, the Living Lands faces a dire threat—a mysterious plague that defies nature and reason, spreading chaos across its sprawling wilderness.\nAs an envoy of Aedyr, you are sent to investigate, but what begins as a mission of duty soon becomes deeply personal you feel as though the land recognizes you and is pulling you toward something greater . The choices you make will ripple across the Living Lands, shaping the fates of its people, its creatures, and even yourself. But beware, for every decision carries weight, and the forces you encounter will not hesitate to test your resolve.\nCan you navigate the tangled web of intrigue, power, and danger to uncover the truth? Can you save this unknown frontier and your soul from the forces threatening to tear them asunder ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/avowed-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/avowed-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 with updates",
        "Processor": "AMD Ryzen 5 2600 / Intel i5-8400",
        "Memory": "16 GB RAM",
        "Graphics": "AMD RX 5700 / Nvidia GTX 1070 / Intel Arc A580",
        "DirectX": "Version 12",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "Obsidian Entertainment",
        "Platform": "PC",
        "Game Size": "69.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.5.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CQNzf9",
        "https://buzzheavier.com/cg5k48hm9c8a",
        "https://datanodes.to/z8mv5yhn0bgb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/avowed-preinstalled-steamrip.jpg"
}