{
    "page_url": "https://steamrip.com/baba-is-you-free-download-u1/",
    "title": "Baba Is You Free",
    "description": "Baba Is You game for free instantly and play pre-installed on SteamRiP\nBaba Is You is an award-winning puzzle game where you can change the rules by which you play. In every level, the rules themselves are present as blocks you can interact with; by manipulating them, you can change how the level works and cause surprising, unexpected interactions With some simple block-pushing you can turn yourself into a rock, turn patches of grass into dangerously hot obstacles, and even change the goal you need to reach to something entirely different.\nThe game has over 200 levels that experiment with the game’s mechanics in a multitude of ways, requiring the player to understand and manipulate the rules of the game and figure out devious ways to make the objects in the game world interact. The game was originally created for and won the Nordic Game Jam 2017. Baba Is You also won the Excellence in Design and Best Student Game awards in the Independent Games Festival 2018, and was nominated a finalist in 2 other categories, including the Seumas McNally Grand Prize. The game was made using Multimedia Fusion 2 by Clickteam.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/baba-is-you-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/baba-is-you-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2.0 GHz+, 32-bit",
        "Memory": "1 GB RAM",
        "Graphics": "ATI Radeon X1300/NVIDIA GeForce 6600 GT/Intel HD 3000 or better",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Indie",
        "Developer": "Hempuli Oy",
        "Platform": "PC",
        "Game Size": "129.9 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v477c | full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4cawoqsg4c5p"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/baba-is-you-free-download-preinstalled-steamrip.jpg"
}