{
    "page_url": "https://steamrip.com/backrooms-run-for-your-life/",
    "title": "Backrooms: Run For Your Life!",
    "description": "This fan-made Backrooms game drops you into a series of strange and dangerous levels. One of the main stages is based on “Level !” where you run through a ten-kilometer hallway with flashing red lights and sirens. Entities chase you non-stop, forcing you to move fast and think quickly. The game lets you experience the full distance if you choose to. It’s intense, chaotic, and built to test your nerve. Alarms echo, the lighting is harsh, and there’s no time to rest. It feels like a true race for survival through a nightmare corridor. Backrooms Bodycam\nOther levels add even more twists to the experience. In “Level !-!” you find yourself in a dark red hotel hallway that plays tricks on your mind. “Level -!” is filled with power outages and lurking threats that strike when the lights go out. “Level ¡” features a square path where you must stay completely still under a blue light. Each level changes how you play and adds a new layer of danger. You’ll need to adapt, observe, and act at just the right moment. The game doesn’t just scare you, it keeps you alert the whole way through.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2559530/ss_22915652db8a71f28fd222c67945aa133f3e7919.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2559530/ss_bd227bdb261cf218075cf82197d635454f6b75db.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / 11 – 64 bit",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie",
        "Developer": "哈基轩",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "TENOKE",
        "Version": "Build 18591899",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/t1isrixy2pz1",
        "https://megadb.net/q50dfxpvhsp5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/backrooms-run-for-your-life-preinstalled-steamrip.jpg"
}