{
    "page_url": "https://steamrip.com/bad-north-jotunn-edition-free-download-1g/",
    "title": "Bad North: Jotunn Edition Free Download Direct Link",
    "description": "Your home is under attack. The king is dead at the hands of Viking invaders. Hope is a distant glimmer in the fog, fading fast with every passing moment. As you rise to take your father’s place as ruler, it will fall to you to stage your defenses. But make no mistake – this is no fight for victory, but a desperate grasp for survival . Bad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.\nEverything is at stake: fail, and watch the blood of your subjects stain the ground red. It’s charmingly brutal, with beautiful procedurally-generated islands and adorable soldiers juxtaposed against the blood-stained realities of war. You control the broad strokes of the battle, giving high level commands to your soldiers who try their best to carry them out in the heat of the moment. It’s accessibly deep, with simple player inputs masking a dynamic combat simulation that make it inviting to new players while challenging veterans. Keep fighting, warriors. Not for power or riches or glory, but for hope of peace to come once again in the harsh lands of the Bad North.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/bad-north-jotunn-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/bad-north-jotunn-edition-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "AMD Athlon X4 5350, Intel Core i3-2100T or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 480M, Radeon HD 6790 or equivalent",
        "DirectX": "Version 11",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "Plausible Concept",
        "Platform": "PC",
        "Game Size": "271 MB",
        "Repack By": "GOG",
        "Version": "vdb0bf17 | Updated  + DLC Deluxe Edition Upgrade",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9rju0ajvmwd8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/bad-north-jotunn-edition-free-download-torrent-steamrip.jpg"
}