{
    "page_url": "https://steamrip.com/baladins-free-download/",
    "title": "Baladins",
    "description": "Buskers, party animals, troublemakers . They’ve been given many names, but they call themselves Baladins These legendary heroes wander from town-to-town to fulfill their sacred quest: entertaining the masses!\nIt’s a difficult task, but one the Baladins take in stride. From helping those in need to throwing parties , they bring surprises with them wherever their travels take them. All that matters to them is bringing joy to the people who inhabit the bright and lively world of Gatherac. City Bus Manager\nEmbark on your quest as one of the Baladins: the imaginative Cook, the crafty Luxomancer , the strapping Dancer, the expressive Pyro, or the ever-charismatic Bard. United by their passion for happiness, each Baladin brings their own unique skills to the table and can hone their talents further throughout the adventure by making choices and collecting items.\nInspired by tabletop roleplaying campaigns , Baladins is a choose-your-own-story game for players of all ages and experience levels. Roll the dice and see where your adventures take you. Your decisions are not inherently good or bad – just creative approaches that can lead to interesting outcomes!\nAnd if you’d rather not play alone, Baladins supports up to four players–either locally or online! You can spread your journey over bite-sized sessions so you can explore Gatherac and its many secrets at your own pace. The story of any given session can change wildly depending on the choices you make each turn, so each playthrough brings its own new surprises",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/baladins-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/baladins-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Pentium G3250 (2 * 3200), AMD Phenom II X4 965 (4 * 3400), or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GT 640 (2048 MB) or Radeon HD 6750 (1024 MB)",
        "Storage": "1600 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Seed by Seed",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.18 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mjkm6ylsdq0h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/baladins-preinstalled-steamrip.jpg"
}