{
    "page_url": "https://steamrip.com/balan-wonderworld-free-download-1o/",
    "title": "BALAN WONDERWORLD Free direct Download",
    "description": "Get BALAN WONDERWORLD for free instantly and play pre-installed on SteamRiP\nBALAN WONDERWORLD is a wondrous action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Planet Zoo\nTwelve different tales await our stars in the Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, filled with a myriad of tricks and traps, to get to the heart of each story. The setting for this tale is the fantastic, bizarre land of Wonderworld; a place where people’s happy and positive memories mix with their restless worries and negativity. Port Royale 4\nLeo and Emma are led into Wonderworld by the mysterious clown Balan and set off on a journey to find what is important to them. Enjoy an even more wondrous adventure as one player controls Leo and the other controls Emma in 2 Player Co-op Local Mode. Co-operate together combining the abilities of two different costumes which will surely open new paths as you wander through Wonderworld.\nOver 80 different suits will help you in different circumstances. The stars of the show can use the powers of the inhabitants of the World of Wonders by donning their colorful costumes Crush enemies, walk through the air, stop time or manipulate objects Each new suit gives you new possibilities.\nTwo legendary authors are working together again Experience a thrilling story from Square Enix and a dynamic magical world created by the legendary Naka Yuji. For the first time in 20 years, Naka Yuji and Oshima Naoto have teamed up to form the BALAN COMPANY They have gathered around them professionals in the field of game development, video and music, finding them both inside and outside the company.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/balan-wonderworld-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/balan-wonderworld-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 8.1 / 10 64-bit",
        "Processor": "AMD Ryzen™ 3 1200 / Intel® Core™ i5-4430",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ R9 270X / NVIDIA® GeForce® GTX 760",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "quare Enix, ARZEST Corp.",
        "Platform": "PC",
        "Game Size": "13.04 GB",
        "Repack By": "SEWN",
        "Version": "Build 6839378 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/b7iqbw1rj1pj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/balan-wonderworld-free-download-preinstalled-steamrip.jpg"
}