{
    "page_url": "https://steamrip.com/baldis-basics-plus-free-download/",
    "title": "Baldi’s Basics Plus",
    "description": "Baldi’s Basics™ Plus is an active stealth roguelike that parodies cheap ’90s edutainment with a subtle horror twist! Try to collect all the notebooks in each level as Baldi uses his incredible hearing to track you down in a game of “Hide & Seek”. As you do so you will encounter strange characters, find useful items, go on field trips and more inside Baldi’s ever changing Super Schoolhouse, and as you explore the game itself you’ll start to realize it is not what it seems… Hokko Life\nMixing strategy with chaos, Baldi’s Basics Plus plays like no other game, with surprises around every corner that will throw your plans for a loop. Strategizing is key, but knowing how to best revise those strategies as situations change is even more important! As you learn the ins-and-outs of every character, item, event, and obstacle, you’ll be able to make better plans, come up with the best strategies, and escape the most dangerous situations.\nBaldi’s Basics Plus randomizes so many different things, every time you play will be a different experience!\nAll these variables and more add up to make each playthrough a unique experience!",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows 7 (SP1+) or newer (64-bit only",
        "Processor": "1.5 GHz or greater",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon HD 8330 or equivalent",
        "DirectX": "Version 10",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Strategy",
        "Developer": "Basically Games",
        "Platform": "PC",
        "Game Size": "100 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v0.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tkxup38jbmux"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/header-8.jpg"
}