{
    "page_url": "https://steamrip.com/baldurs-gate-dark-alliance-free-download-1v/",
    "title": "Baldur’s Gate: Dark Alliance Free Download",
    "description": "Get Baldur’s Gate: Dark Alliance for free instantly and play pre-installed on SteamRiP\nExperience the massively popular world of Baldur’s Gate as never before. Baldur’s Gate: Dark Alliance thrusts you into an epic Dungeons & Dragons adventure filled with intense action, intricate puzzles and sinister intrigue, where your mastery of cold steel and devastating spells is the only thing between you and ultimate evil. A ground-breaking adventure , featuring the 3rd Edition Dungeons & Dragons rule set. Explosive spell effects and incredibly detailed creatures and environments deliver a more realistic gaming experience. Ready or Not\nThree customizable characters, each with distinctive powers, appearances and abilities that develop throughout the game. Battle alone or join a friend in two-player cooperative mode. Explore Baldur’s Gate: Dark Alliance all over again, experiencing newfound adventures with a different customized character or replaying in Extreme mode for ten times the difficulty and fun. Dolby Surround sound, real-time sound effect mixing, Hollywood voice talent and an original soundtrack by acclaimed composer Jeremy Soule .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/baldurs-gate-dark-alliance-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/baldurs-gate-dark-alliance-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 10",
        "Processor": "Pentium 4 2Ghz / AMD AthlonXP 2400",
        "Memory": "1 GB RAM",
        "Graphics": "GeForce FX5700 or better / ATI Radeon 9600 or better",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Square One Games Inc., Black Isle Studios",
        "Platform": "PC",
        "Game Size": "3.16 GB",
        "Version": "Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8oq0kuy0d8zw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/baldurs-gate-dark-alliance-preinstalled-steamrip.jpg"
}