{
    "page_url": "https://steamrip.com/bandle-tale-a-league-of-legends-story-free-download-b1/",
    "title": "Bandle Tale A LoLs Story",
    "description": "One little Yordle, one humongous problem.\nFrom Lazy Bear, the studio that brought you Graveyard Keeper , comes Bandle Tale: A League of Legends Story. Jump into this delightful crafting RPG set in the magical world of Bandle City, home of the furry and fun-loving yordles. You are a shy yordle living in Yarnville, a cozy but isolated island obsessed with all things knitting . When your 101-year-long apprenticeship ends, you want nothing more than to see what lies beyond the portals that connect the rest of Bandle City. But when a party you attend goes horribly wrong, the portals collapse and everything is thrown into chaos With your unique knitting magic and unflappable spirit, enlist the help of new friends, restore the portals, and reunite Bandle City once more\nBEYOND THE BANDLEWOODS In Bandle Tale, experience a never-before-seen look at life beyond the bandlewoods . Encounter curious critters, gather materials to make impossible crafts, and awaken magical portals as you move between five unforgettable new islands.\nPARTY ON, BANDLE CITY A good life in Bandle City hinges on one thing: beet soup! Wait, no, having fun! Throw festivals to ensure that your fellow yordles are happy and entertained. Cultivate your green thumb and cook farm-to-table dishes for your guests, or flex your engineering prowess and build gadgets to delight them.\nMEET THE CHAMPIONS Befriend colorful characters and make League of Legends Champions your allies as you unravel the mysteries around you and mend your community, one magical stitch at a time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/bandle-talea-league-of-legends-story-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/bandle-talea-league-of-legends-story-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i3-4160 / AMD FX-8320 / Intel Core i7-6770HQ",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GT 640 / Radeon HD 7750 / Iris Pro  580",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation",
        "Developer": "Lazy Bear Games",
        "Platform": "PC",
        "Game Size": "786 MB",
        "Released By": "SKIDROW",
        "Version": "v1.068 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1xqevf6qs8cc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/bandle-talea-league-of-legends-story-preinstalled-steamrip.jpg"
}