{
    "page_url": "https://steamrip.com/barn-finders-free-download-s2/",
    "title": "Barn Finders",
    "description": "Get Barn Finders PC game for free instantly and play pre-installed on SteamRiP\nSearch for valuables stashed in abandoned barns ranging from old clocks, musical instruments, antiques, gold, weaponry to even vintage cars and motorcycles and sell them for a profit. Run your family business. Look for valuable items and sell them in your pawnshop.\nEvery item has a value, so collect everything and search everywhere Bid on auctions and sales to get access to closed-off properties. Who knows what kind of dusty treasures you can find there? Visit 12 original locations and unearth their secrets in the land of Ammeryka (largely simmilar to the real America, but not quite). Barns are just the beginning .\nHow about a visit to an old military base or the moon? Take care of developing your shop. Empty shelves mean an empty wallet. Customers will come back if they have something to come back for. Fix found items, clean the dirty ones and sell them all. And if there are no customers, you can always play basketball in your backyard. And somehow, make money while playing. Uncle Billy will keep you busy .\nTogether you’ll explore different locations, but the real work is all for you to do. That is, until you go solo. Eventually. Being a real Barn Finder is a state of mind – a job for the brave and the bold. Your competitors are specialists and they are just waiting for you to slip up.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/barn-finders-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/barn-finders-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "i5 3550 / FX-8350",
        "Memory": "6 GB RAM",
        "Graphics": "GTX 660Ti / R9 270X",
        "DirectX": "Version 11",
        "Storage": "21 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Duality Games",
        "Platform": "PC",
        "Game Size": "17.9 GB",
        "Released By": "RUNE emu",
        "Version": "v25372 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/5j5jcbwwv793",
        "https://1fichier.com/?ipwcjd00o6o1a475ynys",
        "https://datanodes.to/mnu4at9s06ee/Barn-Finders-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/barn-finders-free-download-preinstalled-steamrip.jpg"
}