{
    "page_url": "https://steamrip.com/batman-arkham-knight-premium-edition-free-download-6p/",
    "title": "Batman Arkham Knight Premium",
    "description": "Get Batman Arkham Knight for free instantly and play pre-installed on SteamRiP\nBatman: Arkham Knight brings the award-winning Arkham trilogy from Rocksteady Studios to its epic conclusion. Developed exclusively for New-Gen platforms, Batman: Arkham Knight introduces Rocksteady’s uniquely designed version of the Batmobile. The highly anticipated addition of this legendary vehicle, combined with the acclaimed gameplay of the Arkham series, offers gamers the ultimate and complete Batman experience as they tear through the streets and soar across the skyline of the entirety of Gotham City.\nIn this explosive finale, Batman faces the ultimate threat against the city that he is sworn to protect, as Scarecrow returns to unite the super criminals of Gotham and destroy the Batman forever. Live the complete Batman experience as the Dark Knight enters the concluding chapter of Rocksteady’s Arkham trilogy. Players will become The World’s Greatest Detective like never before with the introduction of the Batmobile and enhancements to signature features such as FreeFlow Combat , stealth, forensics and navigation.\nIntroducing the Batmobile – The Batmobile is brought to life with a completely new and original design featuring a distinct visual appearance and a full range of on-board high-tech gadgetry. Designed to be fully drivable throughout the game world and capable of transformation from high speed pursuit mode to military grade battle mode, this legendary vehicle sits at the heart of the game’s design and allows players to tear through the streets at incredible speeds in pursuit of Gotham City’s most dangerous villains. This iconic vehicle also augments Batman’s abilities in every respect, from navigation and forensics to combat and puzzle solving creating a genuine and seamless sense of the union of man and machine. Sweet Surrender VR",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/batman-arkham-knight-premium-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/batman-arkham-knight-premium-edition-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 7 SP1, Win 8.1 (64-bit Operating System Required)",
        "Processor": "Intel Core i5-750, 2.67 GHz | AMD Phenom II X4 965, 3.4 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660 (2 GB Memory Minimum)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "45 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Rocksteady Studios",
        "Platform": "PC",
        "Game Size": "52.3 GB",
        "Repack By": "GOG (DRM FREE)",
        "Version": "v1.999 (Game of the Year Edition) | Full + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/4ACB4A096D",
        "https://buzzheavier.com/qlhbq0546no5",
        "https://1fichier.com/?r0m3mkvm9x1xos2ual31"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/batman-arkham-knight-premium-edition-free-download-preinstalled-steamrip.jpg"
}