{
    "page_url": "https://steamrip.com/battlefield-3-free-download-3g/",
    "title": "Battlefield 3 Free Download Direct Link",
    "description": "Ramp up the intensity in Battlefield 3 and enjoy total freedom to fight the way you want. Explore 29 massive multiplayer maps and use loads of vehicles, weapons, and gadgets to help you turn up the heat. Plus, every second of battle gets you closer to unlocking tons of extras and moving up in the Ranks. So get in the action. Play to your strengths — The 4 player classes — Assault, Engineer, Support, and Recon — each have specialties, and working together is key to victory.\nGo anywhere, do anything — Commandeer any vehicle you come across, from tanks and buggies to helicopters and jets. Even slam your F/A-18E Super Hornet directly into an enemy combatant Experience total mayhem — Enjoy 29 multiplayer maps. Massive destructible environments? Yup. Wide open spaces for crazy vehicular combat? Roger that. Grab loads of unlockables — Every battle gains you Ranks, Ribbons, Medals, and more, enhancing your prowess. Stick with your helicopter, master your piloting , and unlock IR flares to ward off oncoming missiles or opt to increase your stealth.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/battlefield-3-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/battlefield-3-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "2 GHz Dual Core (Core 2 Duo 2.4 GHz or Althon X2 2.7 GHz)",
        "Memory": "2 GB RAM",
        "Graphics": "card (AMD): DirectX 10.1 compatible with 512 MB RAM",
        "DirectX": "Version 10",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "DICE",
        "Platform": "PC",
        "Game Size": "14 GB",
        "Repack By": "DODI Repack",
        "Version": "v1.4.0 | Full  + All DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/2F603A5155",
        "https://buzzheavier.com/vc7icr2suwk6",
        "https://megadb.net/gc1u6w76s8vh",
        "https://1fichier.com/?qm1rsqnoq3y6h03u3dvg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/battlefield-3-free-download-preinstalled-steamrip.jpg"
}