{
    "page_url": "https://steamrip.com/bayonetta-free-download/",
    "title": "Bayonetta",
    "description": "From PlatinumGames’ legendary director Hideki Kamiya of Resident Evil and Devil May Cry fame, SEGA brings one of the most universally acclaimed character action games of all time to PC. Manhunt 2\nBayonetta. The last survivor of an ancient witch clan who keep the balance between light, dark and chaos. Entombed to protect herself – and the world as we know it – Bayonetta is discovered and revived after 500 years, sparking a chain of events with cataclysmic repercussions. Manhunt 2\nThrust straight into battle, with only one clue to her past, Bayonetta must discover the truth and fight for the future. Her daunting conquest sees her face off against countless angelic enemies and giant foes in a game of 100% pure action.\nDeadly Grace An alluring, stylish and all-action heroine unlike anyone else on the gaming landscape, Bayonetta is ready to push your senses to the limit.\nClimax Action Over-the-top action in extreme environments resulting in continuous high levels of tension and excitement – Bayonetta pushes the genre into new realms of intensity .\nExtravagant Combat Bayonetta wields an impressive arsenal of weapons through an intuitive and fluid combat system, unleashing deadly combos and special attacks with devastating results.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/bayonetta-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/bayonetta-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Microsoft Windows 7 / 8 (8.1)/ 10",
        "Processor": "Core i3 3220",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD6950 / GeForce GTX 570 (VRAM 768MB)",
        "DirectX": "Version 9.0c",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "PlatinumGames",
        "Platform": "PC",
        "Game Size": "11.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 1824749 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/456678C84C",
        "https://buzzheavier.com/akg84cm1gqxv",
        "https://megadb.net/55nwh852u5cd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/bayonetta-preinstalled-steamrip.jpg"
}