{
    "page_url": "https://steamrip.com/beacon-pines-free-download-1t/",
    "title": "Beacon Pines Directly Download",
    "description": "Beacon Pines is a cute and creepy adventure set within a mysterious book. You play as both the reader of the book and its main character, Luka. Something strange is happening at the old warehouse, and Luka and his friends seem to be the only ones taking notice. Sneak out late, make new friends, uncover hidden truths, and collect words that will change the course of fate While helping Luka investigate the strange goings-on in Beacon Pines, you’ll collect special golden charms, each with a word engraved on it. Prodeus\nThese charms can be used at certain turning points in the story to fill in a blank word and drastically change everything that follows. As the book’s reader, you’ll navigate the story’s turning points using The Chronicle: an interactive story tree that branches and grows along with your choices. Exploring one set of events can unlock new charms to use on another branch, leading you to jump back and forth between entirely different versions of the story in order to unravel the mysteries at the heart of Beacon Pines.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/beacon-pines-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/beacon-pines-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "1.8GHz+",
        "Memory": "2 GB RAM",
        "Graphics": "1GB",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Hiding Spot",
        "Platform": "PC",
        "Game Size": "632 MB",
        "Released By": "GOG",
        "Version": "v1.0.2 | Full  + Bonus Content",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/baz2bk5727oz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/beacon-pines-preinstalled-steamrip.jpg"
}