{
    "page_url": "https://steamrip.com/bears-in-space-free-download/",
    "title": "Bears In Space",
    "description": "Get ready to unleash your inner bear in Bears in Space, the over-the-top bullet-hell FPS that’s bound to have you ROARING with excitement! Dive headfirst into hordes of oil-thirsty robots as you embody Maxwell Atoms, a Spacetronaut turned extraterrestrial castaway, whose DNA has been merged with Beartana, the She-Bear. Embark on a zany and humorous out-of-this-world adventure that’ll have you blasting your way across exciting and varied locations, from wastelands to space carnivals to ancient hidden temples and more as you quest to find your way back to earth and if there’s time, save your crew.\nBears In Space offers non-stop, high-energy gameplay. Fight your way through waves of fiendish robots using an arsenal of outrageous weaponry and gadgets. Double jump, dash, and dodge enemy attacks in the tradition of the best old-school shooters. Millennia\nConsume elusive honey pots and unleash your Ursine rage, transforming into a bear Use your unique DNA fusion to your advantage, carving up robot enemies with your mighty bear powers and masterful knowledge of the ancient art of Bear Fu and the fabled Kuma No Ken. Complete challenges and break open loot crates to purchase guns, choosing from a diverse range of over 25 weapons Most weapons upgrade, with each kill gaining your equipped weapon XP until it evolves into its next evolution tier So, get out there and let the lasers fly\nVenture beyond the ordinary FPS experience and discover Substories, secrets and collectibles across every level Learn how to bake a cake, investigate a crime scene, battle a Rock God , play a round of Basketcube and even bust some ghosts! All while meeting a colourful cast of characters with their own quirks and stories to tell.\nCompleting these exciting optional encounters brings with it a hefty loot pay off, making these encounters even more rewarding to search out as you save up for your next weapon Modify your difficulty with independent sliders for incoming and outgoing damage. You can also engage our Platform Helper mode, making all platforming segments of our game significantly easier to conquer! Perfect for kids or gamers new to the FPS genre\nWhether you’re a seasoned gamer looking for a blast from the past or a casual player seeking a fun-filled adventure, Bears in Space promises a fun and absurd, action packed time. Get ready to shoot, chuckle, and unleash your inner bear in this one-of-a-kind bullet-hell FPS adventure that’s truly out of this world!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/bears-in-space-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/bears-in-space-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "4-core CPU @ 3.2 GHz (4th Generation Intel Core i5 or higher or AMD equivalent)",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970/GeForce 1060 or AMD equivalent (3 GB VRAM or more)",
        "DirectX": "Version 12",
        "Storage": "23 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Broadside Games",
        "Platform": "PC",
        "Game Size": "5.3 GB",
        "Released By": "TENOKE",
        "Version": "Build 13794061 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j0rcgyi64asl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/bears-in-space-preinstalled-steamrip.jpg"
}