{
    "page_url": "https://steamrip.com/beat-slayer-free-download/",
    "title": "Beat Slayer",
    "description": "Beat Slayer is a roguelite hack n’ slay game like no other. Instead of just being in the background the music takes centre stage. Join Mia, a badass music lover and crafty tinkerer, as she battles hordes of robots in a dystopian 90s-inspired Berlin. Pathfinder: Gallowspire Survivors\nFight to the rhythm Every move you make has to match the rhythm of the soundtrack. Fail to do so and you’ll pay the price. No button mashing, no frantic inputs. Only smooth and skillful gameplay will lead to your victory against the waves of different enemies and imposing bosses\nShow them your moves Leverage Mia’s nimble move set and decide within seconds which of your moves you should use. Dash to engage or disengage? Attack to build up your drive bar or spread your status effects? Kick your enemies against walls or into each other? The choice is yours\nSlay it your way Each run plays differently and is influenced by your playstyle and your thrill for risks, but also by your starting weapon, your chosen upgrades and your growing skill set.\nBerlin Attitude Rely on your unconventional team of rebels as you navigate through a robot- controlled and corrupted Berlin. Discover the city’s diverse locations, from underground bunkers to towering rooftops, while your allies assist with weapons, upgrades, and valuable insights .\nGet in the flow Put on your headphones, sync with the beat and dive more and more into the action to enter the “flow state”. Don’t think and just play. Let the music guide you and create your own symphony of destruction round, after round, after round",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/beat-slayer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/beat-slayer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows® 8",
        "Processor": "Intel® Core™ i5 4570 (or quad-core equivalent)",
        "Memory": "5 GB RAM",
        "Graphics": "NVIDIA® GTX 970",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "ByteRockers’ Games",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "RUNE",
        "Version": "v1.1.14 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s0rs8t2vgmze"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/beat-slayer-preinstalled-steamrip.jpg"
}