{
    "page_url": "https://steamrip.com/before-the-last-hour-free-download-h1/",
    "title": "Before The Last Hour",
    "description": "Time is no more, your world is frozen in a perpetual agony a moment before its end. You wake up in this desolate land, where most of the inhabitants are consumed by the Oblivion . An affliction that gradually erases their memories and personalities, turning them into empty shells, eternally condemned to wander aimlessly. It is up to you to meet the challenges of this world and find the origin of this apocalypse and, perhaps, bring it to an end. You are the last adventurer in this land devastated by the end of the world and oblivion.\nArmed with a gauntlet that allows you to manipulate the continuum, an energy that permeates your entire world, you must find the origin of the end of time. Before the Last Hour is a roguelike, offering both rpg and deck builder components. Explore the wastelands, defeat ever more powerful and epic enemies to finally give your world the ending it has been waiting for. Arma Reforger\nExplore and equip yourself – Find and combine over 100 unique items to choose from to create a unique and powerful build. Upgrade and use unique weapons with over 60 different abilities to keep your adventures fresh. Combine your cards – Use the cards you are given in combination with other cards and items for more powerful effects.\nWith a 3-card combo system you’ll have to think before you act to maximize your turns. Fight unique monsters – Every battle for survival will be a challenge as the ancient monsters of the legends try to survive just like you. Fight unique and beautifully animated creatures in traditional 2D.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/before-the-last-hour-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/before-the-last-hour-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, 7, 8",
        "Processor": "1 Gigahertz",
        "Memory": "300 MB RAM",
        "Graphics": "3D graphics card compatible with DirectX 9 or better",
        "DirectX": "Version 9.0c",
        "Storage": "350 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy, Early Access",
        "Developer": "Ludeme Games, Sirlin Games",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "N/A",
        "Version": "v0.8.3 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3bx7ttpzqhvu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/before-the-last-hour-preinstalled-steamrip.jpg"
}