{
    "page_url": "https://steamrip.com/before-your-eyes-free-download/",
    "title": "Before Your Eyes",
    "description": "Before Your Eyes is a first person narrative adventure which tells the story of a soul’s journey into the afterlife using a new and innovative form of interaction—your real-life blinks . The story begins after your death, aboard the ship of a mythical Ferryman tasked with shepherding souls to the afterlife. In order to help you pass on, he must first learn the story of your life. And so, he sends you back to relive your most important moments.\nThe game uses your webcam to immerse you in this story in a way you’ve never experienced before. You will learn to control the flow of the narrative with your actual eyes–blinking through precious memories of family, first love, and the rise of an artistic career. But soon the Ferryman will suspect you aren’t showing him everything he needs to see. So he will force you deeper into the dark recesses of your most repressed memories, ultimately revealing a heartbreaking truth. Fallout 2\nBy combining its innovative blink interaction mechanic with a charming world and a fully voice-acted story, Before Your Eyes is a deeply emotional and relatable journey—one about the impossible expectations we place on ourselves and the regrets we carry with us.\nAn earlier version of the game, titled Close Your, received the Game Developers Choice award at Indiecade and the Student Award at the Independent Game Awards (IGF), before receiving funding through a successful Kickstarter campaign.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/before-your-eyes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/before-your-eyes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 64-bit and above",
        "Processor": "AMD Athlon X4 880K 4Ghz or Intel Pentium G4500 3.5Ghz",
        "Memory": "8 GB RAM",
        "Graphics": "Intel HD Graphics 520 or AMD Radeon Vega Integrated Graphics",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "GoodbyeWorld Games",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "GOG",
        "Version": "v1.2.6.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g214t7x0zzms"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/before-your-eyes-preinstalled-steamrip.jpg"
}