{
    "page_url": "https://steamrip.com/bellwright-free-download/",
    "title": "Bellwright",
    "description": "Framed for the murder of the Prince and sentenced to death by the Crown, you’ve been living in the shadows ever since. After barely dodging an attempt on your life, you find the assassin’s contract that raises many questions – was it just misfortune that you were framed ? Or is there more to it? Determined to find the answers, you journey back to the very place you escaped. Slowly but surely, you will lead a rebellion against your homeland’s oppressive Sovereign to victory, uncovering the truth of your family’s secret along the way. The bells shall ring for freedom once again. Sweet Transit\nEstablish and expand your own settlements, liberate the land and assist its villagers , and recruit others to your cause while learning more about a life you had to leave behind. Your recruits will help you build up the resources and might needed for a stand against the Crown . Command your forces, prove your valor through combat, and cement yourself as the hero of your people.\nSurvive and Explore – Gather, hunt, build and craft! Collect and manage resources in a harsh world to survive, and journey through the land for its secrets and adventures! The Crown and its Royal Army is not the only foe in the kingdom\nConquer and Expand – Work your way up from a small camp to becoming the leader of a great rebellion. Improve your relations with the settlements, grow your armies, and liberate regions from the Crown to strengthen your cause. Gain followers with unique knowledge along the way and find new resources to further the technologies of your towns.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/bellwright-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/bellwright-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: 64-Bit Windows 7 Service Pack 1, Windows 8, Windows 10 or Windows 11",
        "Processor": "Intel Core i5-8600 / AMD Ryzen 5 3600",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070 8GB / AMD Radeon RX 580 8GB",
        "DirectX": "Version 12",
        "Storage": "24 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Simulation, Strategy, Early Access",
        "Developer": "Donkey Crew",
        "Platform": "PC",
        "Game Size": "16.5 GB",
        "Released By": "RUNE emu",
        "Version": "v0.0.39527 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/ba0A3I",
        "https://buzzheavier.com/nd7va9r2u15n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/bellwright-preinstalled-steamrip.jpg"
}