{
    "page_url": "https://steamrip.com/bendy-and-the-ink-machine-complete-edition-free-download-1w/",
    "title": "Bendy and the Ink Machine All Episodes Download",
    "description": "Bendy and the Ink Machine download PC Game In Direct Link for free on SteamRIP\nBendy and the Ink Machine is a horror adventure project in which players are invited to play the role of Henry to go to an old animation studio. Here you will find puzzles, riddles, heartbreaking sounds and awesome hardcore atmosphere And do not think that this is an ordinary quest in a confined space.\nIn fact, the studio you will wander through is huge and spacious , and what is happening on its territory can scare and once and for all change your idea of ​​how animation is created. In the story, you, as Henry, come to an old animation workshop to visit your friend, but you don’t find him there, but you find an old non-working ink machine, photographs of Mickey Mouse scattered all over the place and splattered ink.\nYou just have to look for answers to all these questions, wandering through the open spaces of the workshop. But as you explore the workshop , inexplicable things will happen to you, and heartbreaking sounds will be heard from all sides. Will you cope with your fears and understand what is happening? ONE PIECE World Seeker\nOr try to escape from here as quickly as possible? You decide With twists and turns around every corner, “Bendy and the Ink Machine” is sure to thrill you and decimate your childhood. This first chapter sets the tone for the adventure ahead. Solve the riddle. Escape the workshop.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/bendy-and-the-ink-machine-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/bendy-and-the-ink-machine-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10",
        "Processor": "Intel/AMD 64",
        "Memory": "8 GB RAM",
        "Graphics": "4GB Dedicated",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy",
        "Developer": "Joey Drew Studios",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.5.1.2 Complete Edition | Full  All Chapters",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dd8olphwhowa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/bendy-and-the-ink-machine-preinstalled-steamrip.jpg"
}