{
    "page_url": "https://steamrip.com/berserk-and-the-band-of-the-hawk/",
    "title": "BERSERK and the Band of the Hawk",
    "description": "The dark and profound world of “Berserk,” a dark fantasy comic series that has sold over 40 million copies, is faithfully reproduced in this game. The latest graphics shows the fierce quest for vengeance of the main character Guts, and the deadly combat he encounters alongside his friends. Experience the exhilaration of the “Warriors” series combined with an overwhelming destructive power! Grouls\nThe action of defeating hundreds of enemies, fundamental to the Warriors series, has been newly developed to match the world of “Berserk”. In addition to the exhilaration of blowing away enemies, the main character, Guts, uses his giant man-sized sword “Dragon Slayer” to slay enemies using “Cleaving” and “Smashing” attacks for battles overflowing with power. In the original work, Guts and his friends face numerous hopeless battle conditions surrounded by enemy soldiers and monsters. In this game, players can experience the “overwhelming destructive power” that overturns such situations with a single swing of the sword.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/berserk-and-the-band-of-the-hawk-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/berserk-and-the-band-of-the-hawk-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64bit required)",
        "Processor": "Core i7 870 over",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA Geforce GTS 450",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "17.8 GB",
        "Released By": "HI2U",
        "Version": "Build 1627003 + 6 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/A7439FE2B4",
        "https://buzzheavier.com/eepsega1bsrx",
        "https://1fichier.com/?a0x6p6serz33hs8r32ix"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/berserk-and-the-band-of-the-hawk-preinstalled-steamrip.jpg"
}