{
    "page_url": "https://steamrip.com/berserk-or-die-free-download/",
    "title": "Berserk or Die",
    "description": "You are the last soldier left on the battlefield . With enemies approaching from both sides, rally the last of your willpower in one final push to victory. Go berserk, or die Dune: Imperium\nFace danger head-on as your only way to move is attacking to your left or right. Stronger foes await you in the later days of battle, so ensure to spend your gold with the nightly Peddlers to heal, purchase new weapons, obtain new relics, and survive to fight another day.\nThe game’s most distinctive feature is the keyboard-banging controls, which make the battles all the more thrilling. The more buttons pressed, the wider the attack range. Continue attacking to unleash a powerful attack to eliminate a large number of enemies in one fell swing. Charge your Special bar to show your full might to your foes with an even grander display of power. Game pads are also supported. A lone Peddler will sell you wares at the end of each survived day. Heal your wounds, buy upgrades, and purchase rarities to continue the fight.\nSurvive as characters from through the ages, and equip a wide array of weapon choices from the Armory. Ensure you see another night by using Swords, Katanas, Greataxe’s , Staffs and more on your journey to victory.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/berserk-or-die-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/berserk-or-die-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later (64bit)",
        "Processor": "Intel Core 2 Duo E5200",
        "Memory": "8000 MB RAM",
        "Graphics": "GeForce 9800GTX+ (1GB)",
        "DirectX": "Version 10",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Nao Games",
        "Platform": "PC",
        "Game Size": "458 MB",
        "Released By": "TENOKE emu",
        "Version": "Build 18784252 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6349kz9yrkl1",
        "https://buzzheavier.com/zj6gnrh3zdch"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/berserk-or-die-preinstalled-steamrip.jpg"
}