{
    "page_url": "https://steamrip.com/beyond-contact-free-download-1h/",
    "title": "Beyond Contact",
    "description": "Beyond Contact is an innovative science fiction survival crafting game that features a top-down art style inspired by pulp science-fiction comics, providing a distinct visual aesthetic. Offering players the option to engage in a narrative-driven Story Mode or an open-ended Conquest Mode, Beyond Contact’s narrative objectives and moral dilemmas are reminiscent of contemporary science-fiction films.\nBeyond Contact’s gameplay includes a robust system of research and crafting, allowing players to create a wide variety of tools, weapons, gadgets, and structures to aid in their survival. The habitat building, farming, and game mechanics are fun and satisfying to use. The game’s open world features a diverse array of fauna and flora. For players who prefer a more casual pace, the game offers a range of game customization settings. In the year 2766, Quinn Hicks an elite member of Space Corps, the expeditionary arm of the UWC, is called in to respond to a growing crisis at the edge of known space. HYPERCHARGE: Unboxed\nThe planet of Ketern is breaking apart, a yet unknown energy source emanating from the planet’s interior is threatening the civilization that calls Ketern home. Join the fight for control of the planet Ketern in Beyond Contact’s new Conquest Mode. This free-form survival experience offers endless gameplay, huge base-building opportunities, and epic battles against the formidable Corrupted hordes. Polished through collaboration with the dedicated community, the Story Mode is ready to immerse players in an epic journey of exploration and discovery where you fight to save an entire civilization and planet from annihilation .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/beyond-contact-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/beyond-contact-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows (7SP1/8/8.1/10)",
        "Processor": "Intel Core i5 (Sandy/Ivy Bridge) or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 or AMD equivalent",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Playcorp Studio",
        "Platform": "PC",
        "Game Size": "6.8 GB",
        "Released By": "DOGE",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lufvkem4dcl7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/beyond-contact-preinstalled-steamrip.jpg"
}