{
    "page_url": "https://steamrip.com/beyond-the-long-night-free-download-t1/",
    "title": "Beyond the Long Night",
    "description": "A charming twin-stick action roguelike adventure with a heavy emphasis on chaotic combat , cute characters and mystery Explore the Dark Mountain a subterranean world full of monsters, secrets, and lovable characters. Puzzle, upgrade and battle your way through three randomly generated areas to outrun a deadly storm and escape to the Overworld beyond. Coffee Talk Episode 2\nUncover a trail of mysteries in this ancient kingdom of demigods and explorers, captured within an endless time loop. What treasures await in The Overworld? Is there a way to stop the storm from spreading? Can you escape the endless time loop? All may be revealed beyond the long night.\nShoot, dodge, throw items and use Superpowers as you battle your way through The Dark Mountain. Acquire, stack and combine powerful upgrades to wreak havoc on your foes Befriend the mountain folk. Meet a colourful cast of friendly cave dwellers as you journey through the underground. Complete side quests and follow their stories across multiple runs.\nSurvive the deadly storm and discover the mountain’s secrets. Outrun a mysterious corrupting force that chases you through the mountain. Balance your build and time well or suffer the consequences Learn more about the world each time you play, solve puzzles and uncover the true nature of the Storm as you try to escape The Long Night. Beat the game and unlock devastating new upgrades, opening up fresh ways to play.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/beyond-the-long-night-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/beyond-the-long-night-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "AMD Ryzen 5 2500U or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Radeon Vega Mobile GFX or equivalent",
        "DirectX": "Version 12",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Noisy Head Games",
        "Platform": "PC",
        "Game Size": "659 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.00.04 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1p8e52rxwgho"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/beyond-the-long-night-preinstalled-steamrip.jpg"
}