{
    "page_url": "https://steamrip.com/bish-bash-bots-free-download-x1/",
    "title": "Bish Bash Bots",
    "description": "Bish Bash Bots is a unique mix of casual tower defense strategy and all-out brawling action. Team up in couch co-op / online play or go it alone to save the world. In a cartoony take on the distant future, robots have become an integral part of everyday life. But everything changes when the bots, seemingly for no reason, malfunction , revolt against their makers, and start stealing all of the world’s technology. Amongst the chaos, a rag-tag team of unlikely heroes step up to save humanity. Armed with their respective skills, our heroes have set out on a grand adventure to reset the robots and save the world. Cities: Skylines II\nBuild upgradable turrets, unlock new gadgets and bash bots with giant hammers. Journey across the world through vibrant and colourful biomes. Use strategy to defend against swarms of robots and save humanity Large swarms of enemies that navigate dynamically – can be pushed, shoved and bashed around by players and turrets . A unique mix of casual tower defense strategy and all-out brawling action. Swing giant hammers, run and jump around vibrant levels and figure out how best to use your turrets against the incoming waves of bots.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/bish-bash-bots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/bish-bash-bots-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core i3-2100 | AMD Phenom II X4 965",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 870, 1 GB | AMD Radeon R7 250, 1 GB",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "CATASTROPHIC_OVERLOAD",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/poa9zebe3doj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/bish-bash-bots-preinstalled-steamrip.jpg"
}