{
    "page_url": "https://steamrip.com/blacksmith-simulator-free-download/",
    "title": "Blacksmith Simulator",
    "description": "Blacksmith Simulator Co-Op is a unique survival simulation game that takes you to the harsh world of the Middle Ages. Whether playing alone or with friends, you must keep your character alive and overcome challenges such as hunger and thirst. STAR WARS: Episode I: Jedi Power Battles\nIn this game, where you can only build on your base area, you can gather wood and ores from the environment to upgrade both your character and your base.\nPlayers can gather resources like emeralds, gold, and diamonds , transform them into ingots, and craft powerful weapons and armor. These upgrades strengthen characters, enhance blacksmithing skills, and provide the tools needed to overcome upcoming challenges.\nAlthough the main character of Blacksmith Simulator Co-Op is a skilled blacksmith, survival requires farming and animal husbandry. Players must grow crops, raise animals , and fish to gather resources for both survival and crafting, ensuring their journey continues in this challenging world.\nExplore three magical realms in Blacksmith Simulator Co-Op, each with unique resources for crafting powerful weapons and armor. Players must navigate dangerous paths and battle fierce enemies to access these resources and strengthen their character.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/blacksmith-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/blacksmith-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Requires a 64-bit processor and operating system.",
        "Processor": "Windows 8",
        "Graphics": "GeForce GTX 950 or Radeon HD 7970",
        "DirectX": "Version 11",
        "Storage": "5000 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "GalaxyVerse",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/b515h45t9eb1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/blacksmith-simulator-preinstalled-steamrip.jpg"
}