{
    "page_url": "https://steamrip.com/black-clover-quartet-knights-free-download-s2/",
    "title": "BLACK CLOVER: QUARTET KNIGHTS Free Download",
    "description": "Get BLACK CLOVER: QUARTET KNIGHTS for free instantly and play pre-installed on SteamRiP\nIn this magic battle action game, take part in 4-on-4 team battles and cast an array of magic spells to defeat the opposing team. You can assume one of four roles: Fighter, Healer, Support, Ranged. Use your role and spells to the best possible effect, and cooperate with your teammates to win the battle The protagonist, Asta, is the only boy unable to use magic in a world where magic is everything. Despite this affliction, Asta manages to overcome all sorts of hurdles with the help of his friends , and persists in his goal of becoming the Wizard King.\nThis game also includes an original story not depicted in the currently airing Black Clover anime series. Yami Sukehiro, the captain of Asta’s knight order, the Black Bulls, suddenly grows younger, just as a mysterious mage launches an attack on the Clover Kingdom. Join Asta and his friends as they embark on a new adventure of trials and tribulations .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/black-clover-quartet-knights-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/black-clover-quartet-knights-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "AMD Phenom II X4 945 or Intel Core i3-2100",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon Vega 8 or Intel Iris Pro 580",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "ILINX, Inc.",
        "Platform": "PC",
        "Game Size": "12.1 GB",
        "Repack By": "CODEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/2m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/black-clover-quartet-knights-free-download-preinstalled-steamrip.jpg"
}