{
    "page_url": "https://steamrip.com/black-book-free-download-1h/",
    "title": "Black Book Endless Battles",
    "description": "A fusion of card-based RPGs and Adventure games, “Black Book” is a haunting tale of a young sorceress, who gave her life to serve the dark forces. Dive into the cold, yet alluring world of Slavic folktales – and uncover the secrets that hide in the darkness.\nA young girl named Vasilisa, destined to become a witch, decides to throw her fate away and marry her beloved but that dream is shattered when her betrothed dies under mysterious circumstances. Aching for her lost love, Vasilisa seeks out the Black Book a demonic artifact, said to be powerful enough to grant any wish to the one who uncovers all 7 of its seals. Join Vasilisa in her adventures across the rural countryside, as she solves the woes of common folk by confronting demons and performing exorcisms. Nebuchadnezzar\nThe Endless Battles mode is a challenge to your tactical and strategical ability. Help Vasilisa reach the depths of Hell and face Evil itself, in just three days. There are a few paths down below, however, all changing during the night. Your journey will not be easy and full of combat.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/black-book-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/black-book-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 10",
        "Processor": "Intel Core i3 3.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 / AMD Radeon R9 280X",
        "DirectX": "Version 10",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "Morteshka",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "GOG",
        "Version": "v1.0.36 | Full  (Latest) + Endless Battles",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rktqqmxkd3pp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/black-book-preinstalled-steamrip.jpg"
}