{
    "page_url": "https://steamrip.com/blade-of-darkness-free-download-1q/",
    "title": "Blade of Darkness Free",
    "description": "Get Blade of Darkness pc game for free instantly and play pre-installed on SteamRiP\nAn excellent fantasy 3D action game. At one time, the game won a huge army of fans thanks to its excellent combat system, excellent design and the intelligence of monsters that has never been surpassed by anyone. You are offered a choice of four different warriors – each with a unique set of weapons, techniques and initial storyline. The game is highly interactive – you can fight with anything, including the severed limbs of monsters.\nA grim new threat looms over The Central Kingdoms . The borders protected by the fierce King’s Knights are no longer secure. The fearsome orc clans, more numerous than ever, lurk on all roads. The proud nomadic peoples of the steppes are on the alert, for strange beasts prowl the darkness. Not even the stout dwarves, hidden in their underground palaces, seem safe from threat – from the unknown tunnels of its mines, a foul army of hideous creatures advances inexorably. Star Wars The Force Unleashed: Ultimate Sith Edition\nOnly the memory of the oldest recalls the exploits of a hero and a few warriors , who in other times fought against the forces of Chaos. Ianna, the mother of all living beings, gave the hero a powerful sword to enter the abyss and defeat evil. But that happened a long time ago. A new hero is needed, a chosen one who is worthy to wield the Sword and destroy the enemy this time forever .\nFOUR PLAYABLE CHARACTERS Pick your Champion of Ianna — Tukaram, the Barbarian; Naglfar, the Dwarf; Sargon, the Knight; or Zoe, the Amazon — each with unique strengths, weaknesses, and fighting skills, as you hack ‘n slash your way through a blood-drenched quest to save the world from the forces of Chaos. Breathedge\nBLOODY & GORY COMBAT Learn devastating combo attacks and use them to slice your opponents into pieces. Hack off your foes’ limbs, then use them as weapons",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/blade-of-darkness-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/blade-of-darkness-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7, 8.1, 10",
        "Processor": "Dual Core 2Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible for 1920×1080",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Rebel Act Studios, Fire Falcom, General Arcade",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Repack By": "DOGE",
        "Version": "Build 10785701 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jppvi8nfxo3o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/blade-of-darkness-free-download-preinstalled-steamrip.jpg"
}