{
    "page_url": "https://steamrip.com/blade-and-sorcery-free-download-1v/",
    "title": "Blade and Sorcery",
    "description": "Get Blade and Sorcery for free instantly and play pre-installed on SteamRiP\nThe era of the VR weightless, wiggle-sword combat is over. Blade & Sorcery is a medieval fantasy sandbox like no other, focusing on melee, ranged and magic combat that fully utilizes a unique and realistic physics driven interaction and combat system. The gameplay here is based primarily not on virtual reality technology. It is thanks to her that you will be able to feel the full atmosphere and everything that happens in the game. Otherwise, familiar mechanics await you. You will fight numerous opponents, upgrade your hero, participate in battles in various arenas, learn different techniques and types of attacks, and do much, much more.\nBuilt exclusively for VR , collisions are dictated by fine hitboxes, objects have weight and follow the laws of physics, creatures have full body physics and presence, and blades can be used to penetrate soft materials or deflect magic. In Blade & Sorcery, the combat is limited only by your own creativity. Choose your weapon, choose your stance, choose your fighting style; Be the powerful warrior, ranger or sorcerer you always dreamed of becoming Car For Sale Simulator 2023",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/blade-and-sorcery-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/blade-and-sorcery-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / 1060"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Simulation",
        "Developer": "WarpFrog",
        "Platform": "PC",
        "Game Size": "12.8 GB",
        "Released By": "Mr_GOLDBERG | Ty Kirigiri’s, IceColdOldMan (csrinru)",
        "Version": "v1.0.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/tof8jr",
        "https://buzzheavier.com/nvs7btspdid8",
        "https://megadb.net/4hlz9kk76260"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/blade-and-sorcery-preinstalled-steamrip.jpg"
}