{
    "page_url": "https://steamrip.com/blasphemous-free-download-1h/",
    "title": "Blasphemous Digital Deluxe Edition",
    "description": "A foul curse has fallen upon the land of Cvstodia and all its inhabitants it is simply known as The Miracle. Play as The Penitent One – a sole survivor of the massacre of the ‘Silent Sorrow’. Trapped in an endless cycle of death and rebirth, it’s down to you to free the world from this terrible fate and reach the origin of your anguish .\nExplore this nightmarish world of twisted religion and discover its many secrets hidden deep inside. Use devastating combos and brutal executions to smite the hordes of grotesque monsters and titanic bosses, all ready to rip you limb from limb. Aerial_Knight’s Never Yield\nLocate and equip relics, rosary beads and prayers that call on the powers of the heavens to aid you in your quest to break your eternal damnation. Explore a Non-Linear World Overcome fearsome enemies and deadly traps as you venture through a variety of different landscapes , and search for redemption in the dark gothic world of Cvstodia.\nBrutal Combat: Release the power of Mea Culpa, a sword born from guilt itself, to slaughter your foes. Acquire devastating new combos and special moves as you purge all in your path. Executions: Unleash your wrath and relish in the gory dismemberment of your adversaries all in beautifully rendered, pixel-perfect execution animations. Customise Your Build Discover and equip Relics, Rosary Beads, Prayers and Sword Hearts to give you the new abilities and stat boosts you need to survive.\nExperiment with different combinations to suit your playstyle. Intense Boss Battles Hordes of gigantic, twisted creatures stand between you and your goal. Learn how they move, survive their devastating attacks and emerge victorious.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/blasphemous-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/blasphemous-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core2 Duo E8400 or AMD Phenom II x2 550",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 260 or Radeon HD 4850",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "The Game Kitchen",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "GOG",
        "Version": "v4.0.6.7 | Full  + Digital Deluxe Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/3aVJgY",
        "https://megadb.net/a7h80psfvvzg",
        "https://buzzheavier.com/2lo88oaa4gib"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/blasphemous-preinstalled-steamrip.jpg"
}