{
    "page_url": "https://steamrip.com/blasphemous-2-free-download-1i/",
    "title": "Blasphemous 2",
    "description": "The second scripture in the Blasphemous series portends the return of The Penitent One, with a story that continues from the free Wounds of Eventide DLC for the original game, where The Heart in the sky heralded the return of The Miracle and foretold the birth of a new miracle child.\nAwakened in a strange new land, and displaced from his final resting place, The Penitent One is thrust back into the endless cycle of life, death, and resurrection, with no other option than to explore this perilous new world and uncover its long-forgotten secrets. Lawgivers II\nHordes of grotesque enemies stand in your way, awaiting final judgement by the brutal hand of the Penitent One, with titanic twisted bosses also lurking in the darkness, waiting for their chance to return you to the grave from whence you came.\nTaking them down won’t be easy, but with Blasphemous 2 offering more chances to customise and improve your skill set, along with several new unique weapons to wield with righteous zeal and unending fury, victory might just be within grasp .\nHaving awoken in a strange new land, your journey starts anew in a series of enchantingly grotesque landscapes , oozing Gothic charm and littered with unforgiving traps. How you tackle the labyrinthian world remains at your discretion, there is no wrong turn to be made, only scores to settle\nThe Penitent One shows no mercy, and with a series of new weapons offering new moves, brutal executions, and expanded combos, destruction will rain on any that stand in his way\nBlasphemous 2 offers up new ways to play, with the ability to customise and improve your base skillset , alongside several new unique weapons to unleash devastating attacks on enemies\nHordes of monstrous foes stand between you and your goal; twisted bosses with unique attack patters and sundering abilities will put your skills to the test as you fight to stand triumphant when the dust settles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/blasphemous-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/blasphemous-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core 2 Duo E8400 or AMD Phenom II X2 550",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 520, 1 GB or AMD Radeon HD 7470, 1 GB or Intel HD  4400",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "The Game Kitchen",
        "Platform": "PC",
        "Game Size": "5.8 GB",
        "Released By": "RUNE",
        "Version": "v2.0.0 | Full  + Blasphemous 2 – Mea Culpa DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/VXTL7o",
        "https://megadb.net/g53dr3a3eheg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/blasphemous-2-preinstalled-steamrip.jpg"
}