{
    "page_url": "https://steamrip.com/blazblue-entropy-effect-free-download-b1/",
    "title": "BlazBlue Entropy Effect",
    "description": "A brand-new action roguelite developed by a team with years of experience in action games, ready to present the best 2D action combat experience the world has ever seen WrestleQuest\nEach character has their own traits and hundreds of moves to choose from as you create your unique combos . The Legacy System making each battle a unique experience. Think strategically and plan your Tactics by selecting eight elements (Lightning, Fire, Ice, Blade , Toxin, Light, Umbra, and Generic) and over 200 upgrades that synergize with your kit to create different “reactions,” such as Burn, Freeze, Blind, Paralysis Choose upgrades wisely and customize your very own combat style\nExperience the fusion of two classic side-scrolling gameplay styles: sandbox-level progression and Metroidvania-inspired adventures. Battle diverse enemies and face stage-specific bosses within the sandbox-style levels. Embark on a journey through a procedurally generated Metroidvania vast map, stepping into hidden forbidden zones and unraveling the story’s climax.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/blazblue-entropy-effect-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/blazblue-entropy-effect-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 950",
        "DirectX": "Version 10",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "91Act",
        "Platform": "PC",
        "Game Size": "8.6 GB",
        "Released By": "RUNE",
        "Version": "v1.0.3.105542 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/3xHz1w",
        "https://megadb.net/mqtk35uostwk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/blazblue-entropy-effect-preinstalled-steamrip.jpg"
}