{
    "page_url": "https://steamrip.com/bleak-sword-dx-free-download-1q/",
    "title": "Bleak Sword DX",
    "description": "Pure, thrilling , and wonderfully cruel, Bleak Sword DX is a dark fantasy action game challenging warriors to fight their way through compact, cursed diorama battlefields. Newly updated for PC, Bleak Sword DX expands on the critically acclaimed Apple Arcade version with elegant controls, three new game modes, and multiple gameplay and graphical improvements .\nThrough twelve tense and deeply atmospheric chapters, you must lift the curse of the legendary Bleak Sword by striking down all manner of horrifying creatures across an oppressive world wielding fierce weaponry and powerful magic. This striking experience is scored by award-winning composer Jim Guthrie, with sound provided by famed designer Joonas Turner. James Peris 2: The fountain of eternal drunkenness\nDX includes all original Bleak Sword chapters plus the three DLC chapters complete with new level and enemy layouts. A brand new Randomizer campaign modifier throws you into a remixed version of the original game where leveling up or facing bosses in order is not guaranteed. Jump into the brand new Boss Run gauntlet and face all 12 in-game bosses back to back with only one health bar. Make one wrong step and prepare to pay dearly!\nThe soul-crushing Arena mode throws you into a gladiator-style fight for survival. Fight increasingly difficult enemies and become a Bleak Sword legend. New attacks, parries, and counters complement a streamlined control system designed specifically for PC & console, while enhanced enemy AI makes them more unpredictable. New post-processing effects, adaptive depth of field, and a series of filters give Bleak Sword DX a fresh lick of paint, while particle effects, foliage , and weather enhancements bring a new level of atmosphere and immersion to the world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/bleak-sword-dx-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/bleak-sword-dx-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 x64",
        "Processor": "AMD Phenom 9500",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD 4770",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "more8bit",
        "Platform": "PC",
        "Game Size": "223 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11410124 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vkfiodhag1rc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/bleak-sword-dx-preinstalled-steamrip.jpg"
}