{
    "page_url": "https://steamrip.com/blockbuster-inc-free-download/",
    "title": "Blockbuster Inc.",
    "description": "Welcome to Blockbuster Inc., the next-generation simulation game where you take the reins of your movie studio and pave your way to the cinematic hall of fame. Create groundbreaking films, nurture the next generation of acting talents, and usher in a new era in the movie industry. Splodey\nCreate your own sets, design your movies, choose actors, and pick their costumes, decide on camera movement and the behaviour of the actors, and that is not the end After shooting the movie you can decide upon the sound design, layout of scenes and sfx\nBuild it, decorate it, manage it! In Blockbuster Inc you choose how your studio looks, from wallpapers to the size of the rooms. You can choose working hours, buy shares from other studios, take loans, decide on the marketing and so much more. There is no end to good management\nTalent scouting is an art, and you are the artist. Unearth hidden gems among aspiring actors and turn them into the industry’s brightest stars. But remember, each star comes with unique traits and demands. Handling the temperaments of divas and smooth operators alike will test your managerial sharpness .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/blockbuster-inc-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/blockbuster-inc-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7+",
        "Processor": "3 GHz Dual Core",
        "Memory": "6 GB RAM",
        "Graphics": "GTX 660 / R7 370 – 3 GB Video Memory",
        "Network": "Broadband Internet connection",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "Super Sly Fox",
        "Platform": "PC",
        "Game Size": "4.5 GB",
        "Released By": "RUNE",
        "Version": "v1.9.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/i3pkm3398t9i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/blockbuster-inc-preinstalled-steamrip.jpg"
}