{
    "page_url": "https://steamrip.com/blood-trail-free-download-h1/",
    "title": "Blood Trail",
    "description": "This is the game you have been waiting your whole sick life for. Experience what has been called “the most realistic gore system ever” in Raid, Sandbox and Arcade combat modes. Take on the role of a heartless killer for hire and see why Blood Trail has come to be known as “the most violent game in VR”. You are Wendigo. A hard-hearted contract killer motivated only by a paycheck. With a trusted arsenal at the ready, you are tasked with annihilating a fanatical cult. Built from the ground up for VR using proprietary character physics and gore systems, Blood Trail offers an unprecedented shooting experience not for the faint of heart.\nWith realistic gun mechanics and damage effects, you will have no margin for error as you use your pistol, shotgun, rifle and fists to become the last man standing in this nightmarish and brutal scenario. Did we mention that this game features the world’s first virtual pipe? Early Access to Blood Trail gives you several ways to satisfy your unhealthy, violent urges: Raid battle across 9 huge handcrafted trails that end in semi-dynamic outposts full of people to murder. Survival Mode stack the bodies high in 5 unique arena style maps where you will face an onslaught of enemies in a fast-paced shootout. Sandbox The infamous, original “empty room” sandbox map, plus TWO NEW SANDBOX MAPS, now with both armed combatants and mannequins. Platypus Adventures",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/blood-trail-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/blood-trail-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 3.6 GHz or higher",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GTX 970 or higher",
        "DirectX": "Version 11",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Action, Early Access",
        "Developer": "Electrovore",
        "Platform": "PC",
        "Game Size": "6.86 GB",
        "Released By": "cs.rin.ru (Kirigiri)",
        "Version": "Build 15284838 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/jtielY",
        "https://buzzheavier.com/flysay7hmhfg",
        "https://1fichier.com/?s9p5nckyj6xbmgbacmk0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/blood-trail-preinstalled-steamrip.jpg"
}