{
    "page_url": "https://steamrip.com/blud-free-download/",
    "title": "#BLUD",
    "description": "Save your friends, fight off the vampire apocalypse , and survive the horrors of freshman field hockey practice in #BLUD, a delightfully zany animated dungeon crawler that blurs the line between action RPGs and hyperkinetic 90s cartoons. Slaying the undead is just another day at high school for Becky Brewster, new kid in town and latest in an ancient bloodline of spellcasting vampire hunters. Baladins\nRoot out demonic infestations through the town’s buzzing social media, and take selfies with demonic forces to analyze their weaknesses. Power up your trusty fiend-thwacking field hockey stick, and level up your latent magic skills through grimoires and school supplies.\nMaster the slaying game with the help of an eclectic cast of hilarious characters, and teach the vampires a thing or two about messing with Carpentersville High. Take on a delightfully macabre menagerie of outrageously mutated animals and vampirically possessed townsfolk. Engage in epic, energetic boss battles as you defend your hometown .\nHunt the forces of evil in high school halls, convenience store aisles, and shopping malls. Discover and accept missions from the town’s social media, and track down evil (and other after-school plans) with modern tech.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/blud-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/blud-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-540 or AMD Phenom II X3 720",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GT 520, 1 GB or AMD Radeon HD 6570, 1 GB or Intel Arc A380",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Exit 73 Studios",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "SKIDROW",
        "Version": "Build 14621607 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3xq7zgb43fy2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/blud-preinstalled-steamrip.jpg"
}