{
    "page_url": "https://steamrip.com/blue-prince-free-download/",
    "title": "Blue Prince",
    "description": "Welcome to Mt. Holly, the mysterious manor with shifting rooms. In Blue Prince, you embark on a genre-defying experience, filled with a unique mix of mystery , strategy, and puzzles that weave together to create an unpredictable journey. Will your explorative steps lead you to the rumored Room 46?\nUpon reaching a closed door in Mt. Holly, you decide what room appears behind it and each decision shapes your path as you navigate through the manor. Every door can reveal new and exciting chambers that contain their own unique challenges and secrets. But be careful how you draft , for each day the manor’s floor plan resets and the rooms you saw today may not be the same rooms you see tomorrow. Voidborn\nYour progress each day is shaped by the rooms you select to draft and the tools you find within them. Items in the game can be used in a number of creative ways to fuel your exploration deeper into the house, allowing you to adopt unique strategies to combat the challenges that each day brings. Yet, tread wisely – the house resets each dawn, erasing all but the permanent upgrades to your estate blueprint . That is, if you were clever enough to find one!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/blue-prince-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/blue-prince-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11, 64-bits",
        "Processor": "i5-2300/Ryzen 3 1200",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060/AMD RX580",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Strategy",
        "Developer": "Dogubomb",
        "Platform": "PC",
        "Game Size": "3.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.05 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/imgvo21nczv3",
        "https://buzzheavier.com/2tgnxj58nt2s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/blue-prince-preinstalled-steamrip.jpg"
}