{
    "page_url": "https://steamrip.com/blue-reflection-second-light-free-download-1s/",
    "title": "BLUE REFLECTION: Second Light Free Download",
    "description": "BLUE REFLECTION: Second Light v1.02 Download PC Game In Direct Link for free on SteamRIP\nWith gorgeous translucent designs by Mel Kishida, as well as a story that depicts the youth of lifelike girls, based on a theme of human identity and bonding, a new title in the BLUE REFLECTION series is here Under a piercing blue sky, surrounded by crystal clear water, the sun scorched Ao Hoshizaki’s skin. Gazing at the summer scenery, it seemed as if the girl was left behind in a world that she had wandered into. At a school adrift in the distance, there lived three girls who had lost their memories .\nAo, shrouded in confusion, begins to lead a strange communal life with the girls as they seek clues about a way to return to their original world One day, in this world where the school was surrounded by nothing but water, a path that led to new scenery suddenly appeared. At the end of the path was a mysterious location, where familiar things existed inexplicably. In order to grasp the situation, the girls decided to venture forward, but as soon as they took their first steps, they encountered a monster they had never seen before. But just when they thought things had become hopeless, the girls obtain a mysterious power In a world that seemed to be trapped in summer, young girls have lost their memories. If the girls solve the mystery , what will they obtain?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/blue-reflection-second-light-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/blue-reflection-second-light-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1, Windows 10, 64bit",
        "Processor": "Intel Core i5 4460 or over, AMD Ryzen 3 1200 or over",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 or over, AMD Radeon RX560 or over",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "18 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "9.49 GB",
        "Repack By": "CODEX",
        "Version": "v1.02 | Updated  + 9 DLCS",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d0r2xa980wmy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/blue-reflection-second-light-free-download-preinstalled-steamrip.jpg"
}