{
    "page_url": "https://steamrip.com/blue-fire-free-download-s1/",
    "title": "Blue Fire Directly Download",
    "description": "Journey through the desolated kingdom of Penumbra and discover the hidden secrets of this long-forgotten land. Explore mystical temples, where you’ll need to master the art of movement to survive increasingly difficult 3D platforming challenges. During your adventure you’ll slash your way through daunting adversaries, encounter survivors and take on strange quests to collect valuable items. Hot Dogs\nLeap through deadly traps and master movement to navigate gradually demanding platforming challenges. Far from Penumbra, there is a lost land called The Void . Find Void entrances throughout the world to uncover abstract platforming challenges that require great mastery to gather the valuable rewards hidden inside.\nEncounter dangerous enemies with distinct fighting styles and partake in intense combat-platforming boss fights. Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles and more. A long time has passed since Penumbra fell into darkness, but those that survived the kingdom’s fall will aid your journey to unlock valuable rewards.\nOnce a rich and lush kingdom, Penumbra is filled with many collectibles and items to discover, loot, collect, sell, trade and purchase. No great warrior can battle the dangers lurking in Penumbra without the proper equipment. Upgrade your swords, collect valuable amulets and unlock new abilities to transform into a fierce fighter.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/blue-fire-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/blue-fire-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Requires a 64-bit, Dual Core 3.0GHz processor",
        "Memory": "8 GB RAM",
        "Graphics": "DirectX 11 or DirectX 12 compatible graphics card",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Robi Studios",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "ALI213 emu",
        "Version": "v6.3.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/l8w1lyse8bp2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/blue-fire-preinstalled-steamrip.jpg"
}