{
    "page_url": "https://steamrip.com/blue-oak-bridge-free-download-1w/",
    "title": "Blue Oak Bridge Free Download",
    "description": "Washed up on a strange shore, this is your chance to make a fresh start on a cosy farm. The charming villagers of Eloria welcome you into their peaceful lives, but you soon find there’s trouble brewing .\nNow your friends need your help. A powerful magic infects the rivers and forests, monsters overrun the old mines, and the once-bustling Blue Oak Library lies in ruins. Who owns the library? You find yourself tangled in a tale of forbidden magic, ancient secrets, and a quest to unite Eloria when Queen Isa and the intrepid entrepreneur Alonzo clash over this very question. GYLT\nGrow crops, tend to livestock , own a cafe and forage and fish across the island. Everything you make on your farm and discover on the island can be sold, brewed in potions, gifted to friends, donated to the library, or used to upgrade your weapons and tools. Don’t forget to include fantasy animals and fantasy crops into the mix to make your life at Eloria a bit easier!!\nUse your profits to customise your character, expand your farm, and care for your livestock and pets. There are over 30 characters, each with unique stories, and 15 romanceables to date, fall in love with and marry.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/blue-oak-bridge-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/blue-oak-bridge-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+ / 8.1 / 10 64 bit",
        "Processor": "Intel i5",
        "Memory": "6 GB RAM",
        "Graphics": "ATI 7770, Nvidia GeForce GTX 660 2GB",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "Lemon Seed Studio",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "ALI213",
        "Version": "v1.0.16 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/449yaz1rwm1e"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/blue-oak-bridge-preinstalled-steamrip.jpg"
}