{
    "page_url": "https://steamrip.com/bodycam-free-download/",
    "title": "Bodycam",
    "description": "BODYCAM is an ultra-realistic multiplayer first-person shooter game built using the latest technologies from the next-generation Unreal Engine 5 game engine. Developed by two French video game enthusiasts aged 17 and 20, the game was designed to push the boundaries of realism and photorealism : a truly revolutionary experience for the genre. Cricket Captain 2024\nWith the capabilities and technologies available through Unreal Engine 5, players will experience a next-generation gaming experience that showcases the future of realistic video games – stunning graphics, immersive sound effects, as well as a revolutionary shooting and movement experience.\nPrepare to dive into intense combat phases with your teammates, plan strategies to triumph over your opponents using your equipment. Ultra-detailed environments allow for total immersion and in-depth tactics. Enjoy classic game modes like Deathmatch or Team Deathmatch, and also a brand new Body Bomb mode designed for competition. Cooperation and communication with your teammates will be essential to win",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/body-cam-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/body-cam-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "AMD Ryzen 7 3700X, Intel Core i7-9700K",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 5700 (8 GB), NVIDIA GeForce RTX 2070 (8 GB)",
        "Network": "Broadband Internet connection",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Massively Multiplayer, Simulation, Strategy, Early Access",
        "Developer": "Reissad Studio",
        "Platform": "PC",
        "Game Size": "45.2 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "Build 16723847 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/hct68rz95jfd/Bodycam-SteamRIP.com.rar",
        "https://buzzheavier.com/c229t3btdmen"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/body-cam-preinstalled-steamrip.jpg"
}