{
    "page_url": "https://steamrip.com/boneraiser-minions-free-download-h1/",
    "title": "Boneraiser Minions",
    "description": "In a time long ago, those with forbidden power over the dead were branded as wretched Boneraisers. Such heathen were hunted, hanged, burnt, and staked, and their remains sealed within sanctified mausoleums. But what those fearfully foolish folk did not realise, is that those whom are already dead, cannot be killed. You are one such filthy Boneraiser!  As a reviled Boneraiser you must amass an army of skellies and deamons to fight the endless waves of heroes intent to end your necromantic ways\nIn this gothic-horror auto-battler roguelite, use the bones and souls of slain heroes to raise and upgrade undead minions, and collect powerful relics and spells to turn the tide of war. Unlock meta upgrades to improve your boneraising abilities, but crucially you must also bolster the Godly heroes’ forces too in order to gather enough resources to defeat your nemesis King Gigald’s crusade Boneraising auto-battler action:\nDash around avoiding enemies and collecting their bones to raise and upgrade minions who fight for you! Each minion type has their own fighting styles, from melee pulverisers, to bomb lobbers and magical missilers. Multiple game modes: There’s several game modes to keep play fresh. From the Mausoleum Awakening where you must protect your crypt against King Gigald and his forces, making best use of traps and contraptions you place before the show. Super Bullet Break\nThere’s the Endless Skirmishes where the aim is to simply see how long you can last against an ever growing horde of meanies. The Daily/Weekly Challenge were you compete against the world on an equal footing. And then there’s Clashful Cards, a collectable adversarial card game, a bit of respite from the endless boneraising",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/boneraiser-minions-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/boneraiser-minions-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 10",
        "Processor": "1.4 GHz",
        "Memory": "512 MB RAM",
        "Graphics": "512 MB RAM",
        "DirectX": "Version 11",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, RPG, Early Access",
        "Developer": "Sluggerfly",
        "Platform": "PC",
        "Game Size": "328 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v36.11 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4aq6ysp152vi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/boneraiser-minions-preinstalled-steamrip.jpg"
}