{
    "page_url": "https://steamrip.com/borderlands-goty-free-download/",
    "title": "Borderlands GOTY",
    "description": "Lock, Load, & Face the Madness Get ready for the mind blowing insanity! Play as one of four trigger-happy mercenaries and take out everything that stands in your way! With its addictive action, frantic first-person shooter combat, massive arsenal of weaponry, RPG elements and four-player co-op*, Borderlands is a breakthrough experience that challenges all the conventions of modern shooters. Borderlands places you in the role of a mercenary on the lawless and desolate planet of Pandora, hell-bent on finding a legendary stockpile of powerful alien technology known as The Vault.\nTHE ZOMBIE ISLAND OF DOCTOR NED: Enter the corporate owned small town known as Jakobs Cove and put an end to the rumors of the walking “undead.” New areas, new missions, new enemies, Oh My!\nMAD MOXXI’S UNDERDOME RIOT: Celebrate the grand opening of Marcus Bank by taking on hundreds of foes in the only competitive arena around where you’re coming back famous… or not at all.\nTHE SECRET ARMORY OF GENERAL KNOXX: Want more of the Borderlands story and more loot than you could possibly figure out what to do with? Add new guns, missions, vehicles and more!\nCLAPTRAP’S NEW ROBOT REVOLUTION: This destructive adventure invites you to battle a vicious new threat, a massive uprising of your former friends: the claptraps.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/8980/ss_fd826cb3a79f809b63eef0ed139e89ca23b76899.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/8980/ss_23e0027b48e8f7c8138890f66cb3dbf0d89ec8c5.jpg",
        "https://gofile.io/d/gnQUF4",
        "https://buzzheavier.com/46suuon1fbis"
    ],
    "system_requirements": {},
    "game_info": {
        "Platform": "PC",
        "Game Size": "12.1 GB",
        "Released By": "Goldberg + lanternjoe CSF, cs.rin.ru",
        "Version": "Build 356062",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/gnQUF4",
        "https://buzzheavier.com/46suuon1fbis"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/borderlands_goty_featured_final.jpg"
}