{
    "page_url": "https://steamrip.com/borderlands-goty-enhanced-free-download/",
    "title": "Borderlands GOTY Enhanced",
    "description": "Discover the co-op shooter-looter that started it all, crammed with content and enhancements! Equip bazillions of guns as one of four trigger-happy mercenaries, each with unique RPG skills. Take on the lawless desolate planet Pandora in pursuit of powerful alien technology: The Vault. With new weapons, visual upgrades, all 4 add-on packs and more, enjoy the highly acclaimed FPS/RPG solo or together with friends!\nVISUALLY STUNNING: With improved character models, environments, weapons, and textures, Borderlands paired with a 4K display never looked so good.\nNEW WEAPONS: There are already too many to count so we added more.\nNEW CHARACTER HEADS: Be as beautiful as mom says you are.\nNEW GOLD CHESTS AND KEYS: More loot!\nAND MORE!\nTHE ZOMBIE ISLAND OF DOCTOR NED: Enter the corporate owned small town known as Jakobs Cove and put an end to the rumors of the walking “undead.” New areas, new missions, new enemies, Oh My!\nMAD MOXXI’S UNDERDOME RIOT: Celebrate the grand opening of Marcus Bank by taking on hundreds of foes in the only competitive arena around where you’re coming back famous… or not at all.\nTHE SECRET ARMORY OF GENERAL KNOXX: Want more of the Borderlands story and more loot than you could possibly figure out what to do with? Add new guns, missions, vehicles and more!\nCLAPTRAP’S NEW ROBOT REVOLUTION: This destructive adventure invites you to battle a vicious new threat, a massive uprising of your former friends: the claptraps. SCREENSHOTS SYSTEM REQUIREMENTS OS *: Windows 7 64-Bit Processor: Intel Core i3 530 @2.93GHz/AMD Phenom 9950 @2.6GHz Memory: 4 GB RAM Graphics: Geforce GTX 660, Radeon HD 6970 DirectX: Version 11 Storage: 25 GB available space Sound Card: Directx 9.0c GAME INFO Genre: Action, RPG Developer: Gearbox Software, Blind Squirrel Games Platform: PC Game Size: 18.7 GB Released By: Goldberg + lanternjoe CSF, cs.rin.ru Version : Build 9171464 Pre-Installed Game GOFILE DOWNLOAD HERE Buzzheavier DOWNLOAD HERE",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/729040/ss_ef109a2667cf7d690426e657ad3cc1990205aeea.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/729040/ss_8de560caa17336bf6c2f5044b0e8aab2c0af6eff.jpg",
        "https://gofile.io/d/5RIIrO",
        "https://buzzheavier.com/l97jbu1ou7sb"
    ],
    "system_requirements": {
        "OS *": "Windows 7 64-Bit",
        "Processor": "Intel Core i3 530 @2.93GHz/AMD Phenom 9950 @2.6GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Geforce GTX 660, Radeon HD 6970",
        "DirectX": "Version 11",
        "Storage": "25 GB available space",
        "Sound Card": "Directx 9.0c"
    },
    "game_info": {
        "Platform": "PC",
        "Game Size": "18.7 GB",
        "Released By": "Goldberg + lanternjoe CSF, cs.rin.ru",
        "Version": "Build 9171464",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/5RIIrO",
        "https://buzzheavier.com/l97jbu1ou7sb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/borderlands_goty_enhanced_featured_final.jpg"
}