{
    "page_url": "https://steamrip.com/born-punk-free-download-l1/",
    "title": "Born Punk",
    "description": "A former combat hacker , a corporate CEO and a malfunctioning android get possessed by mysterious, otherworldly entities and must band together to save themselves and uncover the entities’ origins. Talk, puzzle and explore your way through this (often humorous) cyberpunk thriller. Bornholm. Today, a quaint island in the Baltic Sea. In 2155, a sprawling metropolis able to compete with major world powers. Thanks to the Space Elevator, a technological marvel built by Bornholm’s corporate consortium,\nThe Conglomerate , few nations on the planet are more influential both in industrial matters and space exploration. In Born Punk, the player slips into the role of three people (well, two people, depending on your stance on artificial lifeforms) living on the island: Eevi, a corporate combat hacker turned bartender down on her luck; Mariposa, the CEO of Bornholm’s biggest corporation; and a malfunctioning android who calls himself Grandmaster Flashdrive. OneShot\nThe three characters have one thing in common: they all, one after another, get possessed by strange entities of unknown origin and even less known intentions . They must work together and sometimes against each other – to find out of the nature of those beings, what they want, and why they seem to think that their ‘mission’ is of vital importance for the future of humanity .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/born-punk-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/born-punk-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP or higher",
        "Processor": "Intel/AMD Dual Core @ 1.8Ghz+",
        "Memory": "1 GB RAM",
        "Graphics": "OpenGL compatible graphics card",
        "Storage": "2400 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Insert Disk 22",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "DARKSiDERS",
        "Version": "Build 8965389 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2xovah63r1c8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/born-punk-preinstalled-steamrip.jpg"
}