{
    "page_url": "https://steamrip.com/born-of-bread-free-download-b1/",
    "title": "Born of Bread",
    "description": "Beings from another age are causing havoc across the land And with their mischief comes a great threat to everyone. The unlikeliest hero, a golem born of bread , will find himself and his newfound buddies in the middle of a drama that’s thousands of years in the making. Together, they will visit incredible locals and meet fascinating characters. Although he may not look like much, Loaf might be the hero this land kneads. Play as a flour golem who possesses a never-ending childlike wonder and a set of odd abilities in this 2.5D adventure game\nExplore the different regions of a wonderful world ripe with mysteries and team up with a colorful cast of fleshed-out characters. With the help of your buddies, face off against menacing and weird baddies and engage in a fun and quirky turn-based combat system. Born of Bread puts a twist on turn-based combat tropes with a fun interaction system that will test your reflexes. This interactive system also features a weaknesss and resistance system that makes battles more strategic. UNDYING",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/born-of-bread-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/born-of-bread-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-2600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 770",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG",
        "Developer": "WildArts Studio Inc.",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "GOG",
        "Version": "v3.2.4d | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/oyyjel78r2ve"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/born-of-bread-preinstalled-steamrip.jpg"
}