{
    "page_url": "https://steamrip.com/bosorka-free-download-k1/",
    "title": "Bosorka",
    "description": "The young witch Horpyna, with the help of the ancient Grimoire , has summoned a familiar, but owing to the lack of experience, she isn’t able to cope with the magic book and the spell has remained incomplete. After the unsuccessful use, the irrepressible book returns to its author from the other world, uncontrollably summoning horrifying monsters.\nThe only salvation is to stop the book and prevent evil forces from taking over the world. Bosorka is an exciting action game that combines the best elements of the roguelike and shoot ’em up genres with incredibly stylized top-down 3D visualization. Immerse yourself in this dark fantasy world and show the demons who’s the power to be reckoned with. MEATGRINDER\nSeveral huge levels are generated from manually created parts. Each level is an independent biome with its own unique atmosphere, mysteries and dangerous . Secret rooms, hidden passages, breathtaking landscapes, and lots of valuable things that can be encountered in unexpected places provide a real incentive to explore the environment. At the end of each level, you will meet powerful monsters that guard the passages to the next locations, preventing you from following the book.\nEach monster has an exceptional set of uncanny abilities and is capable of incinerating you in an instant, so one should be well prepared for this encounter. In the midst of a circle of evil demons, there may be renegades who have not been affected by evil spells and have no bad intentions. Lovely creatures, surprisingly loyal to those who save them. Raise an entire army of companions who will help you in the fight against the enemy. Some of them have marvelous abilities that will definitely come in handy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/bosorka-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/bosorka-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-6100 or AMD FX-8350",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 580 or AMD HD 7870",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Sengi Games",
        "Platform": "PC",
        "Game Size": "273 MB",
        "Released By": "ALI213",
        "Version": "v1.0.32e | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3w3d5p9a74sv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/bosorka-preinstalled-steamrip.jpg"
}