{
    "page_url": "https://steamrip.com/botany-manor-free-download/",
    "title": "Botany Manor",
    "description": "Botany Manor is a first-person puzzle game set in a Victorian English manor. It’s 1890, and you play as botanist Arabella Greene, who is working to finish her botanical research book ‘ Forgotten Flora’.\nExplore a complete historical English manor and its grounds, researching how to grow rare plant specimens from seed. There are many rooms and gardens to discover, all set inside a beautiful countryside surrounding.\nThe manor is filled with mysterious clues for you to discover, including books, posters, letters and fascinating Victorian contraptions. The plants you grow are fantastical, but still inspired by real phenomena in nature, so some of them require you to think outside the box. Using what’s available to you in the manor, you must create the ideal conditions for each plant. Inkbound\nRoom by room, you learn more about the life and career of Arabella , and the challenges she faced as a woman navigating her scientific career. Botany Manor offers a relaxing and peaceful environment, feel free to stop and smell the roses.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/botany-manor-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/botany-manor-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 2500 or AMD FX 6350",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD  4600 or Radeon RX Vega 8",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Balloon Studios",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "RAZOR1911",
        "Version": "v1.1.73.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n9tlw9jds3pd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/botany-manor-preinstalled-steamrip.jpg"
}