{
    "page_url": "https://steamrip.com/braid-anniversary-edition-free-download/",
    "title": "Braid, Anniversary Edition",
    "description": "Control the flow of time to solve subtle platform puzzles in this update of the indie classic “Braid,” featuring refreshed artwork and seriously in-depth creator commentary. Travel from a city house through a series of interconnected worlds where time behaves strangely, searching for an elusive Princess . Along the way you’ll explore memories and regrets that still haunt you. This Anniversary Edition remaster of the award-winning platformer contains fully repainted high-resolution graphics, new sound effects and extensive audio commentary.\nMANIPULATE TIME TO MOVE FORWARD Rewind, pause and use the strange properties of time in each world to run and jump through beautifully painted environments. Avoid hazards, unlock doors and collect jigsaw puzzle pieces to assemble. If you get hung up on a particular puzzle, feel free to move on and return later. Chill Pulse\nA FRESH COAT OF PAINT This is the game you remember, with all the original challenges and the same haunting, evocative score — but repainted pixel by pixel so that each carefully rendered world comes to life in high resolution. New visual details, animated brushstroke effects and revamped sounds add to the immersive experience.\nGO (DEEP) BEHIND THE SCENES Explore the most extensive developer commentary ever put into a game, with over 15 hours of recorded insight and conversation from developer Jonathan Blow, artist David Hellman and more members of the “ Braid ” creative team. Navigate it by visiting a new in-game world, which also contains new puzzles and redesigns of classic puzzles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/braid-anniversary-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/braid-anniversary-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i3-7100 / Ryzen 3 2200G",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 660 / AMD Radeon HD 7870",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Thekla, Inc.",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "RUNE",
        "Version": "v0.444 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v8164ji2mg0h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/braid-anniversary-edition-preinstalled-steamrip.jpg"
}