{
    "page_url": "https://steamrip.com/bravery-and-greed-free-download-m1/",
    "title": "Bravery and Greed",
    "description": "Whether you’re playing as the mighty Amazon , the valiant Warrior, agile Rogue or spell-weaving Wizard, each class possesses a breadth of fantastic and powerful combo move sets. Parry, dodge, juggle, zone and unleash destructive special moves to take the upper hand against ever mightier foes, bosses and even your friends. Explore a variety of thrilling environments in Adventure Mode as you tackle biomes and bosses in your search for runes to the Sky Fortress. Goat Simulator 3\nTeam up with friends and battle against wave after wave of enemies in the challenge Survival Mode or settle the grudge with arena-based team and solo PvP. Along with class choice, you will have to make on-the-fly decisions that alter your character skillset. Skill trees focusing on the aspects of Chaos , Order, Darkness and Life will grant you skill augmentations and special abilities, whilst a myriad of equipment drops ensure that every run feels unique with plenty of options.\nIn Bravery and Greed, you can permanently unlock awesome content and game-altering augmentations by levelling up with gold. Greedily grab coins and plunder chests, steal pockets of gold when reviving allies, or be the first to run and grab loot after an epic encounter, get rich or die trying",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/bravery-and-greed-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/bravery-and-greed-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-650 or AMD Phenom II X4 965",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce 8800 GT, 512 MB or AMD Radeon HD 6570, 1 GB",
        "Storage": "550 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Rekka Games",
        "Platform": "PC",
        "Game Size": "381 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.03a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rikrcqgdpyd6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/bravery-and-greed-preinstalled-steamrip.jpg"
}