{
    "page_url": "https://steamrip.com/bread-fred-free-download-1q/",
    "title": "Bread & Fred",
    "description": "Bread & Fred is a challenging co-op platformer from Apogee where two players must cooperate to jump and climb to the top of a snowy mountain. Play as both Bread and Fred in their exasperating and sometimes maddening climb that requires precision with every jump. Each time you land you’ll be closer to the peak and one step closer to mastering the platforming, but your fall down the mountain will be even farther. Bread and Fred are attached to each other. That means you don’t only fall together, but you can make good use of momentum to swing and propel each other beyond what any single penguin could have ever jumped.\nMake sure one of you anchors down to the ground or you’ll both fall The penguins’ little hands aren’t very good, but you can hang on a wall with your partner for a few seconds to swing them around and overcome the next obstacle. Be careful though. These penguins are chubby so you can’t hold on long. Act fast Can’t find your penguin buddy? Strap your rope to Jeff (a rock!) and use it instead! The climb will all be up to you and your skill, but that also means you have no one to blame when you fall. Each fall will hurt, but try to learn and laugh through it. Think carefully about each jump and master the penguin skills to reach the summit. For the craziest climbers, Bread & Fred includes a speedrun mode so you can compete and be crowned the best penguins on the planet. Return of the Obra Dinn",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/bread-fred-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/bread-fred-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Dual Core 2.4 GhZ",
        "Memory": "2 GB RAM",
        "Storage": "1500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "SandCastles Studio",
        "Platform": "PC",
        "Game Size": "278 MB",
        "Co-op By": "0xdeadc0de",
        "Version": "Build 13062832 | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9j82d768wgup"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/bread-fred-preinstalled-steamrip.jpg"
}