{
    "page_url": "https://steamrip.com/breach-wanderers-free-download-l1/",
    "title": "Breach Wanderers Directly Download",
    "description": "Embark on a thrilling adventure with this fresh take on Roguelike Deckbuilding. Battle against monstrous creatures emerging from the Breach using and evolving strategy based on magical cards, powers, and heroes. Rest at your town, upgrade your gear, get new missions, and strategize wisely to face your fate.\nExperience a unique and strategic deckbuilding system: before each run, customize your starting deck and the pool of cards that will be offered to you during the run. Additionally, every enemy may drop other exclusive card rewards that you can take into account for your strategy . With over 1200 cards to choose from, experiment with different synergies to obliterate your opponents and reach the depths of the Breach. Pile Up!\nWith 10 unique heroes to choose from, each with unique strengths and weaknesses, you can tailor your strategy to suit your playstyle. Freeze your enemies with Raodan to gain control over the battlefield, or hide and strike from the shadows with Mirley to deal devastating damage. With complete control over your characters and cards, victory is within your grasp .\nAs you venture deeper into the Breach , collect valuable resources to unlock new cards, purchase powerful items, and upgrade your town. Visit the Forge to equip your heroes with devastating upgrades and browse the Market for new exotic wares. Take on different missions to earn rewards and face even greater trials as you progress through the story. With each upgrade, you’ll be better equipped for the battles ahead and one step closer to uncovering the secrets of the Aether .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/potionomics-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/potionomics-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Baronnerie Games",
        "Platform": "PC",
        "Game Size": "381 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0001 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/z46hj9c1d335"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/breach-wanderers-preinstalled-steamrip.jpg"
}