{
    "page_url": "https://steamrip.com/broken-universe-tower-defense-free-download-w1/",
    "title": "Broken Universe – TD",
    "description": "Create your own unique strategies in this tower defense with a twist. Play any way you want and any way you can think of. You even decide how each game starts by choosing where to land Try lots of different strategies, from blocking all paths and hiding safely behind your walls, to guiding monsters down a long line of fire. Use the unique towers and barriers to come up with your own original style of play. Try blasting monsters so hard they can’t approach, mixing monsters up until they can’t function properly, or focusing on defense and recovery to build an impenetrable fortress. Survival Nation VR\nYou can even try backing a bunch of monsters into a corner and wiping them all out at once, or lining them up and taking them out one-by-one. Travel around space helping the hero search for his lost girlfriend while battling monsters on various planets. Not only does each stage look different, but you also have to pay close attention to the items and environmental factors of each planet in order to craft your winning strategy. If you do it right, it’ll be a huge help to your strategic gameplay.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/broken-universe-tower-defense-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/broken-universe-tower-defense-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 and above 64bit",
        "Processor": "Dual Core CPU 2Ghz or faster processor",
        "Memory": "4 GB RAM",
        "Graphics": "OpenGL 3.0 compliant with 512MB of video RAM.",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Strategy",
        "Developer": "Jinthree Studio",
        "Platform": "PC",
        "Game Size": "343 MB",
        "Released By": "ALI213",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/59w5hxd33cwx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/broken-universe-tower-defense-preinstalled-steamrip.jpg"
}