{
    "page_url": "https://steamrip.com/broken-arrow-free-download/",
    "title": "Broken Arrow",
    "description": "Broken Arrow is a large-scale real-time modern warfare tactics game that combines the complexity of joint-forces wargaming with action-packed real-time tactics gameplay.\nFeaturing over 300 realistic military units and technologies , each battle offers an immersive experience with endless replayability.\nExperience a gripping narrative-driven campaign featuring 19 handcrafted missions set in the Baltic region, played from both the United States and Russian perspectives.\nThe campaign features a thrilling plot of escalating global tensions, where each mission presents new tactical challenges and story developments. Whether defending key positions with elite units or launching bold combined arms offensives, every mission is designed to test your command skills in dynamic , realistic warfare scenarios.\nOn top of the single-player campaign , engage against AI in the Skirmish mode on 19 maps based on real life locations, choosing your favourite specializations and difficulty levels. Team up with your friends and learn the game at your own pace against various AI presets that represent Battlegroups you will face on the battlefield. At release, Skirmish doesn’t currently allow playing co-operatively with AI as team allies, but it is planned for a future update.\nBut if you’d rather face human opponents, hop online and engage in thrilling Multiplayer matches up to 5vs5. Track your progress as you rise through the leaderboard and you gain experience as a general while you level up and gain new medals.\nUnleash your creativity with the powerful Scenario Editor, the same tool used to craft the game’s missions. Design custom scenarios complete with cutscenes and dialogue using a visual scripting system—no coding required.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/broken-arrow-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/broken-arrow-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i7-6700 (4* 3400) / AMD Ryzen 3 2200G (4 * 3500)",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1650 (4096 MB) / Radeon RX 570 (4096 MB)",
        "Storage": "85 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Steel Balalaika",
        "Platform": "PC",
        "Game Size": "58 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/jZPdnD",
        "https://buzzheavier.com/6ozciuvtfubw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/broken-arrow-preinstalled-steamrip.jpg"
}