{
    "page_url": "https://steamrip.com/brothers-a-tale-of-two-sons-remake-free-download-b1/",
    "title": "Brothers A Tale of Two Sons Remake Download",
    "description": "Guide two brothers on an epic fairy tale filled with discovery, loss, adventure , and mystery. With their father suffering from a deadly illness, two brothers must bravely set out to find the “Water of Life,” the one cure that can save him. With no option for failure the brothers must rely on each other using their individual skills to protect one another and overcome the obstacles ahead in this unforgettable journey.\nA TIMELESS CLASSIC REMADE Hailed by critics when it was originally released, Brothers: A Tale of Two Sons is back! Faithful to the gameplay and touching story from 2013, Brothers: A Tale of Two Sons Remake features rebuilt characters and landscapes based on the original and has been updated to the latest generation of graphics, performance, and gameplay. Paired with a re-recorded soundtrack with a live orchestra, prepare for an emotional experience that will take your adventure to all new heights. Shashingo: Learn Japanese with Photography\nEMBARK ON A FANTASTICAL EPIC Solve puzzles, discover hidden stories, traverse dangerous locations, and fight deadly bosses. In single-player mode, navigate this story as both brothers in tandem or play in local co-op with a friend, each controlling one of the brothers as you play together.\nGET IMMERSED IN THE EMOTIONAL WORLD OF BROTHERS Brothers: A Tale of Two Sons is full of hidden details that reward those who seek them out. In addition to the original hidden treats and rich storyline, the remake has added new secrets to be discovered.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/brothers-a-tale-of-two-sons-remake-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/brothers-a-tale-of-two-sons-remake-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-6700 (4 * 3400), AMD Ryzen 5 1500X (4 * 3500)",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX1650 GPU with 8 GB Dedicated RAM",
        "DirectX": "Version 11",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "Avantgarden SRL",
        "Platform": "PC",
        "Game Size": "16.2 GB",
        "Released By": "FLT",
        "Version": "Build 13533308 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/4A7A9C50F7",
        "https://buzzheavier.com/sc8dk9g4ckq0",
        "https://megadb.net/zm8vppdtmdh3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/brothers-a-tale-of-two-sons-remake-preinstalled-steamrip.jpg"
}