{
    "page_url": "https://steamrip.com/brutalistick-vr-free-download/",
    "title": "BRUTALISTICK VR",
    "description": "Imagine the golden age of flash games . Now imagine playing them with a VR headset. BRUTALISTICK VR aims to make that happen with copious amounts of blood, gore, destruction and weapon variety. Realism does not define this game, the rule of cool does. However, that doesn’t mean that realism has no place here.\nWeapons have weight and must be wielded with the intent to kill if you don’t want to meet your demise. Firearms require precise aim to fit the bullet between enemy armor plates Or just buy a weapon with a caliber that will go through anyone and anything that dares stand in its way, the choice is yours.\nEverything is simulated physically, throwing your enemies through windows and off roofs , launching a stake through their torso and pinning them against the wall, slicing their body in half with a blade that’s more of a large hunk of iron than a sword, and even climbing and using grappling hooks. GEX Trilogy\nDismemberment is not limited to limbs or even joints, splitting someone’s head in half vertically is not a question of if but rather when. Each mission earns you a reward that can then be used to buy new weapons. Or you can upgrade your stats and skills, from simply increasing your health or rewards to lifesteal and the power of your punches.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/brutalistick-vr-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/brutalistick-vr-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Quad Core 3GHz",
        "Memory": "8 GB RAM",
        "Graphics": "4GB VRAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Early Access",
        "Developer": "Kubunautilus",
        "Platform": "PC",
        "Game Size": "944 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 18758203 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1mg97dwbsm67",
        "https://buzzheavier.com/n4g2p8rbaisp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/brutalistick-vr-preinstalled-steamrip.jpg"
}