{
    "page_url": "https://steamrip.com/brutal-orchestra-free-download-1r/",
    "title": "Brutal Orchestra",
    "description": "Hieronymus Bosch’s Brutal Orchestra is a Turn-Based Roguelike Strategy Game with resource management and deck-building elements. Employ the help of damaged and daring fools, equip ancient and insidious items and make deals with the devil on your path to revenge .\nYou died. Someone killed you. You are now in Purgatory and you will never escape. Make a deal with the “demon” Bosch and set off into this brutal and bastardous world, finding ​all manner of demented and degenerate friends and foes on your quest to get petty revenge. Project Hospital\nPurgatory bleeds pigment . It is a strange substance that Bosch has granted you the ability to control. Channeling pigment allows one to perform powerful and absurd abilities. Pigment comes in many colours, each derived from a different source, some even of your own flesh.\nThis may be a place of the dead but even here there are still poor fools eking out a pathetic existence. Some would make for valuable party members or at least entertaining conversation. Most, however, are dim wits or damaged beyond all reason.\nPurgatory is not a gentle place, it is a writhing dump of all that has died in many worlds. Endless deserts of pale sand are stalked by parasitic fish. Storm-cloaked mountain tops hide ungodly things above and below. The Garden waits for you at the end of time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/brutal-orchestra-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/brutal-orchestra-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel or AMD processor, 2.5 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG, Strategy",
        "Developer": "Talia bob Mair, Nicolás Delgado",
        "Platform": "PC",
        "Game Size": "416 MB",
        "Released By": "GOG",
        "Version": "v1.3.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jffjgfoildlb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/brutal-orchestra-preinstalled-steamrip.jpg"
}