{
    "page_url": "https://steamrip.com/bully-scholarship-edition-free-download-1g/",
    "title": "Bully Modded Free Download Direct Link",
    "description": "Bully: Scholarship Edition takes place at the fictional New England boarding school, Bullworth Academy, and tells the story of mischievous 15-year-old Jimmy Hopkins as he goes through the hilarity and awkwardness of adolescence . Beat the jocks at dodge ball, play pranks on the preppies, save the nerds, kiss the girl and ultimately navigate the social hierarchy in the worst school around. Includes the complete soundtrack, featuring 26 original tracks.\nBully Scholarship Edition is a very unusual action game with a third-person view in which you have to play the role of a difficult teenager, a troubled boy who got into the most severe school in the country So, as you probably already understood, you will have to play as a bully boy. After wandering around different schools . They do not like newcomers here, and teachers treat children like prisoners. In general, the conditions in this “new” school are very difficult. You will, controlling the boy, try to adapt to new conditions. Unfriendly teachers are waiting for you, ready to resort to severe punishments at the first opportunity, angry high school students, peer bullies, fights, entertainment and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/bully-scholarship-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/bully-scholarship-edition-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP / Windows Vista",
        "Processor": "Intel Pentium 4 (3+ GHZ) / AMD Athlon 3000+",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX 9.0c Shader 3.0 supported, Nvidia 6800 or 7300 or better, ATI Radeon X1300 or better",
        "DirectX": "Version:  9.0c",
        "Hard": "Drive:4.7 GB free space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Rockstar New England",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Repack By": "DODI REPACKS",
        "Version": "v1.2.0.0 | Full  + Widescreen-Fix + Remastered Mods + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/41UQkD",
        "https://megadb.net/n3r023b3seeo",
        "https://buzzheavier.com/em6bjyg8dxwz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/bully-scholarship-edition-free-download-preinstalled-steamrip.jpg"
}