{
    "page_url": "https://steamrip.com/bum-simulator-free-download-g1/",
    "title": "Bum Simulator Directly Download",
    "description": "Bum Simulator is a sandbox game bursting with inappropriate humor and memorable characters. Apart from day-to-day survival, you can enjoy many uniquely. You can throw pigeons at people and watch as the panic ensues. Not fun enough? Upgrade your birds with explosives and let chaos reign. Still not satisfied? Wait until you see the fully upgraded pigeonado skill. Gravewood High\nMix alcohol with stuff you found on the ground to create powerful mixtures. Drink them (if you dare) to get a boost, or throw them at your enemies for a devastating effect. Every bum needs a shopping cart of their own. Yours is named Carl and he’s your trusty mobile inventory. Also, he’s your best friend (no, really).\nYou’ll learn to love him – we promise Mutant sewer rat people from the ’80s? Mentally unstable clown with a hook for a hand? A bored rich man telling you to punch random people on the street? We have them all, and then some! You’ll meet them all while following the insane storyline (yes, this game has an actual story)\nDay-to-day survival can be exhausting, so why not take a break and get some shut-eye in a cozy shelter? Conquer, construct, and customize your cardboard bases to your heart’s content. However, remember to build some defenses as the rival bum gang raids are inevitable Crafting makes your life easier. Collect materials and process them to get upgrades and expansions to your base. Tired of searching for food? Construct pots and plant some vegetables. Need stronger pigeons? Better upgrade that coop.\nScavenging for scrap got boring? Recruit other bums to do the dirty work for you. With enough work, you can build a truly self-sustainable bum base Hear ye, hear ye! Every character in the game is fully voiced. Each line of dialogue oozes emotion and personality, which makes the game’s storyline and atmosphere even gross er more engrossing",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/bum-simulator-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/bum-simulator-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows (64-bit) 8 or Newer",
        "Processor": "Intel Core i5-2500 @ 3,3 GHz (4 CPUs)",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 960 4GB",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Ragged Games",
        "Platform": "PC",
        "Game Size": "5 GB",
        "Released By": "Codex emu",
        "Version": "v3.7.12a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4nbd7g395api",
        "https://pixeldrain.com/u/3CmYaVmY"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/bum-simulator-preinstalled-steamrip.jpg"
}