{
    "page_url": "https://steamrip.com/bum-revenge-free-download/",
    "title": "Bum: Revenge",
    "description": "You are the king of the neighborhood, but one day you come home and catch your wife cheating with Dennis – the local thug. You want to do something about it but he is too strong and knocks you out. You wake up in the hospital with divorce papers, and after 6 months spent on the street, you are addicted to alcohol and drugs, left with nothing. The Quintessential Quintuplets – Five Memories Spent With You\nGet into the gloomy and neglected atmosphere of an urban backyard.\nJump in with your crew into a world of total mayhem, where rules are just suggestions! Crazy actions, wild missions, and absurdity at every turn. Perfect for nights meant to get out of control.\nTo be able to function, you must maintain the right level of satisfaction of your addiction cravings. Apart from special sensations, intoxicants will help you maintain control over your character, otherwise, you will experience withdrawal symptoms…\nIn order to buy drugs and alcohol, you will have to collect bottles, beg, steal, cheat, and look for other ways to earn money.\nThe map is divided into special factions, each with different crews. You must defeat their boss to gain respect and take over their people. First-person homeless crime sandbox 4-player online co-op – invite friends anytime Dynamic drug hallucinations twist reality Territory wars, rival bosses & dirty weapons Steal, craft and survive the streets\nLife is short – get high, drink, have fun!",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3702930/39e3620aa64f1f4be1b944347836ac7333d2e62a/ss_39e3620aa64f1f4be1b944347836ac7333d2e62a.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3702930/a5d7056bb83248ecf0dd1db453d58631139dcf50/ss_a5d7056bb83248ecf0dd1db453d58631139dcf50.600x338.jpg",
        "https://buzzheavier.com/jvi8fwhaxfcj"
    ],
    "system_requirements": {
        "OS": "Windows 10 / 11 – 64 bit",
        "Processor": "Intel Core i5 6300 HQ | AMD Ryzen 3 1200",
        "Graphics": "NVIDIA GeForce GTX 950M 4GB | AMD RX 550 Mobile 4GB",
        "DirectX": "Version 11",
        "Storage": "15 GB available space",
        "Sound Card": "Any"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation, Early Access",
        "Developer": "Patologgia Interactive",
        "Platform": "PC",
        "Game Size": "7.0 GB",
        "Released By": "OFME",
        "Version": "Build 19472980 + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/jvi8fwhaxfcj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/Bum-Revenge_featured_final.jpg"
}