{
    "page_url": "https://steamrip.com/bus-world-free-download-o1/",
    "title": "Bus World",
    "description": "Bus World is a game about passenger transportation in various conditions, starting from the standard days of a bus driver and ending with rescuing people who have suffered from disasters. Enjoy amazing stories in various scenarios or experience the free mode where you can create your own routes and travel across the game maps the way you want The time and place of the action are very diverse\nEach map has its own atmosphere and scenarios. This game features the unique possibility to take a look at Pripyat, Chernobyl and the surroundings of the infamous Nuclear Power Plant just before the disaster and to dive into the atmosphere of Soviet communism. We have tried to make the Chernobyl Zone look as realistic as possible by using maps, photos and videos, so that houses, key locations and roads are in the same place as in reality. Heretic’s Fork\nYou are going to work as a standard bus driver before the explosion. Your goal is to deliver staff to the Power Plant, get tourists to their destination points, and so on. Also, you’ll have to deal with difficulties such as breakdowns. Everything changes when disaster strikes. You’ll see the destroyed 4th power unit, Red Forest and other famous places of Exclusion Zone. Help the clean-up personnel address the impact of the catastrophe, take part in the evacuation and do your best not to get a large dose of radiation. Welcome to sunny jungles and narrow roads on hair-pin bends! But don’t lose your focus because the weather might be cruel here. You are going to experience tsunami and floods, an earthquake with rockfall, and even a deadly tornado It’s really hard to drive as there are lots of sharp corners, cliffs and impassable roads.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/bus-world-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/bus-world-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® 7 or later 64-bit  required",
        "Processor": "1.9ghz Intel i5-equivalent processor or higher",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 460 or similar AMD Radeon (no support for onboard integrated GPUs)",
        "DirectX": "Version 11",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Racing, Simulation",
        "Developer": "KishMish Games",
        "Platform": "PC",
        "Game Size": "5.6 GB",
        "Released By": "GOG",
        "Version": "v2.3.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qkpgv9mvjukj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/bus-world-preinstalled-steamrip.jpg"
}