{
    "page_url": "https://steamrip.com/bus-driving-sim-22-free-download-n1/",
    "title": "Bus Driving Sim 22",
    "description": "Get behind the wheel and become a professional bus driver This amazing bus simulator will allow you to transport passengers across three different cities (Rio de Janeiro, Munich and Los Angeles) using various bus models with realistic physics and graphics. Play this bus simulator in single-player with career and freeride modes or immerse yourself with friends in the online multiplayer mode. The Evil Within\nBus Driving Sim 22 is the defining bus simulator for PC. Get it now Three different cities to drive through and transport passengers in as a professional bus driver: Rio de Janeiro (Brazil), Munich (Germany) and Los Angeles ( The United States of America ). Every city comes with both downtown and outside the city maps you can drive through.\nVisit various sites, landmarks and points of interest in the cities while experiencing different weather conditions and a full day/night cycle. AI-powered traffic featuring different types of vehicles, pedestrians, animals and diverse road network systems. Sophisticated next-generation physics engine that sets the new gold-standard for realism in bus simulation games. Feel the road bumps, see the suspensions working in real time, hear authentic sounds for vehicles and the environment and get as close as possible to a real bus driving experience.\nThis bus simulator allows you to choose from 3 distinct gameplay modes: advance through Career mode to unlock new buses and more challenging routes, drive freely inside and outside the cities with Freeride and play together with friends in Multiplayer. Want to see how good your driving skills are? Use Leaderboards to see how you compare with other players. Bus Driving Sim 22 is a driving skills based game, so you will be rewarded for following the rules in traffic and getting your passengers safely to their destination.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/bus-driving-sim-22-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/bus-driving-sim-22-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-Bit",
        "Processor": "Intel Core i3 with 3.3 GHz or AMD Phenom II X4 with 3.2 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 (1GB VRAM) or AMD Radeon R7 360 (2GB VRAM) or higher",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "12000 MB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Ovilex Software",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "TENOKE",
        "Version": "v1.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/503cenlcgxd0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/bus-driving-sim-22-preinstalled-steamrip.jpg"
}