{
    "page_url": "https://steamrip.com/bus-simulator-18-free-download-f1/",
    "title": "Bus Simulator 18 Free Download Direct Link (Update 15)",
    "description": "Whether in the industrial or harbour zone, downtown, in the surrounding villages or the business park, in Bus Simulator 18, you experience up-close the exciting everyday life of a bus driver in a vast and freely drivable urban area. Get behind the wheel of your 8 original licensed city buses from the great brands of Mercedes-Benz, Setra, MAN , and IVECO BUS and transport your passengers safely and punctually to their destinations, either solo in single player mode, or with friends in real-time multiplayer mode. Slime\nAs a bus driver in the 12 different districts , you’ll face the challenges of the traffic in a big city and everything that entails. Don’t be deterred by freak weather conditions, potholes , traffic jams, fare evaders, accidents, construction sites, night driving and specific passenger requests. On the contrary, take full control of your bus, earn money, gain a good reputation owing to your safe and punctual driving style and enjoy almost limitless driving pleasure in the authentic urban locations. Use the thousands of miles of virtual roads and streets to gain new districts, new buses and new customisation options.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/bus-simulator-18-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/bus-simulator-18-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-Bit",
        "Processor": "Intel Core i3 with 3.3 GHz or AMD Phenom II X4 with 3.2 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 (1GB VRAM) or AMD Radeon R7 360 (2GB VRAM) or higher",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "6500 MB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "stillalive studios",
        "Platform": "PC",
        "Game Size": "3.88 GB",
        "Repack By": "GOG",
        "Version": "v4.18.3.0 (Update 15) | Updated version + all additions",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hq0avse0zd36"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/bus-simulator-18-free-download-preinstalled-steamrip.jpg"
}