{
    "page_url": "https://steamrip.com/cafe-owner-simulator-free-download-1r/",
    "title": "Cafe Owner Simulator",
    "description": "We were inspired by sandbox and simulation games, where players can create something of their own, set up processes, develop their creation, put their soul into it and show their creativity. In Cafe Owner Simulator you have such an opportunity, our goal is to give the world a game in which everyone can realize his dream and open his own restaurant business. When you buy a room for your own restaurant you will need to free it from trash and make major repairs, it is not an easy task, but what can be better than to clean up the future of a successful restaurant or cafe? Burnhouse Lane\nAfter cleaning and repairing you will have to choose the best wallpaper, carpet or coverings of different materials, this is where your design will begin. So how do you do without kitchen equipment? Decide on the type of your future establishment and buy all the necessary equipment for it. Also, do not forget to connect it to the outlets. To open a place – you need to add a minimum of 5 dishes to the menu.\nTo prepare these dishes you’ll need products, you can buy them at the grocery store. The game has a job market. To hire a staff member, pay a headhunter and he will find a marketable staff member for you. Every worker has his own characteristics , so choose the best ones.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/cafe-owner-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/cafe-owner-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Second Reality",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Released By": "CODEX emu",
        "Version": "v1.0.213 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wi4cepttruly"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/cafe-owner-simulator-preinstalled-steamrip.jpg"
}