{
    "page_url": "https://steamrip.com/call-of-duty-4-modern-warfare-free-download-3l/",
    "title": "Call of Duty 4: Modern Warfare Free Download",
    "description": "Get CoD: Modern Warfare 4 for free instantly and play pre-installed on SteamRiP\nThe new action-thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty series, delivers the most intense and cinematic action experience ever. Call of Duty 4: Modern Warfare arms gamers with an arsenal of advanced and powerful modern day firepower and transports them to the most treacherous hotspots around the globe to take on a rogue enemy group threatening the world.\nAs both a U.S Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower and coordinated land and air strikes on a battlefield where speed, accuracy and communication are essential to victory. The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive and customizable gameplay. Jump King\nAuthentic Advanced Weaponry – Featuring an available arsenal of more than 70 new and authentic weapons and gear from assault rifles with laser sites, claymore mines, .50 caliber sniper rifles, and M-249 SAW machine guns. With accessories like night-vision goggles and ghillie suits, for maximum concealment, Call of Duty 4: Modern Warfare has players locked and loaded to accomplish the mission.\nCoordinated Assault and Support – Delivering the most visceral action thriller ever, the title covers modern battle from the soldier to the satellite, where the need for air support is critical to success. The adrenaline rush deployment enlists gamers to fast-rope from tactical helicopters, ride in an armada of attack choppers, utilize jets to remove enemy strongholds and even engage hostiles from thousands of feet above the ground inside a state of the art aerial gunship.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/call-of-duty-4-modern-warfare-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/call-of-duty-4-modern-warfare-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "Processor": "Intel® Pentium® 4 2.4 Ghz / AMD(R) 64 (TM) 2800+ / Intel",
        "Memory": "512MB RAM (Windows® XP), 768MB RAM (Vista®)",
        "Graphics": "NVIDIA Geforce 6600 or better or ATI Radeon® 9800Pro or better",
        "Sound": "100% DirectX 9.0c compatible sound card",
        "Hard Drive": "8GB of free hard drive space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Infinity Ward",
        "Platform": "PC",
        "Game Size": "6.6 GB",
        "Repack By": "DODI REPACKS",
        "Version": "v1.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/BC05E6D027",
        "https://buzzheavier.com/wjwse1a5544o",
        "https://megadb.net/zu1g6oj1nrrb",
        "https://1fichier.com/?nvbfi3y26976zidl0qyl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/call-of-duty-4-modern-warfare-free-download-preinstalled-steamrip.jpg"
}