{
    "page_url": "https://steamrip.com/call-of-duty-ghosts-free-download-1q/",
    "title": "Call of Duty: Ghosts Free",
    "description": "Get Call of Duty Ghosts Update 21 (CoD games) pc game for free instantly and play pre-installed on SteamRiP\nCall of Duty: Ghosts is an extraordinary step forward for one of the largest entertainment franchises of all-time. This new chapter in the Call of Duty franchise features a new dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. Fueling this all new Call of Duty experience, the franchise’s new next-gen engine delivers stunning levels of immersion and performance, all while maintaining the speed and fluidity of 60 frames-per- second across all platforms. Settlement Survival\nTen years after a devastating mass event, America’s borders and the balance of global power have changed forever. As what’s left of the nation’s Special Operations forces, a mysterious group known only as “Ghosts” leads the fight back against a newly emerged, technologically- superior global power. A New Call of Duty Universe: For the first time in franchise history, players will take on the underdog role.\nCall of Duty: Ghosts; outnumbered and outgunned, players must fight to reclaim a fallen nation in an intensely personal narrative. Gamers will get to know an entirely new cast of characters and visit locales in a changed world unlike anything seen in Call of Duty before.\nIn Call of Duty: Ghosts you don’t just create a class, you create a soldier, a first for the franchise . In the new Create-A-Soldier system, players can change the physical appearance of their soldier by choosing the head, body type, head-gear and equipment, and for the first time in a Call of Duty game, the player can also choose their gender. With 20,000 possible combinations , this is the most flexible and comprehensive character customization in Call of Duty history.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/call-of-duty-ghosts-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/call-of-duty-ghosts-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-Bit / Windows 8 64-Bit",
        "CPU": "Intel Core 2 Duo E8200 2.66 GHZ / AMD Phenom X3 8750 2.4 GHZ or better",
        "RAM": "6 GB",
        "HDD": "40 GB HD space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Infinity Ward",
        "Platform": "PC",
        "Game Size": "29.6 GB",
        "Released By": "ALI213",
        "Version": "Update 21 build 749678 (Ghosts Deluxe Edition) | Full  + DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/5F4E813808",
        "https://buzzheavier.com/frv5wnsc2chd",
        "https://1fichier.com/?qg42vnphiqbsye4lyxo7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/call-of-duty-ghosts-free-download-preinstalled-steamrip.jpg"
}