{
    "page_url": "https://steamrip.com/call-of-duty-world-at-war-free-download-u1/",
    "title": "Call of Duty: World at War Free Download",
    "description": "Call of Duty World at War game for free instantly and play pre-installed on SteamRiP\nCall of Duty is back, redefining war like you’ve never experienced before. Building on the Call of Duty 4®: Modern Warfare engine, Call of Duty: World at War immerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts. The title offers an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through the all new four-player cooperative campaign.\nThe addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action, a higher level cap, more weapons, and a host of new Perks, maps and challenges. Harsh New Enemies, Environments and Tactics: Face off against ruthless and tactically advanced enemies that will stop at nothing to defend their homelands, from swamp ambushes and tree-top snipers to fearless Kamikaze attacks. Play as a U.S. Marine and Russian conscript across a variety of Pacific and European locations against the fearless Imperial Japanese and elite German soldiers in epic adrenaline-filled infantry, vehicle and airborne missions.\nCo-Op Campaign Mode, Call of Duty Style: For the first time in the franchise, Call of Duty: World at War introduces co-op play, bringing fresh meaning to No One Fights Alone. Campaign co-op features up to four-players online, allowing gamers to experience harrowing campaign missions together for greater camaraderie and tactical execution. Co-op mode incorporates innovative multiplayer components such as challenges, rankings and online stats for deeper re-playability and multiplayer experience bonuses. Co-op mode also features Competitive Co-Op that will show who is really the best player on your team. Legend of Mana",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/call-of-duty-world-at-war-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/call-of-duty-world-at-war-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP/Vista/7",
        "Processor": "Pentium 4 @ 3 GHz/AMD 64 3200+",
        "Memory": "512 MB (1 GB for Vista)",
        "HDD": "8 GB Free"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Treyarch",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Repack By": "SEWN",
        "Version": "v1.7 | full version (Latest) Incl Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/06AF804F12",
        "https://buzzheavier.com/ywt9cge2aaj6",
        "https://megadb.net/a5jbjtneeyfg",
        "https://1fichier.com/?usxrsa10ygk3bc8ard3b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/call-of-duty-world-at-war-free-download-preinstalled-steamrip.jpg"
}