{
    "page_url": "https://steamrip.com/call-of-duty-black-ops-6-campaign-free-download/",
    "title": "CoD Black Ops 6 Campaign Only Download",
    "description": "Black Ops 6 is a spy action thriller set in the early 90s, a period of transition and upheaval in global politics, characterized by the end of the Cold War and the rise of the United States as a single superpower . With a mind-bending narrative, and unbound by the rules of engagement, this is signature Black Ops.\nThe Black Ops 6 Campaign provides dynamic moment-to-moment gameplay that includes a variety of play spaces with blockbuster set pieces and action-packed moments, high-stakes heists, and cloak-and-dagger spy activity.\nIn a best-in-class Multiplayer experience, players will test their skills across 16 new maps, including 12 core 6v6 maps and 4 Strike maps that can be played 2v2 or 6v6. Endzone 2\nBlack Ops 6 also marks the epic return of Round-Based Zombies , the fan-favorite mode where players will take down hordes of the undead in two brand-new maps. With additional content still to come, players can look forward to even more exciting maps and groundbreaking experiences dropping into both Multiplayer and Zombies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/call-of-duty-black-ops-6-campaign-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/call-of-duty-black-ops-6-campaign-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 Bit (latest update)",
        "Processor": "AMD Ryzen 5 1400 or Intel Core i5-6600",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 470, NVIDIA GeForce GTX 960 or Intel Arc A580",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage/Additional Notes": "SSD with 128 GB available space at launch"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Treyarch, Raven Software, Beenox, High Moon Studios, Activision Shanghai, Sledgehammer Games, Infinity Ward, Demonware",
        "Platform": "PC",
        "Game Size": "48.7 GB",
        "Released By": "Thanks .r4v3n/MrGoldberg | Thanks to heatfan23 (csrin) OST",
        "Version": "v11.1 | Campaign  Only + ENG only + OST + Zombies OST",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/W6wY7g",
        "https://datanodes.to/azwb29a4tzln",
        "https://buzzheavier.com/9ybd43gq688x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/call-of-duty-black-ops-6-campaign-preinstalled-steamrip.jpg"
}