{
    "page_url": "https://steamrip.com/call-of-duty-deluxe-edition-free-download-2s/",
    "title": "Call of Duty Deluxe Edition",
    "description": "Call of Duty delivers the gritty realism and cinematic intensity of World War II’s epic battlefield moments like never before – through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics , each soldier’s distinct personality and training comes out on the battlefield.\nNo one soldier or nation single-handedly won the war. For the first time, Call of Duty captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism, immersing you in the most intense World War II experience yet.\nCall of Duty: Second Front is an add-on for Call of Duty, one of the best 3D action games on the theme of World War II. An operation in the Ardennes and a sortie as part of a sabotage detachment to Sicily, a battle on the central square of Kharkov and an air raid on Rotterdam – you have to take part in large-scale, brutal battles of the highest degree of sophistication .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/call-of-duty-deluxe-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/call-of-duty-deluxe-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 98 / ME / 2000 / XP",
        "Processor": "Pentium III 600 MHz or Athlon 600 MHz processor",
        "Memory": "128 MB",
        "Graphics": "3D hardware accelerator card required",
        "DirectX": "Version 9.0b (included)",
        "Storage": "1.4 GB"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Infinity Ward",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Based On": "Elamigos Iso",
        "Version": "v1.51 | Full  (Latest) + CoD United Offensive",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qnqkl8a62x8u",
        "https://buzzheavier.com/o78zdiymb7co"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/call-of-duty-deluxe-edition-preinstalled-steamrip.jpg"
}