{
    "page_url": "https://steamrip.com/candy-disaster-tower-defense-free-download-1x/",
    "title": "Candy Disaster Tower Defense Free Download",
    "description": "Candy Disaster – Tower Defense game for free instantly and play pre-installed on SteamRiP\nWe are a 3D strategy tower defense game that combines traps to collect Candies . In the game, you will play Jick, the mad scientist, to help a mysterious friend collect the M89KD Energy Candies scattered on different planets.\nDuring your journey , you will meet many foreign enemies who attempt to obtain the Candies for themselves However, your wit and wisdom will help you The EA version contains Night Club and Storm Desert . The Night Club operates in forest scenery while Storm Desert takes place in the desert with ancient pyramids.\nThese two scenes contain different mechanics , so take advantage of that Ice and Snow Cemetery and Candy Factory will be coming soon! Stay tuned In your journey of Candy Disaster, you will encounter different enemies. Some with powerful skills Party Panic\nChoose the right trap to fight against them For example, the Gravity Net can take down flying enemies by making them land. Know your enemies. With a variety of traps, combine different traps to create your way of attacking. For example, wooden arrows can turn into fire arrows with the help of flame; fans can change the direction of any “bullet” traps. These clever combinations are waiting to be discovered",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/candy-disaster-tower-defense-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/candy-disaster-tower-defense-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Windows Vista, Windows 7",
        "Processor": "2GHz Dual Core",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce 6800 or ATI Radeon x1950 or better with 256MB VRAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Strategy",
        "Developer": "ACE Entertainment",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "CODEX",
        "Version": "Build 8021358 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uquyxcs9hpcm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/candy-disaster-tower-defense-preinstalled-steamrip.jpg"
}