{
    "page_url": "https://steamrip.com/cantata-free-download-o1/",
    "title": "Cantata Directly Download",
    "description": "A rebellion has broken out disrupting the military force controlling the galaxy titled the 111th Reign of Humanity and Prosper, a swarm of robots calling themselves the “Unified Spirit” have risen up against the shackles of their human masters with the dream of a better world. The final stand is taking place on the unexplored planet of Shoal, where legends, Gods and creatures of the shadows meet reality… unknown to humans or robots, the planet itself has awoken – and its people are fighting to save it.\nPlay as a Commanding Officer for each faction as you work your way through the campaign to uncover the planet, crush the rebellion or to create a better world. Manage your resources, troops and capture regions across the planet’s surface. Be careful of your choices, it is not only the enemy forces you must watch out for but the treacherous planet itself. Glitch Busters: Stuck On You\nCantata takes you to a far off planet filled with vibrant colours, striking characters and a unique soundtrack that seems to echo through the galaxy. Each chapter of the campaign plays through as unique stand alone stories allowing you to uncover the history of each faction. Each map holds secrets for players to uncover which can aid you across the campaign – you’ll need to do effective recon to determine the best approach in battle. Beware though, the planet of Shoal isn’t one to let you idly move across its surface. Just like any other faction , the planet itself takes a turn every round, giving it the ability to fight back against the war on its surface with weather, fauna, and other mysteries.\nCombining elements from Grand Strategy titles with the small-scale skirmishes of classic Tactics games, in Cantata you’ll start with a small base of operations and crucial few units, and then bring your grand strategic vision to life by building new structures, managing your regions , and expanding your army. As your presence on the planet Shoal grows you’ll be keeping a close eye on not only the empire you’ve built but also growing threats across the map.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/cantata-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/cantata-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "5th Generation Core i3 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 4600",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Afterschool Studio",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lukqwwblm72x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/cantata-preinstalled-steamrip.jpg"
}