{
    "page_url": "https://steamrip.com/capcom-fighting-collection-2-free-download/",
    "title": "Capcom Fighting Collection 2",
    "description": "Capcom’s new fighting collection hits the stage Choose from fan-favorite games like Capcom vs. SNK 2: Mark of the Millennium 2001 and Project Justice to 3D action games like Power Stone and Power Stone 2 in this collection of eight classic fighting games!\nEach game in the collection can be played online or co-op!\nGet back in the ring and duke it out in battles that everyone rumored, but no one believed! Whether it’s with a rival new or old, give it your all and strive for victory!\n– Smooth Online Play! Compete in heated ranked battles or play for fun in casual matches. Create a lobby with friends and battle head-to-head, play co-op, or spectate other matches. However you choose to play, rollback netcode makes the experience smooth and fun! A High Score Challenge mode is also available. Aim for the top of the global leaderboards!\n– No Experience? No Problem! This collection boasts a number of beginner- friendly features such as adjustable difficulty levels, One Button Specials, and training modes. Plus, players can save and load their progress almost anywhere and pick up right where they left off.\n– Additional Features! Players can view more than 700 pieces of artwork from all 8 titles along with never-before-seen development documents used to make the original games. The Music feature contains over 300 tracks from the original arcade games that players can listen to at any time!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/capcom-fighting-collection-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/capcom-fighting-collection-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10 (64-BIT Required) / Windows11 (64-BIT Required)",
        "Processor": "IntelⓇ Core™ i5-4460, AMD FX-8300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA®: GeForce® GTX 760 with 2GB Video RAM, AMD: Radeon™ R9 290x with 4GB Video RAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "CAPCOM Co., Ltd.",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "CHRONOS emu",
        "Version": "Build 17878692 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m31awti6nhgh",
        "https://buzzheavier.com/ev5zjzc8l6b2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/capcom-fighting-collection-2-preinstalled-steamrip.jpg"
}