{
    "page_url": "https://steamrip.com/capes-free-download/",
    "title": "Capes",
    "description": "Twenty years ago, the supervillains won. Since then, they’ve created a dystopian city where developing super powers is a crime. Nobody has managed to slow them down, until now. Capes is a turn based superhero strategy game where you build a team of heroes and fight to take back the city. Played across a series of campaign and patrol missions, choose to push forward with the story or take the time to explore the side missions and unlock more heroes, earn skill points and complete challenges, and learn more about your heroes lives. SPY×ANYA: Operation Memories\nRecruit new heroes with a range of unique powers and abilities. Every hero plays differently, and requires a fresh approach to their powers and abilities. Learning and exploiting each hero’s unique play style will build their power in combat allowing them to unleash their personal tide turning Ultimates. Exciting, heroic, turn based combat to test your strategic skills. Team ups and positioning matter, unlocking new ways to approach every enemy type and supervillain you encounter. Capes combat isn’t based around random numbers or lurking behind cover. Power doesn’t make you invulnerable, far from it. Your choices will make the difference between victory and defeat.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/capes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/capes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 64-bit",
        "Processor": "Quad-core Intel or AMD, 2.5 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA 960 GTX / AMD RX 590",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Spitfire Interactive",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Repack By": "GOG",
        "Version": "v1.2.0.0 + DLCs + Bonus Content",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/od0v8re7e1zz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/capes-preinstalled-steamrip.jpg"
}