{
    "page_url": "https://steamrip.com/captain-of-industry-free-download/",
    "title": "Captain of Industry",
    "description": "Captain of Industry is a colony and factory simulation game. Your journey will start with a small crew of survivors on an abandoned island. If you do things right, you’ll work your way up towards a self-sufficient colony and will play an important part in the region’s industry. Warlord: Britannia\nBut first, in order to survive, you will need to mine raw materials, grow food, build factories, manufacture products, construct vehicles, research new technologies, explore your surroundings, and trade with other islands. If you are successful, you can even start a space program and build rockets But that’s a long and hard way to go Start simple – smelt iron, mix concrete, create construction parts, and grow food.\nSoon you will be able to expand into crude oil processing, electronics, solar panels, data centers, and even rockets. There are over 150 unique products to explore and work with Fully automated logistics system ensures that products will always go where they are most needed. Your job is to configure the logistics, build enough trucks to keep things moving, and connect closeby machines with conveyor belts or pipelines for optimized resources transportation. To build a thriving empire you need to be clever.\nPlace machines carefully to connect them more efficiently with conveyor belts or pipes, refine raw resources close to their mining location to save fuel needed for transportation, or upgrade production chains with more efficient machines to save raw resources .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/captain-of-Industry-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/captain-of-Industry-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Dual-core CPU @3.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Dedicated graphics card, GTX 770 2GB",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "MaFi Games",
        "Platform": "PC",
        "Game Size": "2.5 GB",
        "Released By": "Goldberg | Ty Titeuf, cs.rin.ru",
        "Version": "v0.7.6a | Build 19018326",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/5yILj0",
        "https://buzzheavier.com/6m7yj7rfuzp1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/captain-of-Industry-preinstalled-steamrip.jpg"
}