{
    "page_url": "https://steamrip.com/car-mechanic-simulator-2018-free-download-1j/",
    "title": "Car Mechanic Simulator 2018 Free Download",
    "description": "Get Car Mechanic Simulator 2018 for free instantly and play pre-installed on SteamRiP\nCar Mechanic Simulator 2018 also includes car auctions where old cars are available for resale or purchased for your collection. Moreover With the inclusion of photo-mode, you’ll take stunning before and after photos, and therefore the game’s infinite number of randomly generated missions will keep you quite busy (and dirty). Each mission offers its own unique challenge of varying difficulty and time constraints to satisfy . Additional tools are available for purchase if needed. you’ll eventually upgrade your garage to incorporate specific equipment like lacquer sprayer or a parts warehouse . Night Book\nIn addition to the orders (which include story mode and randomly-assigned vehicles), the player can also visit locations such as barns, the junkyard, the auction house, or the car salon to find different vehicles and parts to purchase for their personal collection. Fixing up junkyard vehicles is another way to earn money, particularly if one utilizes the ability to repair parts on the workbench (with the necessary unlocks). Completing these cars and selling them can also earn a restoration bonus.\nFurthermore build and expand your repair service empire in this incredibly detailed and highly realistic simulation game, where attention to car detail is astonishing. Find classic , unique cars in the new Barn Find module and Junkyard module. You can even add your self-made car in the Car Editor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/car-mechanic-simulator-2018-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/car-mechanic-simulator-2018-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows(64-bit) 7 or Newer",
        "Processor": "Intel Core i3 3.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVidia GeForce GTX 660 2GB",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Simulation",
        "Developer": "Red Dot Games",
        "Platform": "PC",
        "Game Size": "6.6 GB",
        "Released By": "SKIDROW",
        "Version": "v1.6.8 | Full version + all 19 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/53e33b02xnv2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/car-mechanic-simulator-2018-free-download-preinstalled-steamrip.jpg"
}