{
    "page_url": "https://steamrip.com/cardfight-vanguard-dear-days-2-free-download/",
    "title": "Cardfight!! Vanguard Dear Days 2",
    "description": "1-on-1 battle card game developed by Bushiroad and launched in February 2011. Localized in English, Chinese, Italian, Thai, Korean, etc., it’s sold in 61 countries and regions worldwide, continuing to grow in popularity. It also includes media such as animations and comics, and in 2021, on the project’s 10th anniversary, the new “D series” has been launched. And in 2024, the newest anime “CARDFIGHT!! VANGUARD DivineZ” began. Experience the supreme Vanguard fight digitally, along with an original story With over 3,000 cards compatible with the standard rules and unique in-game animations, your fights will be more thrilling and exciting than ever.\nCompete against fighters worldwide in “ Ranked Fight,” or enjoy a more relaxed experience in “CPU Fight,” among other modes that let you enjoy the world of Vanguard in a way that suits you best. After numerous relocations, Otowa Dosaki (CV. MoeMi) finally arrives in Imizu, Toyama. At a local card shop, she is introduced to Yuki Ichidoji (CV. Yuka Nishio) as an “interesting fighter,” and sets out to find her. Meanwhile, Yuki , who has improved her skills and become a very strong fighter, is frustrated by the lack of worthy opponents. One day, Yuki learns a hidden secret about her mother from Kanji Meguro (CV. Show Hayami), and rekindles her fighting spirit. Dead Season\nAs Yuki and Otowa’s paths cross through interactions with friends and rivals, a major tournament begins to take shape. In addition to characters from Cardfight!! Vanguard Dear Days, the story also features new characters like Kisato Kuga (CV. Seiji Maeda) and Gaku Nijo (CV. Hiro Shimono), whose roles are not to be missed Moreover, a story centered around characters from the anime series will+Dress and DivineZ , featuring Yu-yu Kondo (CV. Shota Aoi) and Akina Myodo (CV. Toshiya Miyata), is also included! Be sure to enjoy these as well",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/cardfight-vanguard-dear-days-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/cardfight-vanguard-dear-days-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows8.1",
        "Processor": "Quad-core Intel or AMD processor, 2.5 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "FURYU Corporation, LANCARSE Ltd.",
        "Platform": "PC",
        "Game Size": "15.5 GB",
        "Multiplayer By": "Goldberg Emu",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/kHhwIC",
        "https://buzzheavier.com/1l1kq8wyz3jg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/cardfight-vanguard-dear-days-2-preinstalled-steamrip.jpg"
}