{
    "page_url": "https://steamrip.com/card-en-ciel-free-download/",
    "title": "Card-en-Ciel Directly Download",
    "description": "Card-en-Ciel is a JRPG take on roguelike deckbuilders , with a full story, over 300 cards each with unique characters, 50 full vocal songs, and a 6×3 playfield for strategic depth. Each battle will earn you new allies to add to your deck, powering up to take on the boss and advance the story. Age of History 3\nFreely roam around dungeons and battle the enemies you choose. You’ll take control of Neon, a self-professed detective who specializes in crimes in full-dive VR games. When an in-development game is suddenly overrun by countless characters from other games old and new, Neon has to delve into virtual dungeons to stop them. Each of the over 300 cards you’ll collect features a unique character from those games. They come alive with full English and Japanese voice acting, talking with their friends and foes and reacting in battle.\nRecruit powerful Muse cards who begin performing when you meet their conditions, activating unique effects to enable your most degenerate combos. Each Muse sings a different song, created with respect to the era and genre you would expect from their original game, with 50 vocal songs in total.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/card-en-ciel-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/card-en-ciel-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "INTI CREATES CO., LTD.",
        "Platform": "PC",
        "Game Size": "5 GB",
        "Released By": "TENOKE",
        "Version": "Build 16177794 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lbmibpyxfnv3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/card-en-ciel-preinstalled-steamrip.jpg"
}