{
    "page_url": "https://steamrip.com/caribbean-legend-free-download/",
    "title": "Caribbean Legend",
    "description": "Welcome to the Caribbean in 1654 AD, a place teeming with opportunities and mysteries . Assume the role of Charles de Maure, a young French noble who embarked on a journey to the New World to assist his brother. What initially appeared to be a simple family matter quickly evolves into a lifelong adventure. Immerse yourself in the tale of a noble brat who rises to become the most influential figure in the Caribbean. Riches, titles, power, and romance – the ultimate booty awaits, and it’s up to you to seize it all. Batman Arkham Origins\nThe Caribbean Sea – a realm of dozens of islands and cities, a grand archipelago shrouded in mystery and secrets. From the summits of Indian pyramids to the ocean depths, unique rewards, quests, and curiosities await. This open world is your sandbox, you are free to explore it and shape your legend as you see fit. Your decisions determine where to go, what to do, and who to take with you. Subdue the New World or it will destroy you",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/caribbean-legend-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/caribbean-legend-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "XP, WIndows 10, Windows 11",
        "Processor": "Intel Pentium IV or AMD Athlon 2.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "1 GB (AMD video cards are not fully supported)",
        "DirectX": "Version 9.0",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "BlackMark Studio",
        "Platform": "PC",
        "Game Size": "20 GB",
        "Released By": "TiNYiSO",
        "Version": "v1.4.0 Hotfix #5 (Build 18090075)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/tn32pbi23o7u",
        "https://datanodes.to/kvtyss10fv7d/Caribbean-Legend-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/caribbean-legend-preinstalled-steamrip.jpg"
}