{
    "page_url": "https://steamrip.com/carnivores-dinosaur-hunt-free-download-1k/",
    "title": "Carnivores: Dinosaur Hunt",
    "description": "Carnivores: Dinosaur Hunt is a first-person hunting simulator where you hunt the largest and most dangerous beasts to ever exist – DINOSAURS. This game is a remaster of the classic dinosaur hunting video game, Carnivores: Dinosaur Hunter, delivered with a new game engine, improved graphics, advanced dinosaur behaviors, and seamless player progression. PAC-MAN WORLD Re-PAC\nExperience an out of this world hunting experience, as you track down and stalk dinosaurs! To survive you’ll need to know your target’s temperament and mannerisms, and just like in real hunting, you need to be aware of your surroundings, because you don’t want to be caught upwind of a T-Rex or you’ll end up being lunch. On your hunting adventure, you will visit beautiful but dangerous environments, each with their own unique Ecosystems .\nExplore the pristine beaches, dense jungles , rocky plains, and scorching deserts of planet FMM UV-32. Environments can be used to increase the odds of a successful hunt. You can follow trails and track animal footprints. Awareness of wind direction is important since some dinosaurs can smell you. Using stealth tactics or gaining the high ground will give you an edge over the more vicious dinosaurs roaming the planet. Careful planning and consideration must be taken before every hunt including weapon choice.\nWill you use a high caliber rifle, sniper rifle, or a silent crossbow? Maybe bring along a sidearm just in case. One of the most important items you will need is your handheld M.I.S.T. (Mobile Interstellar Satellite Transponder), which includes radar and GPS satellite positioning to make tracking these beasts easier. There are other items you can bring on your hunt to improve your chances of survival such as Cover Scent, which masks your smell.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/carnivores-dinosaur-hunt-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/carnivores-dinosaur-hunt-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core2Quad 2.67 GHz or AMD Phenom II X4 965",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460",
        "DirectX": "Version 11",
        "Storage": "1.2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Sports",
        "Developer": "Digital Dreams Entertainment",
        "Platform": "PC",
        "Game Size": "519 MB",
        "By": "Haoose (cs.rin.ru)",
        "Version": "Build 9520956 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8fesqfi5giu1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/carnivores-dinosaur-hunt-preinstalled-steamrip.jpg"
}