{
    "page_url": "https://steamrip.com/cassette-beasts-free-download-1n/",
    "title": "Cassette Beasts",
    "description": "Collect awesome monsters to use during turn-based battles in this open-world RPG. Combine any two monster forms using Cassette Beasts’ Fusion System to create unique and powerful new onesn Welcome to New Wirral, a remote island inhabited by strange creatures you’ve only dreamed of, nightmares you hopefully haven’t, and a cast of brave folks who use cassette tapes to transform for battle .\nTo find a way home you’ll need to explore every inch of the island, and record monsters to your trusty cassette tapes to gain their abilities Faced with the constant threat of monster attacks, the residents of Harbourtown, New Wirral choose to fight fire with fire. Record a monster to tape, then play it back to take on its form for battle Getting close to your companion has benefits–while transformed you can combine your strengths to gain the upper hand in battle. Desktop Dungeons: Rewind\nAny two monster forms can be fused to produce unique, fully-animated new fusion forms. Certain monster abilities can be used in human form. You’ll need these to help you get around, solve puzzles, and locate dungeons. Glide, fly, swim, climb, dash, or turn magnetic Never fight alone Form bonds, spend time together, and help your selected partner complete personal goals to become a better team.\nThe strength of your relationship determines how well you’re able to fuse Take advantage of elemental chemistry to apply extra buffs or debuffs alongside your attack, or even alter your opponent’s elemental type Team up in local multiplayer with a friend to explore an open world, transform and battle together Facing the unknown as a duo will surely develop your relationship",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/cassette-beasts-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/cassette-beasts-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2+ Cores, 2+ GHz",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB VRAM, OpenGL 3.3",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG",
        "Developer": "Bytten Studio",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.8.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u2d21y236gxd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/cassette-beasts-preinstalled-steamrip.jpg"
}