{
    "page_url": "https://steamrip.com/cast-n-chill-free-download/",
    "title": "Cast n Chill",
    "description": "Cast n Chill’s a laid-back fishin’ game for folks who’d rather wet a line than break a sweat. Whether yer driftin’ on a lazy lake, pokin’ ’round a winding river, or droppin’ lines in salty blue water, this here’s a game where you set the pace. Start with the basics, catch whatever bites, sell your haul, and put those coins toward better rods, reels, and upgrades. Before ya know it, you’ll be wranglin’ rare species that’d make any angler green with envy. Find yer favourite fishin’ hole or keep wanderin’. There’s 13 peaceful spots to discover , each with its own critters swimmin’ ’round, just waitin’ to bite. Aquatic Store Simulator\nIn Active Mode , you’re in the thick of it – castin’, reelin’, and keepin’ busy like a loon at nesting time. Switch to Passive Mode if you’d rather let the game do the work while you’re off choppin’ wood. Set it up on a second monitor or tuck it in the corner – come back later and see what kind o’ haul the fish gods left ya.\nThere’s 50 fish to discover – some you’ll recognize, some you’ll squint at and go “what in the heck is that ?” From scrappy little sunfish to big ol’ deepwater beasts, they’re all in the logbook waitin’ for your name. There’s 13 fish out there that still get folks jabberin’ at ol’ Rusty’s bait shop like they saw Bigfoot ride a moose. Land one, and you’ll be part o’ the legend. A day on the water’s better with company. Bring along a trusty companion. They might not know a spinnerbait from a spoon, but they’ll help you spot a fish – if only ’cause they’re hopin’ for a bite themselves.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/3483740/4b30a8cd1d2ff31bc61c3961cd4a146f8e410034/ss_4b30a8cd1d2ff31bc61c3961cd4a146f8e410034.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/3483740/85b7cce2701886954bb348bcff6abd94c0c6469d/ss_85b7cce2701886954bb348bcff6abd94c0c6469d.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel® Core™ i3 @ 3.2 GHZ",
        "Memory": "4 GB RAM",
        "Graphics": "Graphics card with DX9",
        "Storage": "256 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, RPG, Simulation, Sports",
        "Developer": "Wombat Brawler",
        "Platform": "PC",
        "Game Size": "178 MB",
        "Released By": "Goldberg Emu",
        "Version": "Build 18880693",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jg7v70dufk0f",
        "https://buzzheavier.com/zf63yov3efmd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/cast-n-chill-preinstalled-steamrip.jpg"
}