{
    "page_url": "https://steamrip.com/cat-quest-iii-free-download/",
    "title": "Cat Quest III",
    "description": "Get whiskered away on a hearty catventure in Cat Quest III, the third installment in the award-winning Cat Quest series Play as a swashbuckling purrivateer in this 2.5D open-world action RPG set in a fantastical pirate-themed world the Purribean an archipelago swarming with Pi-rats searching for the Northern Star a long-lost mythical treasure. Deathbound\nAlongside your trusty spirit companion, set sail through the Purribean in your very own ship! But beware, the seas are dangerous, and a meow-tiny is nigh as the hordes of Pi-rats under the order of the Pirate King hunt you down\nRETURN OF THE CAT\nThe cutest action RPG you know and love returns for a colorful adventure filled with furr-iously fun gameplay! Delve into a paw-geous new world with varied dungeons and biomes to explore, and encounter fierce battles with the newly refined combat system featuring tighter attack combos and weapon swapping . Playable in either solo or local co-op\nSAIL THROUGH THE PURRIBEAN\nFor the furr-st time in the series, sail the seas and battle in your very own ship Explore the waters on your ship, seamlessly zip to shore, and traverse the land on paw to hunt booty in the paw-esome pirate world – the Purribean! There’s treasures galore to be found, including new weapons, like the blunderpuss , furr-ocious spells, gla-meow-rous costumes, and more",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/cat-quest-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/cat-quest-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "2 GB VRAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "The Gentlebros",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "RUNE",
        "Version": "v1.2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/psgmokayws5t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/cat-quest-3-preinstalled-steamrip.jpg"
}