{
    "page_url": "https://steamrip.com/cato-buttered-cat-free-download/",
    "title": "CATO: Buttered Cat",
    "description": "CATO: Buttered Cat is an adorable puzzle platformer, inspired by the buttered-cat paradox meme: Cats always land on their feet, and toast always lands buttered side down. By strapping a piece of buttered toast to a cat’s back, you create a paradox that results in an infinitely spinning, floating butter-cat perpetual motion machine!\nThe game revolves around the two main characters, “Cat” and “ Buttered Toast.” You’ll need to use the interactions between them to solve various puzzles at each game level. The full game is featuring over 140 main levels and more than 60 side levels. Elsie\nThere are also hidden rooms, challenging boss battles , and fun mini-games. The full version will include an outfit system, with 30+ Cat and Toast skins waiting for you to collect\nCATO will take you to a brain-teasing adventure , exploring five different worlds, each filled with unique contraptions.\nIncluding toaster (Toast: NO!!) to buttered trampolines and speed-boasting space pipes (Cat: Meow!!). Along the way, the two will also encounter some mysterious companions to help them with puzzles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/cato-buttered-cat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/cato-buttered-cat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 SP1+ (or later)",
        "Processor": "Intel or AMD Dual Core at 2 GHz or better",
        "Memory": "4 GB RAM",
        "Graphics": "Intel  4400 or better",
        "DirectX": "Version 11",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Team Woll",
        "Platform": "PC",
        "Game Size": "289 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.594 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2f61qhzsi8b2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/cato-buttered-cat-preinstalled-steamrip.jpg"
}