{
    "page_url": "https://steamrip.com/cats-in-time-free-download-1m/",
    "title": "Cats in Time Free",
    "description": "Get Cats in Time PC game for free instantly and play pre-installed on SteamRiP\nHello explorers My name is Professor Tim Edger, and I’m the inventor of the time machine and an avid cat lover Sadly, I have a problem, and maybe YOU can help me. You see, my beloved cats are missing. While playing in the lab, they’ve activated my time machine and, now they are lost in space and time. Home Sweet Home VR\nYou have to travel from ancient Egypt , all the way to the streets of late 20. century New York, and even beyond the present – to future Tokyo. Your goal is to find all the cats! Please be careful; these cats are really good at hiding.\nEscape to 30 distinctive locations set in seven different ages.\nSolve amazing puzzles and riddles to save all the trapped cats.\nSave almost 300 cats hiding in the most unusual of places.\nThe Steam version is also the ultimate version of the game and features new levels, more detailed 3D graphics, new controls, widescreen support, extra content, and a few surprises!\nListen to the relaxing sounds of the period while exploring. Take your time (heh), and enjoy the trip Professor Tim E.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/cats-in-time-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/cats-in-time-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2 Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "2GB, Shader Model 2.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Pine Studio",
        "Platform": "PC",
        "Game Size": "295 MB",
        "Repack By": "SEWN",
        "Version": "v1.4471.2 Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/anrobtqfakmo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/cats-in-time-free-download-preinstalled-steamrip.jpg"
}