{
    "page_url": "https://steamrip.com/cats-and-the-other-lives-free-download-y1/",
    "title": "Cats and the Other Lives",
    "description": "Following the passing of Bernard Mason, the patriarch of the family, all the remaining Masons return to their childhood home for one last time. As Aspen, the cat of the household, players will take a journey across the hopes, disappointments and regrets of the enigmatic Mason family, traversing through a rich narrative that spans over decades.\nThe game embraces a simple yet intuitive point and click play style, celebrating a design approach based on the behaviours of common house cats living all around the world. Is the cat just a pet, or does this creature play a more mysterious role in our lives? Be a charming but ordinary house cat. Aspen is neither the witty talking cat nor a supernatural creature. Among Us VR\nPlay as the domestic cat of the Mason household. Unravel the decades-spanning story of the Mason Family by witnessing the relations of the surviving family members and tracking ghosts of the past. Explore the mysterious Mason Manor to every nook and cranny in beautiful 2D pixel art supported by modern cinematic lighting. Experience gameplay sequences inspired by naturalistic cat behaviour.\nTrack the scents of different family members throughout the house or cause total mischief in an already tense dinner – as any proper house cat would do Start as the silent witness and eventually become a force of change in the lives of the family members throughout the three chapters of the game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/cats-and-the-other-lives-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/cats-and-the-other-lives-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Intel i5+",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX900 Series or Higher",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Cultic Games",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10000789 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3pdz08tzh75v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/cats-and-the-other-lives-preinstalled-steamrip.jpg"
}