{
    "page_url": "https://steamrip.com/checkmate-showdown-free-download-t1/",
    "title": "Checkmate Showdown",
    "description": "Enter the ultimate arena of cerebral combat , where strategic thinking meets explosive fighting action! In this adrenaline-fueled online multiplayer game, you’ll challenge other players to intense battles that fuse the classic game of Chess with heart-pounding fighting game mechanics . Bopl Battle\nWith lightning-fast reflexes and an eagle-eye for strategy, you’ll need to outsmart your opponents on the chessboard while unleashing devastating combos and special moves in the arena. Master the roster of fighters, each with their own unique fighting styles and chess piece abilities, all based on traditional fighting game archetypes (zoner, grappler, rushdown, etc). Are you ready to become the Checkmate Showdown Grandmaster ?\nThe Chess and fighting parts are intimately linked by design; once a piece attacks the opponent, a fight is engaged. The attacker and defender will be able to make use of tag-assist by other pieces in proximity, and the attacker will have an advantage by having their Ultimate ready to rip from the get-go.Built with the diversity of gamers in mind, Checkmate Showdown will let newcomers have a good time with an approachable control scheme but will feature all of the depth and precision expected by professional FGC players. Easy to pickup, hard to master.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/checkmate-showdown-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/checkmate-showdown-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core i3-4160 @ 3.60GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 480, GTX 570, GTX 670, or better",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "ManaVoid Entertainment, BadRez Games",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "TENOKE",
        "Version": "Build 12765341 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3c1w2gu0mxog"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/checkmate-showdown-preinstalled-steamrip.jpg"
}