{
    "page_url": "https://steamrip.com/chernobylite-free-download-1j/",
    "title": "Chernobylite Enhanced Deluxe Edition Download Direct Link",
    "description": "Chernobylite is a Science Fiction Survival Horror RPG from developers Farm 51. Set in the hyper-realistic, 3D scanned wasteland of Chernobyl’s exclusion zone, you’ll take on the role of Igor, a physicist and ex-employee of the Chernobyl Power Plant, returning to Pripyat to investigate the mysterious disappearance of his fiancée, 30 years prior. Compete with the hostile military presence, other stalkers and supernatural creatures, as well as the harsh and unforgiving environment in your search to uncover the truth. Get ready for a thrilling adventure of survival, conspiracy, horror, love, and obsession. HALF DEAD 2\nCompanions are key to your survival and the resolution of your journey. Each day requires the careful planning and assignment of resources and tasks to your comrades. Survival in the Zone is not easy, and each day brings fresh challenges as comrades die and supplies diminish. Avoid detection with stealth takedowns or engage in open armed. Danger lurks in every corner. But still, the theme of Chernobyl is now popular and if you want to immerse yourself in this atmosphere, you can download and personally try the game. Chernobylite is a sci-fi survival horror game that combines free exploration of a dark world, challenging combat, unique crafting and a non-linear storyline.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/chernobylite-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/chernobylite-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 (x64)",
        "Processor": "Intel Core i5-2500K CPU",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce GTX 660/GTX 1050/GTX 770M or AMD Radeon R7 260/Integrated Ryzen 7 4800H",
        "DirectX": "Version 11",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Simulation",
        "Developer": "The Farm 51",
        "Platform": "PC",
        "Game Size": "35.9 GB",
        "Released By": "FLT",
        "Version": "v48725 (Season 3: Green Walls) | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/d8kl7voqw9e1",
        "https://1fichier.com/?y8lq1npz2tns2or2o7vh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/chernobylite-free-download-preinstalled-steamrip.jpg"
}