{
    "page_url": "https://steamrip.com/children-of-the-sun-free-download/",
    "title": "Children of the Sun",
    "description": "Burning with anger, THE GIRL wages a one-woman war against THE CULT , taking them down cultist by cultist, bullet by bullet, until she reaches her true target: THE LEADER. Along the way she will unravel the dark truth about this mysterious order and the atrocities committed by them in the name of their master .\nIn this tactical third-person puzzle -shooter you assume control of one bullet, guiding it through increasingly complex and challenging levels to kill cultists, trigger traps, and reshape the environment. Every shot counts and ruthless precision is rewarded. Taking down THE CULT is deeply satisfying; doing it with style even more so.\nPLAN YOUR APPROACH Tactical sniping, puzzle solving, and light stealth collide in Children of the Sun to create a third-person shooter like no other. You only have a single bullet to complete each level, but you can re-aim on impact, curve around obstacles, accelerate to break through armor , and more to really make that one crucial shot count.\nRITUAL MURDER Lose yourself in a dark, twisted tale of revenge as you hunt down the nefarious CULT. Children of the Sun accompanies its unique one-bullet action with an evocative, mystery-filled storyline that unravels as you exact your revenge on the people who made your life hell and relentlessly pursue the enigmatic LEADER.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/children-of-the-sun-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/children-of-the-sun-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Strategy",
        "Developer": "René Rother",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "RUNE",
        "Version": "Build 16524106 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pu950rj6yrng"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/children-of-the-sun-preinstalled-steamrip.jpg"
}