{
    "page_url": "https://steamrip.com/children-of-morta-free-download-o10/",
    "title": "Children of Morta Free direct Download",
    "description": "Get Children of Morta PC game for free instantly and play pre-installed on SteamRiP\nChildren of Morta is an action RPG with a rogue-lite approach to character development, where you don’t play a single character – but a whole, extraordinary family of heroes. Hack’n’slash through hordes of enemies in procedurally generated dungeons, caves and lands and lead the family of Bergsons, with all their flaws and virtues, against the forthcoming Corruption .\nLOCAL CO-OP is already available in the game, so two players can become the Bergsons and fight the Corruption together. ONLINE CO-OP is still in development and will be released in a future update. You can also use Steam’s Remote Play Together feature . It lets you play local multiplayer games with Steam Friends online, even when the game doesn’t natively support online play. Agatha Christie – Hercule Poirot: The First Cases\nGAMEPLAY Gameplay-wise it’s a unique mix of action -adventure RPG, rogue-lite and hack and slash game. By leveling up, you develop not only individual characters but also the entire family. There is no permadeath and you can change family members between the dungeon runs.\nCHARACTERS & SKILLS Ranged attacks, magic spells, blocks, stuns, healing, evasions and passive skills – it’s all there for you to discover, unlock and upgrade. You can choose from seven different family members, each one having unique skill sets. The father, John – a protective warrior with a sword and shield. The elder daughter Linda – a precise archer. Kevin, a quiet fighter equipped with deadly daggers . Lucy – a lively and bold fire mage. Mark – a mindful martial arts fighter. Joey – who smashes his enemies with a sledgehammer. And the latest addition to the family – Apan , a mighty healer and a firm defender in one.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/children-of-morta-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/children-of-morta-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7",
        "Processor": "2.8 GHz Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660, Radeon R7 370 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Dead Mage",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "ALI213",
        "Version": "v1.3.155.3 | Full  + 3 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1dx29700swao"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/children-of-morta-free-download-preinstalled-steamrip.jpg"
}