{
    "page_url": "https://steamrip.com/chivalry-2-free-download-1u/",
    "title": "Chivalry 2",
    "description": "Chivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era – from clashing swords, to storms of flaming arrows, to sprawling castle sieges and more. Dominate massive, 64-player battlefields . Catapults tear the earth apart as you lay siege to castles, set fire to villages and slaughter filthy peasants in the return of Team Objective maps.\nA fully featured mounted combat system makes you feel like you are fighting atop a thousand pound beast of war, including the ability to trample your foes, land devastating front or rear horse kicks, unhorse your opponent with a lance and engage in deep melee combat with grounded or mounted opponents. Starbound\nRise to glory and expand your arsenal with a new subclass system that provides more variety than ever before. Four base classes expand to 10+ subclasses and over 30 unique weapons, each with multiple visual variants. New support items ranging from oil pots to barricades , supply crates and archer’s stakes add even more tactical options to the battlefield. Charge to battle alongside your friends with all-platform Crossplay and claim glory by your blade.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/chivalry-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/chivalry-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i3-4370",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660 or AMD Radeon HD 7870 2 GB",
        "DirectX": "Version 10",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Torn Banner Studios",
        "Platform": "PC",
        "Game Size": "25.1 GB",
        "Multiplayer By": "0xdeadc0de | Thanks to gookie | Mr_GOLDBERG",
        "Version": "v1.0.42.0 | Full  | Special Edition + DLC + Co-op + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/0BC4E50D82",
        "https://buzzheavier.com/usfloaibb978",
        "https://1fichier.com/?w9z6ie09hfaddpjiobwe"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/chivalry-2-preinstalled-steamrip.jpg"
}