{
    "page_url": "https://steamrip.com/chrono-cross-the-radical-dreamers-edition-free-download-n1/",
    "title": "CHRONO CROSS THE RADICAL DREAMERS EDITION Download",
    "description": "“ CHRONO CROSS: THE RADICAL DREAMERS EDITION” is a remaster of “CHRONO CROSS”. The 3D models have been upgraded to HD, new illustrations have been added, and all kinds of new features are now included. Additionally, the game that formed the bedrock of the story.\nLe Trésor Interdit -“, is included in this edition CHRONO CROSS is an RPG that transcends time and space, unfolding across two interlinked parallel worlds. With over 40 party members to meet, people and dimensions will intertwine in this epic drama about the planet itself. Utilising an innovative turn-based style battle system, CHRONO CROSS is a unique RPG that follows the protagonist “Serge” as he crosses time on his quest to save himself dying in a parallel universe. Half-Life\n“RADICAL DREAMERS – Le Trésor Interdit -” was released in 1996 as a standalone game, and has not been easily accesible for play in recent years. Players can experience the story that went on to become the basis for CHRONO CROSS in an audio novel format. Here, an alternate story of the RADICAL DREAMERS, a group of three thieves  Serge, Kid and Magil unfolds in a parallel world. You can switch between the new and old versions of the 3D models and illustrations. The 3D models, illustrations, font and background filter cannot be toggled separately. They will all be switched together.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/chrono-cross-the-radical-dreamers-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/chrono-cross-the-radical-dreamers-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 8.1 64-bit",
        "Processor": "AMD A8-7600 / Intel® Core™ i3-3210",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon™ RX 460 / NVIDIA® GeForce® GTX 750",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG",
        "Developer": "Square Enix, D4Enterprise Co.,Ltd.",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "CODEX",
        "Version": "Build 8116082 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pm5xbqlu34db"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/chrono-cross-the-radical-dreamers-edition-preinstalled-steamrip.jpg"
}