{
    "page_url": "https://steamrip.com/chronique-des-silencieux-free-download-c1/",
    "title": "Chronique des Silencieux",
    "description": "Set in 1970s southern France, you play a rookie private eye tasked to dig out the secrets of a stubborn old man. Think on your feet while you follow your leads : ask questions to witnesses, detect their lies, hypothesize why and finally confront the silent ones running from their past. You are entrusted with the peculiar case of Victor Dousvalon . CLeM\nThis old history professor is known for shrouding his past life in secrecy for everyone around, including his own daughter Catherine. But an apparently harmless accident decides him to hire you to help Catherine trace back the steps of his life. Why does Catherine , who has been so distant with her father these past years, suddenly wants to know about him?\nGet engrossed in the handy work of a detective : search through family papers, ask personal questions, call at inopportune times and be generally nosy. No watching characters think for you, this is your time to prove your deductive powers. Choose leads, follow them to the end or stop when you think you’ve got the right idea. But you’ll need to be convincing to push the silent ones to talk",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/chronique-des-silencieux-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/chronique-des-silencieux-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 or Later",
        "Processor": "Intel Core i3 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 1650",
        "Storage": "900 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Pierre Feuille Studio",
        "Platform": "PC",
        "Game Size": "835 MB",
        "Released By": "TENOKE",
        "Version": "v3.7.7f | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7x3xt6ctvkbx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/chronique-des-silencieux-preinstalled-steamrip.jpg"
}