{
    "page_url": "https://steamrip.com/circus-electrique-free-download-1w/",
    "title": "Circus Electrique",
    "description": "Named for the greatest show in Victorian steampunk London, Circus Electrique is part story-driven RPG, part tactics, part circus management, and completely enthralling – all with a steampunk twist. When everyday Londoners mysteriously turn into vicious killers, only the circus’ lineup of Strongmen , Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Through tactical turn-based battles, these unlikely heroes face Bobbies, British Sailors gone bad, aggressive Posh Girls, and other Victorian-era archetypes stand in their way – not to mention the occasional menacing Mime or Robobear .\nThe game’s innovative Devotion morale system affects characters’ performance not only in battles, but also for actual circus shows, dutifully managed between heroic jaunts through six sprawling districts. Despite the chaos, the show must go on! Rebuild the circus to its former greatness and beyond, recruiting and training the most talented performers coming in from all over the world. Performers ’ skill, chemistry with one another, and overall Devotion combine to determine the monetary success of a single show – and you’ll need every single spare Shilling you can get both for Amelia’s quest and to keep everyone paid and happy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/circus-electrique-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/circus-electrique-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64bit)",
        "Processor": "Intel(R) Core(TM) i5-2500 or AMD equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon HD 5770 or NVIDIA GeForce GT 740",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Zen Studios",
        "Platform": "PC",
        "Game Size": "4.1 GB",
        "Released By": "FLT",
        "Version": "Build 9415991 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/iqg4bef695lm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/circus-electrique-preinstalled-steamrip.jpg"
}