{
    "page_url": "https://steamrip.com/citizen-sleeper-2-starward-vector-free-download/",
    "title": "Citizen Sleeper 2: Starward Vector",
    "description": "The highly anticipated sequel to one of 2022’s most acclaimed RPGs, Citizen Sleeper 2: Starward Vector takes players to the Starward Belt, a richly realised, ramshackle set of habitats in an asteroid belt full of secrets, stories, and characters trying to make ends meet. Foundation\nYou are a sleeper, an emulation of a human mind housed in an artificial body. You are on the run from the corporation that made you and the gang that seeks to control you. Commandeer a ship, build a network of crew and allies, and take on challenging contracts as you seek to build a future for yourself.\nChoose a class, configure your skills and assemble your crew in unique tabletop -inspired gameplay. Your future depends on the roll of a dice, as you make difficult choices in a complex world. Reinventing the award-winning systems of Citizen Sleeper, this dice-driven RPG will satisfy both fans of the original game and new players alike.\nTo stay one step ahead of your pursuers you’ll need three things: A belt-worthy ship, a tight crew and a contract or two. The ship you stole. It’s a ragged old Rig that’s seen better days, but it’s all you’ve got. Upgrade your ship to extend its range, reach new locations and turn it from a hovel to a home.\nYour crew starts with Serafin, your fellow escapee and a rock-solid pilot. But you’ll need scrappers, engineers and all sorts to take on the work that’ll keep you flying. From temporary contractors to new residents of the Rig, each of these characters has their own story, skills and troubles. Choose carefully.\nContracts take place far from the bars and shops of the Belt’s many hubs . These high-risk jobs each have their own challenges. From exploring treacherous derelicts and risky heists, to asteroid surveying and ship repair, you’ll need to make the most of your skills, crew and resources to complete the contract and get paid.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/citizen-sleeper-2-starward-vector-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/citizen-sleeper-2-starward-vector-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Requires a 64-bit processor and operating system",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible GPU",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Jump Over The Age",
        "Platform": "PC",
        "Game Size": "460 MB",
        "Released By": "RUNE | Ty Ice_Queen (csrin)",
        "Version": "Build 17185937 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/liaof1cf91h4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/citizen-sleeper-2-starward-vector-preinstalled-steamrip.jpg"
}