{
    "page_url": "https://steamrip.com/city-bus-manager-free-download/",
    "title": "City Bus Manager Directly Download",
    "description": "Build your own depot from scratch and create your personal bus routes in City Bus Manager . Play in your own hometown or any famous city in the world. Recreate the official bus network or change it completely to your preference. Until Then\nDid you ever think your local bus schedule sucks? This is your chance to show that you can step it up. Connect all the Points of Interest and see your passenger numbers grow. Buy new buses and hire staff to make sure you can keep up with your schedule.\nTake care of your buses in the repair and washing stations to make sure they meet your customers’ demands. Build a Service Center to sell tickets directly at your depot and engage with your clients. Get the best passenger reviews and lead your bus company to a prosperous future\nWhether its your home town or any world-famous city – it’s in the game. 100% based on actual OpenStreetMap data including all the specific Points of Interests. The passenger simulation and bus route travel time is also based on real data. Recreate the existing lines or come up with completely new set-ups, it’s all up to you\nBuild everything that a good running bus depot needs. Parking slots, garages, warehouses , maintenance and washing stations are needed to take care of your vehicle fleet. But you also need offices, restrooms and a kitchen to take care of your staff. Also don’t forget about the Service Center to sell tickets and connect with your customers. Choose from different environmental objects and furniture to match the depot to your style.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/city-bus-manager-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/city-bus-manager-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Win 7 / 8.1 / 10 / 11 (64Bit)",
        "Processor": "Prozessor Quad Core CPU with min 2.6 GHZ",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce 760 or similar",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "PeDePe GbR",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v2.1.17 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cli76ndb74ug"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/city-bus-manager-preinstalled-steamrip.jpg"
}