{
    "page_url": "https://steamrip.com/clair-obscur-expedition-33-free-download/",
    "title": "Clair Obscur: Expedition 33",
    "description": "Once a year, the Paintress wakes and paints upon her monolith. Paints her cursed number. And everyone of that age turns to smoke and fades away. Year by year, that number ticks down and more of us are erased. Tomorrow she’ll wake and paint “33.” And tomorrow we depart on our final mission – Destroy the Paintress, so she can never paint death again. Dolls Nest\nWe are Expedition 33.\nClair Obscur: Expedition 33 is a ground-breaking turn-based RPG with unique real-time mechanics, making battles more immersive and addictive than ever. Explore a fantasy world inspired by Belle Époque France in which you battle devastating enemies.\nIn this evolution of JRPGs , real-time actions enhance the heart of turn-based combat. Craft unique builds for your Expeditioners that fit your playstyle via gear, stats, skills, and character synergies. Open an active dimension in combat – dodge, parry, and counter in real time, chain combos by mastering attack rhythms , and target enemy weak points using a free aim system.\nWith only one year left to live, join Gustave , Maelle, and their fellow Expeditioners as they embark upon a desperate quest to break the Paintress’ cycle of death. Follow the trail of previous expeditions and discover their fate. Get to know the members of Expedition 33 as they learn to work together against impossible odds.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/clair-obscur-expedition-33-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/clair-obscur-expedition-33-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-8700K / AMD Ryzen 5 1600X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 6 GB / AMD Radeon RX 5600 XT 6 GB / Intel Arc A380 6 GB",
        "DirectX": "Version 12",
        "Storage": "55 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Sandfall Interactive",
        "Platform": "PC",
        "Game Size": "39.7 GB",
        "Released By": "RUNE emu",
        "Version": "v57069 | Full  + OST + Deluxe Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/YeF16N",
        "https://datanodes.to/guhcaxla2p2y/Clair-Obscur-Exp-33-SteamRIP.com.rar",
        "https://buzzheavier.com/g72c37ea4be1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/clair-obscur-expedition-33-preinstalled-steamrip.jpg"
}