{
    "page_url": "https://steamrip.com/classified-france-44-free-download-c1/",
    "title": "Classified: France ’44",
    "description": "Classified: France ‘44 is a new turn-based strategy game, set in World War II during the desperate months leading up to the Allied invasion of France in June 1944.\nTake charge of a special-ops team of Allied commandos and French resistance fighters. Recruit elite operatives to build your squad, then engage in a sweeping campaign of sabotage and destruction. Deal with competing factions to build the resistance network and strike at German targets deep in occupied territory. However, the more chaos you cause, the more you’ll draw the merciless attention of the Gestapo secret police.\nIn exciting missions inspired by the exploits of the Allies and French, the game expands on turn-based tactical concepts, bringing authentic World War 2 combat to life. The campaign allows for multiple playthroughs that are different each time. For those who really want to test their skills, our rich Mission Creator tool allows players to create, share and download custom missions . In Classified: France ‘44’s unique morale system, every shot taken affects you or your enemies. Suppress and break your opposition, giving you a brief window to flank your cowering targets and finish them off. Worms Armageddon\nUse stealth tactics to eliminate key targets and start the fight on your terms. However, the more kills you make, the more enemies will begin to suspect that something’s wrong, so be ready to unleash your ambush before they sniff you out\nAn authentic and characterful mix of heroes will be yours to choose from, each with their own story to tell. Train, customise and equip them with your growing arsenal of skills and weapons. Raise the morale of your team by spending time around the campfire, and learning about their lives as they fight across the war-ravaged fields of occupied France .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/classified-france-44-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/classified-france-44-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-6600 or AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660, 2 GB or AMD Radeon HD 7850, 2 GB or Intel Arc A380, 4 GB",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Absolutely Games",
        "Platform": "PC",
        "Game Size": "13.4 GB",
        "Released By": "RUNE",
        "Version": "Build 13577128 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LVb1EW",
        "https://megadb.net/435h4f1wb11o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/classified-france-44-preinstalled-steamrip.jpg"
}