{
    "page_url": "https://steamrip.com/class-of-09-the-re-up-free-download-c1/",
    "title": "Class of ’09: The Re-Up Directly Download",
    "description": "It’s not a sequel, it’s not a remaster , it’s The Re-Up! A new serving of story stems parallel to the first critically acclaimed Class of ’09, the interactive sitcom you never knew you needed. Just like the first game: all based on real events, encounters, and personalities experienced by the lead developer. Kingdom Come: Deliverance\nAll of the original cast featuring Elsie Lovelock , Kayli Mills, Kira Buckland, and many more, return to combine for the greatest voiceover performance in gaming to date (yes I dare you to find something better, you won’t). From double entendre to the darkest of humor, all 5,000+ lines of dialogue were carefully tailored to present premiere comedic performance and cultural accuracy.\nNicole makes her triumphant return as the most socially realistic female protagonist to ever graze video games. Delve into even more of her toxic realities sewn together by the darkest of humor as you navigate through 7 different endings, each more poignant than the last.\nAll wrapped in a late 2000’s aesthetic that’s not just a phase, it’s a movement. Plus bonus content upon 100% completion of the game",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/class-of-09-the-re-up-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/class-of-09-the-re-up-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows Vista or higher",
        "Processor": "2.0 GHz Core 2 Duo",
        "Memory": "2 GB RAM",
        "Graphics": "Open GL 2.0 or DirectX 9.0c",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, RPG, Simulation",
        "Developer": "SBN3",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11301186 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0vlrtoi240xs",
        "https://buzzheavier.com/zyzab0twbgkx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/class-of-09-the-re-up-preinstalled-steamrip.jpg"
}