{
    "page_url": "https://steamrip.com/clem-free-download-c1/",
    "title": "CLeM Directly Download",
    "description": "You awaken in a cold, dimly lit room, your senses slowly adjusting to the surroundings that, oddly, feel familiar. A strange sensation lingers in you, reminding you that something is not quite right. As you find your bearings, your attention is drawn to a peculiar item on the ground. A notebook labeled “CLeM” lies before you. As you delve into its pages, covered with intricate sketches of insects accompanied by vague symbols, you find a note containing a cryptic message: “Bring me BEAUTY .” Lost in deciphering the contents, a voice interrupts your focus.\nPuzzles intertwine with exploration, weaving a unique narrative experience we call “ Puzzlevania ” with a shadowy story to unravel and countless challenges to overcome. Craft magic toys to unveil hidden secrets, access unreachable spots, and reclaim items from the past as you uncover new revelations in familiar spaces. Investigate a seemingly desolate house accompanied only by an obscure voice and a notebook full of annotations and drawings on alchemy, insects, and other creepy crawlies. killer7",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/clem-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/clem-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core 2 Duo",
        "Memory": "4 GB RAM",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Mango Protocol",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "SKIDROW",
        "Version": "Build 12743847 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rt7dsi48awas"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/clem-preinstalled-steamrip.jpg"
}