{
    "page_url": "https://steamrip.com/clownfield-2042-free-download-y1/",
    "title": "Clownfield 2042 Directly Download",
    "description": "Clownfield 2042 game for free instantly and play pre-installed on SteamRIP\nClownfield 2042 is an FPS where you take a role of unique soldier, equipped with enough arsenal to fight anyone ahead and win the front. After 2022 crypto-crash caused by NFT’s, majority of nations collapsed and a union of “No-Clowns” has been formed. You are one of them, arm up and get ready for war.\nThe next generation of fan favorites All Out Clownfare is here. Experience the most intense fight against real players and highly skilled artificial intelligence with variety of arsenal and maps. Choose a side or be a lone wolf, the choice is yours. Currently available in three game modes (DM, TDM & Domination) with five maps.\nAdditional locations, weapons and skins are on the way. So, what are you waiting for, clownito? Why play the game like its meant to be played when you can hop into hovercraft and slay all your enemies? Disrupt the game physics, break the rules of gameplay and enjoy the broken and unoptimized experience ever. Ever dreamed about a gateway where you can be just by yourself? Let Them Come\nLook no further, our classic gateway mode is making to Clownfield 2042! Set the single player experience to whatever you want it to be, turn the mediocre weather on with ultra-4k-high-poly-big-boom-over-realistc Tornado. Trust me, you (won’t) be disappointed.",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "8 Core",
        "Memory": "4 GB RAM",
        "Graphics": "8 GB",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Edmund McMillen, James Interactive, Ridiculon",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10236124 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hhpise08vcy4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/clownfield-2042-preinstalled-steamrip.jpg"
}