{
    "page_url": "https://steamrip.com/cocoon-free-download-1j/",
    "title": "COCOON",
    "description": "From Jeppe Carlsen, the lead gameplay designer of LIMBO and INSIDE — COCOON takes you on an adventure across worlds within worlds. Master world-leaping mechanics to unravel a cosmic mystery. COCOON is a unique take on the puzzle adventure genre, where each world exists within an orb that you can carry on your back.\nWrap your head around the core mechanic of leaping between worlds—and combine, manipulate, and rearrange them to solve intricate puzzles. Interact with alien environments and biomechanical devices left behind by an ancient civilization. Fate/Samurai Remnant\nJourney through unique and diverse biomes, from industrial structures to massive organic caverns, and discover how they are connected to one another. Each orb has an ability that can be unlocked, thereby turning the orb into a unique tool for you to utilize within other worlds. Use these abilities to uncover hidden pathways and objects, fire projectiles to trigger switches, and more.\nMighty guardians protect every world, and you must face them in fierce battles . Each fight is unique and requires you to master new and satisfying mechanics.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/cocoon-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/cocoon-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-2600 or AMD FX-8350",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950, 2 GB or AMD Radeon R9 380, 4 GB",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Geometric Interactive",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "FLT",
        "Version": "Build 12353675 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yzo484id55ay"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/cocoon-preisntalled-steamrip.jpg"
}