{
    "page_url": "https://steamrip.com/code-vein-free-download/",
    "title": "CODE VEIN",
    "description": "Team up with an AI partner or a friend in co-op multiplayer and venture out into a world of destruction in this story driven connected dungeon experience. Use your combined strength to coordinate your approach and defend each other from surprise attacks or tackle overpowered enemies. Yarimono\nGREATER CHALLENGES BRING GREATER REWARDS Acquire new gear, level up your character, and become more powerful to rise up against the Lost. From new players to seasoned action game veterans , the challenges in CODE VEIN will keep you coming back for more.\nCUSTOMIZE YOUR REVENANT Choose from various weapons such as bayonets, axes, spears, and more. Enhance your character’s abilities with powerful Blood Code enhancements, each with access to various “Gifts” that can increase your strength, weaken enemies, and can allow you to utilize new weapon abilities or access overpowered attacks. Finish off your opponents with your Blood Veil, powerful blood draining tools, each with their own unique visual and attack style that opens up a myriad of new combat strategies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/code-vein-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/code-vein-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 SP1 or Windows 10 (64-bit)",
        "Processor": "Intel Core i5-2300",
        "Memory": "6 GB RAM",
        "Graphics": "GeForce GTX 760 or Radeon HD 7850",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Bandai Namco Studios",
        "Platform": "PC",
        "Game Size": "34.5 GB",
        "Released By": "RUNE",
        "Version": "v1.53.61787 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Z9G6C4",
        "https://buzzheavier.com/nwte63ywpuba"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/code-vein-preinstalled-steamrip.jpg"
}