{
    "page_url": "https://steamrip.com/colony-survival-free-download-1u/",
    "title": "Colony Survival",
    "description": "Both colonists and monsters can find their way in your world. Build bridges, tunnels, stairs, overpasses and underpasses to make sure your colonists get where they want to go, and monsters don’t! Plant a banner to start your colony. As you recruit more colonists, more monsters will try to invade your colony\nBuild walls, dig moats and construct forts to deal with the increasing threat. Use an extensive science system to unlock jobs, blocks, upgrades and new weapons! Your colony will start small, with a couple of berry farmers, slingers and a copper miner. Expand your colony and start using new metals like bronze, iron and steel. Producing them will require new fuels like charcoal and cokes. Vin Diesel Wheelman\nUse more advanced metals to unlock crossbows and matchlock guns for your guards! Add wheat farmers, bakers, flax farmers, tailors and many other jobs to your colony. Large, advanced colonies are able to unlock the glider and Colony Starter Kits, allowing them to settle new lands. Take to the sky and explore a world with multiple continents and biomes. Start a colony in far-off lands to get access to new jobs, crops and resources.\nEasily launch a co-op server from the main menu, and invite friends to join your world. Share ownership of a single colony with multiple friends, or build your own colonies and trade items and science. It’s also possible to use our advanced server tool to set up a more complex system. Extensive mod support allows players to customize their experience exactly as they want.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/colony-survival-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/colony-survival-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista SP1 & newer, 64-bit",
        "Processor": "Intel Pentium G620 (2.5 Ghz dual core) or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "Intel HD Graphics 5000, 1280×720 display",
        "DirectX": "Version 11",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy, Early Access",
        "Developer": "Pipliz",
        "Platform": "PC",
        "Game Size": "112 MB",
        "Released By": "HLM",
        "Version": "v0.9.1.9 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a2irg3u002pb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/colony-survival-preinstalled-steamrip.jpg"
}