{
    "page_url": "https://steamrip.com/commonhood-free-download-1v/",
    "title": "Common’hood Directly Download",
    "description": "Common’hood is a community building and economy management game with highly customizable base building tools. Scavenge for materials, build a home, grow your own food, research new technology, craft new tools, build a new family. Form your community and take it from surviving to thriving Build a thriving community by growing food, crafting shelters, workshops , and eventually high-tech manufacturing facilities. Your workshop gives you access to unique creation materials where every detail is in your hand Your settlers will have needs and aspirations. Doors: Paradox\nTake them from poverty and misery to becoming key members of a wholesome community. Use the large range of building stations to develop unique automated technology. Once the robots start doing the hard work, sit down and relax and see things grow. Grow a self-sustaining food supply out of a variety of crops, regaining food autonomy in the process Food items will give you access to a large range of cooking recipes to make your settlers happy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/common-hood-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/common-hood-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7 (latest SP) or later",
        "Processor": "2.6 GHz Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce 220 / ATI Radeon HD 3870 or better",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Plethora Project",
        "Platform": "PC",
        "Game Size": "2.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hliz30ffvvet"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/common-hood-preinstalled-steamrip.jpg"
}