{
    "page_url": "https://steamrip.com/commandos-origins-free-download/",
    "title": "Commandos: Origins",
    "description": "ALARM! You have been selected for a mission which will shape the fate of the entire world. Witness the very beginning of the legendary elite WWII force in Commandos : Origins. The long-awaited sequel to the Commandos series brings you right back to the foundation of the real-time tactics genre. And to the days where Jack O’Hara, the Green Beret, and his five companions met to form the infamous unit sent to complete missions which no others would dare to accept. Sephiria\nIn the hushed shadows of history’s most pivotal moments, where heroes are born and legends are forged, a new chapter awaits. Whether it is a daring raid, a covert sabotage, or a courageous rescue mission – the Green Beret, the Sapper, the Sniper, the Driver, the Marine and the Spy will need to combine their skills to meet the most challenging tasks. Your mission can only be achieved through well-thought planning and the smart combination of stealth and destruction that come with the unique skillsets of this elite troop .\nFrom the icy plains of the Arctic to the vast deserts of Africa , from the western coastlines of Europe to the Eastern front, it’s up to you to lead your commandos to success in high-risk missions. Guide them in their fight against the growing Nazi occupation which is menacing the free world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/commandos-origins-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/commandos-origins-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "i5-4690K / Ryzen 7 2700",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 970 / Radeon RX 580",
        "DirectX": "Version 11",
        "Storage": "31 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Claymore Game Studios",
        "Platform": "PC",
        "Game Size": "12.4 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0.74101 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/YXtQz7",
        "https://buzzheavier.com/d4v4i6mpubek"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/commandos-origins-preinstalled-steamrip.jpg"
}