{
    "page_url": "https://steamrip.com/company-of-heroes-2-free-download-1j/",
    "title": "Company of Heroes 2 Download",
    "description": "Powered by the Essence Engine 3.0, the Company of Heroes 2 series feature some unique mechanics rewarding thoughtful players. From the TrueSight system that emulates the units’ line of sight to the cover-system that encourages clever unit placement – not to mention the combined arms approach and the hard and soft counters gameplay that will make you think twice before trying to destroy a tank with a simple squad of riflemen – each game presents players with an uninterrupted stream of meaningful tactical choices that can turn the tide of war.\nThe Company of Heroes 2 base game gives you access to two multiplayer armies from the Eastern Front: the Red Army (SOV) and the Wehrmacht Ostheer (GER). It also comes with a gritty single-player campaign that will give you a chance to familiarize yourself with the series core tenets. Step into the boots of a Soviet commander of the Red Army, entrenched in brutal frontline warfare to free Mother Russia from the Enemy invaders\nAdjust your tactics to take into account the brutal weather conditions and wield the might of the Soviet Empire as you smash your way to Berlin. Company of Heroes 2: The Western Front Armies adds two new factions from the Western Front to the roster of playable multiplayer armies: the Oberkommando West (OKW) and the US Forces (USF). While the former puts you in charge of an aggressive and powerful army with very specialized and elite units – yet in very limited numbers – the latter introduces an expeditionary corps that allows for a variety of approaches and very powerful combined arms tactics, but which inevitably falls a bit short in the heavy armor department.\nCompany of Heroes 2: Ardennes Assault offers a compelling single-player campaign for the USF faction revolving around the Battle of the Bulge. Engage in a dynamic non-linear campaign across the Ardennes landscape consisting of 18 scenarios, choose between three iconic companies, customize their abilities and bear the consequences of your actions as overall company health persists between missions.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/company-of-heroes-2-master-collection-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/company-of-heroes-2-master-collection-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-4130 | AMD FX-8350",
        "Memory": "2 GB RAM",
        "Graphics": "512MB Direct3D 10 capable video card (GeForce 8800 GT or Radeon HD 2900XT)",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Relic Entertainment",
        "Platform": "PC",
        "Game Size": "25.6 GB",
        "Released By": "CODEX (cs.rin.ru)",
        "Version": "v4.0.0.23391 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/F5E530F91B",
        "https://buzzheavier.com/uoycnaufir32",
        "https://1fichier.com/?gpy8inuua5ki9r86w4y1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/company-of-heroes-2-master-collection-preinstalled-steamrip-1.jpg"
}