{
    "page_url": "https://steamrip.com/company-of-heroes-3-free-download-c1/",
    "title": "Company of Heroes 3",
    "description": "Company of Heroes 3 is out now! Bigger and better than ever, CoH3 is bringing its acclaimed mix of action, tactics, and strategy to millions of fans across the world. Immerse yourself in two epic campaigns, four unique multiplayer & co-op factions, and a breathtaking new theatre spanning from the sweeping deserts of North Africa to the rolling hills of Italy. Join the Fight with new features such as Full Tactical Pause and our Dynamic Campaign Map enable you to take complete control of the battlefield. LEGO 2K Drive\nThe legendary strategy franchise is back Company of Heroes 3 is the ultimate package of action, tactics and strategy. Take charge in the heat of real-time battle , then command as a General guiding the overall campaign where every decision matters.\nOverwhelm your opponents with four unique factions and all-new international Battlegroups. Command ground, air and naval forces and build supply lines to crush enemy advances on the new Dynamic Campaign Map – no two playthroughs are ever alike! Play at your own pace across campaign and skirmish modes before diving into blistering multiplayer action. Discover the untold stories of a stunning Mediterranean theatre featuring next-generation destructible environments, all powered by Relic’s proprietary Essence Engine .\nCompany of Heroes 3 delivers the next generation of acclaimed tactical gameplay. Beloved combat mechanics collide with authentic new gameplay features, making for the deepest tactical experience to date. ​ Make use of daring flanking moves to expose enemy side armor, experience all new infantry breaching mechanics allowing you to flush enemy units from their garrisons, and master elevation to enhance your line of sight and gain the upper hand.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/company-of-heroes-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/company-of-heroes-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5 6th-gen or AMD Ryzen desktop processor with 4 cores @3GHz, or equivalent performance",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950, AMD Radeon R9 370, or equivalent performance",
        "DirectX": "Version 12",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "Relic Entertainment",
        "Platform": "PC",
        "Game Size": "24 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.4.2.21612 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/yyZUAi",
        "https://buzzheavier.com/vhgvk58vy3g2",
        "https://1fichier.com/?dfsogfuheno0k85z068r"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/company-of-heroes-3-preinstalled-steamrip.jpg"
}