{
    "page_url": "https://steamrip.com/conquest-dark-free-download/",
    "title": "Conquest Dark",
    "description": "237 years after the Black Planet’s arrival , humanity stands on the brink of annihilation. The undead armies have laid waste to the kingdoms of mankind, the Cosmic Gods have fallen, and the Primordial Ones have awakened from their ancient slumber. Now, champions and criminals alike perform Dark Rituals to face the very forces that brought civilization to its Human Fast Food\nMASTER THE DARK RITUALS Venture into haunting environments where cosmic horror meets primal savagery. Choose your path from legendary classes like the untamed Barbarians of the Lion, the divine Oathkeepers, or the mysterious Acolytes of Kuu, each mastering unique powers against the darkness .\nINSTANT ACTION RPG GRATIFICATION Unlock your power fantasy through intense Ritual runs. Begin as a feeble grunt and discover devastating builds as you progress. Every Ritual delivers the satisfying progression curve of an ARPG in concentrated form, each run bringing you closer to legend status.\nFORGE GODSLAYING BUILDS Discover eldritch abilities, equip legendary armor, and wield unique weapons from fallen champions. Enhance your arsenal and craft builds worthy of slaying gods. Theory-craft your way to godhood with deep customization and endless possibilities.\nCONQUER THE DARKNESS Battle through diverse environments filled with unique challenges and fearsome mini-bosses. Face deadly creatures, undead armies, and fallen heroes in your quest to uncover the secrets of The Black Planet.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/conquest-dark-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/conquest-dark-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit or newer",
        "Processor": "Intel Core i5-4590 OR AMD FX-9590",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce GTX 1050 or AMD Ryzen 3 1200",
        "DirectX": "Version 10",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Early Access",
        "Developer": "Eldritch Sword Games",
        "Platform": "PC",
        "Game Size": "308 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v0.16.1 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ye07zat1tk6o",
        "https://buzzheavier.com/586sljcg2tvc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/conquest-dark-preinstalled-steamrip.jpg"
}