{
    "page_url": "https://steamrip.com/contractville-free-download/",
    "title": "ContractVille",
    "description": "Deep content. Diverse missions. Thoughtful design. Welcome to ContractVille. In Port Town, you start your journey with almost no money. Take on some work from the neighborhood and earn a modest income. Together with your friends, establish a business with up to 4 members. Enjoy the open world in Creek Harbour. Accept a contract mission or buy a ruin. Engage in construction across small, medium, and large plots. Pick up your sledgehammer and get to work. Rise of Industry 2\nDig the soil with your shovel, prepare the cement , add reinforcement, and lay the bricks and tiles. Then move on to the interior construction of the house. Plaster, paint. Lay the floor tiles.\nMany choices and customizations await you. You can paint the walls the color you want and choose the pattern of the floor tiles.\nCustomize your home’s appearance from top to bottom — roof, balcony , porch, and even the garden. It’s all in your hands.\nComplete entire construction projects from the ground up. Once finished, furnish and decorate them to your taste — or put them up for auction and turn your work into profit.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/contractville-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/contractville-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "AMD Ryzen 5 1600 / Intel Core i5-8400",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX-Vega 64 / GeForce GTX 1080",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "MYM Games Studios",
        "Platform": "PC",
        "Game Size": "7.4 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/QMWwXx",
        "https://buzzheavier.com/m2w4o8u29idx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/contractville-preinstalled-steamrip.jpg"
}