{
    "page_url": "https://steamrip.com/convergence-a-league-of-legends-story-free-download-v1/",
    "title": "CONVERGENCE A League of Legends Story",
    "description": "Traverse the sprawling city of Zaun as Ekko, a young inventor with a device to rewind time. He and his friends must work together to keep their city safe, but as danger looms and secrets come to light, Ekko realizes he can’t trust anyone—not even himself. The Legend of Zelda: Tears of the Kingdom\nDeveloped by Double Stallion Games, CONVERGENCE: A League Of Legends Story is a story-driven, single-player 2D action platformer featuring dynamic combat and unique exploration opportunities thanks to Ekko’s ability to travel through space and time. Rewind your actions to learn from your mistakes and outsmart each new enemy. Will it be enough to save Zaun’s future?\nCONTROL TIME Activate Ekko’s Zero Drive to turn back time. Then, use your knowledge of the future to adapt your approach to any challenge and get the jump on your enemies. Fluid, dynamic combat rewards precise timing and positioning.\nDISCOVER ZAUN Run, leap, and slide your way through the streets of Zaun. Meet champions, face down enemies, and locate never-before-seen sides of the Undercity.\nBATTLE CHAMPIONS Encounter League of Legends champions like you’ve never seen them before. Unlock new abilities and face rivals in a series of explosive battles to learn who’s with you, and who’s against you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/convergence-a-league-of-legends-story-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/convergence-a-league-of-legends-story-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-2300 @2.80 GHz (4 cores), AMD FX-4350 @4.20 GHz (4 cores)",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 550 Ti (1 GB), Radeon HD 5770 (1 GB), Intel UHD  730",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Double Stallion",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "RUNE emu",
        "Version": "va7e37f30e71 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u1ces7socy74"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/convergence-a-league-of-legends-story-preinstalled-steamrip.jpg"
}