{
    "page_url": "https://steamrip.com/cookie-cutter-free-download-c1/",
    "title": "Cookie Cutter",
    "description": "The Void. The Matter. The Megastructure. A dystopian world with an egomaniac leader determined to unveil the secrets of the universe. INFONET promised a utopia built on the backs of tireless androids called Denzels. It was a lie. Ghostrunner 2\n200 years later the planet is decaying and the mysterious Red Seed has been stolen. Raz, a renegade mechanic, searches a hidden lab and discovers the Denzel Cherry, butchered and left for dead, clinging to life by sheer will alone. Her creator—and the love of her life, Doctor Shinji Fallon—has been taken by a demented sicko and Cherry intends to make him—and anybody or anything who gets in her way—pay.\nFueled by love and powered by rage, join Cherry on a blood-soaked quest for revenge as she explores the massive Megastructure and eviscerates the armies of INFONET in an unforgettable over-the-top 2D platformer that breaks tropes and bones.\nCookie Cutter is unabashedly irreverent, violent , and risqué. Become Cherry, a badass android on a rage-filled and love-driven quest. To save her beloved creator she’ll explore and fight her way through a unique illustrated sci-fi dystopian world as she chainsaw-murders anybody who stands in her way.\nEvery frame of this immersive experience is drawn by hand with copious amounts of love. That means epic, fall-out-of-your-chair visuals. Grotesque bugs and menacing robots. Gargantuan bosses. Ridiculous weapons, special moves, and brutal gory finishers. All of it brought to life with benchmark 2D animation .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/cookies-cutter-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/cookies-cutter-screenshots-steamrip.jpg"
    ],
    "system_requirements": {},
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Subcult Joint LTD",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 17680734 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sc2grurhip0n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/cookies-cutter-preinstalled-steamrip.jpg"
}