{
    "page_url": "https://steamrip.com/core-keeper-free-download-1y/",
    "title": "Core Keeper",
    "description": "Drawn towards a mysterious relic, you are an explorer who awakens in an ancient cavern of creatures, resources and trinkets. Trapped deep underground will your survival skills be up to the task? Mine relics and resources to build your base, craft new equipment, survive , and power up the Core.\nDefeat giant monsters , discover hidden secrets, farm crops, cook new recipes and explore a procedurally generated underground world in a mining sandbox adventure for 1-8 players. Explore a vast underground cave of endless resources. Mine ores , discover hidden crystals, fossils & trinkets and survive a procedurally generated underground world. Delve into living biomes and fight cavernous creatures in a vast subterranean system.\nScour the dark world around you and encounter the behemoths of the underground . Defeat them and take the spoils of victory to help uncover the mystery of the Core. Customise your character and craft new items, armour and equipment to venture further into the caves. Craft a pickaxe to mine walls and resources, build bridges to cross underground lakes, and place torches to light up the profound ever-present darkness .\nTend your crops to grow a variety of plants by planting seeds found during your adventures . Find the perfect fishing spot and catch a plethora of unique fish. Combine the yield of your hard work farming and fishing in the cooking pot to discover delicious recipes with unexpected effects. Have A Nice Death",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/core-keeper-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/core-keeper-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i3-6100 3.70GHz / AMD A4-4020 APU with Radeon 3.2 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX950"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG",
        "Developer": "Pugstorm",
        "Platform": "PC",
        "Game Size": "409 MB",
        "Co-op By": "Goldberg/0xdeadc0de",
        "Version": "v1.1.2.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/4Fn70e",
        "https://megadb.net/z4sc12bojxa4",
        "https://buzzheavier.com/9adzjt8e2z2w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/core-keeper-preinstalled-steamrip.jpg"
}