{
    "page_url": "https://steamrip.com/coromon-free-download-1v/",
    "title": "Coromon Direct",
    "description": "The sun begins to dawn on Velua, a new day for the world and a new day for you, a freshly minted Battle Researcher of the global research society known as Lux Solis. It’s your first day and everything goes smoothly until a mysterious force attacks your latest workplace. Build up a squad of Coromon, track down the invaders, and grapple with a rising threat that endangers everyone on Velua Coromon is all about taming the eponymous wildlife and challenging the rest of the world: other wildlife , trainers, or titanic bosses\nBuild a team from more than 100 charming creatures, defined by their elements, traits, and skills. Catch, train then set them loose on your rivals The first day at Lux Solis is just the first step in a much greater adventure. Soon you’ll be thrust into a story grand in scope and great of importance, as a mysterious, alien threat emerges. It’s up to you to help Lux Solis put a stop to their dastardly designs. Green Hell\nWe’re honored to be able to provide Coromon to you, a game we’ve poured our heart into. Coromon is our tribute to the classics of this RPG sub-genre. While staying loyal to the core gameplay, we wanted to add new features but also keep the iconic retro look, with a modernized pixel art style.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/coromon-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/coromon-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "1.0 GHz",
        "Memory": "1 GB RAM",
        "Graphics": "OpenGL 2.1 or higher",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "TRAGsoft",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.3.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1yiipm7glpe8",
        "https://buzzheavier.com/1ydvzila438z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/coromon-preinstalled-steamrip.jpg"
}