{
    "page_url": "https://steamrip.com/cosmoteer-starship-architect-commander-free-download-1p/",
    "title": "Cosmoteer Starship Architect & Commander Directly Download",
    "description": "A starship builder perfect for fans of games like FTL, Starsector, SPAZ, Space Engineers, Escape Velocity, Avorion, and more. Design awesome starships using intuitive ship creation tools that are easy to learn but hard to master. Fully customize your ship’s shape and floor plan, choosing where to place individual modules including weapons , engines, hallways, and crew’s quarters. Sackboy: A Big Adventure\nYour ship’s design is key to its survival , and every decision you make will impact its performance in battle. Easily share your designs with others through the Steam Workshop, Forums, and Discord. A ship’s crew is its lifeblood.\nNumbering from half-a-dozen to a thousand or more individually-simulated people, your crew will pilot your ship, operate its weapons, and carry munitions . How efficiently they operate determines how well your ship will perform in combat. Your crew are autonomous but you can optionally customize their behavior with specific roles and job priorities. Command your ship or fleet in real-time tactical battles .\nCombat is physics-driven, explosive, and immensely satisfying . Each module can be individually targeted and destroyed, and whole ships can even break apart into multiple pieces. Target an enemy’s weapons to eliminate its offensive capability, destroy its shields to lower its defenses, or go for the kill by taking out its reactor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/cosmoteer-starship-architect-commandder-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/cosmoteer-starship-architect-commandder-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "32-bit or 64-bit Microsoft Windows 7, Windows 8.1 or Windows 10",
        "Processor": "Dual-core Intel 2.0 GHz (or AMD equivalent)",
        "Memory": "4 GB RAM",
        "Graphics": "1GB DirectX 9  Card or better",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Walternate Realities",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.24.0a | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/926gdmgggfkp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/cosmoteer-starship-architect-commandder-preinstalled-steamrip.jpg"
}