{
    "page_url": "https://steamrip.com/cosmic-cube-free-download-q1/",
    "title": "Cosmic Cube Free",
    "description": "Cosmic Cube Download PC Game In Direct Link for free on SteamRIP\nThis is a refreshing horizontal version of the act game, which is still under production and has completed a simple trial version of the first level. It combines combo skills, perfect defense upgrade and other elements. What you want to see will be updated later Examples including the Skulls (creators of the Cube that would eventually evolve into the Shaper of Worlds), and various other, unnamed civilizations (whose Cubes were gathered/stolen by unknown means by the Magus in the Infinity War story arc and the Goddess in the Infinity Crusade story arc).\nThese matrices —which may or may not actually be shaped like a Cube—are suffused with reality-warping energies of unknown composition that comes from the realm of the Bounders. Unknown to almost everyone in the Marvel Universe, including its creators , the nature of the mysterious energies are such that, after a sufficient but undefined period of time, the matrix will become self-aware and evolve into an independent, free-willed being still possessed of the original Cube’s tremendous powers; the new being’s overall personality is psychically imprinted with the beliefs, desires, and personalities of those who wielded it as a Cube immediately destroyed a large portion of the galaxy that it was located in once it became sentient).",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/cosmic-cube-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/cosmic-cube-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows7, Windows8, Windows10",
        "Processor": "Core i3,i5,i7,E3,AMD",
        "Memory": "2 GB RAM",
        "Graphics": "GT 820M",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Arigatonasu, GHS Game",
        "Platform": "PC",
        "Game Size": "350 MB",
        "Repack By": "GOG",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3E"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/cosmic-cube-free-download-preinstalled-steamrip.jpg"
}