{
    "page_url": "https://steamrip.com/couch-combat-free-download-o1/",
    "title": "Couch Combat",
    "description": "Grab a gun and be the last one standing in fast, frantic rounds. Play on over 30 stages with a variety of elements and unique mechanics. A unique modifier system will continuously stack modifiers which increase the chaos every round with new mechanics, effects, and items. Play with up to 4 players locally as you ruin friendships to claim victory! Short rounds make for great party gameplay where you can hand off controllers to others. Also supports Steam Remote Play Together, where you can play with friends online. Project Downfall\nFeaturing classic FPS staples like the pistol or AK-47 alongside weapons like the BOOMER , a 2d pixelated shotgun. In Classic Mode, you get to vote on modifiers which stack up and build the chaos of the game. And after several rounds of building chaos, you face off in a Ridiculous Round with a unique, bigger modifier. After this, all modifiers reset and you get to do it all over again. In Arcade mode, you get to choose all the stages, guns, and modifiers that you want to play with.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/couch-combat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/couch-combat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 64-bit",
        "Processor": "Intel Core i3",
        "Memory": "2 GB RAM",
        "Graphics": "GTX 580 or equivalent",
        "Storage": "168 MB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "ButWhyLevin",
        "Platform": "PC",
        "Game Size": "122 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.05 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/80vxwh2ev1m9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/couch-combat-preinstalled-steamrip.jpg"
}