{
    "page_url": "https://steamrip.com/crab-god-free-download/",
    "title": "Crab God",
    "description": "Become the Guardian of the Abyss and lead the Great Migration to bring forth the next Crab God 🦀 Use your growing knowledge and great power to command your loveable crab babies (Crablings) to restore your ocean domain and protect your successor’s egg as you venture into the watery depths.\nGrow Your Crabling Colony Raise your Crablings Nurture their personalities and potential as they worship you, build mighty coral reefs, fend off threats, and collect food for the journey ahead. Name them. Upgrade them. Grow your unique colony and guide them with your mighty claw as they become the next generation of ocean caretakers .\nLead the Great Migration It is time for a new Crab God to rise and protect the oceans and it is your job to lead a successful migration , taking your egg to the depths where it can hatch . Balance the growth of your colony with the safety of your egg, otherwise, you will need to return to the shallows and start the migration anew.\nCultivate a Vibrant Underwater Ecosystem Reintroduce a healthy and vibrant diversity back to the ocean, and protect it from predators seeking easy prey. Varied sea life will sustain your colony. Unlock new combinations of flora and fauna to create a beautiful underwater environment. Drug Dealer Simulator 2",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/crab-god-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/crab-god-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or newer, 64-bit",
        "Processor": "AMD FX 8300 / Intel Core i3 8300",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 950 / Radeon R X 460",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation, Strategy",
        "Developer": "Chaos Theory Games",
        "Platform": "PC",
        "Game Size": "793 MB",
        "Released By": "TENOKE",
        "Version": "Build 14779201 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g0wg5gztkwfj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/crab-god-preinstalled-steamrip.jpg"
}