{
    "page_url": "https://steamrip.com/crash-bandicoot-4-its-about-time-free-download-2n/",
    "title": "Crash Bandicoot 4 Its About Time Free Download",
    "description": "Get Crash Bandicoot 4: It’s About Time for free instantly and play pre-installed on SteamRiP\nCrash Bandicoot 4: It’s About Time (Crash Bandicoot 4: It’s a matter of time) is another part of the world famous action-platformer, in which players are again invited to go on an adventure with the legendary hero named Crash Bandicoot A lot of time has passed since the moment Crash visited his last adventures, and now, now he again has to save the world. Who’s Your Daddy\nIt turns out that during this time, Dr. En-Tropic and Neo Cortex were able to escape from prison, and now they have built a new plan to take over the world. But now their goal is not one world, but all dimensions at once. And of course, only Crash and his faithful companion Coco can prevent them.\nGo on an adventure with them, go through numerous levels, test yourself and do everything possible and impossible, but save the world Well, first of all, it would be worth mentioning the changes in the world of Krzhsh Bandicoot. It’s been a long time since the last adventures, and Crash’s world has changed a lot.\nThe developers themselves declare that the world has changed a lot, and moreover, they offer to look at all the changes personally during the adventure. visually, the game itself has changed a lot. The world around looks much brighter and more realistic, beautiful, unpredictable and mysterious .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/crash-bandicoot-4-its-about-time-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/crash-bandicoot-4-its-about-time-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 and higher (x64)",
        "Processor": "Intel Core i3-4340 / AMD FX-6300 3.4 GHz",
        "RAM": "8 GB",
        "Video card": "Nvidia GTX 660 / AMD Radeon HD 7950",
        "Free space on hard disk": "23.2 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Toys For Bob",
        "Platform": "PC",
        "Game Size": "23.6 GB",
        "Released By": "Mr_Goldberg Steam emu",
        "Version": "Build 9629143 | Steam Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/DC39A172D2",
        "https://buzzheavier.com/g8f1hx6lncv0",
        "https://datanodes.to/chsvz8qb08kl/Crash-Bandicoot-4-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/crash-bandicoot-4-its-about-time-free-download-preinstalled-steamrip.jpg"
}