{
    "page_url": "https://steamrip.com/creatures-of-ava-free-download/",
    "title": "Creatures of Ava",
    "description": "Can you save a life? Welcome to Creatures of Ava, a unique creature-saver game inviting you to explore a world brimming with wild beings. Instilling joy and wonder, they provide a unique bond that enables you to utilize their skills for traversing the planet and solving environmental challenges. Once peaceful creatures, they now succumb to an unknown infection driving them to behave aggressively , which makes your mission to save them an urgent necessity.\nExploration-driven Gameplay The gameplay encourages curiosity-driven exploration of its distinct ecosystems such as the colorful Nari jungle or mysterious Mâruba swamp—creating an interconnected world. With non-aggressive combat mechanics designed for healing rather than defeating and indigenous Flute melodies that you play to tame creatures, the game further highlights the creature-saver nature of the experience. Unrooted\nMeaningful Narrative Step into the shoes of Vic, a 22-year-old nature adventurer as she navigates through the immersive expedition alongside Tabitha, a composed and astute researcher. Together, you confront the recurring infection called “the withering” by the local race of Naam threatening Ava’s inhabitants . The game’s narrative, co-created by Rhianna Pratchett, is a journey of wonder and mystery but also discovery, leading to the revelation of the planet’s captivating secrets.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/creatures-of-ava-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/creatures-of-ava-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "AMD Ryzen 5 3600 (6 core with 3,5 GHz) or Intel i5-10400F (6 core with 2,9 GHz)",
        "Memory": "16 GB RAM",
        "Graphics": "Radeon RX580 (8GB) or Nvidia GTX 1660 (6GB)",
        "DirectX": "Version 12",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Inverge Studios",
        "Platform": "PC",
        "Game Size": "9.3 GB",
        "Released By": "RUNE",
        "Version": "Build 15279045 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/bcgo7jrjcrk2",
        "https://megadb.net/wn93gl4ay4kb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/creatures-of-ava-preinstalled-steamrip.jpg"
}