{
    "page_url": "https://steamrip.com/creed-rise-to-glory-vr-free-download-z1/",
    "title": "Creed Rise to Glory Direct VR Download",
    "description": "Got what it takes to become a champion ? You are Adonis Creed, fighting toe-to-toe with the world’s top opponents to establish your boxing legacy. This intense cinematic experience features new Phantom Melee Technology for impactful VR melee combat so you can train, fight, and win like Creed.\nChallenge both your body and mind as you experience the ascent of Adonis Creed from undiscovered underdog to world-class fighter, all within an immersive universe inspired by the Creed films. Choose your path to glory in multiple games modes: store-driven Career , customizable Freeplay, or minigame-based Training.\nPvP just got a lot more personal. Choose your champion, then set up a custom fight with a friend or find your contenders in crossplay Quick Match. Precise upper-body tracking ensures each blow resonates where it lands—on both your opponent and yourself. Death in the Water 2\nPhantom Melee Technology mimics the real-life effects of throwing and taking punches in the ring, such as the out-of-body sensation of getting knocked out or the fatigue during a long, frantic bout. Play or fight the most iconic figures from the Creed and Rocky universe in Freeplay or PvP, including classic Rocky Balboa, Ivan and Viktor Drago, and more",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/creed-rise-to-glory-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/creed-rise-to-glory-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5-4590",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 | AMD R9 290X",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space",
        "VR Support": "SteamVR"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Sports, VR",
        "Developer": "Survios",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "CODEX emu",
        "Version": "Build 3499808 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/txqbu86ugcw8",
        "https://buzzheavier.com/iqjb5s8w2q7x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/creed-rise-to-glory-free-download-preinstalled-steamrip.jpg"
}