{
    "page_url": "https://steamrip.com/cricket-captain-2024-free-download/",
    "title": "Cricket Captain 2024",
    "description": "Build your own dream team in Cricket Captain 2024. The 20 Over World Cup takes centre stage at the start of the 2024 season and, with our Score Predictor making its debut, you can manage run chases and set targets with a clear indication of expectations for the match conditions. With feedback from last year’s game, and simulating thousands of matches from every situation, we have rebalanced scoring rates across the board, with focus on both First Class and limited over scoring rates and AI. Daniel Norcross brings his inimitable style to the commentary box this year, for the first time on Cricket Captain. Blockbuster Inc\nCricket Captain 2024 expands our database once again, including honours boards showing every international century and five-wicket hall across all formats at every ground. With improved filters and viewing options for the vast array of statistics accessible through the game, picking your squads and accessing records is more intuitive and responsive. All domestic systems have been updated to include the latest developments in Pakistan, West Indies and around the world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/cricket-captain-2024-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/cricket-captain-2024-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 8/10/11 64-bit",
        "Processor": "Intel 1.6Ghz Dual-Core or AMD 1.6Ghz Dual-Core",
        "Memory": "2 GB RAM",
        "Graphics": "Intel – HD 3000 Nvidia Laptop",
        "Storage": "250 MB available space"
    },
    "game_info": {
        "Genre": "Sports, Strategy",
        "Developer": "Childish Things Ltd",
        "Platform": "PC",
        "Game Size": "343 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 14639891 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sifbqhrv1p9e"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/cricket-captain-2024-preinstalled-steamrip.jpg"
}