{
    "page_url": "https://steamrip.com/crime-boss-rockay-city-free-download/",
    "title": "Crime Boss: Rockay City Directly Download",
    "description": "Welcome to the 90’s Rockay City! Heist, loot and shoot your way to the top of the criminal underworld ! Build your criminal empire in the singleplayer rogue-lite campaign or put together a crew with your friends in action-packed co-op multiplayer heists Hidden Through Time 2: Discovery\nBecome a notorious criminal legend in this tension-packed, over-the-top, first-person shooter. Use a wide range of weapons and equipment to combat police forces and rival gangs while you make off with the score! Go guns blazing or undetected with immersive stealth gameplay in highly randomized heists . Build your squad and successfully rob banks, hold up stores, raid armored trucks and more\nThe game comes with numerous big and medium heists, dozens of quick jobs and a variety of turfwar battles. Choose from 3 difficulty options to match your skill level. Welcome to Rockay City, Florida – a city full of quirky characters, 90s gangster pop culture and cheesiest dialogues since VHS. Take on the role of the legendary Travis Baker in the single-player, rogue-lite campaign .\nEarn money in heists, manage a team of criminals and conquer the other gangs’ territories to rule the underworld of Rockay City. Every strategic decision has its consequences – but failure doesn’t mean it’s over. Unlock permanent buff cards, to help you make the next run and complete your objective.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/crime-boss-rockay-city-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/crime-boss-rockay-city-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-4790 or AMD Ryzen 5 1600",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650, 4 GB or AMD Radeon RX 570, 4 GB",
        "DirectX": "Version 12",
        "Storage": "90 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "INGAME STUDIOS",
        "Platform": "PC",
        "Game Size": "80.5 GB",
        "Released By": "RUNE emu",
        "Version": "v1.13.2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/FVvkiN",
        "https://datanodes.to/b61ek74ns45k/Crime-Boss-Rockay-City-SteamRIP.com.rar",
        "https://buzzheavier.com/a6s8uc7zytkt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/crime-boss-rockay-city-preinstalled-steamrip.jpg"
}