{
    "page_url": "https://steamrip.com/cruel-free-download/",
    "title": "CRUEL",
    "description": "CRUEL drops you into a twisted world. Disoriented and trapped in a bizarre hotel, you find a lifeless body in the elevator. Without hesitation, you grab the weapon from its cold grip, bracing yourself for the horrors ahead.\nSurvive a Living Nightmare: Battle through 10 dynamic , ever-changing levels filled with bloodthirsty enemies who won’t stop until you’re dead. The building itself is your enemy—time is running out, and it’s trying to consume you. Tyrant’s Realm\nRun, Fight, and Adapt: Speed is your only ally as you race against a constantly shifting environment. Keep an eye out for cans, which serve as both health boosts and currency for powerful upgrades. Stack them up and unleash a devastating attack when you need it most.\nPulse-Pounding OST: Feel the adrenaline surge with a hard-hitting electronic soundtrack that keeps you on edge. The relentless beats and aggressive synths mirror the intensity of the gameplay, immersing you deeper into the chaotic, surreal world of CRUEL.\nA Blast from the Past: Inspired by the adrenaline -pumping classics of FPS and arcade games, CRUEL delivers fast-paced action with a twist of dark humour. It’s a nostalgic thrill ride that doesn’t take itself too seriously, offering a fresh experience with a comedic kick",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/cruel-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/cruel-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Memory": "2 GB RAM",
        "Graphics": "Vulkan support required",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "James Dornan",
        "Platform": "PC",
        "Game Size": "314 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v0.6.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3fzm44rj237n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/cruel-preinstalled-steamrip.jpg"
}