{
    "page_url": "https://steamrip.com/cruise-ship-manager-free-download-1y/",
    "title": "Cruise Ship Manager Directly Download",
    "description": "Fulfill your dreams of owning a beautiful vessel with a large crew, teeming with life thanks to all sorts of unique passengers in Cruise Ship Manager. Take over the Mediterranean Sea with your cruise business in this unique management game. Plan out your ship’s interior , make sure everything is running smoothly, set the prices of your services, and become a legend of the high seas Choosing the layout of the ship is up to you Decide where to place a club for your passengers, and where the 5-star restaurants should be. SkateBIRD\nDoes a casino strike your fancy or maybe you prefer an open pool? And don’t forget about the suitably homely cabins for your passengers! Make sure everything is accessible and works well together, and that remember to buy enough food and supplies in port to guarantee a stellar cruise. Pick your crew wisely. Your success or failure depends on their skills. Once you leave the dock, you’re stuck with your employees on a long journey. Make sure you won’t regret hiring an inexperienced rookie over a seasoned veteran .\nOnce you settle on the amenities and finish all the necessary preparations, you can finally search for passengers to invite onto your ship. But there’s a catch – it’s not up to you who buys your tickets. So price them accordingly! If you offer them a premium charge, your passengers will feel entitled to the best service. It won’t be easy to satisfy them. On the other hand, you could sell the tickets at a low price and improve your budget through other means. For instance, by charging extra for fancy cocktails .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/cruise-ship-manager-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/cruise-ship-manager-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 – 64bit",
        "Processor": "i3-10100 or AMD Ryzen 3 3300X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 770 (2GB) / AMD Radeon R9 270X (2GB)",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Image Power S.A.",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "SKIDROW",
        "Version": "v1.0.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x6ovk2zlqard"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/cruise-ship-manager-preinstalled-steamrip.jpg"
}