{
    "page_url": "https://steamrip.com/crusader-kings-iii-free-download-1j/",
    "title": "Crusader Kings 3 Download Direct Link",
    "description": "Get Crusader Kings III PC game for free instantly and play pre-installed on SteamRiP\nChoose a royal or noble house from variety of realms on a map that stretches from Iceland to India, from the Arctic Circle to Central African Republic. Guide a dynasty through the centuries, ensuring the safety and power of every new generation. Gather new lands and titles to cement your legacy. Be a pious king to bring the religious powers to your side, or strike out on your own, designing your own splinter religion and earning everlasting fame or damnation. Knights, peasant revolts, pilgrimages, Viking raiders experience the drama and pageantry of the center Ages. The map has been expanded to incredible.\nNow all the countries of the planet are at your disposal. Take the country that you simply like, under your control, and do everything possible to make sure that representatives of every generation feel power over the planet , security, and power. award titles to your wards, successors, heirs and subjects, build statehood, make a spread of selections which will determine how history will develop further, and do whatever you would like to try to to. you’ll have an enormous number of characters at your disposal, and you yourself will decide the way to raise each of them, the way to raise him. Minecraft Dungeons\nYour characters are often good or evil, have reputations of tyrants or worthy rulers, and more. Each character can have their own advantages and drawbacks their own skills, abilities, skills. and that they will directly affect the gameplay. And, of course, battles and wars await you in Crusader Kings III. start and do your best to form your country prosperous.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/crusader-kings-iii-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/crusader-kings-iii-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1 64 bit / Windows 10 Home 64 bit",
        "Processor": "Intel Core i3-2120 / AMD FX 6350",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX 460 (1GB)",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation, Strategy",
        "Developer": "Paradox Development Studio",
        "Platform": "PC",
        "Game Size": "6.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.16.2.1 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/HImkyL",
        "https://buzzheavier.com/vq1eetsqmpxk",
        "https://megadb.net/8ik2ov1k1670"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/crusader-kings-iii-free-download-preinstalled-steamrip.jpg"
}