{
    "page_url": "https://steamrip.com/crypt-custodian-free-download/",
    "title": "Crypt Custodian",
    "description": "You play as Pluto – a mischievous cat who has just died, and landed in the afterlife’s palace. After a brief and disastrous meeting with the Afterlife Guardian – Kendra – you are banished from the palace and sentenced to clean Age of Mythology: Retold\nExplore the vast grounds that surround the palace, battle beasts with your trusty broom, and gain new abilities to expand your map. Solve puzzles, discover secrets, and organize an ambush to break back into the palace Meet and befriend all the other bad ghosts who live outside the palace. Learn how they died , and what caused them to face eternal banishment ! And then head on over to the local haunt- The Sinner’s Inn- to chat with the ghosts you meet, and upgrade your gear.\nComplete puzzles, battle epic bosses, and clean your way through ruined dungeons in order to collect new upgrades and abilities. Customize your play style by mix-and- matching your upgrades, and use the abilities you collect to expand your world. Traverse a vast landscape with secrets hiding at every corner. Form your own path and discover the afterlife’s many secrets at your own pace.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/crypt-custodian-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/crypt-custodian-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Pentium E2180 (2 * 2000), AMD Athlon Dual Core 4450e (2 * 2300), or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GT 220 (1024 MB), Radeon HD 4650 (1024 VRAM), or equivalent",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Kyle Thompson",
        "Platform": "PC",
        "Game Size": "398 MB",
        "Released By": "TENOKE",
        "Version": "Build 15296628 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n7spqiah7bqz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/crypt-custodian-preinstalled-steamrip.jpg"
}