{
    "page_url": "https://steamrip.com/crysis-remastered-free-download-y1/",
    "title": "Crysis Remastered Free Download",
    "description": "Crysis Remastered game for free instantly and play pre-installed on SteamRIP\nThe classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around now with remastered graphics optimized for a new generation of hardware. What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a Lingshan island chain. Armed with a powerful Nanosuit , players can become invisible to stalk enemy patrols, or boost strength to lay waste to vehicles. THE KING OF FIGHTERS XV\nThe Nanosuit’s speed, strength, armor, and cloaking allow creative solutions for every kind of fight, while a huge arsenal of modular weaponry provides unprecedented control over play style. In the ever-changing environment, adapt tactics and gear to dominate your enemies, in an enormous sandbox world. Suit up: Your Nanosuit’s speed, strength, armor, and cloaking allow creative solutions for every kind of fight.\nAdapt: In an ever-changing environment, adapt your tactics to dominate on battlefields ranging from frozen jungle to alien environments. Customize: A huge arsenal of modular weaponry provides unprecedented control over play style, with options ranging from the experimental to the alien.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/crysis-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/crysis-remastered-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel(R) Core(TM) i5-3450 / AMD Ryzen 3",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 TI /AMD Radeon 470",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Crytek",
        "Platform": "PC",
        "Game Size": "18.1 GB",
        "Released By": "SKIDROW (Thanks toChristsnatcher)",
        "Version": "Patch 3 (BuildID 8139684) | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lrrsdorzjbgm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/crysis-remastered-preinstalled-steamrip-1.jpg"
}