{
    "page_url": "https://steamrip.com/cubic-odyssey-free-download/",
    "title": "Cubic Odyssey Directly Download",
    "description": "Step into a boundless open world where every planet , every system, and every moment is yours to shape. Explore a universe rich with life, ancient mysteries, and untamed beauty. Fight back the Red Darkness menace as you mine resources, craft tools, weapons, and build vehicles that are essential for your odyssey. Collaborate with friends to battle colossal threats and bring hope to the galaxy. Adventure, creation , and survival await\nHuge Open Cubic World Every star seen in the sky or in space is the light of a star system. Each star is orbited by planets filled with life, with shifting day-night cycles, bustling NPC cities, pirate outposts, and dangerous ruins waiting to be discovered. Capcom Fighting Collection 2\nCrafting and Building Paradise Mine resources, refine materials, and build everything from tools and outposts to vehicles and starships.\nEndless Galactic Odyssey Take on diverse quests, uncover secrets of the forgotten civilization, trade with NPCs, or battle rogue pirates as the epic story of saving the galaxy unfolds before you.\nIntense Red Darkness Battles Combat a spreading galactic infection that mutates wildlife , consumes planets, and threatens all life. Your actions can cleanse the plague—or let it thrive.\nFun Co-op Gameplay Join forces with others to take down massive enemies, initiate orbital laser strikes, or build cooperative megastructures .\nSeamless Ground, Air and Space Traversal Switch between planetary vehicles and spaceships, exploring from the ground up—or the skies down. Experience warp jumps between star systems, cruise at blazing fast speed between planets or just use the planetary speeders to travel on planets .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/cubic-odyssey-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/cubic-odyssey-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 2500 or AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "nVidia GTX 1060 / AMD RX 580 with 6GB of VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Atypical Games",
        "Platform": "PC",
        "Game Size": "2.5 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.1.18 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ez6wtyol7pgc",
        "https://buzzheavier.com/m2uimc0pjwqo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/cubic-odyssey-preinstalled-steamrip.jpg"
}