{
    "page_url": "https://steamrip.com/cultic-free-download-1r/",
    "title": "CULTIC Directly Download",
    "description": "Gear up to fight your way through the ranks of an insidious cult. Their wretched minds twisted by the will of an unseen entity, you’ll find just as much lead flying back as you dish out, so you’ll have to run, slide, dodge, and make use of your environment to survive in this old-school-inspired shooter. Chapter One of CULTIC includes 10 maps full of blood, grit, and of course, cultists. The Darkest Tales\nAfter completing the story, you can test your skills in the wave-based Survival Mode, also included with Chapter One. CULTIC gives you the freedom to approach combat your way. You can run in guns blazing, running, jumping, sliding, and dodging to keep out of harms way. If you prefer a slower approach, you can lay traps, let your enemies come to you, and pick them off from the safety of cover.\nMaybe you prefer to weave in between your foes, leading their attacks towards each other, and turning them against one another. With a full arsenal of mid-century firearms and explosives, you’ll be well equipped to slaughter everything in your path  provided you don’t get slaughtered first. Combat in CULTIC is fast and deadly. Well-placed shots can take your enemies – and yourself – out of the game quickly.\nKeep on the move or stick to cover, and use your arsenal wisely to stay alive as you fight your way through cult territory. CULTIC was styled to feel like a throwback to the shooters of yore, but with the advantages of a modern engine, such as physics, lighting, and a fully 3D game world. The gameplay, audio design, and art are all stylized to create a unique experience.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/cultic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/cultic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "AMD FX 6350 / Intel i3 4150",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GT 740",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Jasozz Games",
        "Platform": "PC",
        "Game Size": "603 MB",
        "Released By": "CODEX emu",
        "Version": "Build 13015560 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/au4yupbnmthh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/cultic-preinstalled-steamrip.jpg"
}