{
    "page_url": "https://steamrip.com/curse-of-the-sea-rats-free-download-1t/",
    "title": "Curse of the Sea Rats Directly Download",
    "description": "Curse of the Sea Rats is a ‘ ratoidvania ’ platform adventure with lovingly crafted, hand-drawn animations. Embark on the epic journey of four prisoners of the British empire, transformed into rats by the notorious pirate witch, Flora Burn. To regain their human bodies, they will have to fight dangerous bosses, uncover the secrets of the vast Irish coast, and ultimately capture the witch who cursed them.\nBeautiful 2D, hand-drawn animation breathes life into the game’s cast of characters – inspired by classic animated films and reminiscent of the golden age of 2D platforming. These animations combine seamlessly with detailed 3D environments enhanced by light and shadow effects to create a 2.5D platforming experience of incredible quality. Kujlevka\nChart your progress through a huge, non-linear world as you attempt to track down the pirate witch who cursed you. Shipwrecked on the coast of Ireland in the 18th Century, you’ll need more than just your swashbuckling skills to forge your path to freedom .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/curse-of-the-sea-rats-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/curse-of-the-sea-rats-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core 2 Duo E8400 or AMD Phenom II X2 550",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 730, 2 GB or AMD Radeon HD 6670, 1 GB",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Petoons Studio",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "CODEX emu",
        "Version": "v1.0.19 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zr6ul2yzqyak"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/curse-of-the-sea-rats-preinstalled-steamrip.jpg"
}