{
    "page_url": "https://steamrip.com/cryberpunk-2k77-d7/",
    "title": "Cryberpunk 2k77 Download",
    "description": "Cryberpunk 2k77 is an open- action-adventure set in Night City, where you play as a cryberpunk mercenary fighting for survival. Improved with all-new free extra content, you can now personalize your character and playstyle as you take on jobs, establish a reputation , and acquire improvements. The relationships you form and the decisions you make will impact both the tale and the world around you. Legends are created here. What will yours be?\nNight City seems more alive than ever with the free Update 2.1 Take a trip on the fully functional NCART metro system, listen to music while exploring the city with the Radioport, hang out with your partner at V’s apartment, engage in replayable races, ride new vehicles, experience enhanced bike combat and handling, uncover hidden secrets, and much more\nCREATE YOUR OWN CRYBERPUNK Become an urban criminal with cybernetic upgrades and establish your reputation on the streets of Night City. Night City is jam-packed with activities to do, sights to see, and people to meet. And it is up to you to decide where to go, when to go, and how to get there.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/cyberpunk-2077-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/cyberpunk-2077-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or 10",
        "Processor": "Intel Core i5-3570K or AMD FX-8310",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 780 or AMD Radeon RX 470",
        "DirectX": "Version 12",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "CDPROJEKTRED",
        "Platform": "PC",
        "Game Size": "89.1 GB",
        "Released By": "CODEX emu",
        "Version": "v2.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/CDD4B38102",
        "https://datanodes.to/boh09zmmc7zk",
        "https://buzzheavier.com/7c8yuphiej5q",
        "https://1fichier.com/?vckmtq1qmfkuzktk0x13",
        "https://buzzheavier.com/i1vc25zpcfc3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/cyberpunk-2k77-preinstalled-steamrip.jpg"
}