{
    "page_url": "https://steamrip.com/danganronpa-s-ultimate-summer-camp-free-download-1h/",
    "title": "Danganronpa S USC",
    "description": "The main part of the game in which players will develop their character over 50 days (50 turns) of summer camp on Jabberwock Island. Roll a die to determine how many spaces to move. An event will be triggered depending on which square the character lands on.\nEach character has various stats, including level. Character stats improve by leveling up, stopping on a Growth Square, or interacting with other characters on Event Squares. Bosses placed by Monokuma and monster battles triggered by Battle Squares will impede the player’s path along the way. Talent Squares grant Talent Fragments, which grant characters new skills. Hell Pie\nPlayers will also need to acquire weapons and armor at shops and treasure chests as well as utilize cards featuring useful effects to their advantage. A Battle Mode can be played separately from the Battle Squares found in the boardgame.\nDevelop characters and form a party of up to four members and take on the 200-floor Tower of Despair where Monokuma-type monsters await. In the Tower of Despair , enemies attack in waves, and the player is rewarded with Monokuma Medals upon victory. Players need to increase their characters’ levels while learning skills and gearing up their characters in order to emerge victorious.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/danganronpa-s-ultimate-summer-camp-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/danganronpa-s-ultimate-summer-camp-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 Home 64-bit",
        "Processor": "Intel Core i5-750",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 740 1GB",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Spike Chunsoft Co., Ltd.",
        "Platform": "PC",
        "Game Size": "983 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 8711840 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/93ez4zu3ozu1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/danganronpa-s-ultimate-summer-camp-preinstalled-steamrip.jpg"
}