{
    "page_url": "https://steamrip.com/dark-chess-free-download-1z/",
    "title": "Dark Chess Directly Download",
    "description": "The Fog of War feature hides enemy armies . Dark Chess is both about quick decisions, tactical thinking and taking risks or thinking slow and scouting the unknown before taking a step into dark. Reworked and enhanced game rules will bring immense joy to die-hard chess-lovers and casual players alike. Game keeps players thrilled with unexpected moves and unforeseen attacks. Spelp\nTake a step to walk deeper into the Dark Chess single player story campaign to fight Queens and Kings of the past.Do you dare to challenge the famous Genghis Khan, outsmart King Solomon or terrify Ivan the Terrible? Dare t o argue with Queen Elizabeth or Empress Cixi and keep the head on your shoulders? Be warned my friend, some of them will not play by the rules Played through the campaign and solved all the puzzles? That’s not all Dark Chess has to offer! You are ready to take on a bigger challenge\nYou can now compete with real people in PvP mode, with opponents who are as clever and tricky as you are, or even more so. Special Ranked Tournament give you the opportunity to reach the highest rank and unlock the Dark Chess Grand Master title. Have you ever won a difficult chess duel feeling that you deserved a reward and got none? Dark Chess is going to reward you for your achievements\nFor every difficult puzzle you solve, difficult opponent you destroy or clever move you make, you’ll be rewarded with an achievement that unlocks visuals improvements. You can customize in game avatar the way you want.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/dark-chess-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/dark-chess-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 32-bit",
        "Processor": "Intel Core i3 or faster",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 9.0 Compatible GPU",
        "DirectX": "Version 9.0",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Tall Troll Games",
        "Platform": "PC",
        "Game Size": "400 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xdgo0qau11pv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/dark-chess-preinstalled-steamrip.jpg"
}