{
    "page_url": "https://steamrip.com/dark-souls-iii-free-download-17/",
    "title": "DARK SOULS III Free",
    "description": "Get DARK SOULS III PC game for free instantly and play pre-installed on SteamRiP\nGet the DARK SOULS III Season Pass now and challenge yourself with all the available content Winner of games award 2015 “Best RPG” and over 35 E3 2015 Awards and Nominations . As fires fade and the world falls into ruin, journey into a universe filled with more colossal enemies an environments. In total, there are four classes in Dark Souls 3. You can choose a knight that is able to fight different creatures in close combat, a warrior with an increased supply of health and strength, a cleric that has incredible powers, and a killer magician that can destroy entire groups of opponents with his magic spells.\nPlayers will be immersed into a world of epic atmosphere and darkness through faster gameplay and amplified combat intensity. Fans and newcomers alike will get lost in the game hallmark rewarding gameplay and immersive graphics. Now only embers remain Prepare yourself once more and Embrace The Darkness The events of the game begin in the location “Lodelet’s Wall”, which is located in the same fantasy universe in which the events of the previous parts took place. You, in the role of the main character , will have to go from here and on a long and very dangerous journey. But first, you will need to decide on the character, or rather, on his class.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/dark-souls-iii-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/dark-souls-iii-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64bit, Windows 8.1 64bit Windows 10 64bit",
        "Processor": "Intel Core i3-2100 / AMD® FX-6300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce GTX 750 Ti / ATI Radeon HD 7950",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "FromSoftware, Inc.",
        "Platform": "PC",
        "Game Size": "25.2 GB",
        "Released By": "CODEX emu",
        "Version": "v1.15.2 (Deluxe Edition) | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/B714088208",
        "https://1fichier.com/?92picw38ayw6w7aeu6xi",
        "https://buzzheavier.com/97ki7d4o0n3w",
        "https://datanodes.to/1zk5c2imcldb/Dark-Souls-III-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/dark-souls-iii-free-download-preinstalled-steamrip.jpg"
}