{
    "page_url": "https://steamrip.com/dark-light-free-download-i1/",
    "title": "Dark Light Directly Download",
    "description": "Dark light is a Sci-fi survival action-platformer set in a post-apocalyptic world overrun by the Dark Creatures from unknown dimensions. You were dropped into the wrecked world as a Dark-Hunter, the last remains of elite human soldiers. To survive, you need to equip yourself, fight through your way, collecting ‘shards’ from killing super nature creatures to reinforce your energy.\nThrough surviving, you will explore the mysterious dark zones, kill, gain, get stronger and find the way to seal the Dark Void and save the world from doom. Fast-paced action, challenging Souls-Like combat system. You must time your attacks, use your dodge and parry the enemy for maximum damage. Use your weapon’s special attacks, drone skills, or air combos to defeat your enemy in different situations . Explore a dynamic world with ever-changing enemies, temporary power-ups totems that change each time you play through them.\nAcquire new drones through Factions , and bosses unlock your skill tree to grow permanently stronger. Take on nightmarish enemies and epic bosses from cyborgs to dragons throughout dark zones to get precious loot and upgrade materials you can use to customize weapons, drones , and character upgrades in multiple ways. A non-linear map structure allows you to choose your own path to explore the dark zones. BONELAB\nTravel through a nightmarish , post-apocalyptic world and explore hand-crafted maps. Seek powers in an Underground city left by the ancient builders, battle your way through gruesome castles made of flesh. Descend into machine temples buried deep in The Great Swamp in search of your own existences.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/dark-light-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/dark-light-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Mirari&Co.",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.0.13 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jyreua0ib828"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/dark-light-preinstalled-steamrip.jpg"
}