{
    "page_url": "https://steamrip.com/darkest-dungeon-2-free-download-1t/",
    "title": "Darkest Dungeon II Free",
    "description": "Darkest Dungeon 2 Download PC Game In Direct Link for free on SteamRIP\nDarkest Dungeon II is the sequel to one of the best hardcore turn-based strategy games with RPG and roguelike elements. A sequel in the same dark Gothic style awaits you. One of the main advantages of Darkest Dungeon is its complexity, which, although annoying, at the same time gives an extremely exciting process of passing.\nFor years, the developers have been honing the balance and various possibilities of Darkest Dungeon, and now, they are ready to release the second part with all the developments.\nThe game has kept all the charms of the first part as much as possible, but at the same time it introduces many new elements. This project has a huge fan base, which was looking forward to the release of the second part. Although the game is still at a fairly early stage of development , you can still play it now.\nAs in the first part, unique heroes await you, which have their own strengths and weaknesses , as well as their own history. You can spend dozens of hours on pumping your favorite hero and kill him with one wrong decision. This is what Darkest Dungeon 2 is all about.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/darkest-dungeon-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/darkest-dungeon-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "Operating system": "Windows 10",
        "Processor": "AMD Athlon X4 or Intel Core i5 4460",
        "RAM": "8 GB of RAM",
        "Video card": "NVIDIA GTX 950 or AMD R7 370",
        "Disk space": "6 GB"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Red Hook Studios",
        "Platform": "PC",
        "Game Size": "7.7 GB",
        "Released By": "RUNE",
        "Version": "v2.02.78692 | Full  (Latest) + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/XI7ycP",
        "https://megadb.net/qnerneuh29gn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/darkest-dungeon-2-free-download-preinstalled-steamrip.jpg"
}