{
    "page_url": "https://steamrip.com/dawnfolk-free-download/",
    "title": "Dawnfolk",
    "description": "In a world of darkness, you are the ruler of a kingdom lost to shadows. On a quest to save your people, you have found the mythical creature called “Lueur,” a fiery companion who will light your way. But what kind of ruler will you be? In Dawnfolk, you will explore an uncharted medieval fantasy world, manage resources, build cities, and survive against many dangers. Warhammer 40,000: Rogue Trader\nMinigames add a unique challenge to supporting your people. The better you are at the minigames, the more resources you get and the more likely your community will weather the darkness. Every choice matters as you explore different strategies and play styles in Dawnfolk.\nNot everyone has time to invest hundreds of hours into learning how to play a grand strategy game. You can dive right in and start building your settlement immediately, going from a handful of tents to a big city in less than an hour.\nDawnfolk was designed to feel familiar, yet unlike any building strategy game you’ve ever played before. Unwind and play with ease, whether you’re at home or on the go, with your gamepad, keyboard, or handheld console. Go back to the roots of gaming, where exploration and experimentation are the key to fun and discovery.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/dawnfolk-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/dawnfolk-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "2+ Cores, 2+ GHz",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB VRAM",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Darenn Keller",
        "Platform": "PC",
        "Game Size": "222 MB",
        "Released By": "Mr_GOLDBERG emu | Ty Frostslayer (csrin)",
        "Version": "v1.0.15 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hghsbsfzpv3q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/dawnfolk-preinstalled-steamrip.jpg"
}