{
    "page_url": "https://steamrip.com/days-gone-free-download-3c/",
    "title": "Days Gone Free Download Updated Direct Link",
    "description": "Days Gone is an open-world action- adventure game set in a harsh wilderness two years after a devastating global pandemic. Step into the dirt flecked shoes of former outlaw biker Deacon St. John, a bounty hunter trying to find a reason to live in a land surrounded by death. Scavenge through abandoned settlements for equipment to craft valuable items and weapons, or take your chances with other survivors trying to eke out a living through fair trade or more violent means.\nA striking setting: From forests and meadows, to snowy plains and desert lava fields, the Pacific Northwest is both beautiful and lethal. Explore a variety of mountains, caves, mines and small rural towns, scarred by millions of years of volcanic activity. Brutal encounters: With vicious gangs and hordes of Freakers roaming the land, you’ll need to make full use of a variety of customizable traps, weapons, and upgradable skills to stay alive. Don’t forget your Drifter bike, an invaluable tool in a vast land.",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows 10 64-bits",
        "Processor": "Intel Core[email protected]or AMD FX[email protected]",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 780 (3 GB) or AMD Radeon R9 290 (4 GB)",
        "DirectX": "Version 11",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Bend Studio",
        "Platform": "PC",
        "Game Size": "60.8 GB",
        "Released By": "CODEX emu",
        "Version": "v1.36.187.0 | Full Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/C5EDC79C52",
        "https://datanodes.to/et5gog1a852i",
        "https://buzzheavier.com/rsjrbxtu769v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/05/Days-Gone-Free-Download-PC-SteamRip.jpg"
}