{
    "page_url": "https://steamrip.com/dayz-free-download-u2/",
    "title": "DayZ Free",
    "description": "Get DayZ v1.25.158.344 Online game for free instantly and play pre-installed on SteamRiP\nThe post-Soviet country Chernarus is infected with an unknown virus that has turned most of the population into zombie-like creatures. You are one of the few not exposed to the virus – how long will you last? All the rest are fiercely fighting for resources, pushing humanity to the brink of extinction. DayZ is a ruthless, authentic, open-world sandbox online game where each of the 60 players on a server has a single goal – to survive as long as possible at any cost. Call of Duty\nThe game has no trivial advice, points of passage, training missions and tips. Every decision must be balanced. There are no saves or extra lives in the game, so any mistake can be fatal. If you fail, you will lose everything and start over.Finding resources and wandering around the open world is never safe in DayZ, since you don’t know what awaits you around the next corner. Interacting with other hostile players or struggling to survive in harsh weather conditions can be nerve-racking and emotional. On the other hand, a chance encounter with a friendly-minded survivor in DayZ can turn into true lifelong friendship",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/dayz-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/dayz-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8.1 64-bit",
        "Processor": "Intel Core i5-4430",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 or AMD R9 270X",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Massively Multiplayer",
        "Developer": "Bohemia Interactive",
        "Platform": "PC",
        "Game Size": "18.9 GB",
        "Repack By": "OFME/DayZavr",
        "Version": "v1.26 | Full  + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/29583B4693",
        "https://buzzheavier.com/vuz7n5e0pocr",
        "https://datanodes.to/xj7mm8qysj5l/DayZ-SteamRIP.com.rar",
        "https://1fichier.com/?2uom8wzrzf3p6sc7766w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/dayz-free-download-preinstalled-steamrip.jpg"
}