{
    "page_url": "https://steamrip.com/dcs-justice-league-cosmic-chaos-free-download-1q/",
    "title": "DC’s Justice League: Cosmic Chaos Directly Download",
    "description": "Unite against chaos, in an all-new open world adventure where the Justice League go head-to-head with Mr. Mxyzptlk , a powerful prankster from the 5th Dimension. Suit up as Batman, Wonder Woman and Superman and go face off against some of the most powerful Super-Villains in the DC universe; including Bizarro, Starro the Conqueror, Clayface and many more in an epic battle to bring peace to Happy Harbor .\nDC’s Justice League: Cosmic Chaos gives you the freedom to play your way in action-packed missions, gruelling fights and daring challenges Fly around Happy Harbor as Superman or propel yourself through the sky as Wonder Woman, the choice is yours Sun Haven\nPlay with friends or family in 2 player couch co-op Instant Action Mode and have the freedom to explore Happy Harbor, the home of the Justice League. Become Happy Harbor’s hero – with unlockable Elemental Attacks plus iconic moves and armor, including Superman’s Heat Vision, Wonder Woman’s Truth’s Pull and Batman’s exploding Batarangs .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/dc-justice-league-cosmic-chaos-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/dc-justice-league-cosmic-chaos-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-Bit",
        "Processor": "AMD Ryzen 3 1200 /Intel Core i3-7100",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 550 4GB / Nvidia GTX 750",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "PHL Collective",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "TENOKE",
        "Version": "Build 10510122 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6acz6cullfd6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/dc-justice-league-cosmic-chaos-preinstalled-steamrip.jpg"
}