{
    "page_url": "https://steamrip.com/dead-space-2-free-download-2v/",
    "title": "Dead Space 2 Directly Download",
    "description": "In Dead Space 2, you join Isaac Clarke, the Systems Engineer from Dead Space, as he wakes up three years after the horrific events on the USG Ishimura. The Ishimura was a Planetcracker -class starship besieged by grotesque reanimations of its dead crew, known as “ Necromorphs .” After unearthing a strange artifact known as the Marker, Isaac finds himself on the Sprawl, a giant space station in orbit around Saturn. Unable to remember how he got here and plagued with demented visions of his dead girlfriend\nNicole, he must survive another nightmarish outbreak of Necromorphs as he fights his way towards an answer he hopes will end all the chaos. Wield a set of devastating tools to bring the terror to space. Impale Necromorphs into the walls with the Javelin, use improved telekinesis to turn limbs into deadly weapons, plant powerful dismembering trip mines, or create a hull-breach to suck a group of monsters out into space. Fire up Isaac’s suit boosters to rocket around in zero gravity like never before. Explore the depths of the Sprawl and encounter new weightless combat and physics-based puzzles with full 360⁰ movement.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/dead-space-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/dead-space-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2.8 GHz or faster",
        "Memory": "1 GB RAM or more for Windows XP (2 GB for Vista)",
        "Graphics": "DirectX® 9.0c compatible video card, Shader Model 3.0 required, 256 MB or better,",
        "HDD": "7.5 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Visceral Games",
        "Platform": "PC",
        "Game Size": "7.7 GB",
        "Released By": "N/A",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/66mczcy6n7fr",
        "https://buzzheavier.com/bfsyvtm5elop",
        "https://datanodes.to/hs5hw4eotrr8/Dead-Space-2-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/dead-space-2-preinstalled-steamrip.jpg"
}