{
    "page_url": "https://steamrip.com/dead-rising-free-download/",
    "title": "DEAD RISING",
    "description": "Frank West, a freelance photojournalist on the hunt for the scoop of a lifetime, pursues a juicy lead to a small suburban town only to find that it is being overrun by zombies! He escapes to the local shopping mall thinking it will be a bastion of safety, but it turns out to be anything but. It’s a true struggle to survive the endless stream of enemies, but with full reign over an entire shopping center, Frank can utilize anything to fight off the flesh-hungry mob and search for the truth behind the horrendous epidemic.\nThis action horror game brings new meaning to the phrase “retail hell.” Dead Rising uses a dynamic real-time system in which time continues to pass whether Frank is actively engaged or remains stationary. For example, though they move slowly during the day, zombies become stronger and faster when the sun sets and make it even more difficult to survive at night. The unprecedented swarms come in never-ending waves and consist of a diverse population. These former humans retain some memory of their previous lives and it is reflected in their behavior and appearance. The variety of different stores in the mall offers an endless supply of resources including vehicles, makeshift weapons and more. Other survivors are encountered along the way and helping them can provide valuable clues as to what has happened.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/427190/ss_fd0d8599b19d41a0935518b63a4e99794e1e8f95.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/427190/ss_21b4e49b63eae0f5d676aa93f43279c86b323c05.jpg",
        "https://gofile.io/d/O0jWxF",
        "https://buzzheavier.com/49533k4y0l3j"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit versions",
        "Processor": "Intel® Core™ 2 Duo 2.4 Ghz or better, AMD Athlon™ X2 2.8 Ghz or better",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA® GeForce® 550TI/ AMD 6770",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Capcom",
        "Platform": "PC",
        "Game Size": "7.9 GB",
        "Released By": "Goldberg (Ty qzack) + Owla CSF, cs.rin.ru",
        "Version": "Build 1378690",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/O0jWxF",
        "https://buzzheavier.com/49533k4y0l3j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/dr1_featured_final.jpg"
}