{
    "page_url": "https://steamrip.com/dead-season-free-download/",
    "title": "Dead Season",
    "description": "The air hangs heavy with the stench of decay – a grim reminder of the world’s rapid descent into chaos. Streets once bustling with life now lay deserted, haunted by the shuffling footsteps of the undead. A random group of four survivors find themselves thrown together by their shared struggle for survival , in a world overrun by the zombie hordes. Their faces etched with weariness and determination mirror the dark and harsh realities they face.\nIn this single-player turn-based tactics game, take control of this band of survivors as they navigate through the midst of a zombie infestation, scavenging for resources and completing objectives, while confronting the endless threat of the undead, and surviving through narrow escapes and close calls.\nUNFORGIVING TURN-BASED COMBAT : Survive at all costs as you complete objectives and escape dangerous situations with weapons you scavenge along the way. Level up and unlock new abilities to survive even in harsher environments. DRAGON BALL: Sparking! ZERO",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/dead-season-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/dead-season-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4590 or AMD FX 8350",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 970 Series or Equivalent. AMD RX 5000 series and beyond",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Snail Bite",
        "Platform": "PC",
        "Game Size": "4.5 GB",
        "Released By": "GOG",
        "Version": "v1.0.0.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vpkewkfe3jo2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/dead-season-preinstalled-steamrip.jpg"
}