{
    "page_url": "https://steamrip.com/dead-take-free-download/",
    "title": "Dead Take",
    "description": "Night falls and he still won’t pick up the phone. You arrive at the mansion : the last place he went. It’s oddly quiet for the site of a glamorous party the night before. Your invite must have gotten lost in the mail. In any case, you make your way inside to find your friend. Titan Quest II\nINT. MANSION – NIGHT “PLAY YOUR PART”\nAn abandoned film set. A broken home cinema. Searching the mansion and unlocking its secrets requires the fullness of your ingenuity. Pay attention.\nINT. HOME CINEMA – NIGHT “A SPLICE OF LIFE”\nYour search reveals a number of USB drives and memory cards containing corrupted video files. Some can be spliced together to reveal what really happened within these walls. Try not to lose yourself in your work.\nINT. HEART OF HOLLYWOOD – NIGHT “TAKE YOUR SHOT”\nThe house is watching. It seems to haunt your steps. Piece together what really happened last night as you discover a side of the entertainment industry only discussed in whispers.\nThe cruelty. The sordid gossip. The auditions gone wrong. The shadowy figure with the power to make or break your career.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/dead-take-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/dead-take-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64bit",
        "Processor": "AMD Ryzen 2600 or Intel Core i7 7700k",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 1060 6GB, AMD Radeon RX580 8GB, or Intel Arc A580",
        "DirectX": "Version 12",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Surgent Studios",
        "Platform": "PC",
        "Game Size": "10.3 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.3.54901 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/vqZKXn",
        "https://buzzheavier.com/jqxor4qb2mq6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/dead-take-preinstalled-steamrip.jpg"
}