{
    "page_url": "https://steamrip.com/death-in-the-water-2-free-download-m1/",
    "title": "Death in the Water 2 Directly Download",
    "description": "Beware the waters, they hide a mysterious and terrifying threat. Death, an ancient Kraken leviathan haunts your every move in this tense underwater horror survival game. Fight to survive using powerful weapons and upgrades as you explore a beautiful yet treacherous underwater world.\nDeath in the Water 2 at its core is a wave-based shooter but combines elements of terrifying horror and tension with heart-pounding adrenalin-fueled action. Each dive (wave) typically starts off with elements of exploration where the pace is a bit slower and gives you a chance to find treasure, and other collectibles as well as find your bearings. During this phase, the tension builds as you investigate ruins, wrecks, and reefs. Sharks and creatures are passive and may not always attack you unless provoked, much like the behavior of real sharks.\nAt any stage during the dive Death (the Kraken) will launch a mind-control attack on all creatures and a feeding frenzy will kick off with you being the primary target. You will need to survive and complete the dive objective before you move on to the next wave. As you progress to the next dive the difficulty ramps up and things get even more frantic. The combination of tension and action makes it incredibly addictive as you explore the open world map. This is a game about facing your fears head on and conquering the challenges that stand in your way. It’s about testing your limits and pushing yourself to the brink. Tokyo Necro\nIt’s about survival, and emerging victorious against all odds. So, strap on your diving gear and get ready for the ultimate underwater horror experience. Death awaits you in the depths. Death in the Water features a large open-underwater world map for you to discover during dives.Explore wrecks, reefs, caves, ruins, and terrifying open waters that will test your thalassophobia .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/death-in-the-water-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/death-in-the-water-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7 / 64-Bit Windows 10",
        "Processor": "Requires a 64-bit processor and operating system",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 670 / GeForce GTX 1050 / AMD Radeon HD 7870",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Lighthouse Games Studio",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.1.10 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ruofif3nomof"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/death-in-the-water-2-preinstalled-steamrip.jpg"
}