{
    "page_url": "https://steamrip.com/deathloop-free-download-o1/",
    "title": "DEATHLOOP",
    "description": "DEATHLOOP is a next-gen first person shooter from Arkane Lyon, the award-winning studio behind Dishonored. In DEATHLOOP, two rival assassins are trapped in a mysterious timeloop on the island of Blackreef, doomed to repeat the same day for eternity. As Colt, the only chance for escape is to end the cycle by assassinating eight key targets before the day resets. CHRONO CROSS\nLearn from each cycle try new paths, gather intel, and find new weapons and abilities. Do whatever it takes to break the loop. Every new loop is an opportunity to change things up. Use the knowledge you gain from each attempt to change up your playstyle, stealthily sneaking through levels or barreling into the fight, guns-blazing. In each loop you’ll discover new secrets, gather intel on your targets as well as the island of Blackreef, and expand your arsenal.\nArmed with a host of otherworldly abilities and savage weaponry, you’ll utilize every tool at your command to execute takedowns that are as striking as they are devastating. Customize your loadout wisely to survive this deadly game of hunter vs hunted. Are you the hero or the villain? You’ll experience DEATHLOOP’s main story as Colt, hunting down targets across the island of Blackreef to break the loop and earn your freedom.\nAll the while, you’ll be hunted by your rival Julianna , who can be controlled by another player. So if you’re feeling devious, you, too, can step into Julianna’s stylish sneakers and invade another player’s campaign to kill Colt. The multiplayer experience is completely optional, and players can choose to have Julianna controlled by AI within their campaign.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/deathloop-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/deathloop-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 bit Windows 10 version 1909 or higher",
        "Processor": "Intel Core i5-8400 @ 2.80GHz or AMD Ryzen 5 1600",
        "Memory": "12 GB RAM",
        "Graphics": "Nvidia GTX 1060 (6GB) or AMD Radeon RX 580 (8GB)",
        "DirectX": "Version 12",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Shooter",
        "Developer": "Arkane Studios",
        "Platform": "PC",
        "Game Size": "30.5 GB",
        "Released By": "EMPRESS",
        "Version": "v1.769.0.5 (Build 7848766) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/F5760A5490",
        "https://buzzheavier.com/ic57ee0u5u0t",
        "https://1fichier.com/?xt66agvhhaw2i6nfws2i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/deathloop-preinstalled-steamrip.jpg"
}