{
    "page_url": "https://steamrip.com/death-or-treat-free-download-h1/",
    "title": "Death or Treat",
    "description": "You will play as Scary, the owner of Ghost Mart, leader in manufacturing candies for Halloween. Discover a huge world with lots of rooms, explore new maps in every run while you try to survive the hordes of enemies . It’s not an easy task, every world is even more tricky than the other. Starting with Darkchat, the Storyum lab, Riptok, the most used app sede, Deviltube , leaders distributing storyum , and the last but not least FaceBoo the ultimate epic frontier. Will you overcome the callenge and dare to defeat Clark Fackerberg? Bum Simulator\nCombat is one of the fundamental pillars of Death or Treat. Choose your favorite weapon style (fast, heavy or ranged) and face a real horde of enemies in the purest hack’n slash style: fly through the air and attack the crowd with force, move nimbly and look for their weak point.\nCollect valuable hidden treasures to unlock new terrifying weapons and spooky skills that will help you in your journey. Each one of the stores that you will find in HallowTown can provide different profit for your enterprise. You can create new weapons at Frank’s Forge, or buy healing potions at DetoxBucks. Our vampire shopkeeper, Joe Bite Them, will help you get new empty slots for your inventory, and the Pumpkin guys will teach you how to craft magic spells. Finally, go to Pumpkin© to trade your ingredients for more candies",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/death-or-treat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/death-or-treat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-Bit)",
        "Processor": "Intel Core i3 2100",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 or higher",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Saona Studios",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/be9jbsn351c8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/death-or-treat-preinstalled-steamrip.jpg"
}