{
    "page_url": "https://steamrip.com/deaths-door-free-download-1i/",
    "title": "Death’s Door Free Download Direct link",
    "description": "Get Death’s Door v1.1.5.1 PC game for free instantly and play pre-installed on SteamRiP\nReaping souls of the dead and punching a clock might get monotonous but it’s honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death – where creatures grow far past their expiry and overflow with greed and power. Talon Sharp Combat: Utilize melee weapons, arrows and magic to overcome a fantastic array of beasts and demigods. Mistakes are punished and victory is rewarded.\nGain an edge by customizing your character stats and mastering the abilities and upgrades you obtain. A Beautifully Bleak World: Venture beyond the Doors and explore a land full of twisted inhabitants and countless secrets, bringing hope to the weird and wonderful characters you’ll meet along the way. A Dark Mystery to Unravel: Track down and defeat colossal tyrants with stories and motivations of their own. Experience a somber yet darkly comedic tale, uncovering the truths behind the flow of souls, the role of the Crows and the origin of the Doors.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/deaths-door-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/deaths-door-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i5-8250U (4 * 1800) or equivalent; AMD Phenom II X4 965 (4 * 3400) or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce MX 150 ( 2048 MB); Radeon R7 260X (2048 MB)",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Acid Nerve",
        "Platform": "PC",
        "Game Size": "1.71 GB",
        "Repack By": "CODEX",
        "Version": "v1.1.5.1 | Updated Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mgdql1q9v6kc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/deaths-door-free-download-preinstalled-steamrip.jpg"
}