{
    "page_url": "https://steamrip.com/decision-red-daze-free-download-1o/",
    "title": "Decision: Red Daze",
    "description": "Decision: Red Daze is an isometric action RPG with a unique spin on survival and tower defense mechanics. The Dust Bowl, once a ‘thriving’ society of corrupt politicians, rich property barons and everyday people who work for them ‘100% willingly’, has been overtaken by a mysterious phenomenon only known by survivors as the Red Daze.\nAs the illness takes hold of the survivors and turns them into crazed and EXTREMELY dangerous mutated creatures, the worlds’ governments are running around like headless chickens. It falls to the few who remain to fend off the monsters in hopes of finding a way to eradicate the Red Daze once and for all.\nEven the lowliest survivor you find has the potential to lead his own squad, explore, make the wasteland safe, and shape their own destiny. It’s up to you to upgrade and specialize any survivor you find in the wasteland any way you see fit. While most of the buildings of the Dust Bowl are long abandoned and taken over by the undead, the loot and potential shelter is coveted by most survivors.\nDuring your exploration missions you’ll come across various farmsteads, factories and military installations full to the brim with monsters, loot, and most importantly, foundations that hold the potential to turn the long abandoned structures into sprawling and heavily fortified settlements. Neptunia x SENRAN KAGURA: Ninja Wars",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/decision-red-daze-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/decision-red-daze-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer",
        "Processor": "1.8GHz single core",
        "Memory": "4 GB RAM",
        "Graphics": "Geforce GTX 750 / Radeon HD 7870",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Strategy",
        "Developer": "FlyAnvil",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "SKIDROW",
        "Version": "v1.2.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ohqsn2l9yinv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/decision-red-daze-preinstalled-steamrip.jpg"
}