{
    "page_url": "https://steamrip.com/deepening-fire-free-download-1v/",
    "title": "Deepening Fire",
    "description": "Freely character customization , there are more than 10 roles to choose from, and you can flexibly change your career paths to explore this dark chaotic world and restore the truth of the broken world. Non-linear process, explore more than 10 maps, not only treasures and adventures there, but also extremely fierce enemies, strange residents. Skinny & Franko: Fists of Violence\nMore hidden maps and Easter eggs waiting for you to discover, and you will turn into a werewolf if you are not careful Choose from heavy swords, giant axes, spears, staffs, gloves and other weapons, with hundreds of equipment and a variety of firebrand, and you can also match the appropriate suit strategy according to the terrain, such as choosing the night vision suit on the dark map at night to see more clearly.\nExperience souls like combat , predict enemy movements according to the sound effects, seize their flaws and accurately counterattack, use precise operations to weaken enemies, and completely defeat them with firebrand.\nMore than 30 original bosses, including bosses custom-designed by players, find pattern of their movement carefully. Even if you knock them down, don’t take them lightly. Because they will most likely summon companions, or enter a more powerful second form",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/deepening-fire-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/deepening-fire-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 7 SP1 / 8.1 / 10 64-bit",
        "Processor": "AMD FX-4350 / Intel® Core™ i3-3210",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon™ R7 260X (2GB VRAM) / NVIDIA® GeForce® GTX 750(2GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "VeryBigDog",
        "Platform": "PC",
        "Game Size": "920 MB",
        "Released By": "RUNE emu",
        "Version": "Build 11046949 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/55qdd33l6lze"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/deepening-fire-preinstalled-steamrip.jpg"
}