{
    "page_url": "https://steamrip.com/deep-rock-galactic-free-download-1w/",
    "title": "Deep Rock Galactic",
    "description": "Deep Rock Galactic Download PC Game In Direct Link for free on SteamRIP\nDeep Rock Galactic is a 1-4 player co-op FPS featuring badass space Dwarves, 100% destructible environments, procedurally-generated caves, and endless hordes of alien monsters. Work together as a team to dig, explore, and fight your way through a massive cave system filled with hordes of deadly enemies and valuable resources.\nYou will need to rely on your teammates if you want to survive the most hostile cave systems in the galaxy Pick the right class for the job. Mow through enemies as the Gunner , scout ahead and light up the caves as the Scout, chew through solid rock as the Driller, or support the team with defensive structures and turrets as the Engineer. Destroy everything around you to reach your goal.\nThere is no set path so you can complete your mission your way. Drill straight down to your objective or build an intricate network of paths to explore your surroundings the choice is yours. But proceed with caution, you don’t want to stumble into an alien swarm unprepared Explore a network of procedurally generated cave systems filled with enemies to fight and riches to collect. LIMBO\nThere’s always something new to discover and no two playthroughs are alike. Dwarves know what they need to bring to get the job done. This means the most powerful weapons and the most advanced gadgets around – flamethrowers, gatling guns, portable platform launchers, and much, much more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/deep-rock-galactic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/deep-rock-galactic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 Bit",
        "Processor": "2.4 GHz Dual Core",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460 or AMD Radeon HD 5770 /w 1GB VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Ghost Ship Games",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.39.108916.0 | full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/dyB8VW",
        "https://megadb.net/5xji72q5u5pf",
        "https://buzzheavier.com/0070ivhicx9m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/deep-rock-galactic-preinstalled-steamrip.jpg"
}