{
    "page_url": "https://steamrip.com/definitely-not-fried-chicken-free-download-1h/",
    "title": "Definitely Not Fried Chicken",
    "description": "Definitely Not Fried Chicken is a business management sim with a Twist Grow your drugs trade through legitimate fronts by managing both sides of the business. A Plague Tale: Requiem\nAcquire new “ businesses “, meet new clientele, develop more potent narcotics, make lots of money and leave a city in ruin Set in a sunshine soaked city in the glamorous 80’s, DNFC will test your entrepreneurial business skills. Build your drugs compound from the ground up, buy adjoining plots of land and expand.\nDesign and lay out your complete production line and establish distribution routes. Fortify your compounds defences and make sure any “overly-enthusiastic” customers can’t break in. Research and develop better strains of narcotics like marijuana, cocaine and methamphetamine. But simply making a great product is not enough, you need somewhere to sell it from\nThis is where your legitimate businesses come in you’ll need to build and manage these fronts, including selling legal goods to avoid detection , people gotta eat right? Run a chain of Fried Chicken stores or diversify your portfolio with other businesses. Different places have different people with different tastes.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/definitely-not-fried-chicken-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/definitely-not-fried-chicken-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later",
        "Processor": "Intel Core i5 / AMD FX Series  or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Dope Games",
        "Platform": "PC",
        "Game Size": "397 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.16 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/iwyvzl9ah8sc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/definitely-not-fried-chicken-preinstalled-steamrip.jpg"
}