{
    "page_url": "https://steamrip.com/demeo-pc-edition-free-download-1r/",
    "title": "Demeo PC Edition",
    "description": "Adventurers , it’s time to unite! A dark force has taken over the underworld in the RPG dungeon crawler, Demeo, and it’s a world you’re not likely to survive alone. Demeo is a cross-platform cooperative adventure for up to four players that recreates all of the magic and camaraderie of gathering around a tabletop with friends to do battle against the forces of evil. Artist Life Simulator\nAssume the role of the eagle-eyed hunter , mystical sorcerer, deadly assassin, protective guardian, melodic bard, powerful warlock or boisterous barbarian. But choose your heroes wisely in this cooperative adventure, for once players have accepted their quest, they must work together to vanquish the unholy force that corrupts everything or die trying.\nOur story originated inside the Elven Necropolis — but that was just a mere overture Following the first Demeo adventure, The Black Sarcophagus, players have already explored the Realm of the Rat King and Roots of Evil — and with our latest adventure, Reign of Madness , they’ll venture into the town of Ends for the first time and meet Demeo’s newest playable character Uhrak, the Barbarian who is never more than a grappling hook’s throw away from the action.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/demeo-pc-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/demeo-pc-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-3470,AMD Ryzen 3 1200, or above",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 760, Radeon R9 280, or above",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "Resolution Games",
        "Platform": "PC",
        "Game Size": "2.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.31.226224 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mcxfgtkwbqqz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/demeo-pc-edition-preinstalled-steamrip.jpg"
}