{
    "page_url": "https://steamrip.com/democracy-4-free-download-r1/",
    "title": "Democracy 4 Directly Download",
    "description": "Democracy 4 lets you take the role of President / Prime minister, govern the country (choosing its policies, laws and other actions), and both transform the country as you see fit, while trying to retain enough popularity to get re-elected. Built on a custom-built neural network designed to model the opinions, beliefs, thoughts and biases of thousands of virtual citizens, Democracy 4 is the state-of-the-art in political simulation games.\nA whole new vector-graphics engine gives the game a more adaptable, cleaner user interface, and the fourth in the series builds on the past while adding a host of new features such as media reports, coalition governments, emergency powers, three-party systems and a more sophisticated simulation that handles inflation, corruption and modern policy ideas such as quantitative easing, helicopter money, universal basic income and policies to cover current political topics such as police body cameras, transgender rights and tons more.\nDemocracy 4 is the ultimate sandbox for testing out your political ideas. We all think our politicians are useless and that we could do a better job ourselves, but is that really true? With one eye on the budget, one-eye on the polls, and somehow finding time to watch out for terrorist attacks at the same time, you will find that staying in power while changing society for the better is a tougher job than you ever imagined.\nWould it really be a good idea to legalize all drugs? to give the police machineguns? to ban abortion ? to invest heavily in green energy? would UBI really work? can you stay elected after cutting pensions in half to pay for your science budget? There is only one game that lets you find out. Victoria 3",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/democracy-4-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/democracy-4-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7,8,10",
        "Processor": "intel i5 1.6GHZ",
        "Memory": "4 GB RAM",
        "Graphics": "intel HD3000",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Positech Games",
        "Platform": "PC",
        "Game Size": "594 MB",
        "Released By": "GOG",
        "Version": "v1.59 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zaxfr5o340d2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/democracy-4-preinstalled-steamrip.jpg"
}