{
    "page_url": "https://steamrip.com/desktop-mate-free-download/",
    "title": "Desktop Mate",
    "description": "Desktop Mate is a next-generation desktop mascot platform that brings cute characters to your computer. Using the latest 3D technology, the characters move freely around your desktop, providing an experience that makes you feel as if they are really there. The Rangers In The South\nPlatform Features Desktop Mate is designed as a highly expandable platform to which various characters can be added. The basic software is available for free, and you can purchase additional characters of your choice to create your own personalized desktop environment.\nInteracting with the characters The characters can move around freely on the desktop , sitting on windows, jumping between windows, etc. – They can play with the mouse, follow the cursor with their hands, and show adorable reactions – They can be linked to the alarm function , allowing you to keep track of time while having fun!\nCharacter lineup Aiel-tan (free of charge), the official image character of Infinite Loop , appears as the basic character of Desktop Mate. She supports your work and study. In conjunction with the alarm function, you can enjoy time management more.\nThe world’s most popular virtual singer is now available as an additional character in the first release! Enjoy an unprecedented new experience with Miku on your desktop.\nFuture Development New characters will be added to Desktop Mate in the future. Desktop Mate will continue to evolve as a platform with new ways to interact with the characters and the addition of useful functions.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/desktop-mate-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/desktop-mate-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit / Windows 11 64bit",
        "Processor": "Intel Core i5-8250U 1.6GHz / AMD Ryzen 3 3300U",
        "Memory": "8 GB RAM",
        "Graphics": "Intel UHD  730 / Radeon VEGA 8",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Animation & Modeling, Utilities",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "96.1 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 16853438 | Full  + DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/uod5kwujc4aj/Desktop-Mate-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/desktop-mate-preinstalled-steamrip.jpg"
}