{
    "page_url": "https://steamrip.com/despots-game-dystopian-army-builder-free-download-q1/",
    "title": "Despot’s Game Dystopian Army Builder",
    "description": "Despot’s Game: Dystopian Army Builder Download PC Game In Direct Link for free on SteamRIP\nA group of people wake up in a strange post- apocalyptic labyrinth — naked, with no memories and with a bunch of weapons. Is this a joke, a crazy experiment, or a game? You’ll find out soon enough, just try not to die first Your puny squad is capable of much more.\nChoose your loot and transform the squishy humans into wizards , cultists, ninjas and dozens of other heroes, including the mythical stale pretzel throwers. With perks and class combos, there are thousands of ways to build your army.\nThe man-eating cabbage will appreciate the variety in its diet If you can survive the labyrinth, you’ll meet THE UNSTOPPABLE END-GAME BUILDS OF OTHER PLAYERS You’ll beat each other to death and only one will be spared by d’Spot.\nNo offense, but in his own game he writes the rules Prepare your warriors and let them fight it out on their own Indirect combat allows you to focus heavily on tactical considerations rather than reflexes. Strengthen your front line with fridge-movers, aim your food-throwers and look after your Forbidden Summoners .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/despots-game-dystopian-army-builder-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/despots-game-dystopian-army-builder-free-download-screeshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Intel i5-7500 or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce GTX 670 / Radeon HD 7970",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Strategy",
        "Developer": "Konfa Games",
        "Platform": "PC",
        "Game Size": "499 MB",
        "Released By": "N/A",
        "Version": "v1.7.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p6dbauvs6c6z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/despots-game-dystopian-army-builder-free-download-preinstalled-steamrip.jpg"
}