{
    "page_url": "https://steamrip.com/desynced-free-download-1s/",
    "title": "Desynced Free Download",
    "description": "When your ship becomes damaged , you must send drones to the surface of an unknown planet to build the facilities necessary for repairs. Guided by ELAINE, your onboard AI, you will build, automate , survive, and thrive. But is there more to learn from this mysterious world? Outpath\nDesynced is an automation game without belts. Drones connected to your logistics network will automatically fill orders to move material around your base. Set up mining operations and factories, expand your logistics network to cover more area, manage power generation and storage, and more. When you need a more custom solution, tailor the behavior of your facilities and bots using customizable parameters, or dive into drag-and-drop scripting for maximum control.\nIntricate Resource Management: Master the art of resource management, production chains, and automation to ensure the survival and prosperity of your base . Every decision counts as you strive to maintain a delicate balance in this hostile world.\nFully Customizable Units: Desynced uses drones instead of belts. Equip them with tools fit for their purpose, or program advanced behaviors using a drag and drop editor. Tailor units to your playstyle and adapt to the challenges that await.\nIn-Depth Technology Tree: Dive into a deep research system that will expand your technological prowess. Unlock new possibilities, develop advanced units and structures, and gain an edge over your foes as you unravel the secrets of this captivating world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/desynced-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/desynced-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit or newer",
        "Processor": "5th Generation Intel i5 CPU or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GTX 1060 / AMD R9 or higher",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Stage Games Inc.",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "RUNE emu",
        "Version": "v0.1.14243 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8bvcrqp4onyw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/desynced-preinstalled-steamrip.jpg"
}