{
    "page_url": "https://steamrip.com/devour-free-download-1c/",
    "title": "DEVOUR Free Download Direct Link",
    "description": "DEVOUR is a co-op horror survival game for 1-4 Horizon . Stop a possessed cult leader before she drags you to hell with her. Run. Scream. Hide. Just don’t get caught. Take control of up to 4 cult members in this unique online co-op experience where you must work together to stop Anna, a possessed cult leader dead set on taking you to hell with her. For hardcore players only. In this mode, you’ll be doing all the screaming yourself. No two DEVOUR playthroughs are ever the same. To stop Anna, you’ll need a focused team and perfect execution, with a single session lasting up to an hour.\nExperience a whole new dimension of fear each time a map is released for DEVOUR. Every brand new environment brings horrifying, original visuals, fresh characters, updated game mechanics and novel terrors . Anna Puerta, leader of demonic cult The Watchers of Azazel , has just performed a forbidden ritual, believing she can summon and control the goat demon himself. But something has gone wrong, and Azazel has possessed her. Your goal is to break Azazel’s hold over Anna. To do this you’ll need to find gasoline, a fire pit, and enough ritual goats to burn. Anna’s rage and speed increase as the game progresses, as does the number of demons Azazel spawns to stop you. Your only means of defence is your UV flashlight.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/devour-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/devour-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 – 64 bit",
        "Processor": "Intel i5 or new-gen i3 / AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R9 290",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Horror, Survival",
        "Developer": "Joe Fender, Luke Fanning",
        "Platform": "PC",
        "Game Size": "6.5 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v5.0.23 | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wwyk609wio2p",
        "https://buzzheavier.com/7hq5w82bzq9k",
        "https://1fichier.com/?cfhkyc6st02nacq44kk0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/devour-free-download-preinstalled-steamrip.jpg"
}