{
    "page_url": "https://steamrip.com/diablo-ii-resurrected-free-download-1s/",
    "title": "Diablo 2 Resurrected",
    "description": "Diablo II: Resurrected is a remastered version of the quintessential action RPG Diablo II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal, now in up to 4K (2160p) resolution on PC. Diablo II: Resurrected includes all content from both Diablo II and its epic expansion Diablo II: Lord of Destruction. Battle your way through icy caverns, horrific tombs filled with undead abominations, and frozen wastelands to the frigid summit of Mount Arreat and stop Baal, the Lord of Destruction. Sapiens\nRaise hell with two Lord of Destruction playable classes—the cunning Assassin, master of traps and shadow disciplines, and the savage Druid, a bold shapeshifter and summoner who commands primal elemental magic. Start your journey in a bandit camp, cross the sea and hide from the scorching heat of the desert in Lut Galein, explore the impenetrable jungles of Kurast, wander the blazing lands of the Pandemonia Fortress, and more. Explore the previously two-dimensional world of Sanctuary in 3D, enjoying high-quality Dolby Surround 7.1 sound and stunning resolution up to 4K (2160p). Feel the evolution of Diablo II as you switch between classic and remastered modes in real time. Classic mode also supports modern screen resolutions and surround sound functionality.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/diablo-2-resurrected-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/diablo-2-resurrected-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "Intel Core i3-3250 / AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 660 / AMD Radeon HD 7850",
        "DirectX": "Version 12",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Blizzard Entertainment, Vicarious Visions",
        "Platform": "PC",
        "Game Size": "28.8 GB",
        "Released By": "BLIZZLESS | ty XATAB",
        "Version": "v1.6.81914 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/4D810C4AF1",
        "https://datanodes.to/l72tol6ifqyh/Diablo-2-Resurrected-SteamRIP.com.rar",
        "https://buzzheavier.com/ts0icfln5gan",
        "https://1fichier.com/?rrvy8ger6qefnz6uxzcx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/diablo-2-resurrected-preinstalled-steamrip.jpg"
}