{
    "page_url": "https://steamrip.com/diesel-legacy-the-brazen-age-free-download/",
    "title": "Diesel Legacy: The Brazen Age",
    "description": "Diesel Legacy is all about embracing the teamwork and chaos of 2v2 battles in a fighting game playing field – four players divided into two teams, on the same stage, at the same time. Enter the dieselpunk world as a robotic war machine, a rocket skater girl, a plague doctor assassin, a suave gangster with her goons and so much more. Punch, kick, parry, shoot, bomb, poison, ignite, freeze and whatever else you can do to win it all.\nStep into the ring with a partner and fight off your competition. Protect each other or go on a double frontal attack. Fighting game newcomers and veterans will be able to team up and level up together with everyone making meaningful contributions to their team. The traditional fighting game experience has transformed into a true battlefield, where tactics and situational awareness reign supreme. Caves of Qud\nYOUR CHARACTER, YOUR UNIQUE EXPRESSION Intuitive controls with an insane amount of depth for each character!\nBrawlers, Rushdown, Zoners, Grapplers , Trap Characters and more– there’s a meticulously crafted, hand-drawn character with an additional unique twist for everyone.\nNewcomers will be able to focus on the fight, not requiring overly complicated inputs to pull off special moves. Meanwhile, fighting game veterans will be constantly engaged by footsies , split-second decision-making, combo optimization , resource management and everything else that traditional fighting games thrive on.\nEach character has their own fighting personality with unique and deep mechanics, giving each player the ability to explore and express themselves via their own playstyle .\nTeam Leader? Showboat? Comeback King? Parry God? Unpredictable Wild Card? It’s time to own what makes you who you are, and celebrate it.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/diesel-legacy-the-brazen-age-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/diesel-legacy-the-brazen-age-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 (64bit)",
        "Processor": "Intel Core i5-7500 | AMD Ryzen 2600",
        "Graphics": "GTX 970 / RX 570",
        "DirectX": "Version 11",
        "Storage": "3600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Maximum Entertainment",
        "Platform": "PC",
        "Game Size": "3.6 GB",
        "Released By": "TENOKE",
        "Version": "Build 16533192 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uj54uxa5vjn3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/diesel-legacy-the-brazen-age-preinstalled-steamrip.jpg"
}