{
    "page_url": "https://steamrip.com/dig-or-die-free-download-1q/",
    "title": "Dig or Die Free",
    "description": "Get Dig or Die for free instantly and play pre-installed on SteamRiP all indie with latest updates\nSurvive massive attacks each night by building strong walls and placing turrets wisely. build wisely or your structures will collapse! And you will need them to defend your base, or build bridges and high towers to access remote locations. rain, infiltration, underground rivers and lakes be careful during the heavy rains, or you could be surprised by a sudden water level rise You are a representative of the CRAFT & Co company .\nYou are selling automated fabrication tools across the galaxy when your spacecraft crashes into a hostile planet. Use the tools you sell and the local resources to build up all of what you’ll need to survive and eventually be able to escape the planet. Play classic solo or multiplayer co-op, or try the custom game modes: Under the Sea (start in a cave under a huge ocean!), Sky World (a random world composed of hundreds of flying islands), or Base Defense (no exploration, only base building and defense).\nActivate the Hazardous Events option to trigger various surprises like Meteor Shower, Rain Flood, Earthquake, Volcano Eruption or even a Sharkstorm Enjoy Creative Mode and produce all items for free. This includes cheated items and tools to modify terrain or even create water and lava.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/dig-or-die-free-download-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/dig-or-die-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Vista, 7, 8, 10",
        "Processor": "Intel 2.4 GHz, Amd FX-8350 or better",
        "Memory": "1 GB RAM",
        "Graphics": "256MB video memory, capable of shader model 2.0",
        "DirectX": "Version 9.0",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Strategy",
        "Developer": "Gaddy Games",
        "Platform": "PC",
        "Game Size": "193 MB",
        "Repack By": "SKIDROW",
        "Version": "v1.11_build 864 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gyq0l0by59pw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/dig-or-die-free-download-preinstalled-steamrip.jpg"
}