{
    "page_url": "https://steamrip.com/digimon-world-next-order-free-download-1t/",
    "title": "Digimon World: Next Order Free Download",
    "description": "The Digital World has run rampant with Machinedramon and is now in a state of utter chaos. As a Digidestined, it’s up to you to restore order to the world in Digimon World: Next Order, a monster collecting RPG. Find and recruit as many faithful Digimon companions as possible to rebuild the Digital World. Will you be able to balance both training and exploration to stop the virus-infected Digimon from causing complete destruction Choose between a male or female protagonist and seek adventure with over 200 Digimon to collect\nExplore the world with, not one but, TWO Digimon companions for the first time ever. Form a strong bond with your Digimon by caring for them: feed, train, discipline, and Digivolve them. The stronger the bond between you and your Digimon, as well as between the two Digimon companions , the greater the chance of victory in battles Expand and manage your town, Floatia. Recruit new Digimon, upgrade buildings, grow crops, and more as you grow into a sprawling Digi- metropolis . Train your pair of Digimon to fight cooperatively in AI battles. Issue commands and cheer them to victory Last Kids on Earth: Hit the Deck",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/digimon-world-next-order-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/digimon-world-next-order-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit only)",
        "Processor": "Intel Core i3-2100 or AMD FX-4300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 560, 1 GB or AMD Radeon HD 6870, 1 GB",
        "DirectX": "Version 9.0",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation",
        "Developer": "HYDE, Inc.",
        "Platform": "PC",
        "Game Size": "4.5 GB",
        "Released By": "CHRONOS (cs.rin.ru)",
        "Version": "Build 10061453 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/84vd7pbh6y9z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/digimon-world-next-order-preinstalled-steamrip.jpg"
}