{
    "page_url": "https://steamrip.com/diluvian-ultra-free-download-x1/",
    "title": "Diluvian Ultra",
    "description": "Become the immortal warrior-prince Atilla, awakened after millenia in deep space by an impudent invasion of your tomb-ship. Pick up your blood-sword and investigate – are these intruders the old enemies from your past, or as yet unknown foes to conquer? Super Buff HD\nNo matter, they have rooted themselves into the ship and defiled all that is sacred to you with their foul presence. It is time to drive them out into the void and save your people.\nFurther chapters continuing Atilla’s story as well as expanding his arsenal and the roster of enemies to obliterate will be released as paid DLCs at a future date. Diluvian Ultra’s combat is built around a dual-damage system where you have to combine weapons to be effective. Armour absorbs damage, but some weapons are designed to quickly strip it off your targets – unable to kill them, but exposing them for a single lethal blow.\nYou have to be careful though, as enemies will mix their attacks in the same way. Collect and consume blood to upgrade your weapons and pick up various power-ups at the opportune moment, to become vengeance incarnate – if only for a while",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/diluvian-ultra-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/diluvian-ultra-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 (x64)",
        "Processor": "2.6GHz dual core/or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 770 – or equivalent",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Crest Helm Studios",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "TENOKE",
        "Version": "Build 12304862 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gek5xz83bywa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/diluvian-ultra-preinstalled-steamrip.jpg"
}