{
    "page_url": "https://steamrip.com/dimensionals-free-download/",
    "title": "Dimensionals Directly Download",
    "description": "Brace yourself for the ultimate Saturday Morning Cartoon adventure Dimensionals is a roguelike turn-based RPG with tons of heroes from different dimensions to collect and level up. Build a party of three and combine hundreds of their unique skills to create insane combos. Fight through an epic story told in the style of voice acted comic book cutscenes. It’s up to you to save the multiverse and beat an army of totally evil bad guys!\nTeleport yourself back to the glory days of the 90s with the Dimensionals radical story campaign, told through voice-acted, animated, comic -book style cutscenes. Kingdom’s Deck\nRagnarath, the tyrannical king of the Specters , has launched his final assault on the multiverse! His armies sew chaos, leaving every dimension they touch on the brink of annihilation! As Earth’s newest young Dimensional, now stranded aboard the Dimensional’s Mothership, YOU emerge as the multiverse’s final hope. Every chapter is a journey through a fractured Dimension, filled with a cast of zaney heroes to recruit with wicked cool personalities, deep lore and backstory .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/dimensionals-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/dimensionals-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GT 640M or ATI™ Radeon™ R9 M290X",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "Mino Games",
        "Platform": "PC",
        "Game Size": "3.6 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wfuk9i68w9a0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/dimensionals-preinstalled-steamrip.jpg"
}