{
    "page_url": "https://steamrip.com/dinkum-free-download-r1/",
    "title": "Dinkum",
    "description": "G’Day there! Get ready to start a new fair Dinkum life and build a home on an Island inspired by the wild Australian outback. Explore tropical eucalyptus forests, survive scorching deserts, relax at cool billabongs and discover scrubland filled with adorable Aussie inspired wildlife. Collect valuable resources by hunting, mining, fishing and foraging to expand and customise your town and attract new townsfolk and businesses. Share your new home with friends and protect each other as you explore beautiful landscapes filled with dangerous predators. Go from starting out sleeping in a swag under the stars, to a sprawling town with farms, businesses and attractions. Crypt of the NecroDancer ULTIMATE PACK\nEventually, you’ll draw in visitors, who might decide to stay and make it their home too. Keep your neighbours happy by customising your town with fences, flower beds, street lamps, beehives, windmills, hedges, fountains and more. The happier your townsfolk are the more likely they are to settle down, bring their families and set up stores with unique items.\nInvite your friends to visit your town where they can help you construct buildings, shop at your stores, go fishing, race Emus, fight crocodiles much more The island is Choc-A-Bloc with insects, fish and minerals. So grab your thongs and go track down and collect them all for your personal museum collection, or sell them for a tidy profit",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/dinkum-screenshot-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/dinkum-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 10",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 560, AMD Radeon HD 6970",
        "DirectX": "Version 9.0c",
        "Network": "Broadband Internet connection",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Early Access",
        "Developer": "James Bendon",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "RUNE",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qb0ds24me60k",
        "https://buzzheavier.com/yxaxkd5f70qr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/dinkum-preinstalled-steamrip-1.jpg"
}