{
    "page_url": "https://steamrip.com/diplomacy-is-not-an-option-free-download-y1/",
    "title": "Diplomacy Is Not An Option Download",
    "description": "Diplomacy Is Not An Option game for free instantly and play pre-installed on SteamRIP\nStep into the well-worn shoes of our Hero: a long- suffering minor Lord, who is forced by circumstances to engage in battle with vastly superior enemy forces. Boxed in a by a quarrelsome king, duplicitous advisors, and enemies on all sides, there is no recourse to resolve this peacefully.\nIt seems that Diplomacy Is Not an Option Experience warfare on an entirely new scale as over 10 THOUSAND enemy units assault your castle walls. Do you have what it takes to save the kingdom? Is the kingdom even worth saving? Your King is a mighty, and bold leader. The only thing he loves more than drinking is fighting, and he’s done a lot of it. The Legend of Bum-Bo\nWhilst waging foreign wars and conquests, the lands at home have been neglected; infrastructure is decaying, and the people are slowly starving. The ground is fertile for the seeds of rebellion Misled by feckless advisors the King cares not for the bureaucracy of statecraft , so when the masses rise up there is little warning or aide to be found. You alone must don the helm of battle and defend your lands from the murderous peasants. But victory will grant you scarce relief as you are the only one proven capable of protecting the kingdom.\nYou must put down the rebellions, flush out its leaders, and restore stability. Rumours abound of vast treasures in distant lands, exactly what the King needs to feed the people and fund more beer and war. Will you do as your sovereign bids and set sail to replenish the palace coffers? Surely the native peoples will offer no resistance to your pilfering. What could go wrong?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/diplomacy-is-not-an-option-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/diplomacy-is-not-an-option-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7,8,10 64 bit",
        "Processor": "Intel Core i5 6400 / AMD X8 FX-8300",
        "Memory": "6 GB RAM",
        "Graphics": "GeForce GTX 960 / AMD Radeon R9 280",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Door 407",
        "Platform": "PC",
        "Game Size": "8 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rlecc3oenk8s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/diplomacy-is-not-an-option-preinstalled-steamrip.jpg"
}