{
    "page_url": "https://steamrip.com/disgaea-6-complete-free-download-y1/",
    "title": "Disgaea 6 Complete Digital Dood Edition",
    "description": "Zed is a boastful zombie who wallows on the lowest rung on the Netherworld ladder alongside his sister Bieko. When a God of Destruction threatens their way of (un)life, Zed must harness his unique ability of Super Reincarnation to stand against the approaching menace.\nAlong the way, he will unite with twisted and colorful denizens of the Netherworld, face challenges around and within, and see if even an undying hooligan like himself can defy the odds Disgaea 6: Defiance of Destiny unites a grim yet touching story with insane tactical combat , while introducing gameplay elements never before seen in previous installments. As a result, new and returning players alike can craft a truly memorable and unique journey through the Netherworld. Green Hell VR\nBring the pain in battle with special attacks and support from a plethora of ally units. Customizable settings such as Auto, Retry, and Replay allow both hardcore and casual players to fight their own way. And should things take a terrible turn, use Super Reincarnation to rejoin the fight and keep trying until you succeed. This truly is a Netherworld fit for everyone From Grave to Glory: Join Zed in his quest to rise above his lowly status and challenge a God of Destruction. Along the way, meet zany characters, explore chaotic new worlds, and discover the power of sibling bonds and determination.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/disgaea-6-complete-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/disgaea-6-complete-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1/10/11 64-bit",
        "Processor": "Intel Core i3-2100 3.1 GHz or AMD equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 560 Ti",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Nippon Ichi Software, Inc.",
        "Platform": "PC",
        "Game Size": "4.5 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 8848380 | Full  (All DLCs + Art Book)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/aqxezs0bwofh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/disgaea-6-complete-preinstalled-steamrip.jpg"
}