{
    "page_url": "https://steamrip.com/dishonored-2-free-download-r1/",
    "title": "Dishonored 2 Directly Download",
    "description": "Dishonored 2 Download PC Game In Direct Link for free on SteamRIP\nPraised by PC Gamer as “ brilliant ”, IGN as “amazing” and “a super sequel, IGN as “amazing” and “a superb sequel”, declared a “masterpiece” by Eurogamer , and hailed “a must-play revenge tale among the best in its class” by Game Informer, Dishonored 2 is the follow up to Arkane Studio’s first-person action blockbuster and winner of more than 100 ‘Game of the Year’ awards, Dishonored .\nPlay your way in a world where mysticism and industry collide. Will you choose to play as Empress Emily Kaldwin or the royal protector, Corvo Attano? Will you make your way through the game unseen, make full use of its brutal combat system, or use a blend of both?\nHow will you combine your character’s unique set of powers, weapons and gadgets to eliminate your enemies? The story responds to your choices, leading to intriguing outcomes, as you play through each of the game’s hand-crafted missions. Dishonored 2 is set 15 years after the Lord Regent has been vanquished and the dreaded Rat Plague has passed into history. An otherworldly usurper has seized Empress Emily Kaldwin’s throne, leaving the fate of the Isles hanging in the balance.\nAs Emily or Corvo, travel beyond the legendary streets of Dunwall to Karnaca, the once-dazzling coastal city that holds the keys to restoring Emily to power. Armed with the Mark of the Outsider and powerful new abilities, track down your enemies and take back what’s rightfully yours.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/dishonored-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/dishonored-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 (64-bit versions)",
        "Processor": "Intel Core i5-2400/AMD FX-8320 or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 660 2GB/AMD Radeon HD 7970 3GB or better",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Arkane Studios",
        "Platform": "PC",
        "Game Size": "38.6 GB",
        "Repack By": "CODEX emu",
        "Version": "v1.77.10.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/C415FBEA0B",
        "https://datanodes.to/87r6px7p2hq0/Dishonored-2-Steamrip.com.rar",
        "https://buzzheavier.com/ytlmbwnwnets"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/dishonored-2-free-download-preinstalled-steamrip.jpg"
}