{
    "page_url": "https://steamrip.com/disney-epic-mickey-rebrushed-free-download/",
    "title": "Disney Epic Mickey: Rebrushed",
    "description": "Disney Epic Mickey: Rebrushed brings the magic of Disney to life in a vibrant 3D platformer. This beautiful remake sends Mickey Mouse on an epic journey through Wasteland, a realm of forgotten Disney characters. As Mickey, you will dive into a fantastical world and, armed with paint and thinner, shape your adventure and the fate of this alternate world. Tiny Glade\nEvery stroke of your magic brush matters ! Use paint to restore beauty and harmony or thinner to alter your environment and uncover hidden secrets. Your choices influence Mickey’s destiny and change the outcome of this artistic odyssey. Will you become the epic hero Wasteland needs?\nEncounter various iconic characters like Oswald the Lucky Rabbit, Walt Disney’s first creation, as you travel between lands in Wasteland. Collect virtual Disney pins, tackle creative challenges, and uncover secrets, all while exploring classic platforming levels inspired by animated films and shorts.\nOriginally envisioned by Warren Spector, reimagined by Purple Lamp, Disney Epic Mickey : Rebrushed employs state-of-the-art visuals and improved controls to breathe new life into a beloved classic. Experience new movement skills for Mickey, such as dash, ground pound and sprinting. The game’s compelling story makes it an unforgettable adventure for long-time fans and newcomers alike. Join Mickey Mouse and unravel the mysteries of Wasteland in this homage to Disney’s legacy .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/disney-epic-mickey-rebrushed-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/disney-epic-mickey-rebrushed-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Purple Lamp",
        "Platform": "PC",
        "Game Size": "23.6 GB",
        "Released By": "RUNE",
        "Version": "Build 16129020 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/8DFA0AE725",
        "https://buzzheavier.com/be8ph672dyrw",
        "https://datanodes.to/y1709463gcap/Disney-Epic-Mickey-Re-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/disney-epic-mickey-rebrushed-preinstalled-steamrip.jpg"
}