{
    "page_url": "https://steamrip.com/distant-worlds-2-free-download-i1/",
    "title": "Distant Worlds 2",
    "description": "Distant Worlds Returns Distant Worlds, the critically acclaimed 4X space strategy game is back with a brand new 64-bit engine, 3D graphics and a polished interface to begin an epic new Distant Worlds series with Distant Worlds 2. Distant Worlds 2 is a vast, pausable real-time 4X space strategy game. Experience the full depth and detail of turn-based strategy , but with the simplicity and ease of real-time, and on the scale of a massively-multiplayer online game. Workshop Simulator\nThe Universe is Yours Huge Galaxies with up to 2,000 star systems and tens of thousands of planets, moons and asteroids are yours to explore and exploit, whether peacefully through mining and diplomacy or by conquest The complex process of generating a galaxy ensures that every new game will be different and the many galaxy setup options ensure incredible replayability as well as the ability to have your game be just the way you like it.\nGalaxies are so deep, fun and immersive that you won’t want to finish the game. Choose from seven playable base game factions which cover a wide variety of playstyles. Build, expand and improve your empire while playing through the storylines, with victory conditions or in an open-ended sandbox mode. Each galaxy is packed with life and activity. Encounter other empires, independent alien colonies, traders, pirates and space monsters. Explore star systems, asteroid fields, galactic storms and black holes.\nDiscover evidence of civilizations long since past, uncovering secrets about the galaxy’s troubled history. Intelligent automation allows you to tailor the game to your preferred playstyle and scale. Decide how much you want to control and which gameplay areas suit you best. You can limit your focus to just one ship or expand it all the way up to everything in a vast galactic empire . Let your advisors and the intelligent automation handle the rest",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/distant-worlds-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/distant-worlds-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8, 10 (64-bit only) – The game runs on Windows 7 but no support will be provided",
        "Processor": "4+ Core CPU @ 2.5GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GTX 760-equivalent or better, 2+Gb VRAM, DirectX 11 compliant",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "CodeForce",
        "Platform": "PC",
        "Game Size": "8.1 GB",
        "Released By": "FLT emu",
        "Version": "v1.2.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/C2ECDD559B",
        "https://buzzheavier.com/ffrxe8i0mep2",
        "https://megadb.net/veb3u835cr5z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/distant-worlds-2-preintalled-steamrip.jpg"
}