{
    "page_url": "https://steamrip.com/dnf-duel-free-download-w1/",
    "title": "DNF Duel",
    "description": "DNF Duel flawlessly reinterprets the iconic classes from the classic Dungeon and Fighter RPG. Whether it’s the lightning-fast and flashy gunshots of the sly Ranger or the uninhibited raw power of the frenzied Berserker, each character’s iconic traits have been heightened and reworked.\nA total of 16 unique characters are available: Berserker, Striker, Grappler, Inquisitor, Dragon Knight, Ranger, Hitman, Kunoichi, Enchantress, Vanguard, Swift Master, Ghostblade , Troubleshooter, Crusader, Launcher, and an unlockable Hidden Character. 17 years of lore is integrated within the storytelling and character development of DNF Duel, supported by the stunning graphic details that merge seamlessly with the stage designs of Arad.\nEnjoy your duels in 8 diverse stages: Sky Tower, Oceanic Express, Moonlight Tavern, Hendon Myre, Ghent City of God, Saint Horn, Zelva, Ruins. DNF Duel takes the fighting game genre to a whole new level with its unique combat system and tactics. Each character has their signature moves and strengths, which are further accentuated by their Awakening effects.\nDon’t forget to keep track of your MP Gauge and White Damage Gauge, lest your opponent catches you by surprise Story Mode allows you to play through each character’s origin story, offering a fully immersive experience into the world of Dungeon and Fighter. Customize your player profile, and unlock exclusive wallpapers and sounds in the Gallery",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/dnf-duel-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/dnf-duel-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/10 (64-bit  required)",
        "Processor": "AMD FX-4350, 4.2 GHz / Intel Core i5-3450, 3.10 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD 6870, 1 GB / GeForce GTX 650 Ti, 1 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual",
        "Developer": "Arc System Works, EIGHTING Co., Ltd., NEOPLE Inc.",
        "Platform": "PC",
        "Game Size": "8.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.70 | Full  + 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/y5g51w81l7g6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/dnf-duel-preinstalled-steamrip.jpg"
}