{
    "page_url": "https://steamrip.com/do-not-feed-the-monkeys-2099-free-download-1j/",
    "title": "Do Not Feed the Monkeys 2099",
    "description": "If you answered yes to any of the above questions, you’re in luck You’ve been invited to join The Primate Observation Club. Live out all your heart’s desires as the newest member and if you are already in the Club, it’s time to move up the ladder. Observe the monkeys behind cages from the comfort of your home , stash some cash with your side hustle jobs, and maybe even play the role of a divine being by manipulating the lives of your subjects. Don’t hesitate, it’s time to make 2099 your year Evil Wizard\nA Dystopian Dreamland\nIt’s 2099 and alien knowledge has caused rapid advancements in technology to the point that big corporations now sponsor planets. Stripped of resources, Earth is now a wasteland and humanity has spread across the galaxy. Humans, robots, and aliens now live side by side.\nSpying Is Encouraged\nThe MonkeyVision app helps you manage hidden cameras and monitor cages. Make observations and search the internet to learn more about each subject. Need more cameras? Pick up side jobs for money, all the while avoiding that wacky conspiracy theorist next door.\nDefinitely Not Feeding the Monkeys\nGet to know the subjects and you might get the chance to interact with them. Hack security systems, make threatening phone calls or even put your own flavor on an unusual beverage . But then forget all those things, because that’s against Club rules",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/do-not-feed-the-monkeys-2099-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/do-not-feed-the-monkeys-2099-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 (32/64) or later",
        "Processor": "2 GHz Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GT 610 (1GB) or equivalent",
        "DirectX": "Version 9.0c",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Fictiorama Studios",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.40 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zlkajw1hxt3y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/do-not-feed-the-monkeys-2099-preinstalled-steamrip.jpg"
}