{
    "page_url": "https://steamrip.com/dolmen-free-download-1v/",
    "title": "Dolmen",
    "description": "Dolmen casts players onto a hostile alien world known as Revion Prime. Your job? Bring back samples of a crystal with particularly unique properties; the so-called “Dolmen”. These crystals are capable of allowing interaction between realities, revolutionising space exploration and changing the known world forever.\nExperience a rich combat system with various weapons and moves at your disposal. Switch natively between melee and ranged combat to overcome the most challenging enemies Revion Prime has to offer.\nEnergy is not only used for ranged weapons, but also for activating “ Energy Mode”. “Energy Mode” imbues your melee weapons with elemental status effects, letting you take full advantage of your enemy’s weaknesses. A devastated, darkly beautiful world is waiting to be explored. Trackmania Turbo\nWill you find all the secrets that Revion Prime has to offer? Or will this cruel world push you to the brink of death? Will you see your timeline erased or will you overcome the challenge that awaits you?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/dolmen-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/dolmen-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 860",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Massive Work Studio",
        "Platform": "PC",
        "Game Size": "7.1 GB",
        "Released By": "FLT",
        "Version": "v1.0.1.0 | Full  + Rebel Set DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h5bbcehrpuu4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/dolmen-preinstalled-steamrip.jpg"
}