{
    "page_url": "https://steamrip.com/doloc-town-free-download/",
    "title": "Doloc Town",
    "description": "Embark on a journey to Doloc Town — a post-apocalyptic oasis brimming with abandoned ruins, quirky architecture, and folks of all kinds. Spirit of the North 2\nRevitalize this empty land and get to know the townies . Thrive and discover your destiny as you delve deeper into this unknown territory.\nGather resources to build your farm from the ground up! As a farmer, you’ll tend crops, build, craft, cook, cast your line, and so much more.\nConstruct charming buildings, upgrade your homestead, and craft handy tools to turn your quiet patch of land into a thriving countryside haven!\nExplore this unknown territory , with intricate valley, treacherous wetlands, and abandoned ruins await. Scout the vast, untouched wilderness in search of secret relics, treasures, and more!\nAt the heart of the map lies Doloc Town, a post- apocalyptic sanctuary built from the remnants of trains and collapsed bridges. Connect with villagers and share a drink to uncover the hidden stories of this land.\nAbove all, the key is to endure the wasteland and follow whatever your heart truly desires.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/doloc-town-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/doloc-town-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i3 6100",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG, Simulation, Early Access",
        "Developer": "RedSaw Games Studio",
        "Platform": "PC",
        "Game Size": "481 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 18399242 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xsm2d22etr1j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/doloc-town-preinstalled-steamrip.jpg"
}