{
    "page_url": "https://steamrip.com/don-duality-free-download-1o/",
    "title": "Don Duality Directly Download",
    "description": "You take on the role of a restaurant owner who just happens to be the Don of a mafia group. You will be giving orders to your gangsters , robbing people and collecting debts, stealing valuables and intimidating cops. However, you will also have to manage your restaurant – hire staff, advertise and try to avoid random events that will interfere with your operations . Will you be able to maintain balance between your businesses? How long will you last? Sunkenland\nYour restaurant will expand and improve. Buy extra tables to seat everyone who wants to visit your establishment. Advertise to increase popularity and invite as many people to your place as possible. But remember, the more people your restaurant attracts, the more staff will have to be hired to serve them. Most of your subordinates will be Gangsters. Send them on a variety of criminal activities. Rob banks, beat money out of debtors, intimidate cops and take control over the city streets\nBe careful when discarding cards. Some of them are marked with a little bell. When such cards appear in your hand, the events get added up to the matching bell’s progress bar. Once an event is triggered, it will seriously affect your business. You will be laundering money you get from criminal activities through the restaurant. The richer you are, the more the police will be interested in your business. Once the police concern is maxed out, you will be arrested.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/don-duality-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/don-duality-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "ОС: Windows 7 (SP1+), Windows 10, Windows 11",
        "Processor": "64-bit Intel or AMD CPU with 2 or more cores",
        "Memory": "2 GB RAM",
        "Graphics": "card with DirectX 10 or higher support",
        "DirectX": "Version 10",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Strategy",
        "Developer": "Königsborgs",
        "Platform": "PC",
        "Game Size": "213 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sgcyesm8gpuv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/don-duality-preinstalled-steamrip.jpg"
}