{
    "page_url": "https://steamrip.com/doomblade-free-download-1n/",
    "title": "DOOMBLADE Directly Download",
    "description": "Lured out of her solitude, Gloom Girl discovers a chamber containing DOOMBLADE: a sentient weapon, trapped and bound for eons. “Doom and Gloom” join forces and begin a quest to regain the blade’s powers and exact vengeance on its captors. Wielding DOOMBLADE, Gloom Girl can ride through the air to attack enemies.\nTarget monsters to attack them directly, and slay them with DOOMBLADE’s wrath The blade hungers for vengeance on the Dread Lords, who bound it in chains and stripped it of its powers. But first, it must regain its strength . System Shock Remake\nSearch for demonic shrines, where DOOMBLADE’s powers were hidden and stored by the long dead Gloomfolk, awaiting its return. Then use Doom Drop, Wicked Wind, and the Nightmare Onion to teach your enemies fear.\nFrom the abandoned halls of Gloomhaunt, into the New Wilderwood forest full of untrusting tribesmen, through the Molded Mines with their hedonistic shroom people, and into a technological hellscape known as the Power Sector. Gloom Girl must fight her way through these interconnecting worlds and destroy the monsters within as she hunts down the Dread Lords who imprisoned DOOMBLADE.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/doomblade-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/doomblade-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 @ 2.0 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050 or AMD Radeon RX Vega 56 4 GB",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Muro Studios",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "GOG",
        "Version": "v1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0q9982wf0ayj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/doomblade-preinstalled-steamrip.jpg"
}