{
    "page_url": "https://steamrip.com/dorfromantik-free-download-1f/",
    "title": "Dorfromantik Free Download Direct Link",
    "description": "Dorfromantik is a relaxing building strategy and puzzle game in which you place tiles to create ever-growing, idyllic village landscapes. With Dorfromantik, you can immerse yourself in a quiet , peaceful world at any time and take a break from everyday life. At the same time, Dorfromantik offers a challenge for those who are looking for one: To beat the highscore , you need to carefully plan and strategically place your tiles. In Dorfromantik you start with a stack of procedurally generated tiles.\nOne after the other, you draw the top tile of the stack, place it on one available slot and rotate for the best fit. Thereby groups and combinations of landscapes are formed, such as forests, villages or water bodies, and you are rewarded with points depending on how well the tile fits. On some tiles you will also encounter special objects that give you a quest: For example, the windmill wants to border 6 grain fields, the locomotive wants to be connected to 10 tracks or the deer wants to inhabit a forest with at least 50 trees. Fulfill these quests to get more tiles to continue the expansion of your landscape. The game ends when the tile stack is used up.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/dorfromantik-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/dorfromantik-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2 GHz Dual Core (Intel / AMD)",
        "Memory": "3 GB RAM",
        "Graphics": "Nvidia GT550M | AMD Radeon R7/HD 5650 | Intel HD 520",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy, Early Access",
        "Developer": "Toukana Interactive",
        "Platform": "PC",
        "Game Size": "341 MB",
        "Released By": "GOG",
        "Version": "v1.0.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gy93oz7km89t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/dorfromantik-free-download-preinstalled-steamrip.jpg"
}