{
    "page_url": "https://steamrip.com/double-dragon-gaiden-rise-of-the-dragons-free-download/",
    "title": "Double Dragon Gaiden Rise Of The Dragons",
    "description": "Prepare to throw down the Double Dragon way in this fresh addition to the iconic beat ‘em up franchise. It’s the year 199X, and nuclear war has devastated New York City leaving its citizens to fight for survival as riots and crime engulf the streets. The city has been overtaken by criminal gangs who terrorize its ruins as they fight for total dominance. Unwilling to endure these conditions any longer, young Billy and Jimmy Lee take it upon themselves to drive the gangs out of their city. Granny Simulator\nExplore the early beginnings of the young Double Dragon brothers as they take on both new and familiar enemies in this alternate story. In this fresh roguelite take, every playthrough is a brand new chance at new action. Featuring a unique and dynamic level structure, the difficulty of the missions you take on will change depending on the order you have selected them.\nTag in and out as the classic duo Billy and Jimmy, switch it up with Marian and Uncle Matin, or experiment with 12 additional unlockable characters, each with their own special moves and unique playstyles. With 2-player online and local co-op, the action quadruples as you and a friend clean up the mean streets .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/double-dragon-gaiden-rise-of-the-dragons-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/double-dragon-gaiden-rise-of-the-dragons-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10-11",
        "Processor": "Intel Core i5 – 9300H 2.4Ghz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 1050 – 4gb",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Secret Base",
        "Platform": "PC",
        "Game Size": "908 MB",
        "Released By": "CHRONOS",
        "Version": "Build 14716072 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hpociscr74gc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/double-dragon-gaiden-rise-of-the-dragons-preinstalled-steamrip.jpg"
}