{
    "page_url": "https://steamrip.com/dragon-chronicles-black-tears-free-download/",
    "title": "Dragon Chronicles: Black Tears",
    "description": "The Black Tears of those filled with anger and sorrow sweep across the world at an unstoppable pace. The only hope for this cursed world is this expedition I lead. Doll Impostor\nThis is a strategic RPG with unique skills, attributes , different hero combinations, and more. Build an expedition that suits your playstyle and make use of various items to seize victory. 20 Heroes, 72 Artifacts, and 180 Imprint Stones await you on your adventure .\nWelcome! It may look a little rundown and dark, but this place is your home. Repair the facilities to unlock abilities that will help you on your expedition. Make clever use of the scarce resources you have, and you may just survive to see the next day. Reconstructing the Town and advancing your Heroes will aid in your fight against the Black Tears.\nA shady merchant , an immortal being clad in burning armor, a floating dragon They await you in places you have yet to tread. Pay attention to the random events and quests that pop up during your journey. Your choices may lead to your success. Or downfall . Choose wisely. Who knows what they may grant you\nThe high-quality graphics of the game will push you into lava pits and fields of ice. Powerful attacks may be intimidating, but their stunning visuals make them even more terrifying. Do you have the courage to face these dangers?\nYour enemies will come at you with a slew of skills and abilities. Their roars may put an unexpected end to your adventure. But each boss you face will be an experience that will make you stronger. Don’t be afraid of failure. Put your life on the line to excavate Artifacts , regroup, and then embark once more. The challenge never ends",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/dragon-chronicles-black-tears-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/dragon-chronicles-black-tears-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 version 64-bit",
        "Processor": "Intel Core 2 duo E8500, AMD Phenom II X3 720",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 440, AMD Radeon HD 5670, Intel HD",
        "DirectX": "Version 12",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Nyou",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "SKIDROW",
        "Version": "Build 15031818 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ej7c468dnlbl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/dragon-chronicles-black-tears-preinstalled-steamrip.jpg"
}