{
    "page_url": "https://steamrip.com/dragon-quest-monsters-the-dark-prince-free-download/",
    "title": "DRAGON QUEST MONSTERS: The Dark Prince",
    "description": "Compose your very own team of monsters from across the DRAGON QUEST series and engage in thrilling battles against your foes. Recruit monsters from the wild world around you and combine them to synthesize new creatures as you see fit. Teenage Mutant Ninja Turtles: Mutants Unleashed\nWith over 500 monsters to choose from and a revamped synthesis system to explore, you can mix and match to you heart’s content to create your favorite cute critters and dastardly supervillains, as well as brand-new additions to the monstrous roll call. Psaro is cursed and is unable to harm anything with monster blood. Now, he must become a Monster Wrangler to create an army for battle.\nThe hunt for high-ranked monsters takes Psaro through the ever-changing seasons of Nadiria and its unique environments, with rivers of bubbling lava, mysterious ancient ruins, and soaring towers of cake. Along the way, Psaro meets the kind-hearted elf, Rose, who joins his adventure to seek out ever-stronger monsters.\nThe key to Psaro’s success lies with synthesis: the ability to combine two monsters and create a stronger offspring. Each new creation brings Psaro one step closer to his goal of becoming the Master of Monsterkind.\n(The network mode Online Battles from the console version, where players battle one another in real time, is not included.)",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/dragon-quest-monsters-the-dark-prince-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/dragon-quest-monsters-the-dark-prince-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 64-bit / Windows® 11",
        "Processor": "AMD A8-7600 / Intel® Core™ i3-3220",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ RX 460 / NVIDIA® GeForce® GTX 750",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "Square Enix",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x74y6xp63g9y",
        "https://buzzheavier.com/1uq8bvmulzji"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/dragon-quest-monsters-the-dark-prince-preinstalled-steamrip.jpg"
}