{
    "page_url": "https://steamrip.com/dragon-ball-z-kakarot-2z/",
    "title": "DRAGON BALL Z KAKAROT",
    "description": "Experience the story of DRAGON BALL Z from epic events to light-hearted side quests , including never-before-seen story moments that answer some burning questions of DRAGON BALL lore for the first time Play through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles against the most iconic foes (Raditz, Frieza, Cell etc). Increase your power level through RPG mechanics and rise to the challenge\nDon’t just fight as Z Fighters. Live like them Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters. Relive the story of Goku and other Z Fighters in DRAGON BALL Z: KAKAROT Beyond the epic battles , experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku, Gohan, Vegeta and others. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. Inside the Backrooms",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/dragon-ball-z-kakarot-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/dragon-ball-z-kakarot-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64-bit",
        "Processor": "Intel Core i5-2400 or AMD Phenom II X6 1100T",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 750 Ti or Radeon HD 7950",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "36 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "CyberConnect2 Co. Ltd.",
        "Platform": "PC",
        "Game Size": "47.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.30 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/SBx83P",
        "https://buzzheavier.com/843oxffg6gm4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/dragon-ball-z-kakarot-preinstalled-steamrip.jpg"
}