{
    "page_url": "https://steamrip.com/dragon-ball-fighterz-free-download-3e/",
    "title": "DRAGON BALL FighterZ Ultimate Edition Direct Play",
    "description": "DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its all-powerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay. Using the power of the Unreal engine and the talented team at Arc System Works\nDRAGON BALL FighterZ is a visual tour-de-force. Build your dream team and sharpen your skills to master high-speed tag combinations. Ranked matches, interactive lobby, crazy 6-player Party Match There is something for every taste Discover a never-seen-before scenario featuring Android 21, a brand new character whose creation was supervised by Akira Toriyama himself. DLCs Included FighterZ Pass SSGSS Goku and SSGSS Vegeta Unlock SSGSS Lobby Avatars Stamps: Girls Pack Goku (Super Saiyan) Exclusive Lobby Avatar Color Android 21 Early Unlock Anime Music Pack Commentator Voice Pack Bardock Broly Zamasu (Fused) Vegito (SSGSS) Goku Vegeta Android 17 Cooler 4 Extra Stamps Anime Music Pack 2 Jiren Videl Goku (GT) Janemba Gogeta (SSGSS) Broly (DBS) FighterZ Pass 2 Commentator Voice Pack 2 Commentator Voice Pack 3 Commentator Voice Pack 4 Kefla Goku (Ultra Instinct) Master Roshi Gogeta (SS4) Super Baby 2 FighterZ Pass 3 Android 21 (Lab Coat) How to run Game: Run GDK_Helper.bat , which is located in the game folder Turn on the developer mode. (type 3 in cmd then Enter) Install the game. (type 1 in cmd then Enter) (if DLCs option available, install them too) Turn off the developer mode. (type 4 in cmd then Enter) Run the game through the start menu shortcut. When you enter the game, you will be asked for login information with a Microsoft account. DO NOT USE YOUR EXISTING ACCOUNT, THERE IS A BAN RISK. Create a new one that you don’t mind SCREENSHOTS SYSTEM REQUIREMENTS OS : Windows 7/8/10 (64-bit OS required) Processor : AMD FX-4350, 4.2 GHz / Intel Core i5-3470, 3.20 GHz Memory : 4 GB RAM Graphics : Radeon HD 6870, 1 GB / GeForce GTX 650 Ti, 1 GB DirectX : Version 11 Network : Broadband Internet connection Storage : 6 GB available space GAME INFO Genre: Action Developer: Arc System Works Platform: PC Game Size: 5.4 GB Multiplayer By: 0xdeadc0de Version: v1.0.36.0 | Full Version + All DLCs Pre-Installed Game INSTALLATION GUIDE 1. Run GDK_Helper.bat , which is located in the game folder. (performed once) 2. Enable Developer Mode . (restart your PC if necessary) (performed once) Before enabling developer mode, read up on what it is on the Internet. 3. Install the game . (performed once) 4. Install DLC . (performed once) 5. Disable Developer Mode . (performed once) 6. Launch the game through the start menu . Buzzheavier DOWNLOAD HERE DataNodes DOWNLOAD HERE",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/05/DRAGON-BALL-FighterZ-Free-Download-Steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/05/DRAGON-BALL-FighterZ-Free-Download-Crack-Steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 (64-bit  required)",
        "Processor": "AMD FX-4350, 4.2 GHz / Intel Core i5-3470, 3.20 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD 6870, 1 GB / GeForce GTX 650 Ti, 1 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Arc System Works",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v1.0.36.0 | Full Version + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/34cyovm24g5k",
        "https://datanodes.to/prikp3kv5vrw/Dragon-Ball-FighterZ-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/05/DRAGON-BALL-FighterZ-Free-Download-Pre-Installed-Steamrip.jpg"
}