{
    "page_url": "https://steamrip.com/dream-engines-nomad-cities-free-download/",
    "title": "Dream Engines: Nomad Cities",
    "description": "Advanced society is long gone, the world is overrun by the Dream Plagues . The only survivors are small nomadic tribes that don’t attract too much attention. And now, the discovery of a long-abandoned project of the ancients lights a new hope – the flight-capable Nomad Cities. Bloodstained: Ritual of the Night\nYour city’s population and economy form the backbone of your survival . Running out of food or resources can be just as dangerous as meeting a Dream Plague in the wilds. Plan and build automated production lines, and keep your people housed, happy and well fed.\nFortify your city and defend it against raids for as long as you can. But even the ancients were unable to withstand the Dream Plagues forever – the longer you stay, the stronger they become. Unlike the ancients, however, you are able to grab your entire city and just fly away when things become too rough.\nYour city’s area is limited. You’ll have to balance between expensive long-term upgrades to expand your city, and building disposable infrastructure that will be left behind. Carefully choose which buildings you take with you and which you can live without – at least for a while.\nResources are rare, and you’ll need a lot of them to turn your city into a self-sufficient empire. Good thing you can always move to another area when you’ve depleted everything around you. Every biome has an unlimited variety of procedurally generated landing areas, that each have different resources, opportunities, and challenges.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/dream-engines-nomad-cities-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/dream-engines-nomad-cities-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/8/10 64-bit",
        "Processor": "3.0 Ghz Dual Core CPU",
        "Memory": "8 GB RAM",
        "Graphics": "DirectX 11 GPU with 2GB of memory (GTX 660 or better)",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Suncrash",
        "Platform": "PC",
        "Game Size": "689 MB",
        "Released By": "TENOKE",
        "Version": "v1.0.539 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h1hba6hg0ya0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/dream-engines-nomad-cities-preinstalled-steamrip.jpg"
}