{
    "page_url": "https://steamrip.com/dread-templar-free-download-l3/",
    "title": "Dread TemplarFree",
    "description": "Get Dread Templar PC game for free instantly and play pre-installed on SteamRiP\nDread Templar is a fast- paced first-person shooter that combines elements from both modern retro shooters and classics from the 90s. You are a Dread Templar seeking his revenge deep in the evil realm. Explore the levels and solve puzzles to find hidden weapons and upgrades . Face hordes of demons and bloodthirsty fiends using ninja equipment, firearms, and infernal weapons that will make YOU the scariest thing in hell. Gain Dread Powers and customize your skills according to your playstyle, as they will help you in your battle against the dark forces.\nIt’s a very familiar game, to be sure. At first, you’ll only have dual blades and dual pistols. The blades can be combined into a single projectile and thrown for massive damage, but doing so leaves you without them while the ability cools down. As you play, you’ll find new weapons, many of which use the id Software standard of “stronger weapons that use the same type of ammo.” For instance, the dual pistols are succeeded by twin SMGs, while the shotgun gets locked into a slot with its twin cousin; the super shotgun. You even get a bow and a trap weapon for your wrist.\nFeatures:",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/dread-templar-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/dread-templar-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 Bit",
        "Processor": "CPU 2.5+ GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVidia GTX 560",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Early Access",
        "Developer": "T19 Games",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.2b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x6sqg2fdm56n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/dread-templar-free-download-torrent-steamrip-1.jpg"
}