{
    "page_url": "https://steamrip.com/dreadout-free-download-d1/",
    "title": "DreadOut",
    "description": "DreadOut is a third person supernatural horror game where you play as Linda , a high school student trapped in an old abandoned town. Equipped with her trusty smart-phone and an SLR camera, she will battle against terrifying encounters and solve mysterious puzzles which will ultimately determine her fate.\nWhen a group of high school students went astray from a field trip, they came across something totally unexpected. A town long forgotten trapped in a peaceful state of slumber. What they did not realize was what lurks within. And what seemed like an innocent stroll turns into disaster as the secluded town reveals its dark and terrible secrets. The presence of sinister forces from beyond their realm of existence. The Jackbox Party Pack 6\nIt all comes down to Linda. She will experience stirrings of unfamiliar powers, emerging from within her. These new found abilities might just be the only way she can save her own life and those of her friends.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/dreadout-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/dreadout-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 / 8",
        "Processor": "Intel Dual-Core 2.4 GHz or AMD Dual-Core Athlon 2.5 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce 8800GT or AMD Radeon HD 3830 or Intel HD  4000, 512 MB VRAM",
        "DirectX": "Version 9.0c",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Digital Happiness",
        "Platform": "PC",
        "Game Size": "4.1 GB",
        "Released By": "GOG",
        "Version": "v2.2.18 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yxdnsuruh6pn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/dreadout-preinstalled-steamrip.jpg"
}