{
    "page_url": "https://steamrip.com/drive-rally-free-download/",
    "title": "#DRIVE Rally",
    "description": "#DRIVE Rally not only nails the spirit of the 90s. It reignites it for a new generation of drivers. Whether you’re a veteran of dirt roads or a rookie just looking to get their tires wet, this game will let you redefine speed over and over again.\n#DRIVE World\nFrom the sunny landscapes of Dry Crumbs , through the whispering woods of Holzberg, to the chilly wilderness of Revontuli. Take a journey to a diverse world you haven’t experienced in racing games before.\nLegendary Cars\nJump behind the wheel of legendary rally cars, including Das Holzwagen, The Doggo , The Bobond, and many more. We’re going 90s this time, so there’s also going to be new stuff. Das Sandsturm and Celestia just for a start!\nPassionate Co-Drivers\nYour co-driver can be your biggest cheerleader and toughest judge. It’s a partnership that thrives on performance and emotions! Their goal is to assist your performance with helpful directions and navigation, critical to informing your next maneuver , and tips on improving your performance – sometimes delivered a little too passionately. Nikoderiko: The Magical World",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/drive-kill-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/drive-kill-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3 2.5GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Geforce GTX 650 or equivalent",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Racing, Simulation, Sports",
        "Developer": "Pixel Perfect Dude",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "RUNE emu",
        "Version": "Build 18120182 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9tbrft5zvgmz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/drive-kill-preinstalled-steamrip.jpg"
}