{
    "page_url": "https://steamrip.com/driver-san-francisco-free-download-1s/",
    "title": "Driver San Francisco",
    "description": "With crime lord Charles Jericho now on the loose, San Francisco faces a terrible threat. Only one man can stand against him. He has driven the streets of a hundred cities and spent his whole life putting criminals behind bars. But to take Jericho down, there can be no turning back, and he knows that this may very well be his last ride. His name is John Tanner. He is the DRIVER. Rediscover the cinematic driving sensations of DRIVER: loose suspension, long drifts, Hollywood-style crashes and high-speed pursuits in dense traffic. Conan Chop Chop\nDrive over 130 fully destructible muscle and super cars with realistic handling and customization features that take fast-action driving to the next level. Uncover a thrilling character-driven storyline in which personal revenge fuels Tanner’s relentless manhunt for Jericho .\nFollow Tanner’s survival race across San Francisco and beyond to discover how this chase will bring him to a point of no return. As Tanner recovers from a terrible crash, he realizes he has acquired a new ability, SHIFT, enabling him to instantly change vehicles and take control.\nExperience unprecedented intensity, diversity and freedom; SHIFT into a faster car, deploy civilian vehicles to destroy your enemies and even take control of your opponents’ car to force their demise. SHIFT also allows for thrilling new Multi-player modes within the game. Drive on more than 200 square miles of road network, over the Golden Gate Bridge, and through iconic locations of San Francisco.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/driver-san-francisco-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/driver-san-francisco-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win XP, Win Vista, Win 7",
        "Processor": "Intel Core 2 Duo or Athlon 64 X2 Quad Core",
        "Memory": "1 GB RAM",
        "Graphics": "GeForce 7600 GT",
        "DirectX": "Version 9",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action,Racing",
        "Developer": "Ubisoft Reflections",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Released By": "PROPHET",
        "Version": "v1.04 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/ItleL8",
        "https://1fichier.com/?l6xyt9s89v1kgbfb4qo0",
        "https://megadb.net/b1ppton053ag"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/driver-san-francisco-preinstalled-steamrip.jpg"
}