{
    "page_url": "https://steamrip.com/dros-free-download-m1/",
    "title": "DROS",
    "description": "Discover the world of Dros, a beautifully detailed story-driven adventure about a slimy little creature and her human bounty hunter shell. Little Dros and Captain both have different strengths and weaknesses and you’ll switch between them to solve puzzles, fight off enemies and sneak through a vast steampunk Tower.\nThe world of Dros features a fantasy story with a huge cast of odd and interesting characters to interact with. Unravel the mysteries within the Tower as you explore, unlock journal entries and collect strange alchemical treasures. One Military Camp\nDUAL-CHARACTER PLAY Use both characters’ abilities to make it through the Tower. Jump, squirm and stealth around as Little Dros and fight off creepy enemies as Captain. As you journey upward through the Tower you’ll converse with a range of other strange beings. Each character has their own story to tell their own struggles.\nNo one is truly good or truly evil. Inside the Tower use both brains and brawn to solve puzzles, take on enemies and collect alchemical treasures . Unlock journal entries that expand world lore and flesh out character backstories.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/dros-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/dros-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5 Quad-Core, 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660 or AMD R7 260x",
        "DirectX": "Version 10",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "emergeWorlds",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Released By": "FLT",
        "Version": "Build 11744801 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4b2ofhe61rql"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/dros-preinstalled-steamrip.jpg"
}