{
    "page_url": "https://steamrip.com/duck-life-9-the-flock-free-download/",
    "title": "Duck Life 9: The Flock",
    "description": "Welcome to the newest chapter of the Duck Life series, Duck Life 9, where the ducks are still finding new ways to do what they do best honing their skills and racing their way to the top! Touch down on the tropical archipelago of Featherhaven Island and set up shop in your own little town, ready to rise up the ranks and become the fastest flock there is Gift\nDifferent Duck stats\nGet ready to cultivate the most talented bunch of ducks any farmer has ever had! Start your flock from selection of different eggs, each with unique skill bonuses that affect how well they can utilise their skill levels during races. But let’s not get ahead of ourselves, before we hotfoot it to the races it’s time to get your newly-hatched duck to grips with some training!\nTraining\nBecoming the champion won’t be easy, though, as this is hardly a simple matter of training alone. Feed and clothe your ducks to help boost their stats, and then race every challenger you can find! The island itself is filled with many tricky tasks to overcome, and without fully exploring each of the 9 areas that surround your humble settlement, you won’t stand a chance against the mysterious challenger that looms atop the volcano",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/duck-life-9-the-flock-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/duck-life-9-the-flock-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 (SP1+) or Windows 10/11",
        "Processor": "x86, x64 architecture with SSE2 instruction set support",
        "Memory": "2 GB RAM",
        "Graphics": "DX10, DX11, DX12 capable.",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Racing, Simulation, Sports",
        "Developer": "Wix Games",
        "Platform": "PC",
        "Game Size": "696 MB",
        "Released By": "TENOKE",
        "Version": "Build 14290650 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/c38n00slus91"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/duck-life-9-the-flock-preinstalled-steamrip.jpg"
}