{
    "page_url": "https://steamrip.com/dune-spice-wars-free-download-r1/",
    "title": "Dune Spice Wars",
    "description": "A 4X real-time strategy game from the developers of the critically acclaimed Northgard . Set in Frank Herbert’s groundbreaking Dune universe, you must lead your faction and battle for control and dominance over the harsh desert planet of Arrakis. Spice is the most valuable resource in the universe. Peglin\nThe spice extends life, expands consciousness, and makes interstellar travel possible. Found only on Arrakis, it is sought by the most influential forces in the universe. Play as one of several factions, including House Atreides, House Harkonnen, the Smugglers, and the native Fremen, and compete for power over Dune and the spice.\nScan the landscape for wormsign or risk losing your troops and spice harvesters to titanic sandworms who will burst through the dunes to swallow and devour them whole. Crush your opponents in combat, best them through political intrigue, and undermine them with your network of illusive spies. Experience the unique Dune universe, one of the most influential sci-fi settings ever created. Lead your faction to victory with iconic characters, such as Duke Leto Atreides, the Baron Vladimir Harkonnen, Esmar Tuek, and Liet Kynes.\nStay alert as opposing factions seek to gain the upper hand and the planet itself threatens with withering deserts, huge storms, and consuming sandworms. Balance open warfare, subterfuge , political influence, and economic supremacy to prevail and gain control over the most important planet in the universe! Use secretive agents to sabotage the plans of your opponents. Vote on political resolutions in the Landsraad to further your strategy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/dune-spice-war-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/dune-spice-war-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 and Windows 11",
        "Processor": "Intel Core i5 2.5 GHz or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GTX 1050 or AMD equivalent",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Shiro Games",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "RUNE",
        "Version": "v2.2.6.32935 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/f09w2uee5gbr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/dune-spice-war-preinstalled-steamrip.jpg"
}