{
    "page_url": "https://steamrip.com/dungeons-of-hinterberg-free-download/",
    "title": "Dungeons of Hinterberg",
    "description": "Welcome to Hinterberg, a new tourist hotspot in the idyllic Austrian Alps! You play as Luisa, a burnt-out law trainee taking a break from her fast-paced corporate life to conquer the Dungeons of Hinterberg. There are plenty of dungeons to find and adventures to be had in Hinterberg – will Luisa be sent packing on her first day, or remain to become a Master Slayer? Only one way to find out. Gym Simulator 24\nSnowboard down a glacier, zipline through the forest, climb a mountain, or have a coffee by the lake… There’s no shortage of places to discover while you’re out looking for your next dungeon Monsters lurk around every corner in Hinterberg, and your sword and magic skills are essential for keeping them at bay. Harness the wind, conjure a snowboard out of thin air, or freeze your enemies in a jelly block\nBraving a dungeon requires more than just cutting -edge sports gear and a good sword arm: Hinterberg’s dungeons are full of puzzles that will surprise and challenge you. Use your head, your magic skills, and every trick in the book to solve them",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/dungeons-of-hinterberg-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/dungeons-of-hinterberg-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i5-4670K (4 * 3400) / AMD FX-4350 (4 * 4200) or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 960 (4096 MB) / Radeon RX 550 (4096 MB) or equivalent",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Microbird Games",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "TENOKE",
        "Version": "Build 15076385 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/83yz1je15yve"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/dungeons-of-hinterberg-preinstalled-steamrip.jpg"
}