{
    "page_url": "https://steamrip.com/dungeon-defenders-free-download-1l/",
    "title": "Dungeon Defenders Directly Download",
    "description": "Dungeon Defenders is a Tower Defense Action- RPG where you must save the land of Etheria from an Ancient Evil! Create a hero from one of four distinct classes to fight back wave after wave of enemies by summoning defenses and directly participating in the action-packed combat Customize and level your character, forge equipment, gather loot, collect pets and more SLUDGE LIFE 2\nTake your hero through multiple difficulty modes and challenge/survival missions to earn more experience & even better treasure. Join your friends with 4-player online and local (splitscreen) co-op to plan your strategies together or compete in PvP Deathmatch . 4-player Online and Local Co-Op Team-up with up to 3 friends to defend cooperatively, with character classes that support each other’s strengths and weaknesses. Dynamically combine local (splitscreen) and online players and leave/join any time, so that the game’s always full.\nTower-Defense Meets Action-RPG – Choose your class, customize your character & equipment, strategically assemble your defenses, and participate directly in action-packed battle to preserve your castle against the invading horde 4 Distinct Character Classes Each character class has a different skill tree, set of towers, and even basic attacks! You can choose if you want to play stealthy, turn invisible, and plant traps behind enemy lines with the Huntress or go all out, block off choke points, and brutally beat your foes into submission with the Squire Loot and Level-Up Grab the mounds of money and items that your defeated foes drop and trade them or store them for later use in your Item Box\nGetting kills and completing waves earns you experience points, which can be used to upgrade your characters, skills, equipment, and towers on a per-statistic basis. Do you want to enhance Hit Points, Attack Rate, Damage, etc? The choice is your Store your massive overflow of money in the ‘ Mana Bank ‘ and then spend it to improve your equipment or trade with other players. Proudly show off your best equipment in your own ‘Adventurer’s Tavern’, without fear of item theft.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/dungeon-defenders-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/dungeon-defenders-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP",
        "Processor": "1 Ghz Dual-Core CPU",
        "Memory": "1 GB RAM",
        "HDD": "2GB"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Strategy",
        "Developer": "Chromatic Games",
        "Platform": "PC",
        "Game Size": "10.1 GB",
        "Released By": "TiNYiSO emu",
        "Version": "v10.1.0 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/utFoeM",
        "https://megadb.net/56r1c3f6lmzf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/dungeon-defenders-preinstalled-steamrip.jpg"
}