{
    "page_url": "https://steamrip.com/dungeons-of-aether-free-download-z1/",
    "title": "Dungeons of Aether",
    "description": "Dungeons of Aether is a turn-based dungeon crawler designed by Nikita ‘ampersandbear’ Belorusov from the Aether Studios team. Rivals of Aether is known for its intense competition and twitch skills, while Dungeons of Aether allows you to take things at your own pace but it’s still just as challenging Every choice you make can lead you deeper into the dungeons or to an early demise .\nWill you carry out a treasure chest, or be carried out in a pine box? The combat in Dungeons of Aether uses a dice draft system that ensures each battle is unique while challenging the player to adapt the pool of dice each turn. Use fortune to your favor to defeat your foes, collect treasures and shift the odds in your favor. Dungeons of Aether introduces four exciting new heroes to the world of Aether , each with their own unique skills and memorable personalities. Tchia\nFleet is the self-proclaimed protector of her hometown of Julesvale, although she’s seen as a clumsy menace more than a hero. As the jack of all trades, Fleet is a great character for learning the combat system. Hamir is a former Wall Runner from the mighty Rock Wall. He has made his way to Julesvale in exile after losing his trusted partner. Hamir now finds himself looking for a purpose and the courage to carry on.. Hamir is strong and sturdy, weathering blows until the time is right to crush his foes.\nSlade is a pirate from the far-off Polekai Islands . He has made his way to Julesvale hunting a mysterious rare mineral unique to Julesvale. Rumor has it the mineral is key to saving his homeland. Slade’s style and swagger allow him to dodge attacks entirely if his speed is high enough. Artemis is a renowned general in the Fire Mora who often fought alongside Zetterburn . She was sent to Julesvale by Emperor Loxodont on a secret mission. Artemis can heal her wounds in battle, showing off her innate regeneration abilities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/dungeons-of-aether-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/dungeons-of-aether-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® 7 / 8 / 10 / 11",
        "Processor": "2.0GHz processor",
        "Memory": "512 MB RAM",
        "Graphics": "DirectX Compatible graphics card with at least 32MB of video memory",
        "DirectX": "Version 9.0c",
        "Storage": "75 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Dan Fornace, ampersandbear",
        "Platform": "PC",
        "Game Size": "112 MB",
        "Released By": "ALI213",
        "Version": "v1.11 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hhlr4rpl824s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/dungeons-of-aether-preinstalled-steamrip.jpg"
}