{
    "page_url": "https://steamrip.com/dungeons-degenerate-gamblers-free-download/",
    "title": "Dungeons & Degenerate Gamblers",
    "description": "Begin your adventure in a tavern that is home to a unique, corrupted version of blackjack you have never played before. You will need to pick up the rules and adapt to them as you progress through the tavern, challenging a colourful cast of blackjack-addicted townspeople . Discover the mystery of who runs this twisted casino as you progress through the tavern to take them down Knock on the Coffin Lid\nPick a suit: hearts for healing, spades to offer you some protection, diamonds for more currency for shop purchases , or clubs for extra damage. Remove cards from your deck as you progress. Pick up more aces and face cards, or fill your deck with tarot cards, business cards, birthday cards, hall passes and more\nMake your way through the tavern challenging patrons , purchasing additional cards for your deck, resting up when your health gets low, opening boosters packs, participating in minigames and much more! Take on the run-based deckbuilding roguelike challenge, with endless possibilities for unique and interesting decks",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/dungeon-degenerate-gamblers-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/dungeon-degenerate-gamblers-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, RPG, Strategy",
        "Developer": "Purple Moss Collectors",
        "Platform": "PC",
        "Game Size": "463 MB",
        "Released By": "TENOKE",
        "Version": "Build 15300981 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d3f35mqrufm1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/dungeon-degenerate-gamblers-preinstalled-steamrip.jpg"
}