{
    "page_url": "https://steamrip.com/dusk-diver-2-free-download-1j/",
    "title": "Dusk Diver 2",
    "description": "The story begins with a girl named Yang Yumo and her classmate Liu Yusha when they accidentally trespassed Youshanding and started an adventure. After arriving at Youshanding, Yumo and Yusha were attacked by the Chaos Beasts and passed out.\nFortunately, Leo, a Stone Lion Warrior who’s in charge of repelling the Chaos Beasts in Youshanding, found and saved them. However, Yumo unexpectedly obtained the power of the Dragon Vein energy, rendering her appearance abnormal. To get back her usual looks, she accepted an offer from the Boss, Leo’s superior and the manager of Youshanding.\nAfterward, Yumo has been spending her summer vacation working for them and fighting against the Chaos Beasts. While clearing out the Chaos Beasts that rampaged Ximending, they met two other people from Kunlunian – Bahet and Le Viada. However, these two people seemed to have been brainwashed and were causing trouble in the mortal world and Youshanding . When chasing down clues and searching for the culprit who was controlling Bahet and Le Viada, the culprit showed themselves in front of Yumo and the others.\nMuch to Yumo’s surprise, this culprit was none other than a little girl named Nemea, which is also the Ximending Dragon Vein Energy controlling AI. After a series of battles, Yumo has successfully prevented the system from going out of control and has detached Nemea from its grasp. Then, Yumo’s adventure seems to come to an end.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/dusk-diver-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/dusk-diver-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/Windows 10 64Bit",
        "Processor": "Intel Core i5-6400",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Wanin International",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Released By": "SKIDROW",
        "Version": "v1.0.2 | Full  (Latest) + Summer Swimsuit Set",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vbzij0s441qc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/dusk-diver-2-preinstalled-steamrip.jpg"
}