{
    "page_url": "https://steamrip.com/dustborn-free-download/",
    "title": "Dustborn",
    "description": "Dustborn is a single-player, story-driven action- adventure game about hope, love, friendships, robots and the power of words. MONKEY KING: HERO IS BACK\nYou play Pax: exile, con-artist, Anomal — with the ability to weaponize language. Looking for a new life and a way out, Pax has been hired to transport an important package from Pacifica to Nova Scotia , across the Justice-controlled American Republic. Sounds like a legit reason for a road-trip, right?\nSo pack your bags, assemble a crew with their own peculiar powers, and get ready to travel the country. Explore the stunning Neo-Western landscapes of an alternate history America on a robot-driven tour bus, and stop at a dozen locations along the road to build your crew, manage relationships , complete missions, and face increasingly difficult challenges. But the people you stole the package from want it back, and the authoritarian Justice is hot on your heels, so don’t forget to pack your baseball bat\n(And, oh yeah, you’re travelling undercover as a punk-rock band, so you’ll definitely need to brush up on your musical skills before your next gig.)\nWords have power. Like, actual power. Fight with Shouts and use Vox in conversations to manipulate people and talk your way out of hairy situations. Craft new words, and learn to wield a lingual arsenal against enemies and friends.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/dustborn-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/dustborn-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "Intel Core i5 5th generation or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 2GB or equivalent",
        "DirectX": "Version 11",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Red Thread Games",
        "Platform": "PC",
        "Game Size": "11.1 GB",
        "Released By": "RUNE emu",
        "Version": "v1.10 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/26536BC635",
        "https://buzzheavier.com/a6i6ovbp1xi4",
        "https://datanodes.to/2j6fj8plngnn/Dustborn-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/dustborn-preinstalled-steamrip.jpg"
}