{
    "page_url": "https://steamrip.com/dust-neon-free-download-1q/",
    "title": "Dust and Neon Directly Download",
    "description": "Death is just the beginning in Dust & Neon, an action-packed twin-stick roguelite shooter set in a post-apocalyptic Wild West overrun by villainy. Play as the mysterious gunslinger as he embarks upon an epic quest filled with twitch-trigger precision gunplay, armies of menacing robots, and incredible boss fights.\nIf at first you don’t succeed, try again with dozens of unlockable abilities, thousands of unique weapons, and game-changing performance boosts , all of which transform your hero into an unstoppable force.\nA seriously robust and challenging twin-stick roguelite shooter with visceral reload mechanics —pop each bullet into the chamber during the heat of battle. Best-in-class controls allow for twitch speed and precision gunplay, and a dynamic power-up boost system will have you mowing down mechanical menaces with non-stop action. Dive, slide and seamlessly take automatic cover as you reload and strategize your next move.\nChoose your arsenal from an unlockable selection of nearly 2,000 wholly unique revolvers , shotguns and rifles. 1,600 unique tonics allow you to temporarily change or enhance your gunslinger’s abilities on the battlefield, crack open hundreds of loot boxes filled with money, weapons and upgrades. Upgrade your gunslinger with 24 unique skills that fundamentally change the way the game plays. My Dream Setup",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/dust-and-neon-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/dust-and-neon-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia Geforce 650M or equivalent",
        "DirectX": "Version 9.0"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "David Marquardt Studios",
        "Platform": "PC",
        "Game Size": "271 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10584258 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hep2opojz01t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/dust-and-neon-preinstalled-steamrip.jpg"
}