{
    "page_url": "https://steamrip.com/dying-light-the-following-enhanced-edition-1j/",
    "title": "Dying Light: The Following Free Download",
    "description": "Get Dying Light: The Following PE for free instantly and play pre-installed on SteamRiP\nFrom the creators of hit titles Dead Island and Call of Juarez. Winner of over 50 industry awards and nominations. The game whose uncompromising approach to gameplay set new standards for first-person zombie games. Still supported with new content and free community events years after the release. Survive in a city beset by a zombie virus! Discover the hard choice you will have to make on your secret mission.\nSurf the retrowave a la mode equipped with boldly designed retrofuturistic gear. along side the new Night Rider outfit you’ll receive a replacement buggy paint job (Speedmaster Turbo) and three new weapon blueprints. Don’t let the flashy appearances fool you! Anyone who mistakes the Blademaxx machete, the Vindicator 2000 revolver or the Volkatronix automatic for a toy, are going to be painfully proven wrong. The undisputed star of the show is that the Volkatronix. Designed by Tolga and Fatin for Volkan Dal, it’s the primary Dying Light firearm to shoot electric bullets, and thus a necessary addition to your arsenal. The Survivalists",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/dying-light-the-following-enhanced-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/dying-light-the-following-enhanced-edition-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {},
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Techland",
        "Platform": "PC",
        "Game Size": "32 GB",
        "Released By": "CODEX emu",
        "Version": "v1.51.0 (Build 18721096) | Full version + All DLCs + DevTools + Bonus Content",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/FgjGvB",
        "https://buzzheavier.com/lr0vrqc896x8",
        "https://1fichier.com/?w16nwqgg3ymbp5zi3t4b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/dying-light-the-following-enhanced-edition-free-download-preinstalled-steamrip.jpg"
}