{
    "page_url": "https://steamrip.com/dying-l-two-stay-human-i1/",
    "title": "Dying Light 2 Stay Human",
    "description": "Over twenty years ago in Harran, we fought the virus—and lost. Now, we’re losing again. The City, one of the last large human settlements, is torn by conflict. Civilization has fallen back into the Dark Ages. And yet, we still have hope. You are a wanderer with the power to change the fate of The City. But your exceptional abilities come at a price. Haunted by memories you cannot decipher, you set out to learn the truth… and find yourself in a combat zone. Hone your skills, as to defeat your enemies and make allies, you’ll need both fists and wits. Unravel the dark secrets behind the wielders of power, choose sides and decide your destiny. GigaBash\nBut wherever your actions take you, there’s one thing you can never forget—stay human. Participate in the life of a city engulfed in a new dark era. Discover different paths and hidden passages, as you explore its multiple levels and locations. Take advantage of your parkour skills to tip the scales of even the most brutal encounter. Clever thinking, traps and creative weapons will be your best friends.\nWait for night to venture into dark hideouts of the Infected. Sunlight keeps them at bay, but once it’s gone, monsters begin the hunt, leaving their lairs free to explore. Shape the future of The City with your actions and watch how it changes. Determine the balance of power by making choices in a growing conflict and forge your own experience. Play in up to four-player co-op. Host your own games or join others and see how their choices have played out differently than yours.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/dying-light-2-stay-human-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/dying-light-2-stay-human-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3-9100 / AMD Ryzen 3 2300X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Ti / AMD Radeon RX 560 (4GB VRAM)",
        "Storage": "63 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Techland",
        "Platform": "PC",
        "Game Size": "54.9 GB",
        "Co-op By": "Mr_Goldberg+SSE",
        "Version": "v1.22.4 | Full  + All DLCs + Bonus Content + Co-op (Not Tested)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CGHLZS",
        "https://datanodes.to/5ixqdecltn0c/Dying-Light-2-SH-SteamRIP.com.rar",
        "https://buzzheavier.com/c3ne6pvkvad9",
        "https://gofile.io/d/b4fizv",
        "https://buzzheavier.com/oxpxsove0hyg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/dying-light-2-stay-human-preinstalled-steamrip.jpg"
}