{
    "page_url": "https://steamrip.com/echoes-of-yi-samsara-free-download/",
    "title": "Echoes of Yi : Samsara",
    "description": "ECHOES of YI: SAMSARA is a dark martial arts action game that blends elements of traditional Chinese culture. In this game, players take on the role of the Sword Saint’s first disciple, embarking on an adventure to defeat powerful enemies and prevent a global disaster. Faced with fast-paced combat, players must precisely master the rhythm of offense and defense to experience a highly challenging battle system. Yakuza Kiwami\nUnder the Jianmu Tree of the Sanxingdui site, a heart-wrenching struggle of passion unfolds quietly. Players will delve into the spirit realm, seeking ways to save the world while gradually uncovering the layers of conspiracy within the secret realm, ultimately revealing the deep connection between the divine tree and this world. Will you confront the difficulties with the truth or drift aimlessly? The choice is in your hands.\nThrough rapid transitions between offense and defense, and precise counterattacks, players can build up the enemy’s momentum bar, causing their defenses to collapse. Once an opportunity is seized, players can unleash deadly attacks, experiencing a high-intensity battle that seamlessly integrates offense and defense.\nThe game deeply incorporates traditional Chinese culture, featuring elements such as the Sanxingdui ruins and Peking opera. The designs of the bosses and the arrangement of the scenes reflect the unique essence of traditional culture.\nPlayers can learn and utilize various traditional martial arts, including Tai Chi, sword techniques, and spear techniques. The game also integrates rich folklore, traditional customs, and cultural heritage.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2776940/6325682e3dbdb06bd1b6015f6d4030cae42fa778/ss_6325682e3dbdb06bd1b6015f6d4030cae42fa778.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2776940/c000c4762c7dfe9440450017b7333a38f77caa59/ss_c000c4762c7dfe9440450017b7333a38f77caa59.600x338.jpg",
        "https://gofile.io/d/z6Z2EF",
        "https://buzzheavier.com/eh6xbs8ajbp5"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit",
        "Processor": "Intel Core i3-2100 | AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Runmeng",
        "Platform": "PC",
        "Game Size": "22 GB",
        "Released By": "RUNE | Ty Let’sPlay, cs.rin.ru",
        "Version": "Build 18321989",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/z6Z2EF",
        "https://buzzheavier.com/eh6xbs8ajbp5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/Echoes-of-Yi-Samsara_featured_final.jpg"
}