{
    "page_url": "https://steamrip.com/eco-global-survival-game-free-download-v1/",
    "title": "Eco Global Survival Game Free Download",
    "description": "Eco Global Survival Game Download PC Game In Direct Link for free on SteamRIP\nEnter the world of Eco, a fully simulated ecosystem bustling with thousands of growing plants and animals living their lives. Build, harvest, and take resources from an environment where your every action affects the world around you. An imminent meteor strike threatens global destruction. Can you save the world without destroying it in the process?\nConstruct buildings and towns, tend to your farm, hunt wildlife , build infrastructure and transportation, craft clothing, build power plants, and research new technologies. Specialize in a craft and trade your goods to other players. Develop your civilization and sculpt your planet.\nAs your civilization grows, you’ll need to analyze data from the simulation; evaluating the impact you have on your world. Use this data as evidence in proposed laws, restricting harmful activities without disrupting the advancement of technology. Balance your individual needs with the needs of community, all while maintaining the state of the ecosystem. The future of your world is in your hands. Every organism in Eco exists as part of a detailed simulation; a disruption in one species can have cascading effects across the planet.\nChop down all the trees, and habitats for creatures will be destroyed. Pollute the rivers with mining waste, and your farms will become poisoned and die. The ecosystem supplies the resources you and your community will need to stop the meteor. Manage your pollution, mining waste, hunting, and resource collection to balance your effect on this system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/eco-global-survival-game-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/eco-global-survival-game-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD Ryzen 5 1500X 3.5 GHz Quad-Core or Intel i5-6500 3.2 GHz Quad-Core or similar",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon HD 7850 or NVIDIA GeForce GT 640",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Early Access",
        "Developer": "Strange Loop Games",
        "Platform": "PC",
        "Game Size": "3.6 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v0.11.1.8 | Early Access (Latest) + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4jcjjuca038t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/eco-global-survival-game-preinstalled-steamrip.jpg"
}