{
    "page_url": "https://steamrip.com/eiyuden-chronicle-hundred-heroes-free-download/",
    "title": "Eiyuden Chronicle: Hundred Heroes",
    "description": "Our story begins in one corner of Allraan, a tapestry of nations with diverse cultures and values. By dint of sword, and by way of magical objects known as “rune-lenses,” the land’s history has been shaped by the alliances and aggressions of the humans, beastmen , elves, and desert people who live there.\nThe Galdean Empire has edged out other nations and discovered a technology that amplifies the rune-lenses’ magic. Now, the Empire is scouring the continent for an artifact that will expand their power even further. It is on one such expedition that Seign Kesling, a young and gifted imperial officer, and Nowa, a boy from a remote village, meet each other and become friends. However, a twist of fate will soon drag them into the fires of war, and force them both to reexamine everything they believe to be right and true.\nEiyuden Chronicle: Hundred Heroes became the #1 funded Kickstarter video game of 2020 thanks to phenomenal support from the community. 505 Games is truly honored to publish Eiyuden Chronicle and work with Rabbit & Bear to help deliver a memorable gaming experience to fans. The goal of Rabbit & Bear and 505 Games is to make sure Eiyuden Chronicle reaches its true potential and delivers a worthwhile JRPG the community will enjoy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/eiyuden-chronicle-hundred-heroes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/eiyuden-chronicle-hundred-heroes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "CPU: Intel Core i5-4670K (4 * 3400) / AMD FX-4350 (4 * 4200)",
        "Memory": "8 GB RAM",
        "Graphics": "GPU: GeForce GTX 660 (2048 MB) / Radeon R7 260X (2048 MB)",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Strategy",
        "Developer": "Rabbit & Bear Studios",
        "Platform": "PC",
        "Game Size": "18.4 GB",
        "Released By": "RUNE",
        "Version": "Build 14133848 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/XaLmC5",
        "https://buzzheavier.com/yk6q8ywiyx9y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/eiyuden-chronicle-hundred-heroes-preinstalled-steamrip.jpg"
}