{
    "page_url": "https://steamrip.com/elderand-free-download-1h/",
    "title": "Elderand",
    "description": "Through the darkness and madness, promised glory awaits. Heads will literally roll in this gruesome, retro-inspired action platformer, where only the strong will survive in brutal, skill-based combat against terrifying creatures. Wield a variety of killing instruments and abilities to test your metal against towering, bone-chilling bosses. Explore a twisted Lovecraftian world shrouded in darkness and madness . RPG elements allow you to customize your battle experience to your liking, from your character’s appearance to skills, stats, and weapons.\nWield an arsenal of killing devices, including whips, swords, daggers, axes, bows, and more. From a magical staff that shoots bursts of energy to a giant sword, different weapons have different stats and capabilities, so find the ones that you enjoy battling beasts with the most Satisfying Metroidvania-style exploration meets terrifying Lovecraftian creatures in this detailed hand-drawn pixel world with glorious gothic aesthetics and handcrafted level design. RPG elements let you customize your experience to best suit your play style, from your character’s appearance to their skills, stats, and weapons. Spelunky",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/elderand-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/elderand-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 32bit",
        "Processor": "Intel Core 2 Duo E7500 2.93 GHz / AMD Athlon 64 X2 Dual Core  5600+ 2.9GHz",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce 9600 GT/ AMD Radeon HD 6450",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Mantra, Sinergia Games",
        "Platform": "PC",
        "Game Size": "212 MB",
        "Released By": "CODEX emu",
        "Version": "v1.3.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tg8ni1o6p2f5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/elderand-preinstalled-steamrip.jpg"
}