{
    "page_url": "https://steamrip.com/electrician-simulator-free-download-1l/",
    "title": "Electrician Simulator Directly Download",
    "description": "Perform minor repairs, starting with replacing sockets and light bulbs, installing comprehensive systems in the houses of the customers, and repairing stuff or just laying wires. Sit down and relax in front of the computer as a virtual electrician, without the risk of physical electric shock\nLearn the tricks of the trade and become the best professional this city has ever seen Just like in real life, in Electrician Simulator you will be fixing broken stuff, assembling sockets, repairing gamepads, remote controls, speakers, plugs, chandeliers, changing light bulbs, and laying wires. Get to know your clients and solve their problems. Slime Rancher 2\nThis true-to-life plot is bound to make you feel like a real electrician Remember to get all the necessary gear before you meet the client, and make sure to check everything twice. There is no place for mistakes What could be more interesting than new challenges? This job just never gets boring Check your work inbox regularly and accept various orders – from small tasks to complex electrical installations Remember to measure the strength of intentions – being an electrician is not just fun and games. Poorly done work can have serious consequences! It is better not to annoy customers .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/electrician-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/electrician-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel Core i5-8400 / AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 970 / AMD Radeon RX 580",
        "DirectX": "Version 9.0c",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "Take IT Studio!",
        "Platform": "PC",
        "Game Size": "8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.8.3 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Nw78Um",
        "https://buzzheavier.com/xn7rn82gpevr",
        "https://megadb.net/9yab5ks8aff9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/electrician-simulator-preinstalled-steamrip.jpg"
}