{
    "page_url": "https://steamrip.com/elsie-free-download/",
    "title": "Elsie",
    "description": "Welcome to the planet Ekis, a bountiful world filled with natural resources and scientific discovery! There is chaos amongst this wonder however, in a world awash with natural disasters. Our story begins with Dr Grey, a talented scientist who engineered a team of high-tech androids with the power to prevent these disasters.\nThese Androids were known as “The Guardians “. Dash, dive, and shoot your way through stages filled with dynamic enemies, all while performing perfectly timed precision parrying. Satisfactory\nDeath is only the beginning: In this roguelike rollercoaster die and die and die again – but you’ll always get back on your feet to embrace the chaos.\nExplore the technicolour Domains of Planet Ekis Take a tour of Planet Ekis’s vibrant neon-drenched biomes. With procedural generation leading to everchanging levels, each run presents unique challenges and enemies.\nAugmented Action and Character Customization: Make strategic decisions on upgrades, skills, and weapons to drastically alter the dynamic of each run. Experiment with different playstyles for devastating synergies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/elsie-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/elsie-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel 8th Gen Quad Core or AMD Ryzen Quad Core",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia 450 GTS / Radeon HD 5750 or better",
        "DirectX": "Version 11",
        "Storage": "700 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Knight Shift Games",
        "Platform": "PC",
        "Game Size": "338 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 15586169 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nomnf4khwa05"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/elsie-preinstalled-steamrip.jpg"
}