{
    "page_url": "https://steamrip.com/ember-knights-free-download-1w/",
    "title": "Ember Knights",
    "description": "In this fast-paced action rogue-lite, play as Ember Knights, the last spark of hope of a universe in turmoil . Praxis, the mad sorcerer, has syphoned the life out of the Ember Tree and fled through the four Prime Worlds spreading corruption in his path. In solo or co-op (up to 4 players), use powerful weapons and skills to hack and slash deadly hordes, defeat epic bosses, free the decaying\nPrime Worlds and restore energy to the Ember Tree Legendary warriors, the Ember Knights, are skilled in the wielding of 6 weapons each with its own modification system However, the sword doesn’t make the knight. Through action-packed combat rooms, you’ll need to chain your attacks and perfectly time your swings to unleash fiery attacks. Planes, Bullets and Vodka\nWith 6 distinct weapons, 9 modifications per weapon, 17 skills and 85 relics, there are hundreds of deadly builds to create. Froma fire spreading scythe wielder to a relentless damage resistant spellcaster to a poison spreading archer with summons, forge your own build during your runs.\nBeasts, specters, sorcerers, mechanized amphibians, and creatures of all sorts Fight over 60 unique monsters and variations each with their own unique attacks and behaviors. Be prepared to face Elites and Champions, they are more resistant and deadlier versions of Praxis’ devoted minions. You will have to adapt your playstyle to each encounter and learn from your mistakes if you wish to succeed.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/ember-knights-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/ember-knights-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia 450 GTS / Radeon HD 5750 or better",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Doom Turtle",
        "Platform": "PC",
        "Game Size": "735 MB",
        "Released By": "TENOKE emu",
        "Version": "v2.2.1 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5c3zkeocyqei"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/ember-knights-preinstalled-steamrip.jpg"
}