{
    "page_url": "https://steamrip.com/embr-free-download-o1/",
    "title": "Embr Free direct Download",
    "description": "Get Embr v06.01.2022 for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nTeam up with friends to become the most über firefighters money can buy. Rush into burning buildings filled with dangerous hazards, valuables, and top-of-the-line security systems. Fight fires, save lives, salvage goods, and make life-changing money. Buy high tech tools with advanced upgrades , and fresh outfits that unlock new ways to play. There’s plenty of fire to go around Play by yourself or join a response crew of up to 4 players online, with dynamic difficulty that adapts to the size of your team. Medieval Dynasty\nPlay through 25 unique levels across 3 districts filled with traps, hazards , and escalating danger. There’s more than one way to be a hero. Break down doors, smash windows, fix electrical circuits, clear gas leaks, evade security systems, and do whatever you can to get the job done and get paid. Earn five star ratings to attract the attention of wealthy customers . And if you’re short on cash, try snatching a few valuables while the clients aren’t looking.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/embr-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/embr-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 8.1, 10 x64",
        "Processor": "Intel i5-6600 Series @ 3.5 GHz / Intel i7-4760 @ 3 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 960",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation, Strategy",
        "Developer": "Muse Games",
        "Platform": "PC",
        "Game Size": "4 GB",
        "Repack By": "GOG",
        "Version": "v06.01.2022 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jvvuam3zvy5l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/embr-free-download-preinstalled-steamrip.jpg"
}