{
    "page_url": "https://steamrip.com/emergency-crew-volcano-eruption-m3/",
    "title": "Emergency Crew Volcano Eruption Free Download",
    "description": "Get Emergency Crew Volcano Eruption for free instantly and play pre-installed SteamRiP\nAn earthquake occurred in Coastland! The Emergency Crew by Stephen Shepard immediately went to rescue people. Starting its mission from the coast, the group quickly moved to the city center, where buildings collapsed because of the earthquake and victims remained under the rubble. Having evacuated the city, the heroes understand that the size of the disaster exceeds all expectations – forests are burning, a volcano is in eruption. To save all people from the danger zone is now their duty. Mad Games Tycoon 2\nEmbark on a heroic rescue mission Enthralling disaster relief missions wait for you in a breathtaking casual Emergency Crew strategy. A huge variety of different missions, 40 levels, an in-depth story about a team of heroes of our time and places where only real rescuers can stay – this is waiting for you right now! Save people, rebuild the ruined city, fight the marauders who have come and establish the necessary resources wisely. Remember – time is valuable",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/emergency-crew-volcano-eruption-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/emergency-crew-volcano-eruption-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "1500 MHz",
        "Memory": "512 MB RAM",
        "DirectX": "Version 9.0",
        "Storage": "1250 MB available space"
    },
    "game_info": {
        "Genre": "Casual",
        "Developer": "GameOn Production",
        "Platform": "PC",
        "Game Size": "292 MB",
        "Repack By": "SEWN",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1sogh3ihm9hf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/emergency-crew-volcano-eruption-free-download-preinstalled-steamrip.jpg"
}