{
    "page_url": "https://steamrip.com/empire-of-the-ants-free-download/",
    "title": "Empire of the Ants",
    "description": "Experience an immersive journey and defend your lands through tactical and strategic battles in an epic, microscopic world. Play as 103,683rd, an ant of the warrior caste with an inquisitive mind: explore the Federation and fight for it, conquering new territories. Exploring, strategizing, and forging alliances with the local wildlife will be crucial to emerge victorious from the many challenges lying ahead.\nUnconventional legions with which to wage war. Shape your strategy by choosing your roster wisely: starting, support, and super-predator legions. Upgrade your nest’s tier to access new and stronger legions. Will you opt for the defensive Snail or the mobility of the Rhino Beetles? Vampire Hunters\nSpecial abilities for victory\nScare the enemy away, reinforce your units, or spy on your opponents: your chosen pheromones forge your offensive—or defensive—strategy.\nConquer and upgrade outposts\nAdapt your strategy by building the right chambers : build your economy, manage your legions, gather Information on the battlefield, gain new Powers, or strengthen your Defense. Not enough space? Conquer other nests to expand your territory and get stronger.\nDominate the online cross-platform ranked multiplayer Challenge your friends in thrilling skirmishes or prove your strategy skills in player- versus -player mode: ranked 1-vs.-1 matchmaking and three free-for-all matches. Custom Private Lobby available to train your skills against a friend or AI. Play through a 20-hour-long campaign inspired by Bernard Werber’s bestselling saga, where the fate of your colony rests upon your antennae . Choose your way to play, whether you’re looking for strategic combat and challenges or you prefer exploring the environment and fast-paced tactical missions .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/empire-of-the-ants-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/empire-of-the-ants-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel Core i5 9400 / AMD Ryzen 5 2600",
        "Memory": "8 GB RAM",
        "Graphics": "6GB VRAM / NVIDIA GeForce GTX 1060 / AMD Radeon RX 580",
        "DirectX": "Version 12",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Tower Five",
        "Platform": "PC",
        "Game Size": "36.2 GB",
        "Released By": "RUNE",
        "Version": "v1.03.19990 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/51i3UM",
        "https://datanodes.to/gqjqvrp5sn8y/Empire-of-the-Ants-SteamRIP.com.rar",
        "https://buzzheavier.com/4b186jzg5jdn",
        "https://1fichier.com/?37dz0a1ibopnm4o7lzk8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/empire-of-the-ants-preinstalled-steamrip.jpg"
}