{
    "page_url": "https://steamrip.com/empires-of-the-undergrowth-free-download-3s/",
    "title": "Empires of the Undergrowth Free Download",
    "description": "Empires of the Undergrowth Download PC Game In Direct Link for free on SteamRIP\n“Your queen has set up home beneath a rotting log. She is fat, and vulnerable. Her first brood will need to move quickly if the colony is to survive. Their priority now is to find food, and there is plenty around; but there are other hungry creatures in the undergrowth. The workers will need to be vigilant .” Empires of the Undergrowth is an ant colony management game, in a fast-paced real-time strategy style. The player excavates their nest underground, constructing tunnels and chambers to store food and raise brood.\nOn the surface, the ants claim territory , gather resources, overwhelm fearsome arachnids and clash with other colonies. Nest design, army size, composition and attack timing are key to securing victory. Missions are narrated from the perspective of a documentary film maker studying the ants, who offers intelligent insight into the goings-on of the colony and the undergrowth beyond. Undernauts: Labyrinth of Yomi\nThe primary game mode in early access is Formicarium, where you take ownership of a home colony of unique DNA-harvesting ants as they work to assimilate the desirable traits of their foes. You can upgrade them by playing one-off missions, sometimes with your home colony and sometimes with other ant species .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/empires-of-the-undergrowth-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/empires-of-the-undergrowth-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit or higher",
        "Processor": "Intel Core i3-4340 / AMD FX-6300",
        "Memory": "4 GB RAM",
        "Graphics": "nVidia GeForce GTX 660 2GB / AMD Radeon HD 7850 2GB",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Slug Disco",
        "Platform": "PC",
        "Game Size": "5.1 GB",
        "Released By": "SKIDROW",
        "Version": "v1.000419 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/0FA60397F6",
        "https://buzzheavier.com/tcqyg00wn5gd",
        "https://megadb.net/d54tef42kejv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/empires-of-the-undergrowth-free-download-preinstalled-steamrip.jpg"
}