{
    "page_url": "https://steamrip.com/empyrion-galactic-survival-free-download/",
    "title": "Empyrion – Galactic Survival",
    "description": "Empyrion – Galactic Survival is a true space sandbox survival adventure that uniquely combines elements from space simulations, construction games, survival games and first-person shooters. Construct mighty capital vessels, sprawling planetary settlements, and vast space stations in your galactic journey to discover the mysteries of Empyrion!\nBuild mighty capital vessels, agile fighters, vast planetary settlements, and space stations with complete freedom; piece by piece, anywhere you want – or download pre-built community blueprints from the Steam Workshop and customize them with your own ideas!\nFully modify and deform the terrain on any planet. Thanks to the voxel-based terrain, you can flatten it for your planetary settlement, dig holes to find resources, or build a tunnel system to protect yourself. Empyrion is a true sandbox game!\nA vast galaxy awaits you. Warp and fly between a huge variety of planets, moons, and far-flung star systems. Freely explore the surface of each planet, with its own gravity, atmosphere, terrain, vegetation, climate, resources, and more. Survive its flora and fauna, and discover the secrets of alien races. Chocolate Factory Simulator\nElevate your experience with an ocean of player-made blueprints for vessels and settlements, along with mods that provide completely new scenarios and items.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/empyrion-galactic-survival-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/empyrion-galactic-survival-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / 11, 64-bit system required",
        "Processor": "Dual-Core  2.5 GHz or better",
        "Memory": "10 GB RAM",
        "Graphics": "AMD RX 550 / NVIDIA GTX 1050 (min. 2 GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation, Strategy",
        "Developer": "Eleon Game Studios",
        "Platform": "PC",
        "Game Size": "11.5 GB",
        "Released By": "RUNE emu",
        "Version": "v1.11.10 4546 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/rnKje5",
        "https://datanodes.to/schrwfum3b9p/Empyrion-Galactic-Survival-SteamRIP.com.rar",
        "https://buzzheavier.com/7zqj840kj96d"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/empyrion-galactic-survival-preinstalled-steamrip.jpg"
}