{
    "page_url": "https://steamrip.com/en-garde-free-download-q1/",
    "title": "En Garde! Directly Download",
    "description": "From the forgotten pages of history, comes Adalia de Volador! Legendary swashbuckler . Dashing adventurer. Hero of the people. Play as Adalia in her daring escapades full of sword-fighting, satire and shenanigans. Challenge the cruel Count-Duke and oppose tyranny with panache Beautifully painted locations, charismatic characters, and an astounding amount of battle banter will transport you to the golden age of swashbuckling comedy Bomb Rush Cyberfunk\nSo, sharpen your sword, grab your boots and hat, and embark on a hilarious, action-packed spectacle Parry, riposte and lunge your way to victory! Fight with style to fill your Panache Meter and unlock special skills! But you’ll need more than your sword to win the day. Challenging, ever-changing fights push you to rely on your cunning and acrobatics to disturb your enemies.\nLearn their weaknesses to toy with them and express your fighting style. Combat areas are playgrounds full of opportunities to create mischief and gain the upper hand. Surprise, stun, or evade enemies with a variety of objects – from rolling barrels to falling chandeliers.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/en-garde-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/en-garde-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "4 Core 2.5GHz (TBC)",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1050 or RX 580 (TBC)",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Fireplace Games",
        "Platform": "PC",
        "Game Size": "6.7 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.1.18179 | Full  +win7 fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/y0cxp1zu5zsh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/en-garde-preinstalled-steamrip.jpg"
}