{
    "page_url": "https://steamrip.com/enemy-remains-free-download-1y/",
    "title": "Enemy Remains",
    "description": "Enemy Remains game for free instantly and play pre-installed on SteamRIP\nEnemy Remains is a punishing twin-stick shooter, offering a blend of intense top-down action and survival horror. Explore a town filled with atmospheric set pieces; mysterious forests, slaughtering farms, creepy mansions and more Play the game solo or plug in a controller to hop in as a second player in couch co-op Monsters and fiends won’t stand a chance against two players working as one. But sudden death awaits the careless and brash explorer. We’ve built the game from the ground up to focus on the gameplay. Nothing comes between you and the action; no lengthy cutscenes, dialogue windows, complicated inventory screens or menus that you have to haul around. Stronghold: Warlords\nThere is no food meter to manage, and no useless junk to carry around. It’s just you, your weapons and medkits against the relentless supernatural foes. Powered by the Unity engine, all the environments can be explored in full 3D glory. Objects will have physics, bullets landing on different surfaces will react with different effects, crates and barrels can be pushed around You can even use the environment as your advantage, luring the enemies into mines or laser traps, or destroy these deadly mechanisms with explosives.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/enemy-remains-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/enemy-remains-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64bit",
        "Processor": "Intel i7 3.40Ghz",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 560",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "GameRealmMadness",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "DOGE",
        "Version": "Build 8154428 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/89k4yqcnmush"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/enemy-remains-preinstalled-steamrip.jpg"
}