{
    "page_url": "https://steamrip.com/enigma-of-fear-free-download/",
    "title": "Enigma of Fear",
    "description": "In a place that doesn’t exist, young detective Mia and her little dog Lupi investigate the disappearance of her father, one of the most skilled agents in the world and the leader of Ordo Realitas, an organization of paranormal detectives.\nEnigma of Fear is a game of investigation and mystery in Pixel Art/3D where your deduction is your guide. Play and enjoy this story in the way that you want to: analyze thoroughly every detail in an engaging narrative, ask partner agents for help, face enemies or try to go through them stealthily .\nThe Enigma of Fear Unravel a deep secret entangled in the Perimeter with the mystery of the “Cult of Fear” – a group responsible for the disappearance of countless agents from Ordo Realitas .\nDiscover your own ending What is a place that doesn’t exist? Why did your father come here? Where are the missing agents? Explore the Perimeter any way you want: an open-world and non linear, where you can let your own curiosity and deduction guide your next steps and experiences.\nInvestigate like a paranormal detective Use an immersive inspection and investigation system that will allow you to feel like a true detective analyzing dozens of clues that hide the secrets of the story. Examine documents and evidence, solve enigmas, make use of your equipment, review your discoveries in Mia’s mental map and much more.\nEyes always open Defeat terrifying paranormal creatures and unique bosses. Follow your instincts, face the paranormal threats and try to stay alive in front of Fear.\nKeep the sanity Reinstate your connection to Reality with your loyal dog Lupi to regain sanity after dangerous paranormal encounters. Talk to partners from Ordo Realitas, like the hacker Samuel and the occultist Agatha, to uncover clues and valuable information if you’re lost or need to remind yourself of some detail.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/enigma-of-fear-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/enigma-of-fear-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 +",
        "Processor": "Intel Core i3-530 | AMD A6-3650+",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce 9600GT+ | AMD HD 6570+",
        "DirectX": "Version 9.0c",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Dumativa, Cellbit",
        "Platform": "PC",
        "Game Size": "7.6 GB",
        "Released By": "RUNE",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CUEXMG",
        "https://buzzheavier.com/py7apy1wb8ct",
        "https://datanodes.to/apmyf61njvwm/Enigma-of-Fear-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/enigma-of-fear-preinstalled-steamrip.jpg"
}