{
    "page_url": "https://steamrip.com/enotria-the-last-song-free-download/",
    "title": "Enotria: The Last Song",
    "description": "“Enotria: The Last Song” is a thrilling Soulsike set in a sun-lit land inspired by Italian folklore and filled with danger The world has been gripped by the Canovaccio – a twisted eternal play that keeps everything in an unnatural stasis. You, Maskless One, are the only one without a given role and master of your destiny. Defeat the fearsome Authors that created it and free the world from stagnation, by harnessing the power of Ardore.\nBecome the Mask of Change.\nSummer Souls 3 Main Regions , 40+ hours, more than 100 different enemies Enotria is a beautiful sun-lit land inspired by Italian nature, that hides dark secrets behind its bright facades, and it is up to you to unravel the mysteries of this stunning world. Eternal Strands\nMany Masks, One Face\n30+ Masks. Don your fallen foes ’ Masks to take on their roles, enabling new ways to play, each with its own strengths and weaknesses. Swap between up to 3 customisable Loadouts at any time.\nPath of Innovators\n68 Skills (Unlockable PERKS), with 150+ milions different build combinations Expand your playstyle options through a unique pool of talents in the Path of Innovators. Slot talents into Masks to create custom builds on a single screen, experience a unique system that makes theorycrafting and altering playstyle for each situation easier than ever.\nUnparalleled Flexibility\n30+ aspects to alter your main statistics dynamically Choose strategically which Mask will face the dangers of Enotria and swap between up to three custom loadouts at any time. Each loadout allows you to try out a new playstyle, without the burden of a respec.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/enotria-the-last-light-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/enotria-the-last-light-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-Bit Windows 10",
        "Processor": "Intel Core i5-6600 (3.3Ghz) or AMD Ryzen 5 1400 (3.2Ghz)",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1080 6GB or AMD Radeon RX 580 8GB",
        "DirectX": "Version 12",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Jyamma Games",
        "Platform": "PC",
        "Game Size": "11.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.007.28161 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/k6ORry",
        "https://datanodes.to/7re1h13zuum9/Enotria-The-Last-Song-SteamRIP.com.rar",
        "https://buzzheavier.com/d4a981xxbh0b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/enotria-the-last-light-preinstalled-steamrip.jpg"
}