{
    "page_url": "https://steamrip.com/enshrouded-free-download-e1/",
    "title": "Enshrouded",
    "description": "The realm of Embervale is lost. In their greed for magical power, your ancestors unleashed a pestilence that consumed the world. New Cycle\nEnshrouded is a game of survival, crafting, and Action RPG combat , set within a sprawling voxel-based continent. As you journey across the mountains and deserts of an open world, you are free to choose your path and shape your destiny. Ignite the Ancient power of the Flame, and piece together the fragments of a story that unfolds below the surface.\nSURVIVE THE SHROUD You start with nothing but the will to survive the wilds. You must scrape and scavenge through the ruined remnants of a lost kingdom, and fend off the beasts that hunger for your flesh .\nJourney through forests, caves, dungeons, searching for secret knowledge and treasure. Build the strength to venture into the Shroud and bring the fight back to the horrors of the deep.\nHEART POUNDING ACTION COMBAT The Shroud consumes the land it corrupts, mutating and guiding all life it encounters. Cleave your way through ravaging factions and formidable bosses, battling Scavenger in the forests, Vukah in the caves, and Fell creatures in the mist.\nDuck, parry , and surprise your foes with unexpected fighting skills and powerful spells. Exploit the weaknesses of your enemies as you develop your own unique playstyle with an in-depth skill tree system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/enshrouded-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/enshrouded-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-6400 (2.7 GHz 4 Core) / AMD Ryzen 5 1500X (3.5 GHz 4 Core) or equivalent",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 (req. 6GB VRAM) / AMD Radeon RX 580 (req. 6GB VRAM)",
        "Network": "Broadband Internet connection",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Early Access",
        "Developer": "Keen Games GmbH",
        "Platform": "PC",
        "Game Size": "21 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v0.8.1.2 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/6uqi7b3fpnj9",
        "https://gofile.io/d/DnuqGY"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/enshrouded-preinstalled-steamrip.jpg"
}