{
    "page_url": "https://steamrip.com/epic-chef-free-download-s1/",
    "title": "Epic Chef Free",
    "description": "Epic Chef Download PC Game In Direct Link for free on SteamRIP\nEpic Chef is a story-driven adventure game flavoured with life-sim farming, and crafting elements, blended together into one delicious dish via an interactive cooking experience – all served with a side of humour and elaborate cast of characters inspired by classics such as Mister Ajikko, or the writing of Sir Terry Pratchett. Grab your spatula and start on your journey to become Epic Chef In Epic Chef you will combine ingredients, stirring and tossing with culinary precision to bring out the flavour elements of Vigor.\nSophistication and Spirit in your dishes. This forms the core of the cooking experience that you must master in order to become the very best chef in Ambrosia . Dish synergy and ingredient properties combine with a dynamic recipe creation system, meaning that you can experiment with thousands of different combinations to create a unique menu of decadent delights. Serving Rats with Tomatoes and Potatoes ? Don’t you mean Tomato Soufflé and Vermin Slices in Starchy Cream ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/epic-chef-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/epic-chef-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10: 64-bit",
        "Processor": "Intel Core i3-2100 or AMD Phenom II X4 965",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660 2GB, or Radeon HD 7850 2GB",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation",
        "Developer": "Infinigon Games",
        "Platform": "PC",
        "Game Size": "3.07 GB",
        "Repack By": "CODEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wndlydjeqbnh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/epic-chef-free-download-preinstalled-steamrip.jpg"
}