{
    "page_url": "https://steamrip.com/ereban-shadow-legacy-free-download/",
    "title": "Ereban: Shadow Legacy Directly Download",
    "description": "Ereban: Shadow Legacy is a fast-paced stealth platformer game where you become Ayana , the last descendant of a forgotten race. Harness mystical shadow powers, high-tech gadgets and avoid or kill to uncover the truth about your past and the key to saving a dying, morally grey universe. What will your legacy be?\nExperience an unprecedented combination of stealth and shadows with the Shadow Merge ability. Dive into shadows and move freely through them to climb walls, reach inaccessible places, attack from cover or advance unseen. Yellow Taxi Goes Vroom\nAbsorb echoes to learn more lethal and non-lethal shadow powers , craft high-tech gadgets, and combine all this with your agility to infiltrate Helios lines and investigate what they are hiding. Avoid or kill. Spare or consume. The decision is yours: how far are you willing to go to uncover the truth? Approach each level with your own style of play. Use your powers to move like a ghost or strike as a deadly shadow in this sci-fi universe where actions go beyond good and evil.\nDiscover the ruins of lifeless cities, infiltrate sci-fi facilities carved into ancient temples and forge alliances to unravel the mystery of who you are and what happened to your people.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/ereban-shadow-legacy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/ereban-shadow-legacy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 10",
        "Processor": "Intel i5-6500 or Equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 960 or Equivalent",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Baby Robot Games",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "RUNE",
        "Version": "v1.1.14 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/acpunr7vf09s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/ereban-shadow-legacy-preinstalled-steamrip.jpg"
}