{
    "page_url": "https://steamrip.com/escape-the-backrooms-free-download-1z/",
    "title": "Escape the Backrooms Directly Download",
    "description": "Explore the seemingly infinite expanse of eerily familiar levels in the backrooms based on the popular creepypasta lore. Each level features different ways to escape with danger along the way. Explore the backrooms with a team of up to 4 players. Be warned, as teammates may no-clip into other areas of the map and every member of your team must find the exit alive to escape. No wanderer left behind. Communicate with your teammates with proximity voice chat. Be sure to not wander far away from your team, as you can easily get lost in the confusing expanse of the Inside the Backrooms .\nEntities can also hear you, so stay quiet whenever you sense any danger. Traverse though 8 unique levels based on backrooms lore with regular content updates adding more. Each level features a different way to escape with various danger along the way. “If you’re not careful and noclip out of reality in the wrong areas, you’ll end up in the Backrooms, where it’s nothing but the stink of old moist carpet, the madness of mono-yellow, the endless background noise of fluorescent lights at maximum hum-buzz, and approximately six hundred million square miles of randomly segmented empty rooms to be trapped in. God save you if you hear something wandering around nearby, because it sure as hell has heard you.”",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/escape-the-backrooms-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/escape-the-backrooms-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 / 10 / 11 – 64 bit",
        "Processor": "Intel Core i3",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Early Access",
        "Developer": "Fancy Games",
        "Platform": "PC",
        "Game Size": "16.7 GB",
        "Released By": "Mr_GOLDBERG/online-fix.me",
        "Version": "Build 28012024 | Early Access + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/YE5O4a",
        "https://buzzheavier.com/u7n6rdnwdpt1",
        "https://megadb.net/9l9txd0jxst1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/escape-the-backrooms-preinstalled-steamrip.jpg"
}