{
    "page_url": "https://steamrip.com/escape-the-ayuwoki-horror-night-free-download-1k/",
    "title": "Escape the Ayuwoki Horror Night",
    "description": "Horror Night is an online Third/First person asymmetric horror adventure coop multiplayer videogame. Escape from the abandoned mansion by solving puzzles and finding items. You can customize your character with a variety of hairstyles, outfits, faces, colors, etc. Explore and enjoy each match as its own unique experience because the mansion is procedurally generated each time you play\nAnd finally, get to play as the Ayuwoki and hunt down all the survivors you can before they escape Enjoy all the new cosmetics, skins, and NEW MAPS that are being added periodically to the game Finally! you can play as the Ayuwoki! hunt down every last survivor to win the match\nThe Ayuwoki monster has special abilities to use as an advantage , visual hearing like a sonar, or echolocation Also throwing up biomass to create a sticky substance in the floor, or alarm rats, among other things You can also directly execute players with an “ ultimate ” skill (with a huge cooldown time of course). Knock down closed doors to keep pursuing the survivors or to prevent them to shutting the doors in your face so they can escape.\nPlay alongside your friends and don’t let the Ayuwoki catch them you are rewarded for helping your teammates, solving puzzles and working as a team to be able to escape the mansion. Each time you play re-live the experience of being lost in an unknown mansion since its randomly generated again and again each match Puzzles will be also randomized and this time you can escape through different exit points and each one is a different challenge to solve.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/escape-the-ayuwoki-horror-night-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/escape-the-ayuwoki-horror-night-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 x64",
        "Processor": "Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 970",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Early Access",
        "Developer": "Deadlycrow Games",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Multiplayer By": "Online-fix.me",
        "Version": "v0.7.7a | Early access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tuy8v4i4o8m1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/escape-the-ayuwoki-horror-night-preinstalled-steamrip.jpg"
}