{
    "page_url": "https://steamrip.com/esports-godfather-free-download/",
    "title": "Esports Godfather",
    "description": "“Esport Godfather” is a management simulation card game that revolves around the theme of MOBA esports. In this game, you will play a role of a coach in an esports club and personally build your own team Starting from scratch, what kind of playstyle will you devise for your team? In a constantly evolving meta , can you derive a unique understanding of what it takes to win? The Tribe Must Survive\nWhat style of play will you devise for the team? Trident or 1-carry? Is the main focus on the top lane 1v1 battle, or the ultimate coordination between Mid laner and Jungler? In the ever-changing version environment, can you come up with a unique understanding of victory and lead the team to success?\nHow will you inspire those outstanding athletes you carefully selected and mold them into superstars? And finally, can you overcome countless obstacles, lift the championship trophy, and write your own esports legend?\nYou can not only customize your team’s name but also create a unique team logo using the tools provided in the game (you can also import local images). Then you can see the flag with your logo waving on the battlefield, in the community, and in the most liked team vote each month",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/esports-godfather-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/esports-godfather-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows XP/7/8/8.1/10/11",
        "Processor": "2.0Ghz",
        "Memory": "8 GB RAM",
        "Graphics": "256mb Video Memory, capable of OpenGL 2.0+ support",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, RPG, Simulation, Sports, Strategy",
        "Developer": "Asteroid Game Studio",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "TENOKE",
        "Version": "v2.1.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a1wgsjhzogjc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/esports-godfather-preinstalled-steamrip.jpg"
}