{
    "page_url": "https://steamrip.com/eternal-strands-free-download/",
    "title": "Eternal Strands",
    "description": "Play as Brynn, a young but fearless Weaver , determined to recover her people’s cultural home in the debut fantasy action-adventure title from Yellow Brick Games, a new independent studio founded by industry veterans.\nArmed with powerful magical abilities and an arsenal of magical weapons, face enemies that range from humanoid constructs to towering beasts. Use the environment and temperature to your advantage in battles against a diverse roster of fantastical creatures, like turning a dragon’s fiery breath against ice-covered minions. Climb every surface and use arcane skills to create new paths. Explore the world in pursuit of the Enclave’s lost mysteries and challenge giant titans on your journey .\nThe World is Your Weapon At the heart of Eternal Strands beats a revolutionary new system for gameplay interactions: heat spreads, cold chills, and real-time destruction allows for unprecedented reactivity in combat . Hurl burning tree trunks at enemies with telekinetic powers, snap nearby trees to block opposing fire, or channel raw telekinetic force to rip boulders from the ground.\nWeaver of Magic Wear the Mantle, a magical cloak that channels raw magic into raging flame, chilling ice, and telekinetic force. Combine your growing array of powers with enchanted weapons and armor crafted from slain enemies to create a custom look and style. Block incoming attacks with a wall of magical ice, lash out waves of flame from a massive two-handed blade, or toss enemies off a cliff with raw force.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/eternal-strands-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/eternal-strands-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / Windows 11",
        "Processor": "Intel Core i5-9400 / AMD Ryzen 5 3350",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1660 Super 6GB / AMD Radeon RX 5600 XT 6GB / Intel Arc A580",
        "DirectX": "Version 12",
        "Storage": "24 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Yellow Brick Games",
        "Platform": "PC",
        "Game Size": "8.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/B2mK0G"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/eternal-strands-preinstalled-steamrip.jpg"
}