{
    "page_url": "https://steamrip.com/evil-genius-2-world-domination-free-download-g1/",
    "title": "Evil Genius 2 World Domination Deluxe",
    "description": "Evil Genius 2 is a satirical spy-fi lair builder , where players take control of an Evil Genius and set their plans for world domination in motion. When it feels this good to be bad, the Forces of Justice don’t stand a chance Build your own unique evil lair and cover operation, Train a force of criminal minions,\nDefend your Lair from the Forces of Justice, and Dominate the world with a Doomsday Device in this direct sequel to the 2004 cult classic Cruel Constructions Every villain needs an island lair, so pick your paradise and put your own sinister stamp on it\nShape the internal structure of your hazardous hideaway to fit your play-style, and construct wonderfully wicked devices for your minions to put to use. Competence isn’t going to cut it when you’re running an evil operation.\nAs you expand and train your minion workforce , you can create new specialists to help further your evil plans! Need something a little more intimidating? Recruit powerful Henchmen that complement your play style; every mastermind needs a right hand or several, in fact",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/evil-genius-2-world-domination-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/evil-genius-2-world-domination-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-8100",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GT 1030 2GB, Radeon RX 550 2GB",
        "Storage": "18 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Rebellion",
        "Platform": "PC",
        "Game Size": "10 GB",
        "Released By": "EMPRESS",
        "Version": "v1.13 | Full  + Deluxe Edition + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kaiipo4csord"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/evil-genius-2-world-domination-portrait-steamrip.jpg"
}