{
    "page_url": "https://steamrip.com/expeditions-a-mudrunner-game-free-download/",
    "title": "Expeditions A MudRunner Game",
    "description": "From Arizona to the Carpathians , chart through expansive open worlds in search of hidden treasures and forgotten ruins. Expeditions: A MudRunner Game is a groundbreaking off-road simulation crafted by Saber Interactive, creators of the critically acclaimed SnowRunner. News Tower\nLead research missions as you drive a variety of all-terrain vehicles, using high-tech tools and managing your camp and crew to ensure your success in the wild. Embark on ever-rewarding scientific expeditions as you adapt to nature’s challenges, and unravel the mysteries of uncharted lands.\nExpeditions: A MudRunner Game builds on the legacy of Saber Interactive’s off-road simulations with its advanced physics-based gameplay systems, perfectly encapsulating the feel of driving through the wilderness. Whether you’re a long-time player of MudRunner games or a newcomer, you are in for a thrilling scientific adventure.\nSuccess depends on preparation. Plan your missions carefully and hire a team of Specialists to improve your skills in the field. With the drone and metal detector, scout your itinerary and locate points of interest. Invest the profits from each expedition to expand your home bases by building support structures to gain useful supplies and summon new vehicles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/expeditions-a-mudrunner-game-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/expeditions-a-mudrunner-game-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit",
        "Processor": "Intel Core i3-9100 / AMD Ryzen 3 1300X",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB VRAM, Nvidia GeForce GTX 660 / AMD Radeon R7 370",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Racing, Simulation",
        "Developer": "Saber Interactive",
        "Platform": "PC",
        "Game Size": "20.4 GB",
        "Released By": "RUNE",
        "Version": "Build 17182680 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/F40zbr",
        "https://datanodes.to/lacwacf5wz4s/Expeditions-AMG-SteamRIP.com.rar",
        "https://buzzheavier.com/c458a7zvdltm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/expeditions-a-mudrunner-game-preinstalled-steamrip.jpg"
}