{
    "page_url": "https://steamrip.com/f-i-s-t-forged-in-shadow-torch-free-download-p1/",
    "title": "F.I.S.T.: Forged In Shadow Torch Download",
    "description": "Get F.I.S.T Forged In Shadow Torch for free instantly and play pre-installed on SteamRiP\nSix years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and steps to his journey fighting back.\nAnd he never expects that he has been involved in a bigger scheme between the mafia, the rebellion, and the legion. Sophisticated and Interconnected Game Map with Countless Secrets Exploring the Metroidvania game world with a dozen of areas with distinguishing vision themes and level designs.\nEarning the rewards by conquering the challenges of combats, puzzles and platformers in countless chambers, tunnels and shortcuts. Interconnected and automatically loading game map makes the detailed Torch City more convincing and beautiful. Mastering the Fist, the Drill and the Whip, depending on the situation of the battlefield, switch your advantages between the long hits, the high damage and the wide range, taking every enemy standing in front of you down.\nDozens of enemies wielding their unique weapons challenge you with exquisite cooperation tactics, and various bosses with totally different combat patterns provides you never repeated experience. Powered by Unreal Engine 4 with physically based rendering and extremely detailed textures, presenting a gorgeous 3D visual performance and pushing the genre to a whole new level.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/fist-forged-in-shadow-torch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/fist-forged-in-shadow-torch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 version 1903",
        "Processor": "Intel Core i5-6400 or AMD FX 8320",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 960 or AMD Radeon R9 280",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Simulation, Sports",
        "Developer": "TiGames",
        "Platform": "PC",
        "Game Size": "21 GB",
        "Repack By": "FLT",
        "Version": "v1.200.002 + WINDOWS 7 FIX",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/4b6uh4gjl4zr",
        "https://datanodes.to/t9ofzd7urbf1/FIST-FST-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/fist-forged-in-shadow-torch-preinstalled-steamrip.jpg"
}