{
    "page_url": "https://steamrip.com/fabledom-free-download-1z/",
    "title": "Fabledom Directly Download",
    "description": "Welcome, your Highness A vast land awaits your settlers and is ready to be colonized. Fabledom offers an accessible and intuitive way of playing City bu i lders, no excel sheets nor optimization is required to build yourself a kingdom. Set in a strange world where Fairytales became reality, you will witness the growth of your village; follow your citizens’ lives and watch the rise and fall of your relationships with the neighboring kingdoms. Find the promised land, settle, and flourish You will need every resource available to you to expand and thrive. Build and shape a city worthy of your future citizens Wildfrost\nBuild your economy , exchange rare resources to grow and evolve. Fabledom offers numerous ways to interact with other kingdoms. How you will handle diplomacy will shape your progress. Romance will strongly shape the way you play and enjoy the game. Fabledom’s focus on love and candor will provide fresh city building mechanics.\nChoose your champion, assemble your town watch and defend your Kingdom against vile neighbors and minions Experience the fairytale world filled with giants , witches, flying pigs and hidden secrets. Explore every nook and cranny of this magical world",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/fabledom-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/fabledom-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 3470 @ 3.2 GHz | AMD FX 8120 @ 3.9 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1060 / RX 580",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation, Strategy",
        "Developer": "Grenaa Games",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.07 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lsneny1afgey"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/fabledom-preinstalled-steamrip.jpg"
}