{
    "page_url": "https://steamrip.com/factorio-free-download-3o/",
    "title": "Factorio directly Download",
    "description": "Get Factorio for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nFactorio is a game in which you build and maintain factories . You will be mining resources, researching technologies, building infrastructure, automating production and fighting enemies. In the beginning you will find yourself chopping trees, mining ores and crafting mechanical arms and transport belts by hand, but in short time you can become an industrial powerhouse , with huge solar fields, oil refining and cracking, manufacture and deployment of construction and logistic robots, all for your resource needs. Timberborn\nHowever this heavy exploitation of the planet’s resources does not sit nicely with the locals, so you will have to be prepared to defend yourself and your machine empire. Join forces with other players in cooperative Multiplayer, create huge factories, collaborate and delegate tasks between you and your friends. Add mods to increase your enjoyment, from small tweak and helper mods to complete game overhauls, Factorio’s ground-up Modding support has allowed content creators from around the world to design interesting and innovative features. BALAN WONDERWORLD\nWhile the core gameplay is in the form of the freeplay scenario , there are a range of interesting challenges in the form of Scenarios. If you don’t find any maps or scenarios you enjoy, you can create your own with the in-game Map Editor, place down entities, enemies, and terrain in any way you like, and even add your own custom script to make for interesting gameplay .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/factorio-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/factorio-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 8, 7, Vista (64 Bit)",
        "Processor": "Dual core 3Ghz+",
        "Memory": "4 GB RAM",
        "Graphics": "5500",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Wube Software LTD.",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "RUNE emu",
        "Version": "v2.0.47 | Full  + Factorio: Space Age",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/mJokta",
        "https://megadb.net/wdti38cda50n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/factorio-free-download-preinstalled-steamrip.jpg"
}