{
    "page_url": "https://steamrip.com/factory-town-free-download-t1/",
    "title": "Factory Town Free",
    "description": "Get Factory Town PC game for free instantly and play pre-installed on SteamRiP\nYour goal is to build a thriving village in the wilderness, supplied with a wide selection of food, clothing, tools, books, and magical artifacts that you produce from raw materials. Worker units can help you move goods between production buildings and markets, but as much workload as possible will need to be automated using mechanical transportation systems. Use a combination of gravity-powered chutes, conveyor belts, railroads, pipes, sorters and filters to route items around the map so they can be processed and sold.\nAs your earnings rise, you can research new technology to improve your supply chains and grow your civilization. There’s no enemies or starvation to worry about, so you can enjoy a stress-free logistics challenge to maximize production and happiness. Play through eight built-in campaign maps with unique goals, or start your own customized/random map from scratch Build complex logical systems with gates, triggers, and filters to make sure resources get to the right destination",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/factory-town-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/factory-town-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Memory": "1 GB RAM",
        "DirectX": "Version 11",
        "Storage": "250 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Erik Asmussen",
        "Platform": "PC",
        "Game Size": "231 MB",
        "Released By": "VALVE",
        "Version": "v1.12 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uqwj5wfgs8v1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/factory-town-free-download-preinstalled-steamrip.jpg"
}