{
    "page_url": "https://steamrip.com/fae-farm-free-download-y1/",
    "title": "Fae Farm",
    "description": "Escape to the world of Fae Farm and create your own cozy home in the enchanted world of Azoria . As you nurture and grow your homestead , you’ll get to meet charming characters, foster deep relationships and discover ways to infuse magic into everything you do. Customize your character, master the arts of crafting, cooking, potion-making and discover so much more. Pocket Bravery\nUnfold the mysteries of the island on your own or with up to three other players. You can invite your family and friends or visit their homestead to progress together, playing beside you or online. As the seasons change, you’ll be able to unlock new areas and restore the world around you. Embark on a ship and set sail to Azoria, there’s a magical world waiting for you\nCozy and customizable Create your own character and customize your adventure with unlockable styles and decorations for your farm. The cozier your home, the better your experience! The story unfolds independently from the in-game calendar, allowing you to play at your own pace.\nMagical Creatures As you tend your farm, you can care for a variety of cuddly animals where you can collect eggs, wool, and more. You can also raise baby animals in many different colors and explore the island to discover magical critters that drop rare potion ingredients. But not all creatures are friendly: beware the jumbles; mischievous spirits that block your path.\nAdventure is at your doorstep Explore the realms of Azoria as you traverse the island with your skills and spells. Forage caves to gather resources and battle jumbles! Progress at your own pace as you uncover new mysteries and restore peace to Azoria.\nBudding Friendships Azoria is home to a cast of colorful characters! As you progress through the story, you can build bonds with many islanders along the way. You can even find romance by going on dates and eventually getting married at Town Hall.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/fae-farm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/fae-farm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i3-4160 / AMD A8-7600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460 / AMD HD 6850 / Intel UHD620",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Simulation",
        "Developer": "Phoenix Labs",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v3.2.0 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1rs9j333wzvv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/fae-farm-preinstalled-steamrip.jpg"
}