{
    "page_url": "https://steamrip.com/fairy-tail-2-free-download/",
    "title": "FAIRY TAIL 2",
    "description": "“FAIRY TAIL 2” is a new RPG based on the popular magical combat fantasy manga and anime series “FAIRY TAIL,” whose story is beloved by fans around the world, with the original manga selling more than 72 million copies worldwide. This sequel to the game “FAIRY TAIL,” released in July 2020, depicts the “Alvarez Empire Arc,” the climax of the original manga. Dog Man: Mission Impawsible\nRelive the culmination of the original series through gameplay! This RPG depicts the dramatic developments of the “Alvarez Empire Arc,” the climax of the original story. Playing as the main characters Natsu and Lucy and other members of the Fairy Tail guild, you can relive the epic battles against their greatest enemy, Emperor Spriggan (Zeref) of the Alvarez Empire, along with his elite team, called the “Spriggan 12,” and the world destroyer, Black Dragon Acnologia .\nFlashy magic battles with unique characters! The battle system has been completely redesigned from the previous game, resulting in real-time battles that are even more flashy and impactful. Use various strategic elements to your advantage and experience the thrill of exhilarating battles",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/fairy-tail-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/fairy-tail-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10, Windows® 11, 64bit",
        "Processor": "Intel Core i5-7400, AMD Ryzen 3 3200G",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050Ti 4GB, AMD Radeon RX 570 4GB",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "10.6 GB",
        "Released By": "TENOKE",
        "Version": "v1.2.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LA1fD8",
        "https://datanodes.to/qb7lezjzz47j/FAIRY-TAIL-2-SteamRIP.com.rar",
        "https://megadb.net/8buq6q2po0ky"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/fairy-tail-2-preinstalled-steamrip.jpg"
}