{
    "page_url": "https://steamrip.com/fallen-aces-free-download/",
    "title": "Fallen Aces",
    "description": "The A.C.E.S, watchful guardians of Switchblade City, are being taken down, one by one. Now it’s up to one man, with two fists, to get to the bottom of it all. Fallen Aces is a crime noir FPS that plays right out of the ’90s and looks like it’s right outta the comics. STUFFED\nEnter a world of heroes, villains, crime, corruption and betrayal! Fallen Aces is a FPS crime noir that plays right out of the ’90s and looks right out of a comic. A gritty crime noir saga: spanning three episodes and dozens of levels, and featuring fully voiced hand drawn comic cutscenes – Fallen Aces tells a real story. The world is your weapon: use fists, knives, pipes, bats, trash cans, frying pans, pistols, shotguns, nail guns, spear guns, Tommy guns and more to take back Switchblade City.\nNon linear level design: Choose your path, use stealth , go loud or try a mixture of both! Hand drawn: 100% original hand drawn art and animation (No AI) brings the game to life. Fuggedaboutit!: Hundreds of lines of authentic period era gangster dialogue injects personality into the wide array of people and places in Fallen Aces.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/fallen-aces-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/fallen-aces-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit or later",
        "Processor": "2.4GHZ Dual Core Processor Or Higher",
        "Memory": "4 GB RAM",
        "Graphics": "4GB VRAM or greater",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Early Access",
        "Developer": "Trey Powell, Jason Bond",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "RUNE emu",
        "Version": "v0.7.92 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/oc8u63lkmu3j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/fallen-aces-preinstalled-steamrip.jpg"
}