{
    "page_url": "https://steamrip.com/falling-out-free-download-1y/",
    "title": "FALLING OUT Directly Download",
    "description": "Take control of two accidental adventurers, as you explore ancient kingdoms, discover treasures (be careful of the traps) and bump into the equally lost shopkeeper, Azar . Collect items to craft weird weapons and useful objects that will help you traverse the world in this unplanned escapade. It was supposed to be a relaxing vacation but ditch the itinerary because you’ll now need to choose your own path.\nNavigate through procedurally generated levels that offer the perfect balance of risk and reward. Help Giorgio and Felicie overcome their differences and work as a team in single-player or co-op. However you play, you’ll need to work together to conquer the unique obstacles and challenges scattered throughout each world.\nPlay as either Giorgio or Felicie in solo, co-op or vs mode. Easily switch between characters to use each of their unique characteristics. It’s fun to explore but don’t hang about for too long because these temples flood Grab what you can and get to the exit before it’s too late. Oh, and please don’t leave your partner behind Navigate your way through hordes of ghastly ancient creatures while exploring randomly generated temples, threats and exit locations. The Matriarch\nEvery level is different and every challenge is unique but the feeling you get from mastering them is always just as satisfying. A randomly generated pyramid is kept for 24 hours for everyone to enjoy together. Decode blueprints, buy objects and collect scraps to build weapons and items that will help you overcome the unknown perils ahead",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/falling-out-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/falling-out-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1",
        "Processor": "1.2Ghz",
        "Memory": "1024 MB RAM",
        "Graphics": "256MB",
        "DirectX": "Version 11",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "PolyCrunch Games",
        "Platform": "PC",
        "Game Size": "145 MB",
        "Released By": "CHRONOS (cs.rin.ru)",
        "Version": "v1.0.21.14 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/w3hix0rfxajg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/falling-out-preinstalled-steamrip.jpg"
}