{
    "page_url": "https://steamrip.com/falsepine-free-download-q1/",
    "title": "Falsepine",
    "description": "Falsepine is a fast-paced action roguelike with a focus on difficult combat and exploration. Developed by Voyager Softworks, a team of new and eager game developers. Falsepine is a labour of love, pulling all the passion and drive from the team into a brutal and rewarding action roguelike.\nFalsepine places you in the role of a lineage of monster hunters tasked with tracking down and defeating 5 legendary creatures across the untamed West. Use all your wits and skill to combat these dangerous foes and come out victorious. Explore a variety of unique locales from the snowy Grizzly Peaks to the dusty Arid Badlands. Track down and collect clues and journals detailing the rich history of each monster.\nEach clue found may be the key to your success or your defeat in the grand showdown against these legendary creatures. Prepare for the journey ahead in the town of Falsepine, purchase weapons and equipment at Gold and Irons, buy drinks and clues at the Crossroads Saloon, store valuable items at Falsepine Bank and finally equip gear and take on unique bounties at the Hunters Camp . Sprocket\nOnce you leave for your hunt there is no turning back. Falsepine offers a variety of playstyles to suit all types of hunters. Do you want to be an unstoppable pickaxe-wielding barbarian or perhaps an agile high-damage sniper? Utilize 35 different weapons and tools, pairing them with a variety of Talismans and Artifacts to create different builds for every new adventure .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/falsepine-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/falsepine-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "3.6 GHz 8 Thread CPU",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1060",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Voyager Softworks",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10215219 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rkr4lpdgsn5g"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/falsepine-preinstalled-steamrip.jpg"
}