{
    "page_url": "https://steamrip.com/far-cry-free-download-5l/",
    "title": "Far Cry Free Download",
    "description": "Get Far Cry PC game for free instantly and play pre-installed on SteamRiP\nA tropical paradise seethes with hidden evil in Far Cry, a cunningly detailed action shooter that pushes the boundaries of combat to shocking new levels. Freelance mariner Jack Carver is cursing the day he ever came to this island. A week ago, a brash female reporter named Valerie had offered him an incredible sum of cash to take her to this unspoiled paradise . Shortly after docking, however, Jack’s boat was greeted by artillery fire from a mysterious militia group swarming about the island. Sally Face\nWith his boat destroyed, his money gone, and the gorgeous Valerie suddenly missing, Jack now finds himself facing an army of mercenaries amidst the wilds of the island, with nothing but a gun and his wits to survive. But the further he pushes into the lush jungle canopy, the stranger things become. Jack encounters an insider within the militia group who reveals the horrific details of the mercenaries’ true intentions. He presents Jack with an unsettling choice: battle the deadliest mercenaries, or condemn the human race to a maniac’s insidious agenda.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/far-cry-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/far-cry-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "Processor": "AMD Athlon™ 1 GHz or Pentium® III 1 GHz",
        "Memory": "256 MB",
        "Graphics": "64 MB DirectX® 9.0b-compliant graphics card (see supported list*)",
        "Sound": "DirectX 9.0b compliant PCI card ( Blaster Audigy series recommended)",
        "DirectX": "9.0b or higher",
        "Hard Disk Space": "4 GB"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Crytek Studios",
        "Platform": "PC",
        "Game Size": "2.49 GB",
        "Repack By": "GOG",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3U",
        "https://buzzheavier.com/diucu5jfjcod"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/far-cry-free-download-preinstalled-steamrip.jpg"
}