{
    "page_url": "https://steamrip.com/far-cry-primal-free-download-2d/",
    "title": "Far Cry Primal Free Download Direct Link",
    "description": "The award-winning Far Cry franchise that stormed the tropics and the Himalayas now enters the original fight for humanity’s survival with its innovative open-world sandbox gameplay, bringing together massive beasts, breathtaking environments, and unpredictable savage encounters. Welcome to the Stone Age, a time of extreme danger and limitless adventure, when giant mammoths and sabretooth tigers ruled the Earth and humanity is at the bottom of the food chain.\nAs the last survivor of your hunting group, you will learn to craft a deadly arsenal , fend off fierce predators, and outsmart enemy tribes to conquer the land of Oros and become the Apex Predator. The rich setting of the Stone Age provides a new setting filled with unpredictable mayhem, dangerous threats, and incredible stories that Far Cry is known for. This is earth before man laid claim to it, where deadly sabretooth tigers ruled the world, giant woolly mammoths were kings, and herds of massive Elk stormed through the plains. Discover these and many more daunting creatures in the savage open-world of Oros within the towering redwood forests, harsh taiga, cold glacial mountains and humid swamps.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/far-cry-primal-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/far-cry-primal-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8.1, Windows 10 (64-bit versions only)",
        "Processor": "Intel Core i3-550 | AMD Phenom II X4 955 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460 (1GB VRAM) | AMD Radeon HD 5770 (1GB VRAM) or equivalent",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Ubisoft",
        "Platform": "PC",
        "Game Size": "16.60 GB",
        "Repack By": "GOG",
        "Version": "v1.3.3 (Apex Edition) | Updated  + all add-ons and HD textures",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/dxyf7jvyz7b0",
        "https://megadb.net/690bqmzcewmr",
        "https://1fichier.com/?y817gy29yg413ejopp4n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/far-cry-primal-free-download-preinstalled-steamrip.jpg"
}