{
    "page_url": "https://steamrip.com/far-cry-new-dawn-free-download-2k/",
    "title": "Far Cry New Dawn",
    "description": "Dive into a transformed vibrant post-apocalyptic Hope County, Montana, 17 years after a global nuclear catastrophe. Join fellow survivors and lead the fight against the dangerous new threat the Highwaymen, and their ruthless leaders The Twins, as they seek to take over the last remaining resources .\nTake up arms on your own or with a friend in two player co-op in an unpredictable and transformed world Recruit an eclectic cast of Guns and Fangs for Hire and form alliances to fight by your side against the Highwaymen’s unruly leaders The Twins Recruit Specialists to upgrade your homebase, who will help unlock all new features including crafting weapons, gear and more Engage the Highwaymen in Turf Wars and venture on Expeditions to memorable locations across the USA\nThe world is practically destroyed, there is nothing left that would resemble an advanced civilization . You are in this apocalypse and you will have to survive . Find characters from Far Cry 5, stir up Hope County, destroy the sisters who preach violence and lawlessness and just survive.\nThis time you will be able to travel across a huge open world, arrange firefights , carry out expeditionary sorties on the territory of other states, create melee weapons from improvised materials and have fun like never before.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/far-cry-new-dawn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/far-cry-new-dawn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1, Windows 8.1, Windows 10 (64bit versions only)",
        "Processor": "Intel Core i5 2400 @ 3.1 GHz or AMD FX 6350 @ 3.9 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 670 (2GB) or AMD Radeon R9 270X (2GB) or better",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Ubisoft Montreal, Ubisoft Kiev, Ubisoft Shanghai",
        "Platform": "PC",
        "Game Size": "30.3 GB",
        "Released By": "CODEX",
        "Version": "v1.0.5 | All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/4bstuo1vk2mf",
        "https://1fichier.com/?ehcmx546frqwnk6u1vgg",
        "https://datanodes.to/co9yyhedh5ak/Far-Cry-New-Dawn-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/far-cry-new-dawn-preinstalled-steamrip.jpg"
}