{
    "page_url": "https://steamrip.com/far-cry-3-free-download-s2/",
    "title": "Far Cry 3",
    "description": "Far Cry 3 is an open world first-person shooter set on an island unlike any other. A place where heavily armed warlords traffic in slaves. Where outsiders are hunted for ransom. And as you embark on a desperate quest to rescue your friends, you realize that the only way to escape this darkness is to embrace it Create your own FPS adventure. Customize your weapons, your skills and your approach to each mission, whether you favor intense run-and-gun action, stealthy close-up takedowns or long-range sniping. Explore a diverse island playground, from mountain ranges and swampy grasslands to white sandy beaches. Discover relics, hunt exotic animals, play mini-games and travel quickly by land, sea or air.\nFight your way through the island’s towns, temples, river ports and more Encounter an engaging and disturbed cast of characters as you take a gritty journey to the dark side of humanity, written by a Writers Guild Award winner. Play online and team up in a four-player campaign which challenges you to be your best and work together to prevail. Experience the island through the eyes of a wayward crew in their own quest to survive against the odds. Innovative multiplayer rewards skill and team play. To level up, players must support each other by boosting with battle cries, reviving teammates and calling in support weapons. After each match, players have the choice to punish or show mercy for their foes in fun and twisted ways, choreographed with interactive cutscenes. Blast Brigade vs. the Evil Legion of Dr. Cread",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/far-cry-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/far-cry-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Windows Vista and Windows 7",
        "Processor": "Intel Core®2 Duo E6700 @ 2.6 GHz or AMD Athlon64 X2 6000+ @ 3.0Ghz or better",
        "Memory": "4 GB RAM",
        "Graphics": "512MB Video RAM (1GB Video RAM), DirectX9c (DirectX11) Shader Model 3.0 (Shader Model 5.0)",
        "DirectX": "9.0c",
        "Hard Drive": "15 GB HD space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Ubisoft",
        "Platform": "PC",
        "Game Size": "7.6 GB",
        "Released By": "RELOADED",
        "Version": "v1.05 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/8A4A5FF390",
        "https://1fichier.com/?1bu0vm1brgrayj8v8s7w",
        "https://buzzheavier.com/hnam4zxjo3k5",
        "https://megadb.net/lb56hz3zzhsl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/far-cry-3-preinstalled-steamrip.jpg"
}