{
    "page_url": "https://steamrip.com/farlanders-free-download-1l/",
    "title": "Farlanders",
    "description": "Lead the charge in establishing a colony on Mars in this turn-based strategy game with a nostalgic look but fresh gameplay. Use specialized tools to terraform the planet, build residential areas for your colonizers, and construct resource-producing factories in an effort to become a self-sustaining society. Create a viable habitat for your settlers by building water pumps, establishing farms on fertile ground, harnessing the power of the sun, and mining for precious minerals. Make sure to plan carefully before building . The position of each building will provide additional bonuses based on their placement. For example, placing a wind turbine near mountains will provide an increase in electricity output. Mahokenshi\nIn case you run out of space on the surface or are in need of further resources, you can always choose to expand below. Utilize terraforming tools to dig underground and uncover new areas for expansion, discover artifacts, and harness rare minerals. The more resources you collect, the more your colonists will prosper. Use a turn to select a terraforming kit and shape the landscape to your colony’s advantage. Need a water source? Place a water drop tile into a canyon and watch the surrounding flat land become fertile.\nNot enough resources? Create new mineral deposits or simply expand pre-existing ones. Terraforming tiles have preset shapes, so be careful when configuring where to place them You may end up with ice if you place a water drop tile on flat ground instead of a canyon . Be wise in your choices and always plan two steps ahead.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/farlanders-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/farlanders-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5 or equivalent (Dual Core with Hyper-Threading)",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 4400 or equivalent, 1280×720 resolution or higher.",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Andriy Bychkovskyi",
        "Platform": "PC",
        "Game Size": "322 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zkgn9xq1jlk3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/farlanders-preinstalled-steamrip.jpg"
}