{
    "page_url": "https://steamrip.com/farmers-life-free-download-1k/",
    "title": "Farmer’s Life Free",
    "description": "Get Farmer’s Life PC game for free instantly and play pre-installed on SteamRiP\nLife of a farmer is filled with stench, filth and hard work. Kashmir is an old bachelor, farmer and an alcoholic. Help him survive as long as possible in the middle of east-european nowhere. Your life rhythm will be determined by seasons, wildlife will threaten your life and the land will be hard to work with. Your fate is in your hands Explore, take care of your farm and manage your resources wisely. Your animals require patient care. Thanks to it the chickens will lay more eggs and cow will give more milk. Well-kept animals work more efficiently. Voidtrain\nMind the seasons Prepare for constantly changing weather conditions and hard winters. A good farmer is a prepared farmer. Learn new ways of survival. Sow, feed, harvest, slaughter. Your farm is surrounded by impenetrable forests, home of countless dangerous animals. Uninvited guests will frequently disrupt your work, so remember to be prepared for unexpected encounters. Loneliness is hard to bear? Not necessarily. Few neighbors ma become more of a problem than wild animals living in the woods nearby .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/farmers-life-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/farmers-life-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 750",
        "DirectX": "Version 10",
        "Sound Card": "DirectX compatible"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG, Simulation",
        "Developer": "FreeMind S.A.",
        "Platform": "PC",
        "Game Size": "4.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.36 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zvbt47m07sgf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/farmers-life-free-download-preinstalled-steamrip.jpg"
}