{
    "page_url": "https://steamrip.com/farm-manager-2021-free-download-1w/",
    "title": "Farm Manager 2021",
    "description": "Get ready for a logistic challenge in the next part of the best-selling series, which has been sold in over 120,000 copies! In Farm Manager 2021, as a farm manager, you have to ensure the right level of harvest, employee satisfaction, animal health, equipment efficiency and proper crop processing.\nYou can buy new plots and use materials from abandoned buildings to expand your farm. Thanks to the new, more intuitive interface, employee management is even simpler. In Farm Manager 2021 you will find even more plant species to grow. Now also organic ones! Grow celery, carrots, currants, gooseberries , onions and more. Observe plant growth. The new mechanics allow automatic field management using available employees and machines. Cassiodora\nEnjoy a variety of machines that you can use when working in the field. Buy and sell them on the stock market. Look for bargains among used machines. In Farm Manager 2021 you will find bees, sheep, goats, chickens, turkeys, ducks, geese and cows.\nFor the first time, you will be able to set up a fish farm, ostrich, wild boar and quail farm. Logistics center, mechanic’s garage, veterinary center and much more! The logistics center will allow you to transport larger quantities of resources and products easier and faster. In the mechanic’s garage, they will take care of your agricultural machinery. Employees from the veterinary center will ensure the health of your farm animals.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/farm-manager-2021-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/farm-manager-2021-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 (64-bit versions)",
        "Processor": "Intel i5-8400, AMD Ryzen 5 2600",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1050 4GB",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Cleversan Games",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "RUNE emu",
        "Version": "v1.1.526 | Full  + 3 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6ro8ptcfs0e3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/farm-manager-2021-preinstalled-steamrip.jpg"
}