{
    "page_url": "https://steamrip.com/farthest-frontier-free-download-1x/",
    "title": "Farthest Frontier",
    "description": "Protect and guide your small band of settlers to forge a town from untamed wilderness at the edge of the known world. Harvest raw materials, hunt, fish and farm to sustain your advancing town. Produce crafted items for villagers to trade, consume, equip and fight with as you battle for your survival against the elements and outside threats (pacifist mode available for players who do not want to engage in combat). Harvest 14 different raw materials from wood, stone and clay, to metal ores, wild herbs, and honey. Grow 17 types of food, including forage items, fish and game, plus 10 food crops, each with different characteristics. Produce 32 crafted items and materials in a multi—tiered economy. The Coin Game\nBuild and Advance – Construct 50 different types of buildings as you grow your town from a fledgling settlement to a bustling city. Your town center and housing will advance through multiple building tiers as the prosperity and desirability of your town increases. Upgrade production buildings to increase efficiency and enable production of more advanced items.\nMost Detailed Farming System Ever – Strategically select from 10 crops with unique growing characteristics and configure crop rotations to maintain soil fertility , avoid heat and frost damage, and prevent the accumulation of diseases. Cultivate your fields over time, removing weeds and rocks, raising fertility and adjusting soil mixture to achieve maximum crop production to keep your growing population fed.\nAdvanced Town Simulation – Villagers actively live their lives and perform their jobs in real time. Watch as villagers carry goods across town from remote work-sites to be processed into materials and crafted into items. See foods and goods delivered to homes, the trade post or stored for later use. Develop roads, transport wagons and improve storage methods to facilitate the efficient movement of goods through your town and prevent spoilage.\nRandomly Generated Maps – Farthest Frontier is highly replayable and no game is ever quite the same with beautiful, completely randomized terrain generation and resource distribution. Controls allow players to specify the amount of water or mountains they desire, with extreme maps leading to unique challenges .\nIdyllic to Brutal – Customizable difficulty options allow players to turn off features like invaders and disease, for a more tranquil experience or max out difficulty to truly test their town-builder prowess.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/farthest-frontier-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/farthest-frontier-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64bit versions only)",
        "Processor": "Intel Core i5 3470 @ 3.2 GHz | AMD FX 8120 @ 3.9 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 780 | AMD R9 290, with 3 GB VRAM or better",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Crate Entertainment",
        "Platform": "PC",
        "Game Size": "6 GB",
        "Released By": "RUNE Emu",
        "Version": "v0.9.7f | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/95b4fa4i2ucm",
        "https://1fichier.com/?5480c956opyelko6ez5z",
        "https://megadb.net/ap9qouwdp8de"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/farthest-frontier-preinstalled-steamrip.jpg"
}