{
    "page_url": "https://steamrip.com/fate-stay-night-remastered-free-download/",
    "title": "Fate/stay night REMASTERED",
    "description": "Experience in vivid detail the story of Shirou Emiya, a teenage boy with dreams of becoming a Hero of Justice, and his battle revolving around the omnipotent wish-granting vessel, the Holy Grail. With numerous entries in the ever-expanding Fate series, including the mobile game Fate/Grand Order, the curtains of Fate, the Origin, rise once again. The Political Machine 2024\nA ritual held in Fuyuki City by magi grasping to reach the Root. Seven magi, known as Masters , gather to compete over possession of the Holy Grail, which possesses the power to fulfill any of its bearer’s wishes. They fight other Masters for supremacy by summoning Heroic Spirits, known as Servants, called upon by the Holy Grail.\nHowever, throughout the past four Holy Grail Wars, history has yet to see a single victor. During the Fourth Holy Grail War ten years ago, Shirou Emiya was saved from amidst the fires of war by the self-proclaimed mage Kiritsugu Emiya.\nThe young Shirou started living with Kiritsugu and persistently asked for instruction in magecraft, much to the mage’s disapproval. On the night prior to Kiritsugu’s death, Shirou promised his adoptive father that he’ll become a Hero of Justice.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/fate-stay-night-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/fate-stay-night-remastered-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10(64bit)",
        "Processor": "4th generation Intel Core processor or later",
        "Memory": "4 GB RAM",
        "Graphics": "intel HD",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "TYPE-MOON, fuzz Inc.",
        "Platform": "PC",
        "Game Size": "7.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.128 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/NhKX8Y",
        "https://megadb.net/97sgch3gjikh",
        "https://buzzheavier.com/fuxcm35zn5n3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/fate-stay-night-remastered-preinstalled-steamrip.jpg"
}