{
    "page_url": "https://steamrip.com/fbc-firebreak-free-download/",
    "title": "FBC: Firebreak",
    "description": "FBC: Firebreak is a cooperative first-person shooter set within a mysterious federal agency under assault by otherworldly forces. As a years-long siege on the agency’s headquarters reaches its boiling point, only Firebreak— the Bureau’s most versatile unit—has the gear and the guts to plunge into the building’s strangest crises, restore order, contain the chaos, and fight to reclaim control.\nDive into the Federal Bureau of Control’s (FBC) unpredictable and extradimensional headquarters during its darkest—and strangest—hours. As one of the FBC’s fearless first responders, you and your team are on call to confront everything from reality-warping anomalies to otherworldly monsters… no matter the odds. Will you contain the chaos or finally lose control? Date Everything\nJoin forces with friends or strangers to tackle each job as a well-oiled crew. Survival in this three-player cooperative FPS hinges on quick thinking and seamless teamwork as you scramble to tame raging paranatural crises across a variety of unexpected locations. Improve your odds by utilizing the tools and skills that make you unique or improvising with whatever’s on hand to support your crew.\nBefore deploying, select your weapon and customize your Firebreaker’s Crisis Kit with specialized tools, grenades, support items, and paranatural augments… then modify them to suit your strategy and change the way you play. Experiment with different loadouts to perfect your playstyle and synergize with your team, giving you the edge to succeed in every job, no matter the difficulty.\nReturn to the strange and unexpected world of Control or venture in for the first time in this standalone, multiplayer experience. Discover the iconic and unfathomable headquarters of the FBC — the Oldest House — from an entirely new perspective as a team of volunteer first responders with nothing but gear and guts to bring the Bureau back from the brink.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2272540/caf501f52b9f6126cba76e453a8d78a0b1660265/ss_caf501f52b9f6126cba76e453a8d78a0b1660265.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2272540/838a4b1c0960c078d74bacc2db37890d95a71293/ss_838a4b1c0960c078d74bacc2db37890d95a71293.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit",
        "Processor": "Intel Core i5-7600K or AMD Ryzen 5 1600X",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070 or AMD Radeon RX 5600 XT (6 GB VRAM)",
        "Network": "Broadband Internet connection",
        "Storage": "30 GB available space",
        "Additional Notes": "1080p / 60 FPS / Low Quality Settings, SSD storage required"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Remedy Entertainment",
        "Platform": "PC",
        "Game Size": "12.7 GB",
        "Released By": "OFME",
        "Version": "v5251171 + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/zqDRLv",
        "https://buzzheavier.com/wfrnaxmy01tl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/fbc-firebreak-preinstalled-steamrip.jpg"
}