{
    "page_url": "https://steamrip.com/fear-hunger-free-download/",
    "title": "Fear & Hunger Directly Download",
    "description": "Fear & Hunger is a horror dungeon crawler set in the dark and hopeless dungeons of fear and hunger. Four misfortuned adventurers dwell deeper and deeper to the darkness and uncover the secrets this ancient fortress holds inside. The fortress works as an ancient nexus for different planes of existence. The depths are in an eternal turmoil as both old and new gods struggle for power, it’s up to the players to choose their position and stance in all of this. Fear & Hunger 2: Termina\nThe game is a hybrid of survival horror and dungeon crawler genres with its influences ranging from Silent Hill to Nethack. There are roguelike elements to the game as well as a heavy foundation of a j-RPG. Fear & Hunger is heavy on atmosphere and ruthless in its difficulty.\nExtreme violence and gore are everyday sights in the dungeons and death is one of the easier ways to go in the game. The game has drug and substance abuse, heavy themes ranging from self- mutilation to sexual violence. None of the themes are taken lightly however. They are all part of the world building and there to create the unique atmosphere where the game measures just how far the player is willing to go in order to survive.\nParts of the dungeon layout, events, loot and enemy placements are randomized with few different variations to keep things fresh with subsequent playthroughs. The game is designed with the classic trial and error formula, so you can expect to start the game over and over again. But as long as you learn from your mistakes, you can quickly find yourself at the deeper levels of the dungeon .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/fear-and-hunger-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/fear-and-hunger-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: WindowsR 7/8/8.1/10 (32bit/64bit)",
        "Processor": "Intel Core 2 Duo or better",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 9/OpenGL 4.1 capable GPU",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Miro Haverinen",
        "Platform": "PC",
        "Game Size": "739 MB",
        "Released By": "N/A (cs.rin)",
        "Version": "v1.4.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v9xwsu2eviyt",
        "https://buzzheavier.com/hmde00ug4phz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/fear-and-hunger-preinstalled-steamrip.jpg"
}