{
    "page_url": "https://steamrip.com/fernbus-simulator-free-download-1r/",
    "title": "Fernbus Simulator Free",
    "description": "Fernbus Simulator v1.14.12800 Download PC Game In Direct Link for free on SteamRIP\nThe Fernbus Coach Simulator is the first simulation of the very popular intercity buses. Thanks to the cooperation with FlixBus the Fernbus Coach simulator shows the daily life of a coach driver on the German Autobahn, highways and in more than 40 cities in great detail. With a large and modern MAN Lion’s Coach Bus you experience the daily life of a long distance coach driver .\nNavigate through a complex Autobahn and road network to bus stations in the more than 40 implemented cities and stay in constant communication with the headquarters. Be careful with the other car traffic during your trips on partially full German highways and control your bus safely by day and night during all seasons.\nAbout 20.000 km of the German route network of FlixBus and over 40 cities were simulated. Time passes at a scale of 1:10, so that the individual tours last not too long. Like in reality at the bus stations passengers already holding a valid ticket can get on right away while the other passengers have to buy a ticket from you. Both MAN busses are equipped with original cockpits including all functions .\nThe interior and exterior of the bus is modeled to the last detail. True to original passenger announcements provide a realistic atmosphere. Construction sites, traffic jams and accidents will challenge you as a bus driver to keep up with the schedule. The busses were tested and optimized by bus drivers and driving instructors.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/fernbus-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/fernbus-simulator-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "7/8/8.1/10 (64bit only)",
        "Processor": "Intel Core i5  or similar with at least 2.6 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX 560 or similar AMD Radeon (no support for onboard cards)",
        "DirectX": "Version 11",
        "Storage": "45 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "TML-Studios",
        "Platform": "PC",
        "Game Size": "4.62 GB",
        "Repack By": "CODEPUNKS",
        "Version": "v1.14.12800 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3Y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/fernbus-simulator-free-download-preinstalled-steamrip.jpg"
}