{
    "page_url": "https://steamrip.com/field-of-glory-kingdoms-free-download/",
    "title": "Field of Glory: Kingdoms",
    "description": "Field of Glory: Kingdoms is the new game from award-winning studio AGEOD, makers of some of the best grand strategy games of all times. It is set in 1054, just after the Great Schism, and it encompasses more than two centuries of epic European, African, and Middle Eastern history. Mori Carta\nAdminister your royal domain with the new Authority concept. Keep your population and vassals under control, promulgate edicts to construct buildings, and declare wars on your enemies. As a ruler, prepare your succession by siring an heir with your spouse or with any other person of your choice. Having an heir is by no means a guarantee of a peaceful transition. Having a neighbor of a different religion will create tensions and sometimes wars, even for tolerant rulers.\nWhen the imbalance is too strong, diplomacy will take a backseat , and war will be declared. Lose too many holy cities and watch a Crusade or Jihad form up. Administer your population from the lowest peasants to the prestigious, powerful, and troublesome nobles. The social ladder is difficult to climb and your ability in keeping social classes under control is paramount to success.\nKeep your borders protected and build an army of expert combatants. Knights , sergeants, spearmen, crossbowmen, and many more types of units can be used to fulfill your objectives. Field of Glory II Integration. If you want even more direct control, Field of Glory: Kingdoms lets you export and load your battles into Field of Glory II: Medieval and then load the results back into the game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/field-of-glory-kingdoms-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/field-of-glory-kingdoms-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 & 11",
        "Processor": "2GHz processor",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB DirectX 9 Compatible  Card",
        "DirectX": "Version 9.0c",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "AGEOD",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "SKIDROW emu",
        "Version": "v1.0.6 | Full  + DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/cj1l09phncrn",
        "https://megadb.net/tjy1bgu9hfj2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/field-of-glory-kingdoms-preinstalled-steamrip.jpg"
}