{
    "page_url": "https://steamrip.com/fight-knight-free-download-1u/",
    "title": "FIGHT KNIGHT Free",
    "description": "FIGHT KNIGHT game for free instantly and play pre-installed on SteamRiP\nTHE TOWER ascends without warning. It consumes the land it rises from, growing ever higher with each appearance. Those trapped within the Tower’s shadow are cursed to live in an eternal night… until, before long, it vanishes as quick as it came. The wise can predict its next appearance, and fools seek the treasures within. But the Tower is full of the twisted forms of the people and places it has consumed in its many ascents, preventing the brave and the ignorant alike from climbing its cursed halls.\nSurely some great reward awaits the one who reaches the top! But with such powerful and evil sorcery afoot, who could possibly reach its summit? FIGHT KNIGHT is a mix between a first person dungeon crawler and a high speed action game.  Climb through the many unique floors of the Tower and get to know friend and foe alike! Solve puzzles, collect artifacts, and help FIGHT KNIGHT grow in power. Encounters take place in real time, through grid-based melee combat . Wits and reflexes will pave your way to victory. Will YOU master the Tower and those who wait within?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/fight-knight-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/fight-knight-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel i3-3110M (2.40ghz)",
        "Memory": "8 GB RAM",
        "Graphics": "Integrated  Card",
        "DirectX": "Version 11",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Team Sorcerobe",
        "Platform": "PC",
        "Game Size": "268 MB",
        "Repack By": "SEWN",
        "Version": "v01.12.2021 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3Z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/fight-knight-free-download-preinstalled-steamrip.jpg"
}