{
    "page_url": "https://steamrip.com/file-destined-free-download-1n/",
    "title": "File Destined Directly Download",
    "description": "File Destined is a psychological thriller game developed with Unreal Engine 5. While you are getting a chill down your spine with the impressive story and realistic locations, you will also witness the mystery behind Oliver’s story. Can this last case of Oliver , all be just a small part of a bigger picture? Gather clues, unravel the mystery behind the case and uncover the truth. As you are trying to find clues and figure out who is responsible of one of the most close watched murder cases of the country, you will encounter unexpected dangers when least expected. Take your time investigating the crime scene as each thing you find might lead you to the truth you are seeking for. Madshot: Road to Madness\nDuring your mission , be very careful not to spend too much time in in darkness, because in darkness may reside evil spirits out of this world. You will have to look through and closely examine the objects in the map to see if they carry any crucial information about the case. In the meanwhile, you will try to survive in a hostile dark environment with only a lighter in your hands as a light source. The lighter has a real life mechanics, so be careful using it, or else you will be left in dark .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/files-destined-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/files-destined-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 64 Bit",
        "Processor": "Intel i5 or new-gen i3 / AMD equivalen",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 960",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Metavision Studio",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "DARKSIDERS",
        "Version": "v1.0.382 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xfr1yfccg7c2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/files-destined-preinstalled-steamrip.jpg"
}