{
    "page_url": "https://steamrip.com/filthy-animals-heist-simulator-free-download-1i/",
    "title": "Filthy Animals | Heist Simulator",
    "description": "Filthy Animals : Heist Simulator is a chaotic multiplayer Heist game for 1-4 players, spanning across 8 different chapters featuring a total of 21 unique heist levels Take on the role of mutant animals following the orders of Tony, the Filthy Animal Bossman Criminal Mastermind.\nWreak havoc through a series of heists starting with a convenience store, a bank robbery , then break into a super secret military base, with missions ranging all the way into outer space It’s not safe to steal alone, bring up to 3 pals with you and wreck the joint while you try to steal everything that’s not nailed down. Play co-op online or local and bring the chaos! But if you need some alone time, don’t worry, we’ve got you covered in single player too. Beyond Contact\nSuccess brings you bigger and tougher heists to cut your teeth on. Start with a store, move on up to a bank and after that the sky’s the limit! Literally. No-one said heists were easy. Every chapter is filled with enemies determined to stop your stealing and environmental hazards that will blow your socks clean off. With careful planning, and a lot of bumbling about, you’ll be able to smash and grab with the best of them.\nEven if you do lose your life, never fear, simply get your team to flush you down the toilet and you’ll be back and fighting fit in no time. The deck isn’t stacked against you, each mutant animal has their own special ability letting you explode things, smash up levels, and level the playing field. Bring the chaos and let rip, just take care not to destroy your teammates. Drink soda and eat tacos and other spicy Mexican foods to give you the power you need to smash your way to victory",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/filthy-animals-heist-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/filthy-animals-heist-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Pewter Games Studios, LoPoly Games",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.05 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rw5r299jzbeo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/filthy-animals-heist-simulator-preinstalled-steamrip.jpg"
}