{
    "page_url": "https://steamrip.com/final-profit-a-shop-rpg-free-download-1g/",
    "title": "Final Profit A Shop RPG Directly Download",
    "description": "Final Profit is a merchant life-sim RPG that presents a critique of capitalism. You are Queen Mab, exiled from the lands of the Fae because of your radical plan to save the realm from financial predators . The Fae Council thinks attempting to defeat the Bureau of Business at their own game is an insane ploy with no hope of success.\nStarting with nothing, you assume the alias of Madama Biz. Accumulate wealth and influence to climb the ranks until you become a Lord of Business But you’ll need more than just money. Seek out allies to help overcome the danger, traps, and colossal debt the Bureau has in store for you. Dark Chess\nRun your shop, make investments, and explore a story filled world as you work to earn enough coin to take down the corrupt Bureau of Business Earn XP by making money Your main source of income will be your shop, but there’s plenty of side hustles to uncover if you go looking for opportunities Find customers and unlock products to sell in your shop .\nManaging it all can get a bit hectic but there’s plenty of ways to streamline , upgrade, and strategise to become more efficient Automate your products going on display, unlock better and quicker ways to get stock, change the way customers behave, collect cosmetics to change the way your shop looks, and many more! There’s a lot of options to build your own play style",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/final-profit-a-shop-rpg-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/final-profit-a-shop-rpg-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® 7/8/8.1/10 (32bit/64bit)",
        "Processor": "Intel Core2 Duo or better",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 9/OpenGL 4.1 capable GPU",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation, Strategy",
        "Developer": "Brent Arnold",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "TENOKE",
        "Version": "Build 10701692 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a566uxdjf06n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/final-profit-a-shop-rpg-preinstalled-steamrip.jpg"
}