{
    "page_url": "https://steamrip.com/firework-simulator-free-download-m1/",
    "title": "Firework Simulator",
    "description": "Firework Simulator lets you play with all kinds of different fireworks and even lets you make your own. Do what ever you want in sandbox mode or test your skills to complete puzzles in challenge mode . Everything is controlled by a physics system, the fireworks, projectiles , sparks, rocks, doodads and even you, the player.\nThis lets it all behave without preset animations and such. Play with a bunch of premade fireworks including missile boxes, roman candles, bees, helicopters and mortars. Fireworks will behave realistically reacting on how they’re placed and any objects they interact with. Also similar to real fireworks, sometimes they will take off perfectly and other times they will spin a bit and fizzle out or explode too early. The Quarry\nSo each time you light one off it will be different. Create your own fireworks by choosing a container like a cylinder, shooter, airplane and many more, then select different powders to put in them like sparkles, crackles , pops, jets and explosives . You’ll also be able to pick the color of certain powders and timings.\nChoose different locations like a dark alley, a hangar, a rock pit or the creatively named “ Concrete Slab in Open Field” Try to complete the different challenges and puzzles , like creating a custom firework to get over a gap, fire a roman candle to pop a balloon, or even step onto the explosion platform where you have to dodge explosives trying to blast you off. There might be secrets to find and things to unlock.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/firework-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/firework-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows",
        "Processor": "Intel i3 8th Generation or AMD Equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Dedicated GPU with at least 4GB VRAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "echomune",
        "Platform": "PC",
        "Game Size": "806 MB",
        "Released By": "TENOKE",
        "Version": "Build 10375611 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/e6b3z1opf389"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/firework-simulator-preinstalled-steamrip.jpg"
}