{
    "page_url": "https://steamrip.com/fireworks-mania-an-explosive-simulator-free-download-r1/",
    "title": "Fireworks Mania – An Explosive Simulator Download",
    "description": "Get Fireworks Mania – An Explosive Simulator for free instantly and play pre-installed on SteamRiP\nFIREWORKS MANIA is an explosive simulator game where you can play around with fireworks. In various low-poly environments you can go nuts with all the fireworks you want. Eventhough the game is created to be a casual game where players just have fun for a short while, the game can easily entertain creative players for hours, as they setup a firework show or explore the environments in the hunt for things to blow up. Not two play-sessions are the same, as the game is heavily physics based, resulting a different outcome every time. This often leads to fun moments, when things are not going as planned .\nJust watch how different fireworks explode, enjoying the spectacle that will be reflected in the night sky? Or you want to create your own unique combination by detonating several types of fireworks at once? Or maybe you want to try to create something much cooler, like in one of the many shows? Moreover, everything is possible here But there are also a couple of important points",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/fireworks-mania-an-explosive-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/fireworks-mania-an-explosive-simulator-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "i5-2550k",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 770",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation",
        "Developer": "Laumania ApS",
        "Platform": "PC",
        "Game Size": "321 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2025.4.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/b65umqkmx9l6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/fireworks-mania-an-explosive-simulator-free-download-preinstalled-steamrip.jpg"
}