{
    "page_url": "https://steamrip.com/five-nights-at-freddys-security-breach-free-download-u1/",
    "title": "Five Nights at Freddy’s: Security Breach",
    "description": "Get Five Nights at Freddy Security Breach PC game for free play pre-installed on SteamRiP\nFive Nights at Freddy’s: Security Breach is the latest installment of the family-friendly horror games loved by millions of players from all over the globe. Play as Gregory, a young boy trapped overnight in Freddy Fazbear’s Mega Pizzaplex. With the help of Freddy Fazbear himself, Gregory must survive the near-unstoppable hunt of reimagined Five Nights at Freddy’s characters FNAF SB as well as new, horrific threats. THE HUNTERS AND THE HUNTED – Once nighttime protocols are initiated, the animatronics at Freddy Fazbear’s Mega Pizzaplex will relentlessly pursue all intruders . The Amazing Spider-Man 2\nGlamrock Chica, Roxanne Wolf, Montgomery Gator, and the Pizzaplex’s security guard, Vanessa, will turn over every Cotton Candy Pizza Stand if they have to – it’s not wise to stay in one place for too long. ADAPT TO SURVIVE – Access the building’s security cameras to survey the environment and plan your route through danger. Distract enemies by knocking over paint cans and toys FNAFSB get free just slip away before enemies are drawn to your location. Hop into hiding spots and allow danger to pass, or try to outrun your pursuers . Play your way, but be prepared to adapt.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/five-nights-at-freddys-security-breach-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/five-nights-at-freddys-security-breach-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit)",
        "Processor": "AMD Ryzen 5 3600, Core i5 6600K",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1050 Ti",
        "DirectX": "Version 12",
        "Storage": "80 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Steel Wool Studios",
        "Platform": "PC",
        "Game Size": "56 GB",
        "Version": "Build 11744860 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/o9m7UF",
        "https://buzzheavier.com/vynzop6s5sd4",
        "https://1fichier.com/?epobbp8m87ovypgmzk0w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/five-nights-at-freddys-security-breach-preinstalled-steamrip.jpg"
}