{
    "page_url": "https://steamrip.com/five-nights-at-freddys-vr-help-wanted-free-download-o1/",
    "title": "Five Nights At Freddy’s VR: Help Wanted Free Download",
    "description": "Five Nights at Freddy’s: Help Wanted is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection of new and classic “Where fantasy and fun come to life Time to get your hands dirty. Repair claustrophobic ventilation systems, troubleshoot broken animatronics that could activate at any moment, or spend your evenings cowering in the nighttime security guard office. Confront your favorite killer animatronics including; Freddy, Bonnie, Chica, Foxy, Springtrap, The Mangle, Funtime Foxy, and Circus Baby. FIFA\nToys, Plushies, Bobbleheads, and candy candy candy Earn super fun prizes you can play with at the interactive Prize Counter Collect well hidden Faz-Tokens to unlock even more rare collectibles for more SUPER FUN FUN FUN. Scenes from classic titles have been updated and remade for a fully immersive experience including; Five Nights at Freddy’s, Five Nights at Freddy’s 2, Five Nights at Freddy’s 3, Five Nights at Freddy’s 4, and Five Nights at Freddy’s: Sister Location. Experience the horror in flat (non-VR) mode or VR. FNAF Steamrip Oculus Rift and HTC Vive are supported.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/five-nights-at-freddys-vr-help-wanted-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/five-nights-at-freddys-vr-help-wanted-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8",
        "Processor": "Intel i5-4590 or greater / AMD FX 8350 or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 / AMD R9 390",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual",
        "Developer": "Steel Wool Studios",
        "Platform": "PC",
        "Game Size": "4.29 GB",
        "Repack By": "Pirate",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0qiekvw099x6",
        "https://buzzheavier.com/rtjxl7d0vp0x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/five-nights-at-freddys-vr-help-wanted-free-download-preinstalled-steamrip.jpg"
}