{
    "page_url": "https://steamrip.com/five-nights-at-freddys-help-wanted-2-free-download-f1/",
    "title": "Five Nights at Freddy’s: Help Wanted 2",
    "description": "Find out if you have what it takes to be a Fazbear Entertainment Superstar Five Nights at Freddy’s: Help Wanted 2 is the sequel to the terrifying VR experience that brought new life to the iconic horror franchise. As a brand new Fazbear employee you’ll have to prove you have what it takes to excel in all aspects of Pizzeria management and maintenance. Pioneers of Pagonia\nGo Backstage as a VIP to help Roxanne Wolf & the S.T.A.F.F Bots get ready for their performances in the Pizzaplex Salon Head into the Fazcade and enjoy classic games like Bonk-a-Bon and Fazerblast! See if you can top all the high scores Take care of things behind the scenes in the Staff Only section of the Pizzeria . Deliver First Aid to patients who aren’t quite feeling themselves, and help animatronics perform routine diagnostics & maintenance.\nOur Food Prep courses will help you get the federally mandated amount of value preparing food in the Pizzaplex . Experience all the joys of high-speed food service & get ready to feed some hungry bots Head over to the Ticket Booth to test out our E-ticket attractions, such as Captain Foxy’s Cowboy Adventure! On this lighthearted log ride, you’ll float through the old West as a gunslinger in search of booty!\nAnd finally, if you’re short on dread, dive into the world of our Sister Location These special minigames are VR versions of classic experiences from Five Nights at Freddy’s: Sister Location . These fan-favorites brought to life promise to be as fun as they are terrifying. So what are you waiting for?!? Five Nights at Freddy’s: Help Wanted 2 is now accepting applicants for all positions, effective immediately.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/fnaf-help-wanted-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/fnaf-help-wanted-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "AMD Ryzen 5 1500X / Intel i5-8400",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070 8GB / AMD RX Vega 56 8GB",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Steel Wool Studios",
        "Platform": "PC",
        "Game Size": "10.2 GB",
        "Released By": "Anymars",
        "Version": "Build 14743947 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/82nb6x6uov1g",
        "https://gofile.io/d/kllgqh",
        "https://1fichier.com/?fgz8wfs7n61m6o2t8kqw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/fnaf-help-wanted-2-preinstalled-steamrip.jpg"
}