{
    "page_url": "https://steamrip.com/flame-keeper-free-download-k1/",
    "title": "Flame Keeper Directly Download",
    "description": "Become Ignis, a special coal tasked with liberating the world of Orbis, recently overrun by forces of darkness. Luckily, it just so happens that you’re trained in the art of mortal combat! Learn how to fight, upgrade your abilities, venture through increasingly hostile worlds, and restore the Eternal Flame. Adapt and take on enemies using a multitude of moves and attacks including punch combos , fiery dashes, wide area-of-effect stomps, and powerful finishers that deal decisive damage. DmC: Devil May Cry\nBut don’t get too reckless – smart stamina usage is essential. Each biome in Flame Keeper is inhabited by unique foes and obstacles of increasing difficulty. Consult the trusty Bestiary as you unlock insight into the strengths and weaknesses of your enemies. It’s not enough to let your fists do the talking. Sometimes you need a little pick-me-up.\nUpgrade Ignis to your heart’s desire via skills and passive abilities. Collect seeds from defeated enemies to learn new skills and complete specific tasks to receive runes and unlock helpful passive abilities. Mix and match to create tons of different builds . To restore the Eternal Flame, you must scour each environment for what remains of its energy and transfer it back into each stage’s Fire Camp. Here’s the twist: the energy you collect also acts as your health .\nYou need to deplete it to charge up each Fire Camp , but you also have to stay healthy to explore ever deeper. Find the right balance and discover your best way to play. At the start of each level lies Vulpis Village. The Vulpis are friends to a brave charcoal like yourself, so they’re happy to provide a service. Here you can rest, enhance abilities, rebuild and upgrade structures thanks to the resources you collect. The village changes along with your progress and opens up all-new gameplay features each time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/flame-keeper-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/flame-keeper-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 7/8/10",
        "Processor": "Intel Core i3-6100",
        "Memory": "4 GB RAM",
        "Graphics": "2GB VRAM",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Kautki Cave",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "DOGE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9hcs9bpg9yze"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/flame-keeper-preinstalled-steamrip.jpg"
}