{
    "page_url": "https://steamrip.com/flatout-2-free-download/",
    "title": "FlatOut 2 Enhanced",
    "description": "Experience the drive of your life as you throw yourself around on and off the track causing fences to shatter, tire walls explode, water tanks and barrels fly across the track into other cars. And if anyone, including you, gets caught up in a big smash sit back and watch as the driver gets catapulted through the windscreen in spectacular effect. With over 5,000 destructible objects on each track and 40 deformable pieces on every car sparks are guaranteed to fly increasing the mayhem with every lap FlatOut\nFeaturing an enhanced version of the original’s lauded physics engine and even faster driving track designs, FlatOut 2 also boasts a plethora of improvements, enhancements and additions to make this the definitive FlatOut experience. Twice as many vehicles, a more sophisticated career mode, additional race environments, double the number of tracks; twice as many mini-games along with many multiplayer modes (via LAN only) are just some of the exhaustive features that are included in FlatOut 2.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/flatout-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/flatout-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Racing",
        "Developer": "Bugbear Entertainment, ZOOM Platform Media, Jordan Freeman Group",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Released By": "TiNYiSO",
        "Version": "Build 15008640 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fypco5folmlz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/flatout-2-preinstalled-steamrip.jpg"
}