{
    "page_url": "https://steamrip.com/floodland-free-download-k1/",
    "title": "Floodland",
    "description": "The climate change was a catalyst for a sucession of events that led to the destruction of our world; rising sea levels have innundated the coasts. Only you can help humanity survive by leading your band of survivors on a path to redemption. Starting with a lost bunch of survivors, you need to scavange resources, rediscover technology and maintain the peace between differing factions as you strive to rebuild society.\nThe world as you know it has gone, replaced by islands, swamps and isolated groups of survivors. Gathering scarce resources, you need to explore the world island by island – helping those you can and dealing with those who do not share your vision of the future. We Who Are About To Die\nThere’s more to a city than just people. Food, shelter, water, health, security the list is long and varied. Technology to be researched along a branching Tech-Tree, buildings upgraded and specialists to train. It’s down to you to make sure all these needs are fulfilled; a job made all the harder with limited resources, space and labour to complete these tasks. A society is only as good as its laws; it’s up to you to define them. Will you usher in a new utopian age of equality or is your future a benign dictatorship ?\nNot every group shares your vision and the choices you make can have a profound impact on the future of your settlement. A common goal will make your society more productive than one at loggerheads with itself; you need to define and choose your legal evolution and which route to follow on the Law-Tree but – as with all things there are always consequences.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/floodland-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/floodland-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 64-bit",
        "Processor": "Intel(R) Core(TM) i5-4460 or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1060 or AMD equivalent, 6 GB VRAM",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Vile Monarch",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "CODEX emu",
        "Version": "v1.2.22330 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pwfx0ry71o97"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/floodland-preinstalled-steamrip.jpg"
}