{
    "page_url": "https://steamrip.com/flotsam-free-download-r1/",
    "title": "Flotsam Free",
    "description": "Get Flotsam for free instantly and play pre-installed on SteamRiP\n“ Guide your drifters through a flooded world full of life and color” Sail the ocean on your scrappy town. Search for food, fresh water and garbage to recycle. If you manage your resources wisely your drifters will do more than survive. They will thrive The people in the world of Flotsam have met a terrible fate. But with your help they can still make the best of it. Get to work with your crew of happy go-getters. Fish, distill water, collect driftwood and plastic or build a new inventive structure. Making sure you can stay afloat .\nRemnants of the old world can be found everywhere. Re-discover old technology to improve your town. But be careful your drifters don’t get sick. The old world is polluted. Most people still cling to the old ways and build small driftwood shacks on protruding islands. Food scarcity, garbage floods and storms left settlers and animals stranded and in need of your help. Save the poor souls and welcome them aboard in your family of drifters. The world of Flotsam is a colorful and cheerful place. It’s about going on adventures , seeing the world and cleaning it up as you go. The sun is shining, the sky is clear and the ocean is calm mostly at least.\nThe people in the world of Flotsam are quirky. They each have their likes and dislikes, the things they are good at and the things you better leave to another dr i fter. There is a lot to salvage and discover. But once resources start running low or you just don’t like the view: scout ahead and move your town to a new interesting location. “Land-ho!”",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/flotsam-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/flotsam-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1+",
        "Processor": "Intel Core i5 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 or equivalent",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Pajama Llama Games",
        "Platform": "PC",
        "Game Size": "441 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v0.9.0e9 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/e9mlq3g45pem"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/flotsam-free-download-preinstalled-steamrip.jpg"
}