{
    "page_url": "https://steamrip.com/flyknight-free-download/",
    "title": "FlyKnight",
    "description": "Flyknight tells the tale of a squire of the order of the Flyknights who is assembled to vanquish the witch Lunamoth and lift her curse, which is preventing the denizens of the realm from growing wings. Now separated after an ambush, the squire arriveth at the village of the swamp folk and pledges to see the mission through, either alone or teaming up with other fighters summoned to help along the way.\nDo you have what it takes to emerge victorious and claim Knighthood ? Arm yourself with an arsenal of weapons and choose what’s best for the situation at hand: chop off a foe’s arm to prevent aggression, crush their head to deprive them of senses, fight out of their range with long weapons or arrows. Approach each encounter tactically to prevail Assassin’s Creed III Remastered\nTraverse a hand crafted environment with many sidepaths filled with loot and dangerous encounters, survive from checkpoint to checkpoint and prove your skills against fierce bosses that want you dead!\nSummon a friend and progress through Lunamoth’s lair together: divide and conquer, trade items and make gestures. 2 to 4 players can play together and progress is saved for everyone involved",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/flyknight-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/flyknight-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Quad-core Intel or AMD, 2.5 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce 470 GTX or Radeon 6870",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Wabbaboy",
        "Platform": "PC",
        "Game Size": "534 MB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.2b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g470yjjz57sh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/flyknight-preinstalled-steamrip.jpg"
}