{
    "page_url": "https://steamrip.com/forgive-me-father-2-free-download/",
    "title": "Forgive Me Father 2",
    "description": "Journey once again into a malevolent world inspired by H.P Lovecraft’s myths where madness awaits on every corner. Embark on a path to salvation as you continue the story of the Priest character from the first installment. How long can you balance on the edge of sanity? Will your sins be forgiven, or your soul consumed by madness?\nDistinctive dark comic-like visuals Dark hand-drawn graphic design where every frame looks like a page from a comic book is one of the pillars of Forgive Me Father, and the sequel brings a fresh perspective to its unique style with improved sprites, models and atmospheric lighting effects. Prepare to feast your eyes on juicy blood effects and animated gibs flying everywhere Tormenture\nDive into the madness Defeat Lovecraftian nightmares with a wide range of weapons. Fight hosts of diverse, formidable enemies and beware: each and every one of them evolves into different, ever more evil and twisted forms of themselves – this journey does not get any easier!\nGear up and fight Define your own playstyle and assemble the deadliest arsenal with plenty of weapons to choose from, each with even more powerful variations designed to cause absolute mayhem and bring utter destruction upon your foes. Take your pick from devastating shotguns, lethally accurate rifles, explosive launchers, and unleash their full potential.\nGain mad skills Overwhelming madness is your best friend and worst enemy at the same time. Let it flow through you, unleash absolute mayhem on your foes and gain extraordinary powers as a reward. Embrace the insanity, use it to fuel your bizarre new abilities, and teach the horrors assaulting your senses to fear YOU!\nOtherworldly soundtrack Experience the surprisingly fitting combination of strong electric guitar riffs and energetic drums underscoring the dark Lovecraftian atmosphere. Slay hordes of deranged cultists and confront unimaginable ancient evil while listening to the original soundtrack that will make you headbang for hours on end.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/forgive-me-father-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/forgive-me-father-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5, AMD Ryzen 3 or equivalent (64 bit)",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 or higher",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Byte Barrel",
        "Platform": "PC",
        "Game Size": "7.8 GB",
        "Released By": "RUNE emu",
        "Version": "Build 16168486 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LU8e84",
        "https://megadb.net/rsdl6afith7j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/forgive-me-father-2-preinstalled-steamrip.jpg"
}