{
    "page_url": "https://steamrip.com/forklift-simulator-free-download/",
    "title": "Forklift Simulator",
    "description": "Start your career in logistics today in Forklift Simulator . Take on a variety of different missions, a selection of vehicles and an extensive career mode in which you can put your skills to the test. Start your career in the logistics sector by passing your theoretical and practical forklift driving licence test.\nAfter that you start working in a small company and progress to larger companies in the course of your career, where you can complete extensive tasks and unlock new vehicles. The Plucky Squire\nAfter completing the career-mode you can continue your shift in free play mode to complete orders and missions as you wish. Complete a variety of different and authentic missions that occur every day in a logistics company.\nFrom assembling pallets and inspecting load conditions to sorting out broken loads and, of course, transporting freights, there are many different jobs waiting for you to take care of Unlock a range of vehicles in the course of the career mode, including three different forklift trucks and an electric pallet truck. So you are well equipped for every job.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/forklift-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/forklift-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5 Intel Chip 7",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 1050 TI",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "Bandsoft",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cdcm9ttlp60u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/forklift-simulator-preinstalled-steamrip.jpg"
}