{
    "page_url": "https://steamrip.com/forza-horizon-2-free-download-1v/",
    "title": "Forza Horizon 2 [+Xenia Emulator] Free Download",
    "description": "Get Forza Horizon 2 for free instantly and play pre-installed on SteamRiP\nA world of beauty and freedom awaits in Forza Horizon 2! Explore a beautiful open world with dynamic day, night and spectacular weather effects in stunning 1080p. Drive 200 + cars in epic road trips through a massive, wide-open world of freedom. Action-packed driving gameplay rewards you for showing off your style as well as your skill. Instantly connect with friends online with no lobbies and no waiting. Among new features in the game are “ Bucket Lists”, three groups of timed challenges for the player to complete, similar to the 1000 Club in Forza Horizon.\nThey can be completed in solo or co-op mode (when a player goes to the online version of the map, they can be completed with a random person or invited friend). These challenges are continuously updated to provide new challenges throughout the map. Car Meets are an online mode where players can meet up online and compare their cars, similar to “Forzavista” mode in Forza Motorsport 5 . Players are also able to interact with each other in Car Meets, including sharing tuning setups and liveries. In the online version of the game, races such as circuits, sprints, and cross country are playable against other players, along with other game types such as Infected and King .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/forza-horizon-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/forza-horizon-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "CPU": "Core 2 Duo 2.4 GHz or Althon X2 2.7 GHz.",
        "RAM": "4 GB",
        "Graphics Card": "Graphics card memory 512 MB.",
        "Direct X": "Sound card compatible sound card.",
        "HDD": "6 GB"
    },
    "game_info": {
        "Genre": "Racing",
        "Developer": "Turn 10 Studios, Playground Games, Sumo Digital",
        "Platform": "PC",
        "Game Size": "7.3 GB",
        "Version": "XBOX 360 Classics: Forza Horizon 2 [+Xenia Emulator]",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hb574anko067",
        "https://buzzheavier.com/2czmoze2tteh",
        "https://1fichier.com/?omuuj5wd5b09orfkvhyl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/forza-horizon-2-preinstalled-steamrip.jpg"
}