{
    "page_url": "https://steamrip.com/foundry-free-download/",
    "title": "FOUNDRY",
    "description": "FOUNDRY is a first-person (first-robot?) factory builder with complete creative freedom set in a procedurally generated and infinite voxel world. Land on an unexplored planet and design a giant automated robot production facility under the watchful direction of your AI friend, Carl. Abiotic Factor\nBuild Anything, Anywhere Create a mechanically magnificent factory and a work of industrial art integrating your creation into the environment around you. Set up your machines far below the surface, high in the sky and everywhere in between. Grid-based construction gives you precise control over where and what you build .\nLand on an unexplored planet and explore a procedurally generated sandbox . Journey through dense jungles, gigantic mountain ranges, and great plains stretching into the horizon, with even more to discover beneath the surface.\nAutomate Everything Design intricate systems of conveyor belts, long-distance transport networks, pipes and elevators from deep underground to automate your research. Unlock more advanced, complex and faster technology to optimize your factory and maximize production.\nYou’ll start by crafting items and harvesting resources manually but will soon find yourself setting up assembly lines piece by piece to devise a system that flows perfectly. Combine form, fit and function to create a smooth setup that effortlessly transforms raw materials into galaxy-grade robot products without you lifting a metallic finger.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/foundry-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/foundry-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 Home 64 Bit",
        "Processor": "Intel® Core™ i3-2120 | AMD® FX™ 6350",
        "Graphics": "Nvidia® GeForce™ GTX 660 (2GB)",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Channel 3 Entertainment",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Co-op By": "RUNE",
        "Version": "v0.6.0.20868 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nl6tk0cab8lp",
        "https://buzzheavier.com/jvnkgnh2fvj9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/foundry-preinstalled-steamrip.jpg"
}