{
    "page_url": "https://steamrip.com/frozen-flame-free-download-p1/",
    "title": "Frozen Flame Directly Download",
    "description": "Frozen Flame is a Survival RPG set in the vast world of Arсana, an ancient land once governed by the Dragons. Addled by the curse, it now beckons for souls capable of harnessing the powers of the primeval magic. Those who seek to govern over these lands will have to amass power and allies to bring the fight to the Ice Citadel, home of the Faceless that spreads rot over the realm.\nTailored for those who love to explore, Frozen Flame offers so much more than just an open world full of beautiful vistas and ancient ruins riddled with monsters . With a fully-developed progression system, it’s up to you to choose your own path and endure the harsh world full of mystery, threatening enemies, and gigantic creatures guarding the secrets of this world. Marvel’s Spider-Man: Miles Morales\nRecruit allies, build your keep, gear up with dozens of craftable options and get exploring in search of ancient artifacts left by the ancients. No journey is like any other in this realm: bound by magic, the shape of the world is unique for every playthrough, with islands, floating in the air, changing the layout in an unpredictable way. Spread the wings given to you by the power of Frozen Flame and explore the ever-changing landscape in search of ancient treasure",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/frozen-flame-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/frozen-flame-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel Core i5 2310 / AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA® GeForce GTX 970 / ATI Radeon R9 series",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Early Access",
        "Developer": "Dreamside Interactive",
        "Platform": "PC",
        "Game Size": "10.6 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.70.0.2 (Build 10417983) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/grwvleqai4ss"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/frozen-flame-preinstalled-steamrip.jpg"
}