{
    "page_url": "https://steamrip.com/fuga-melodies-of-steel-2-free-download-1x/",
    "title": "Fuga: Melodies of Steel 2",
    "description": "A year has passed since the events of Fuga: Melodies of Steel. The war was fought and won. Life went on. That is, until the children are summoned to Pharaoh to aid with the investigation of the recovered Taranis. During their survey, the Taranis suddenly goes haywire and sets out on a deadly rampage , trapping and absconding with a number of their party. The remaining children and Malt board their erstwhile enemy the dread tank Tarascus to chase after the Taranis and save their friends. To the Moon\nNew additions to the battle system based on player feedback such as the reworked Soul Cannon and newly implemented Managarm allows for cutting-edge tactical gameplay Plot your path forward on the branching routes of the battlefield. The new airship support system allows for even more options The choices you make affect the Judgment Gauges , ultimately changing how events play out. You are the author of your own story The weight of despair, rage, and loss will shake you to your core in Fuga: Melodies of Steel 2—the RPG of hard choices and tough decisions",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/fuga-melodies-of-steel-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/fuga-melodies-of-steel-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 (64-bit  required)",
        "Processor": "Intel Celeron G1620 / AMD A6-7400K",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 650 (1GB) / Radeon R7 250X (1GB)",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation, Strategy",
        "Developer": "CyberConnect2",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "RUNE",
        "Version": "Build 11177821 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q0ux3mtx9lw2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/fuga-melodies-of-steel-2-preinstalled-steamrip.jpg"
}