{
    "page_url": "https://steamrip.com/fun-with-ragdolls-the-game-free-download-m1/",
    "title": "Fun with Ragdolls: The Game Free",
    "description": "Get Fun with Ragdolls: The Game for free instantly and play pre-installed on SteamRiP\nYou’re a ragdoll! What’s the point of the game? Do what a ragdoll is meant to do and flop, fall, or crash on to things! Don’t be nervous Build worlds for you and your ragdolls Choose from a collection of Cannons, Black Holes, giant Fans, Ragdolls (obviously), Mines, Lasers, Cars, Jump Pads, Telepads, glass, destructible Pillars, Lasers, and more I can’t name everything cause it’d take up too many characters. Share your creations and download maps created by others from across the world. Granny 3\nChoose from a selection of different Ragdoll AI! Attackers , Defenders, Seekers (hide & seek), Followers, Explorers, and more They can also traverse the worlds you build autonomously Every item in the game has properties you can adjust! Want to change how powerful the Mines are? Go for it! Want to make your Ragdolls giant!? Do it! You can use items and adjust their properties to make mazes , stunt courses, mini-games, art, at this point I’m sure you get the idea.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/fun-with-ragdolls-the-game-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/fun-with-ragdolls-the-game-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Pentium Silver N5000",
        "Memory": "4 GB RAM",
        "Graphics": "Intel UHD  605",
        "DirectX": "Version 10",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "DVloper",
        "Platform": "PC",
        "Game Size": "282 MB",
        "Repack By": "GOG",
        "Version": "v2.0.3 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/fun-with-ragdolls-the-game-free-download-preinstalled-steamrip.jpg"
}