{
    "page_url": "https://steamrip.com/gamedec-free-download-n1/",
    "title": "Gamedec Free direct Download",
    "description": "Get Gamedec for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nGamedec is a single-player non-combat cyberpunk isometric RPG. You are a game detective, who solves crimes inside virtual worlds. Use your wits to gather info from your witnesses and suspects, get to the bottom of deceptive schemes, save lives, and investigate the extraordinary relationships between virtual worlds and their inhabitants . The game continually adapts to your choices and never judges – You are the sum of your choices.\nWelcome to Warsaw City of the 22nd century. The Tech of the future is so advanced that the term “real” is relative and “life” and “death” have many meanings. Virtual worlds give rise to problems of the human nature: lust, sloth, envy, and pride. The residents of these virtual game-worlds need specialists – Gamedecs – Private Investigators with experience in those worlds who work to discover the secrets and explores mechanics hidden in those realities for the commission of your clients. You are one of them. You are a Gamedec. Becastled",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/gamedec-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/gamedec-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-3570 / AMD FX-8140",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 760 / AMD Radeon R9 270",
        "DirectX": "Version 11",
        "Storage": "17 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Anshar Studios",
        "Platform": "PC",
        "Game Size": "5.95 GB",
        "Repack By": "GOG",
        "Version": "v1.5.0.r43825 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://1fichier.com/?cx1zc8ess0k7rhohbrfw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/gamedec-free-download-preinstalled-steamrip.jpg"
}