{
    "page_url": "https://steamrip.com/garden-life-a-cozy-simulator-free-download-g1/",
    "title": "Garden Life A Cozy Simulator Directly Download",
    "description": "You are in charge of an abandoned community garden and decide to roll up your sleeves to restore it to its former glory. Complete tasks given to you by your neighbours to earn rewards, unlock new tools, seeds, ornaments and areas of the garden, and learn more about what lies behind this secluded spot.\nInstantly unlock every corner of your garden, including all the seeds and ornaments , and give free rein to your creativity: in this restriction-free mode, you can bring your dream designs to life Procedural growth simulation developed specifically for the game ensures each plant grows in its own way Each and every plant grows procedurally, and some even adapt to their environment by climbing if planted close to certain objects.\nIn Garden Life, you are not restricted by a grid: place plants and objects freely to create your designs Head to the village square to sell flowers and bouquets at your stall and use the earnings to buy new seeds, ornaments and tools in the shop. You can also donates flowers to help create huge floral sculptures in the pavilion and win adorable prizes Pacific Drive",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/garden-life-a-cozy-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/garden-life-a-cozy-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-4790 or AM D Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760, 2 GB or AMD Radeon R9 280X, 3 GB",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "stillalive studios",
        "Platform": "PC",
        "Game Size": "4.1 GB",
        "Released By": "TENOKE emu",
        "Version": "v1272@67558 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zv37joqkce9k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/garden-life-a-cozy-simulator-preinstalled-steamrip.jpg"
}