{
    "page_url": "https://steamrip.com/garfield-lasagna-party-free-download-g1/",
    "title": "Garfield Lasagna Party Directly Download",
    "description": "32 mini-games to discover across emblematic environments such as Garfield’s house, the pizzeria, Liz’s veterinary clinic. Our friends Garfield , Odie, Arlene et Nermal have taken on an enormous challenge: to participate in a gigantic lasagna party g wide variety of crazy games are on the menu: throw snowballs, navigate obstacle courses, slice pizzas Anything to get ahead of your opponents: win the mini-games, roll the best dice throws and multiply the low blows by using objects Garfield Lasagna Party invites you to play a party game set in the world of everyone’s favorite fat orange cat. Tactics Ogre: Reborn\nWith 32 mini -games and 3 play modes, the fun never ends Designed for 4 players, this mode allows players to enjoy their favorite mini-games without having to pass all the squares on the game board: the perfect way to get in a quick game or for intensive training This game mode enables players to organize a championship with a selected number of mini-games, chosen randomly and played successively at high speed",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/garfield-lasagna-party-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/garfield-lasagna-party-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+ 64bit",
        "Processor": "Intel Core i3",
        "Memory": "8 MB RAM",
        "Graphics": "AMD R7 260X – Nvidia GTX 550 Ti 2GB",
        "Storage": "2 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Balio Studio",
        "Platform": "PC",
        "Game Size": "509 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 9870991 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3onqrsnsc1ny"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/garfield-lasagna-party-preinstalled-steamrip.jpg"
}