{
    "page_url": "https://steamrip.com/gas-station-simulator-n2/",
    "title": "Gas Station Simulator Free direct Download",
    "description": "Get Gas Station Simulator PC game for free instantly and play pre-installed on SteamRiP\nGas Station Simulator is all about renovating, expanding and running a gas station along a highway in the middle of a desert. Freedom of choice and multiple approaches to run your business and deal with pressure are key ingredients in this game. Buy an abandoned gas station in the middle of nowhere and restore it to its former glory. Get rid of debris and broken furniture, fix up the walls, paint and decorate the place to your liking. Just don’t spend all your cash on the looks right away, you bought a gas station after all.\nRepair the equipment, buy what can’t be repaired and start serving your customers to earn money for further renovations and improvements. You don’t need to stay small. You can expand your gas station to be able to serve more customers. Also, a gas station is not just about selling fuel. You can expand the array of services that you offer to your customers and thus attract more and more varied customers.\nYou have various expansion options at your disposal, from smaller ones like providing toilets, a simple shop to complement your income up to big ones like an entire workshop to perform car repairs or even a car wash. There are quite a few choices and most of the expansions can themselves be further expanded upon as well. There is so much you can do here. Space Engineers",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/gas-station-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/gas-station-simulator-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-bit) or 10 (64-bit)",
        "Processor": "Intel Core i3 3.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVidia GeForce GTX 660 2GB VRAM",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "DRAGO entertainment",
        "Platform": "PC",
        "Game Size": "14 GB",
        "Released By": "GOG",
        "Version": "v1.0.2.38810s| Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/fVoGcG",
        "https://buzzheavier.com/9jvk7bgeq4wq",
        "https://datanodes.to/owhlpy9k5dxs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/gas-station-simulator-free-download-preinstalled-steamrip.jpg"
}