{
    "page_url": "https://steamrip.com/gears-of-war-free-download-1x/",
    "title": "Gears of War Directly Download",
    "description": "Gears of War is a third-person shooter that places emphasis on using cover to avoid taking damage while moving towards enemy forces. The game uses a number of weapon archetypes , but predominately featured is the Lancer, an assault rifle that has a mounted chainsaw bayonet that can be used to kill foes at close range. The player can attempt an “Active Reload” of a weapon to reload it faster and temporarily boost the damage from the gun, but failing to perform the Active Reload correctly will cause the gun to become momentarily jammed while the player’s character fixes it.\nWhen the player takes damage, the “ Crimson Omen”, a red cog representing the player’s health gauge, will fade into the screen, becoming more defined with larger amounts of damage. The player can seek cover to recover their health, but if they take too much damage, they will become incapacitated . Once this occurs, a skull will fill the center void of the omen. Depending on the game type being played, the consequences will vary. If single-player career mode is being played, instant death will follow. If there is a second player, they will have to revive their fallen teammate. Circus Electrique",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/gears-of-war-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/gears-of-war-screenshots-steamrip.webp"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Shooter",
        "Developer": "Epic Games, The Coalition, People Can Fly, Splash Damage",
        "Platform": "PC",
        "Game Size": "9.9 GB",
        "Released By": "ViTALiTY (Dodi)",
        "Version": "v1.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zyf25fk9q5yr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/gears-of-war-preinstalled-steamrip.jpg"
}