{
    "page_url": "https://steamrip.com/gearcity-free-download-1x/",
    "title": "Gear City",
    "description": "Thousands have tried, and many have failed. What made business leaders such as Henry Ford, William Durant, and Karl Benz so great? Could you ever accomplish what they did? Now is your chance to find out. GearCity is a realistic historically focused economic simulation of the global automobile industry. Unlike tycoon games, GearCity has not been simplified. It is a complex , realistic, in-depth management sim that will take several hours to grasp and hundreds of hours to master.\nThousands of players across the globe and industry professionals from automotive engineers to economics professors have praised the game’s intricate details. Create chassis, engines, transmissions, and vehicles. Manage production lines, supplies, prices, and employees. Build factories and distribution branches. Set marketing and racing budgets. Negotiate with benefits unions. Adjust dividends on your subsidiaries and enact a hostile takeovers in a feature-heavy stock system.\nProduce munitions and military equipment for governments at war. Let your imagination free and choose your own path. GearCity offers several maps with hundreds of cities. For a little less micromanagement, the game also includes territory based maps which are broken down into a few dozen regions .\nEach map has historically accurate purchasing power, population, population growth, inflation, interest and market growth rates. With correct settings most maps have near historically accurate sales figures, hundreds of static AI and infinite dynamically generated AI competition . All maps also include thousands of historical events that shape world and automotive history such as the Panic of 1907, World War 1, the Post War Recession, The Great Depression, and many more large and small events that will affect your decisions.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/gearcity-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/gearcity-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "XP",
        "Processor": "1.2 GHz",
        "Memory": "1 GB RAM",
        "Graphics": "128 MB",
        "DirectX": "Version 9.0",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Visual Entertainment And Technologies",
        "Platform": "PC",
        "Game Size": "4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2.0.0.11 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hyjh99qdux0v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/gearcity-preinstalled-steamrip.jpg"
}