{
    "page_url": "https://steamrip.com/geometry-dash-free-download-4a/",
    "title": "Geometry Dash Download Directly",
    "description": "Geometry Dash is an addicting 2D platformer where you will find the most difficult puzzle levels, many challenges, adventures and fun As such, there is no plot in this game, but it is not needed, because the essence of the game is not to go through the storyline , but to overcome levels with obstacles, on each of which you will find traps, various obstacles, physical puzzles and much, much more. In general, the game is quite interesting, it is not so easy not to pass it, because at the level you can die, and then you have to start the whole level all over again.\nlus, the very essence of the gameplay changes as the level progresses, depending on what form the potential protagonist takes. The levels themselves are something like an obstacle course, on which pits and cliffs are located, circular saws, stakes and much more. You also need to overcome all these obstacles, using the features of the form that the controlled character has taken. It can take the form of a cube that can bounce when you press a certain key, or the shape of a ship flying through the air and falling if you release the lift key, or even a UFO that flies and jumps right in the air.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/geometry-dash-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/geometry-dash-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP",
        "Processor": "2.0+ GHz",
        "Memory": "512 MB RAM",
        "Graphics": "OpenGL 2.0 support",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "RobTop Games",
        "Platform": "PC",
        "Game Size": "313 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v2.2074a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/521qrfktmdf2",
        "https://buzzheavier.com/pzm4ncupaxrl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/geometry-dash-free-download-preinstalled-steamrip.jpg"
}