{
    "page_url": "https://steamrip.com/getsufumaden-undying-moon-free-download-1t/",
    "title": "GetsuFumaDen Undying Moon Directly Download",
    "description": "GetsuFumaDen: Undying Moon combines intense roguelike hack-and-slash action with a stunning dark fantasy world, brought to life through the stroke of traditional Japanese art. As the chosen leader and guardian of the land of the living, wield the otherworldy arsenal and powers of the Getsu clan as you overcome multiple “Death” and descend deeper into the depths of Hell to eradicate the source of the cataclysm.\nDistinct Ukiyo-e Inspired Visuals Inspired by the Japanese ukiyo-e art style, the world of GetsuFumaDen is as beautiful as it is deadly. Vibrant, dynamic 2D animations bring the artistic world to life.\nBrutal, Larger than Life Boss Battles A reanimated demon lord, a colossal centipede , and a five-headed hydra are only some of the myriad massive and fearsome monsters and yokai standing in your way. Defend yourself against their relentless onslaught and emerge victorious to descend deeper into the depths of Hell.\nDynamic, Weapon-Based Combat. Master the rythmn of intense sword fighting action: pacing and timings of movements are inspired by Japanese martial arts. Utilize the unique special moves of a wide range of weapon types including katanas, battle umbrellas and spears to outsmart your enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/getsufumaden-undying-moon-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/getsufumaden-undying-moon-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit  required)",
        "Processor": "Intel Core i5-4440 AMD Athlon 300GE",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Radeon RX 560",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Konami Digital Entertainment, GuruGuru",
        "Platform": "PC",
        "Game Size": "4.1 GB",
        "Released By": "GOLDBERG (cs.rin.ru)",
        "Version": "v1.1.1 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rwvi50c2rlqd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/getsufumaden-undying-moon-preinstalled-steamrip.jpg"
}