{
    "page_url": "https://steamrip.com/getting-over-it-with-bennett-foddy-l2/",
    "title": "Getting Over It with Bennett Foddy",
    "description": "Getting Over It with Bennett Foddy is a punishing climbing game, a homage to Jazzuo’s 2002 B-Game classic ‘Sexy Hiking’. You move the hammer with the mouse, and that’s all there is. With practice, you’ll be able to jump, swing, climb and fly. Great mysteries and a wonderful reward await the master hikers who reach the top of the mountain.\nGetting Over It revolves around a man by the name of Diogenes – who, somewhat true to his namesake, resides in a large metal cauldron – and wields a Yosemite hammer, which he can use to grip objects and move himself. Using the mouse or trackpad (controllers are supported but make the game harder because of the lack of precision in the joysticks), the player tries to move the man’s upper body and sledge hammer in order to climb a steep mountain.\nAs the player progress up the mountain, they are at a constant risk of losing some or all of their progress; there are no checkpoints. The game concludes when a player reaches the highest point of the map and then enters space. Upon reaching the conclusion, a message asks players if they are recording the gameplay. When a player indicates they are not, the game provides access to a chatroom populated by other players who have completed the game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/getting-over-it-with-bennett-foddy-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/getting-over-it-with-bennett-foddy-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista",
        "Processor": "2 GHz Dual Core CPU",
        "Memory": "2 GB RAM",
        "Graphics": "Intel HD  4000 or better",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Bennett Foddy",
        "Platform": "PC",
        "Game Size": "738 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ahzssa8aqdb7",
        "https://buzzheavier.com/yhkamej7f5nl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/getting-over-it-with-bennett-foddy-free-download-preintsalled-steamrip.jpg"
}