{
    "page_url": "https://steamrip.com/gex-trilogy-free-download/",
    "title": "GEX Trilogy",
    "description": "Exploding into the modern era like a pro wrestler from the top rope—it’s GEX! The fast-talking gecko who doesn’t want to sell you insurance! That’s right, the greatest gaming hero of the 1990s has returned for the 2020s through the raw, unbridled power of the Carbon Engine. Broken Arrow\nGEX Trilogy reproduces all three original games in exacting detail, precisely the way you remember them. Assuming you’ve gone senile and remember them having high-definition native 16:9 widescreen visuals and fully analog controls. Which they didn’t. No, this is the Gex series the way it was meant to be played. The Man didn’t think you were ready back then. He kept this version locked away. But the moment has finally arrived. Down with The Man ! Up with Gex! GEX Trilogy is Gex, the next-gen version. The Gex’t-gen version. The Gexiest version of all.\nAnd just like the tightest red carpet attire on Oscar night, the GEX Trilogy is totally stuffed with tons of bonus features, including a music player featuring every track from each game (even the tunes that are kind of annoying), a massive museum filled with key art, a collection of classic TV commercials for the media-addled idiots in the audience, and an all-new interview with the voice of Gex.\nRewind and save anywhere.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/gex-trilogy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/gex-trilogy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit  required)",
        "Processor": "Intel(R) Core 2 Duo E7500",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 or equivalent",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Limited Run Games, Crystal Dynamics",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "TiNYiSO | Ty Fitgirl repacks",
        "Version": "Build 18889250 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qevf3qqqprmj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/gex-trilogy-preinstalled-steamrip.jpg"
}