{
    "page_url": "https://steamrip.com/ghost-hunters-corp-free-download-1n/",
    "title": "Ghost Hunters Corp Free Download",
    "description": "Get Ghost Hunters Corp PC game for free instantly and play pre-installed on SteamRiP\nHey, are you feeling the soul of a ghost hunter ? Want to send these evil entities back to the afterlife ? Do you like the thrill, alone or in a team Ghost Hunters Corp is a spooky exorcism game inspired by paranormal movies and series. The ghost hunter’s mission will be to purify entities haunting places such as castles, mansions and abandoned houses. You will therefore have at your disposal many ghost detection devices, such as the EMF K2 detector, the frequency analyzer , the threat detector, surveillance cameras, etc. Lake\nOnce the threat has been identified, you will have at your disposal an exorcism protocol which will allow you, by means of various objects and equipment such as the Neutron-Gun, holy water, incense, the Tiger Eye stone to return these supernatural creatures where they come from and guarantee the success of your mission. Play alone or in groups up to 4 players in cooperation, to exorcise ever more dangerous and powerful ghosts.\nGhost Hunters Corp will allow you to use your microphone to interact with the different category’s of ghosts. They will listen to you and understand your request, but be careful not to get on their nerves .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/ghost-hunters-corp-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5-2500 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 or equivalent",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Early Access",
        "Developer": "StudioGoupil",
        "Platform": "PC",
        "Game Size": "5.79 GB",
        "Repack By": "GOG",
        "Version": "v2021.11.10 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/er2rl9o5kbga"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/ghost-hunters-corp-free-download-preinstalled-steamrip.jpg"
}