{
    "page_url": "https://steamrip.com/ghostrunner-2-free-download-g1/",
    "title": "Ghostrunner 2 Directly Download",
    "description": "Blood will run in the highly anticipated hardcore FPP slasher set one year after the events of Ghostrunner . Adventure through a post-apocalyptic cyberpunk future that takes place after the fall of the Keymaster, a tyrant who ruled over Dharma Tower, the last refuge of mankind. Jack is back to take on the violent AI cult that has assembled outside Dharma Tower and shape the future of humanity .\nFeaturing incredible katana combat mechanics, a deeper exploration of the world beyond Dharma Tower, nonlinear levels with complex motorbike sections, exciting new modes, and all the action you loved about Ghostrunner. Plus, boss fights are more interactive, giving players freedom to choose how to survive battles against the toughest opponents.\nGhostrunner 2 introduces new skills, allowing players to be more creative and take on even the most demanding encounters with greater accessibility. However, enemies in Ghostrunner 2 behave uniquely dependent on the skills used against them, providing a fresh challenge with each encounter. The player progression system has been completely redone, providing opportunities to experiment and customize gameplay .\nMaster the Cybervoid if you hope to survive. Take on challenging, new enemies as you traverse interactive environments including exploding barrels, destructible walls, helpful neutral entities, and countless improvements that keep combat exciting and fresh. Can’t get enough? Dive even deeper into the lore and plot with the new dialogue system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/ghostrunner-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/ghostrunner-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Strategy",
        "Developer": "One More Level",
        "Platform": "PC",
        "Game Size": "30 GB",
        "Released By": "RUNE",
        "Version": "v0.40667.448 | Full  + All DLCs/packs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/nrbwzjm3phzz",
        "https://qiwi.gg/file/7Fnc6990-Ghostrunner-two-SteamRIP",
        "https://gofile.io/d/QRVpTe"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/ghostrunner-2-preinstalled-steamrip.jpg"
}