{
    "page_url": "https://steamrip.com/gimmick-2-free-download/",
    "title": "Gimmick! 2",
    "description": "In Gimmick! 2, you once again meet the green little yokai Yumetaro . Decades after his first adventure he now sets out on a new quest in a world packed with interesting challenges, dangerous enemies, and hidden treasures. The game can be played in either a friendlier assisted mode, or if you’re up for a challenge play in the true-to-the-original “Gimmick!” mode BAKERU\nStar physics As a yokai, Yumetaro has the ability to summon and throw a powerful star that not only bounces, but also keeps the momentum of his movement. The Star can be used to activate switches, defend against enemies and even be ridden to get to those hard-to-reach places while exploring the secrets of the world. You can discover treasure, find shortcuts or set speed records by mastering the star’s bouncing physics. Experiment with it to unlock its full potential. This is a game with true star power!\nA Legendary Soundtrack The composer David Wise hardly needs any introduction. In his work on the Gimmick! 2 soundtrack , he has both written completely new melodies and remade old classics. The soundtrack was creatively directed by Pelle Cahndlerby and recorded live in Sweden together with Joel Bille.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/gimmick-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/gimmick-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Quad-core Intel or AMD 2.5 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Any DirectX 11 or 12 compatible card.",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Bitwave Games",
        "Platform": "PC",
        "Game Size": "584 MB",
        "Released By": "TENOKE",
        "Version": "Build 15545156 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p7o1yh6evozl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/gimmick-2-preinstalled-steamrip.jpg"
}