{
    "page_url": "https://steamrip.com/gladiator-guild-manager-free-download-1q/",
    "title": "Gladiator Guild Manager",
    "description": "Form a guild, hire your first gladiators and begin your adventure in this epic fantasy world. Choose gladiators to enter each fight, position them and instruct their behavior. The deadly battle will play out on its own, showing you the results of your strategy.\nBeware of your enemy, keep a keen eye on their moves, and figure out how to counter them. Your main goal is to win monthly championships, rise through the ranks, and conquer more and more challenging arenas. As you progress you’ll expand your guild, allowing you to hire various new types of gladiators ranging from warriors, rangers, and beasts to mages, creatures, and all in between.\nLetting you form unique teams. Each gladiator comes with different quirks, either making them very good at something, but expensive, or very bad, yet affordable. Choose and trade your champions wisely at the market, where all kinds of new gladiators will arrive. Unleash your creativity by growing your unique team. Level them up, and equip them with more and more powerful items.\nAll while planning for gladiators whose traits and equipment compliment each other to fight most efficiently. Between monthly championships you should maximize your guild profit and growth to gain an edge at the next big tournament. A variety of quest offers will come from different characters in need of your deadly gladiator services outside of the arena. Build reputations with different factions and learn about this world, or even change it. Help out the poor, support the district and the kingdom, or aid the progress of magic, depending on the main allegiance you chose.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/gladiator-guild-manager-free-download-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/gladiator-guild-manager-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/8.1/10 (64 bit)",
        "Processor": "4 Ghz",
        "Memory": "6 GB RAM",
        "Graphics": "256mb Video Memory, capable of Shader Model 2.0+",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Entertainment Forge",
        "Platform": "PC",
        "Game Size": "517 MB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tkic8v2v0w1z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/gladiator-guild-manager-free-download-preinstalled-steamrip.jpg"
}