{
    "page_url": "https://steamrip.com/go-go-town-free-download/",
    "title": "Go-Go Town",
    "description": "Plan, Build Prosper? As mayor, it’s up to you to breathe life back into this rundown town. Construct shops, hire staff, automate deliveries with couriers, and attract tourists to town, all while managing infrastructure and avoiding catastrophes! Who said being mayor was going to be easy\nBuild and decorate the town of your dreams. Convert tourists into townies; they will need a home, job and purpose. Impress visitors to unlock new buildings, decorations and tools. Use terraforming to shape the world to your heart’s desire Customise your character. Play solo, local split-screen co-op or Remote Play. Take on tricky timed challenges (or just chill fishing ). Try to avoid major catastrophes. Republic of Pirates\nGather materials using a variety of power tools. Refine raw goods into complex materials. Feed your town with locally grown produce; raise bees, cows and crops. Fish in places where fish ought to be (warning: fish not guaranteed). Clean the city to keep tourists happy (and rejoice when you unlock the bubble gun). High-five the animals.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/go-go-town-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/go-go-town-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS *": "Windows 7",
        "Processor": "Intel Core i5-2300 or AMD FX-4350",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTS 450, 1 GB or AMD Radeon R7 240, 1 GB",
        "DirectX": "Version 11",
        "Storage": "1 GB available space",
        "Sound Card": "DirectX compatible",
        "Additional Notes": "Windows 10 requires 6 GB RAM"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Prideful Sloth",
        "Platform": "PC",
        "Game Size": "681 MB",
        "Released By": "Goldberg Emu",
        "Version": "v0.4.44 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v3dcwlcmv1v3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/go-go-town-preinstalled-steamrip.jpg"
}