{
    "page_url": "https://steamrip.com/goat-simulator-goaty-edition-free-download-1x/",
    "title": "Goat Simulator: GOATY Edition Free Download",
    "description": "Goat Simulator: GOATY Edition game for free instantly and play pre-installed on SteamRiP\nGoat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally come true! WASD to write history. Gameplay-wise, Goat Simulator is all about causing as much destruction as you possibly can as a goat. It has been compared to an old-school skating game, except instead of being a skater, you’re a goat, and instead of doing tricks, you wreck stuff.\nDestroy things with style, such as doing a backflip while headbutting a bucket through a window, and you’ll earn even more points Or you could just give Steam Workshop a spin and create your own goats, levels, missions, and more When it comes to goats, not even the sky is the limit, as you can probably just bug through it and crash the game.\nIt would seem that what could be interesting in a game in which you play as an ordinary mountain goat without any cool abilities or skills. But in fact, playing for him is really cool, because due to his savagery and stupidity, the goat can do things that a normal person would have long been condemned for. He can just run around the city, lick everything with his long tongue, destroy objects, ruin people’s lives and do much more. In general, being bored playing for such a simple and familiar animal is more than interesting. Hot Lava",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/goat-simulator-goaty-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/goat-simulator-goaty-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista",
        "Processor": "2.0 GHz Dual Core",
        "Memory": "2 GB RAM",
        "Graphics": "Shader Model 3.0, 256 MB VRAM",
        "DirectX": "Version 9.0c",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Coffee Stain Studios",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "CODEX",
        "Version": "v1.5.58533 (GOATY) | full version (Latest) + all DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rshqwfoyq8ca"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/goat-simulator-goaty-edition-preinstalled-steamrip.jpg"
}