{
    "page_url": "https://steamrip.com/god-of-weapons-free-download-n1/",
    "title": "God Of Weapons Directly Download",
    "description": "The world was once a bright and beautiful place, filled with light and wonder. But one day, an evil force swept across the land, stealing away the world’s light and plunging it into darkness. As a result, chaos and destruction spread across the world, and many feared that the darkness would never end.In this action roguelike, survive hordes of monsters on every level with automatic weapon attacks. Dodge and collect loot to improve your chances in the next round. It’s all about strategy, reflexes, and smart movement. Bus World\nCollecting weapons and accessories and strategically organizing them in your inventory is crucial to your survival. Your inventory space is limited, hence before putting in a new item, you’ll need to consider its strengths and weaknesses and how it fits into your overall strategy. Careful management of your inventory can make the difference between victory and defeat. As you progress through the game, you will amass an arsenal of powerful weapons and accessories, making you an unstoppable force to be reckoned with.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/god-of-weapons-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/god-of-weapons-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer, 64-bit",
        "Processor": "Intel Core i3-6100 / AMD FX-8350",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 580 / AMD HD 7870",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, RPG",
        "Developer": "Archmage Labs",
        "Platform": "PC",
        "Game Size": "977 MB",
        "Released By": "TENOKE emu",
        "Version": "v1.5.62 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g9nry2dm2ga0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/god-of-weapons-preinstalled-steamrip.jpg"
}