{
    "page_url": "https://steamrip.com/godsworn-free-download/",
    "title": "Godsworn",
    "description": "The wild pagan lands have been under the watchful eye of the gods for as long as time. The arrival of a knight order bearing the banner of heaven threatens to upset the uneasy alliance. Will the realm burn, or will blood of both divine and mortal be spilled to protect it?\nGODSWORN is a fantasy real time strategy game set during the Northern Crusades. Take control of a divine hero, gather worshippers, rally great armies of mortals and mythical creatures, and crush your enemies to prove you are worthy to lead these lands. Maniac\nDivine Heroes and Abilities – Master the various divine heroes, each with their own set of abilities. Heroes gain unique units and buildings in addition to the ones from their faction, making each of them have a unique playstyle. Protect your followers and burn your enemies with the light of the sun as the goddess Saule, or strike under the cover of darkness as the moon god Meness . Or join the order and smite the heathens as the archangel Michael.\nBuild and Be Worshipped – Devoted followers will flock to your shrine. Have them gather resources and build cities so you can raise great armies for battles to come. Protect them while they pray to grant you faith, a powerful resource used for mythical creatures and god powers .\nCo-op Campaign – To unite the pagan tribes, take up arms on your own or with a friend in a campaign with optional co-op. The campaign follows the Baltic pagan struggle against the crusades . Can you bring unity to the feuding pagan gods before the armies of heaven arrive? Or will the land be torn asunder for your pride?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/godsworn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/godsworn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "windows 10",
        "Processor": "I7 3.70GHz",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce 2070",
        "Network": "Broadband Internet connection",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy, Early Access",
        "Developer": "Thunderoak Interactive",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 14493694 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xu5dg8w16owu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/godsworn-preinstalled-steamrip.jpg"
}