{
    "page_url": "https://steamrip.com/gogh-focus-with-your-avatar-free-download/",
    "title": "gogh: Focus with Your Avatar",
    "description": "gogh: Focus with Your Avatar is more than a focus tool – it’s a cozy blend of avatar creation, room design, and virtual pet game. Build your perfect space, vibe with Lofi beats, and let your cute avatar and quirky companion turn work into pure fun Conquest Dark\nYOUR OWN ROOM TO PERSONALIZE Create a space that’s uniquely yours, arranging furniture, decor , and colors however you like. Add your favorite images or GIFs to monitors, posters, and other room items, so every corner feels just right. Save different setups and switch things up anytime to match your vibe!\nADORABLE ANIME-STYLE AVATARS Customize your avatar with a variety of face parts, hairstyles, and outfits to make them the perfect little sidekick for your work sessions. Move them around, pick animations , and sync with the Pomodoro timer as they shift between focus and relaxation along with you!\nA QUIRKY COMPANION TO CHEER YOU ON Stay on track with the simple To-Do list and Pomodoro timer, while uncovering new forms of your quirky companion as you make progress, keeping you curious and motivated! Who knew productivity could feel so rewarding?\nCHILL LOFI BEATS AND AMBIENT SOUNDS Relax with playlists featuring chill Lofi beats from “ Japanolofi Records” and ambient sounds you can mix to suit your mood. With ASMR-like sounds synced to your avatar’s actions—typing, writing, or page-turning—you’ll be surrounded by the perfect atmosphere to stay focused and unwind .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/gogh-focus-with-your-avatar-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/gogh-focus-with-your-avatar-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / 11",
        "Processor": "Intel Core i5-1235U",
        "Memory": "8 GB RAM",
        "Graphics": "Intel Iris Xe",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "ambr",
        "Platform": "PC",
        "Game Size": "821 MB",
        "Released By": "TENOKE",
        "Version": "Build 18292550 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/JoaqmO",
        "https://megadb.net/d268p8gxsio6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/gogh-focus-with-your-avatar-preinstalled-steamrip.jpg"
}