{
    "page_url": "https://steamrip.com/going-medieval-free-download-b1/",
    "title": "Going Medieval Free Download Directly",
    "description": "In the world of Going Medieval , dark age society is on its knees. At the end of the 14th century, 95% of the global population has perished due to rampant plague. Eventually, survivors emerge from society’s ashes, and it’s now up to you to help them settle in a dangerous new land reclaimed by nature. Build your people a home, help shape their lives, and protect them from animals, bandits, and other dangers in a lawless post-calamity age. Design, build and expand your settlement from a small wooden hut into a colossal stone castle.\nWith simple-to-use 3D terrain tools you can create the perfect stronghold, from winding underground caverns to sprawling multi-story forts. This harsh new world is rife with external threats, but you can give your colonists the upper hand in battle by building impenetrable defences and traps . Research, craft and equip weapons and gear so that they can fight back against unrelenting waves of attackers. Your colonists have more than just raids to contend with. They need protection from starvation and the elements, so it’s essential to stock up on supplies and build shelter to keep them fed and warm. Maintain your villagers ’ emotional states, as their moods are affected if their needs and wants aren’t met.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/going-medieval-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/going-medieval-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "AMD or Intel, 3.3 GHz (AMD FX 8300, Intel i5 3000)",
        "Memory": "8 GB RAM",
        "Graphics": "AMD/NVIDIA dedicated GPU, 2GB dedicated VRAM (Radeon RX 560, Geforce GTX 1050)",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy, Early Access",
        "Developer": "Foxy Voxel",
        "Platform": "PC",
        "Game Size": "423 MB",
        "Repack By": "RUNE emu",
        "Version": "v0.25.29 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3renia911w4m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/going-medieval-free-download-torrent-steamrip.jpg"
}