{
    "page_url": "https://steamrip.com/golf-club-wasteland-free-download-1n/",
    "title": "Golf Club Wasteland Free",
    "description": "The rich fled to Mars but venture back to a desolate Earth for a round of golf. Each hole in the wasteland offers its own little story and possible puzzle to sink the perfect shot. Play through destroyed brutalist monuments, crumbling shopping malls, and abandoned museums as neon signs and poignant graffiti take swings at current events, Silicon Valley culture and humanity.\nPiece together the full story of how humanity fell through three distinct sources. Details from the lone golfer’s story, who’s come back to Earth for one last game. The Radio Nostalgia From Mars broadcast that gives a glimpse into the lives of those who escaped. And the narration of a “secret spectator” watching from a distance. Tennis Manager 2021\nBe accompanied by a purposefully composed soundtrack as well as personal stories broadcasted on Radio Nostalgia From Mars. The station caters to citizens of Mars, nostalgic for Earth as they listen to music from the 2020s, and dial in to share their memories of the planet. A smooth-voiced radio DJ keeps the show flowing with updates and announcements hinting at a not-so-glamorous life on Mars.\nThree distinct modes mean every golfer can find something for their tastes. Casual players can focus just on the story and a relaxing scenic round of golf in Story Mode. Those looking for an extra challenge can beat each hole under par using skill and puzzle solving through Challenge Mode. While the total pros can try Iron Mode, where there’s almost zero room for error. Easy-to grasp controls and a minimalist UI underpin the whole game so anyone can easily pick up and play at their own pace.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/golf-club-wasteland-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/golf-club-wasteland-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2.6 GHz Intel Quad Core",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GT 750M, 2 GB Memory",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Sports",
        "Developer": "Demagog Studio",
        "Platform": "PC",
        "Game Size": "1.10 GB",
        "Repack By": "CODEX",
        "Version": "v15.11.2021 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ngn3x4d09sv4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/golf-club-wasteland-free-download-preinstalled-steamrip-1.jpg"
}