{
    "page_url": "https://steamrip.com/golf-with-your-friends-free-download-2j/",
    "title": "Golf With Your Friends Download Direct Link",
    "description": "Why have friends if not to play Golf With Your Friends! Nothing is out of bounds as you take on courses filled with fast paced, exciting, simultaneous mini golf for up to 12 players 12 Player Multiplayer Make sure your skills are up to scratch as you tee off against 11 other golfers in simultaneous online multiplayer. Themed Courses Go head to head on courses with unique mechanics and holes.\nThe main advantage of this game is the variety of playing fields. And let the golf courses finished today in Golf It! not so many, but each of them is unique in its essence and conveys its own unique atmosphere. For example, there is a pirate cove with the appropriate atmosphere, dark gloomy mines, a winter country in which snow-covered plains await you, a pasture and even a cemetery . Each map will have unique challenges, obstacles, obstacles, and additional features.\nGolf With Your Friends is a great mini golf simulator for playing with friends. The game supports up to 12 people, where you can compete on the most addicting maps. Each card is designed to give you pleasure and challenge you at the same time. Do you think putting a ball into the hole is very easy? Try it on an interactive map with a variety of obstacles. Of course, this game is fully revealed in the competitive part with other people, so gather your friends, make a bet and go to the thematic fields. Dying Light: The Following Platinum Edition\nThe features, first of all, should include the presence of a special map editor. Using this editor, you can create your own maps from those modules, elements that are used on existing maps. Also, over time, many additional elements will appear at your disposal. As a result, you can create a whole town with a mini golf course, unique difficulties, obstacles, challenges, and more. And yet you will find a simple but interesting mechanic of hitting the ball.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/golf-with-your-friends-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/golf-with-your-friends-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 (64-bit) or Windows 10 (64-bit)",
        "Processor": "Intel i3-2100 / AMD FX-6300 @3.1GHz or higher",
        "Memory": "2 GB RAM",
        "Graphics": "GTX 460 / Radeon 6870 / Intel HD  630",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Sports",
        "Developer": "Team17, Mouldy Toof Studios",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Released By": "TENOKE",
        "Version": "v282 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/advmd81i909l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/golf-with-your-friends-free-download-preinstalled-steamrip.jpg"
}