{
    "page_url": "https://steamrip.com/golf-it-free-download-r1/",
    "title": "Golf It! Directly Download",
    "description": "Golf It! is a multiplayer Minigolf game with focus on a dynamic, fun and creative multiplayer experience. One of the most exciting features is a Multiplayer Editor, where you can build and play custom maps together with your friends. This version of the game features at least 6 different maps with 18 holes each: Grassland, Winterland , Graveyard, Mines, Pirates Cove and Jade Temple. Every map has unique gameplay features and different aesthetics. Every asset of each area and more will be available for you inside the Multiplayer Editor and you are free to mix them all together to create the map of your desires. Alyx\nCurrently there are over 2.300 placeable objects inside the Multiplayer Editor To have a more fun and different experience each time you play, we are using a ball hitting system which is based on the speed of the mouse. The faster you swing your mouse the harder you will hit the ball. It takes more experience and practice to hit that precious hole in one every time. The features, first of all, should include the presence of a special map editor. Using this editor, you can create your own maps from those modules, elements that are used on existing maps. Also, over time, many additional elements will appear at your disposal.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/Golf-it-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/Golf-it-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or higher (64-bit)",
        "Processor": "2 GHz  or better",
        "Memory": "4 GB RAM",
        "Graphics": "512 MB (DX 11 recommended)",
        "Network": "Broadband Internet connection",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Sports",
        "Developer": "Perfuse Entertainment",
        "Platform": "PC",
        "Game Size": "4.6 GB",
        "Version": "v1.0 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a7ihj6tftves"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/Golf-it-preinstalled-steamrip.jpg"
}