{
    "page_url": "https://steamrip.com/golftopia-free-download-1t/",
    "title": "GolfTopia",
    "description": "Design, Plan, Build and Manage every aspect of your golf course from the ground up. Place every structure, every tee, and every hole. Manipulate the very earth itself and forge the perfect golf course. It’s all up to you! Just don’t go bankrupt. 200 Persistent golfers make frequent visits to your course, evolving and growing in skill.\nOver time they will develop a long term opinion of your course. Keep them happy enough and they’ll turn into prestigious members, netting you more money. Or drive them to madness with a golf gauntlet nightmare Golfers have over 100 different thoughts, ranging from “I have to pee” to “The green is too large”.\nSeriously, who would ever complain about the green being too large? Peer into the minds of your visitors, seeing exactly where a thought took place, giving you critical feedback on how to tinker and tune your golf course over time. Fight off an infestation of weeds, bent on turning your beautiful creation into a disgusting knotted mess of ill-tempered foliage. SpaceEngine\nBuild an army of drone workers, or employ powerful defensive turrets to keep your course clean and tidy. Build crazy devices like fans, bumpers, launchers, teleporters, and more! These devices can make or break your golf course, allowing you to manipulate the physics of the ball itself. Turn your course into a money making machine of fine tuned perfection. Or a ruthless meat grinder of frustration and injury .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/golftopia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/golftopia-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10",
        "Processor": "3 GHz Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660, Radeon R7 370 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "MinMax Games Ltd.",
        "Platform": "PC",
        "Game Size": "364 MB",
        "Released By": "GOG",
        "Version": "v1.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kjujvb1jd24q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/golftopia-preinstalled-steamrip.jpg"
}