{
    "page_url": "https://steamrip.com/golfie-free-download-t1/",
    "title": "Golfie Directly Download",
    "description": "Deckbuilding meets minigolf in Golfie the only game in which you can power-up and modify realtime golf shots by collecting and crafting a deck of cards. Each run requires strategy, planning, and skill. Build unique decks which can unlock incredible new ways to play, giving you the power to pull off some spectacular shots.\nTry to beat 18 holes from an unlimited supply of procedurally-generated levels in the single-player roguelike campaign. Shape the deck your way by collecting cards, and gain bonuses and abilities through special modifiers – all of which can combine to create truly unique shots. MAGLAM LORD\nCard powers can vary from increasing the distance or elevation of a standard shot, through to out-of-this-world abilities and power-ups which can be combined to dazzling effect. But be careful: finish over par and you’ll lose some energy – and once it’s totally depleted, the run is over.\nDaily runs, endless modes and seeded runs mean you’ll never run out of holes to play. Gain experience during each run to unlock an ever-increasing pool of cards and customisation options, then return to the course with even more ways to play.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/golfie-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/golfie-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 Bit Required. Windows 10",
        "Processor": "Intel I3, AMD Athlon 64 Dual-Core 4000+ or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "128 MB of Video RAM",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Sports",
        "Developer": "Triheart Studio",
        "Platform": "PC",
        "Game Size": "485 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2.0.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8sygbxct06ad"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/golfie-preinstalled-steamrip.jpg"
}