{
    "page_url": "https://steamrip.com/golf-vs-zombies-free-download-g1/",
    "title": "Golf VS Zombies Directly Download",
    "description": "Frenemies. We mean frenemies. There are no friends in the post-apocalyptic, living dead-infested wasteland. So you might want to take your club, hit those courses, collect bottlecaps (what other currency did you expect? rupees?), and drive your golf cart through crowds of zombies for fun and profit. OR Or you can invite up to 3 more people to a hilarious hot-seat golfing duel, treuel, or even quadruel, where survival is optional, but fun is unavoidable. Wandering Sword\nThere is only so far your collection of clubs and balls gonna get you. Luckily, or not so, that weird guy has also survived and he has been tinkering on all sorts of things. Exploding and homing balls, sniper clubs, drones, movement detectors and other wacky stuff. Too bad the guy accepts only bottle-caps as legal tender, but you are bound to find some – this is a wasteland afterall.\nUp till now you had to deal with sand traps, tall grass, pools of water and that bloody wind, but times have changed and repeating a shot may be the least of your worries. Keep your head in the game and the dead well dead – there is a record to set. Even better if you manage to grab some loot along the course.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/golf-vs-zombies-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/golf-vs-zombies-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5 4th gen or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 660",
        "DirectX": "Version 10",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Sports",
        "Developer": "Sleepwalking Potatoes",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "TENOKE",
        "Version": "Build 12130773 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ikeim9tz052b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/golf-vs-zombies-preinstalled-steamrip.jpg"
}