{
    "page_url": "https://steamrip.com/good-company-free-download-1x/",
    "title": "Good Company",
    "description": "Good Company is an in-depth management sim about building a bustling tech corporation in a world inspired by the trail-blazing spirit of Silicon Valley. Assemble complex production lines, manage employee logistics, and sell high-quality products on the market to become the best company in the whole county\nBECOME A PRODUCTION POWERHOUSE Turn a garage into your first manufacturing headquarters and eventually develop it into a leading tech corp. Purchase materials, hire staff and craft a wide range of items as you focus on building an efficient production line that always keeps the goods flowing\nAUTOMATE FOR SUCCESS Create complex production loops using a powerful logistics system. Expand into new buildings and improve efficiency with zone management, work policies and fully automated machines.\nINVENT AND INNOVATE Design new tech products that will conquer an ever-changing market. Focus on in-demand features and create high-quality products – or just squeeze as much profit out of them as you can\nGET BIGGER, BETTER, BOLDER Build beyond your humble beginnings by expanding your facilities, investing in new markets and researching new technology. Manufacture advanced products like robots and improve workflow using the power of conveyor belts",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/good-company-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/good-company-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 10 – 64bit",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "nVidia GTX 560, AMD Radeon HD 6970",
        "DirectX": "Version 9.0c",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Chasing Carrots",
        "Platform": "PC",
        "Game Size": "619 MB",
        "Released By": "GOG",
        "Version": "v1.0.14b | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tnn7i39cj2vz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/good-company-preinstalled-steamrip.jpg"
}