{
    "page_url": "https://steamrip.com/gorebox-free-download-o1/",
    "title": "GoreBox Directly Download",
    "description": "Dive into the adrenaline -fueled world of GoreBox, an action-packed sandbox game that harmoniously fuses relentless action with unlimited creativity . Here, you’re equipped with an extensive array of weapons and explosives, as well as a special piece of equipment that stands out from the rest: the Reality Crusher . The Reality Crusher is a unique tool that enables you to spawn , manipulate, and obliterate any spawnable entity in the game. With this tool, you are not just a player in the world of GoreBox you are the architect of your own chaotic adventures. Viewfinder\nAs a player, you share the same damage system as the active, physics-based ragdolls in the game. This shared damage system makes every encounter thrilling , as you balance between creating chaos and protecting yourself. You also have control over various gameplay settings. Whether it’s activating invincibility , turning on noclip, or switching to creator mode (which grants you access to the Reality Crusher), you can tailor the game to your play style.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/gorebox-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/gorebox-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel(R) Core(TM) i5-10400F CPU @ 2.90GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GT 1030",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation",
        "Developer": "Felix Filip",
        "Platform": "PC",
        "Game Size": "448 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.15.17.45 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/buexxkiufgas",
        "https://buzzheavier.com/yq0jtann8d3s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/gorebox-preinstalled-steamrip.jpg"
}