{
    "page_url": "https://steamrip.com/gorilla-tag-free-download-g1/",
    "title": "Gorilla Tag Directly Download",
    "description": "Run, climb, and jump in VR using a unique locomotion method that only needs the movement of your hands and arms. No buttons, no sticks, no teleportation. Push off of surfaces to jump and squeeze them with both hands to climb . Alan Wake Remastered\nThere are four different game modes – From simple Tag, for up to 3 players, or infection mode, with 4 or more. The Hunt game mode gives you a unique personal target to chase down. Paintbrawl is a team vs. team paintball battle using slingshots.\nRun from the other gorillas, or outmaneuver the survivors to catch them. Parkour up trees and cliff faces to evade and chase monke down. Hang out in a virtual jungle with randos or group up in a private room with friends to hang out and play. The stakes are low, so feel free to just chat or make up your own games. The movement is easy to learn, and hard to master. Crossplay with the PC versions of the game, so play with anyone on any platform. There are six different levels to explore. Each with their own topography that form routes and obstacles to play on. Visit our store in the City, with a rotating inventory of items to buy, play with, and wear to express your true monke .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/gorilla-tag-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/gorilla-tag-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4590 / AMD FX 8350",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R9 290",
        "Network": "Broadband Internet connection",
        "Storage": "140 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual",
        "Developer": "Another Axiom",
        "Platform": "PC",
        "Game Size": "538 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 12855156 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7gwutk7z3sw5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/gorilla-tag-preinstalled-steamrip.jpg"
}