{
    "page_url": "https://steamrip.com/gorn-2-free-download/",
    "title": "GORN 2",
    "description": "GORN 2 is a ludicrous sequel to the hit VR gladiator simulator from Free Lives. It’s bigger, wilder, and stronger than ever before, with mighty new weapons to wield, treacherous new traps to avoid, and new power-ups to imbue you with supernatural strength. Enjoy GORN 2’s improved VR combat as you battle the five sons of the God of the Afterlife across an array of heavenly realms, with in-your-face combat so irresponsibly violent you’ll check your headset for blood spatters when you’re done.” DRIVE Rally\nA BRUTAL GLADIATOR POWER FANTASY Engage in fierce gladiatorial battles powered by an outrageous fully physics-driven combat engine, savagely striking down foes with a bountiful collection of 35 devastating, uniquely violent weapons — including many monstrous new additions to your gladiator’s arsenal .\nVANQUISH OTHERWORLDLY ENEMIES Journey through a series of heavenly realms populated by the fallen heroes of the original game. Here you’ll battle the five sons’ champions : powerful bosses primed to unleash fresh challenges upon even the most seasoned, blood-flecked arena veteran.\nMORE OF ABSOLUTELY EVERYTHING GORN 2 is everything GORN was but MORE. More weapons , more enemies, more arenas, more traps, more power-ups, and more hilariously over-the-top combat. If you loved the first game, but still feel a raging yearning for more, GORN 2 will sate your blood-thirst.\nENDLESS VIOLENCE Conquered all five arenas? Then stand your ground in the relentless non-stop onslaught of Endless Mode, or try creating your own battlefields of destruction in Custom Mode. Get creative and crush your opponents any way you choose, no matter how outlandish .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/gorn-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/gorn-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 18116127 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j6qe4e3jga7e",
        "https://buzzheavier.com/kuo7ctuqvbqu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/gorn-2-preinstalled-steamrip.jpg"
}