{
    "page_url": "https://steamrip.com/granblue-fantasy-versus-rising-free-download/",
    "title": "Granblue Fantasy Versus: Rising",
    "description": "The latest installment in the GBVS series is taking the genre to new heights! Rise to glory in the definitive fighting game experience for beginners and veterans alike. Bioweaver\nIt’s a Party! Claim Your Crown in Grand Bruise Legends! Need a break from matches? Take a breather and experience a one-of-a-kind island lobby filled with fun attractions. You can even go head-to-head with other players online in a variety of obstacle courses and survival games in an all-new party mode, Grand Bruise Legends!\nStay Focused on the Battle, Not the Controls Newcomers can fully enjoy the intensity and thrills of one-on-one combat without needing to memorize complicated controls—simple inputs can be used to perform skills with the press of a single button!\nA Captivating Story Campaign Awaits Embark on a journey through the vast skies of Granblue Fantasy and immerse yourself in an epic adventure while mastering the fundamentals of gameplay. As you take on more quests in this action RPG-inspired experience, you’ll continue to grow stronger.\nPersonalize the Experience On Every Level Express yourself and show some love for your favorite Granblue characters through a variety of character colors, weapon skins, lobby avatars, and even a selectable partner character to cheer you on and give you advice !\nGet Creative with the Digital Figure Studio The only limit is your imagination—construct original dioramas from a massive collection of high-quality 3D models from the Granblue Fantasy Versus series!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/granblue-fantasy-versus-rising-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/granblue-fantasy-versus-rising-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit  required)",
        "Processor": "AMD FX-4350, 4.2 GHz / Intel Core i5-3470, 3.20 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD 6870, 1 GB / GeForce GTX 650 Ti, 1 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Cygames, Inc., Arc System Works",
        "Platform": "PC",
        "Game Size": "19.7 GB",
        "Co-op By": "OFME",
        "Version": "v2.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/FIcTrR",
        "https://datanodes.to/cwn6fn7t60x9/Granblue-Fantasy-Versus-R-SteamRIP.com.rar",
        "https://buzzheavier.com/lq5v47fybegi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/granblue-fantasy-versus-rising-preinstalled-steamrip.jpg"
}