{
    "page_url": "https://steamrip.com/granny-chapter-two-free-download-g1/",
    "title": "Granny Chapter 2",
    "description": "You have now been moved from Granny`s old house to her love Grandpa`s house. You wake up in another dark moisty room, you feel dizzy after the bumpy car ride and you have a headache. The main door is covered with different locks and you have to search the house and find items to unlock them and the door and escape this house. But you have to be careful because Granny hears everything as usual and Grandpa also wanders around the dark house but he doesn’t hear very well, but if he sees you then it’s best to run.\nThere is also a creepy little creature in the back of the house that Granny and Grandpa adore. As usual if you drop something on the floor or walking on a creaking floor Granny will start running to the place she heard that sound. You also need to watch out for her bear traps. You can hide under beds or in wardrobes but be careful that they does not see you when you are hiding. There is another way to escape. At the bottom of this house there is a sewer. There you can find an old rusty boat. If you manage to start it and open the gate you can escape that way. You can protect yourself from Granny and Grandpa using one of the two different types of weapons you can find in the house. But it only stops them for a while. But it’s worth it.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/granny-chapter-two-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/granny-chapter-two-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS ": "Windows 7,8,10",
        "Processor": "Intel Core TM i5 750",
        "Memory": "4 GB RAM",
        "Graphics": "Sapphire Radeon HD 5770 1GB",
        "Storage": "870 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "DVloper",
        "Platform": "PC",
        "Game Size": "484 MB",
        "Released By": "Kirigiri",
        "Version": "v1.2.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/AWnAMx",
        "https://megadb.net/s3wspfdv80jc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/granny-chapter-two-preinstalled-steamrip.jpg"
}