{
    "page_url": "https://steamrip.com/granny-remake-free-download-g1/",
    "title": "Granny Remake Directly Download",
    "description": "Prepare yourself for an immersive and thrilling adventure inside an abandoned house, where you must find a way to escape from the merciless and terrifying Granny. You wake up in a barricaded room with limited time to find an exit. You’ll have to explore the dark corners of the house, solve puzzles, and gather clues to unravel the mysteries of this cursed place. She hears every sound you make and will chase you relentlessly to prevent your escape. You’ll need to be incredibly cautious, using agility and stealth to avoid her attention and survive. Granny Chapter Two\nAs you delve deeper into the house, more horrific secrets will be revealed. Gradually, you’ll uncover the history of this cursed place and learn about its dark past events. You’ll have to confront your fears, collect tools and items necessary to unlock new areas, and overcome obstacles set up by Granny. Prepare yourself for a true challenge, where every step you take could be your last. Can you survive the horrors of the house and outsmart the deadly granny, or will you become her next victim?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/granny-remake-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/granny-remake-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Ryzen 5 1400",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 1050TI",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "FerriteLabs",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "TENOKE",
        "Version": "v3.2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LPCxbO",
        "https://1fichier.com/?b6wdbd4llkcsfyedels3",
        "https://megadb.net/ty1zku91q0i5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/granny-remake-pre-installed-steamrip.jpg"
}