{
    "page_url": "https://steamrip.com/granny-3-free-download-m1/",
    "title": "Granny 3 Free Directly Download",
    "description": "Welcome to Granny 3.\nGranny and grandpa have moved into a new old mansion with a moat and a high wall around it as protection or rather to make escape attempts more difficult. You are an explorer looking for new objects to explore when you see a seemingly abandoned mansion late one night. You take courage and open the unlocked gate and enter. What you do not know is an infamous couple living there who will do anything to keep you.\nThere are a lot of items placed inside and outside the house that you will have use for. You just need to figure out how to use them. But you have to be careful because Granny hears everything as usual and Grandpa also wanders around, but he does not hear very well, but if he sees you then it’s best to run.\nAs usual if you drop something on the floor or walking on a creaking floor Granny will start running to the place she heard that sound. You also need to watch out for her bear traps. You can hide under beds, a couch or in wardrobes but be careful that they do not see you when you are hiding. You can protect yourself from Granny and Grandpa using one of the two different types of weapons you can find in the house.\nBut it only stops them for a while. But it’s worth it. If you play in Practice mode, you are in the house without Granny and Grandpa and you have the opportunity to try different things without major difficulties. But remember the house is not completely free from dangers . Assassin’s Creed",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows 7,8,10",
        "Processor": "Intel Core TM i5 750",
        "Memory": "4 GB RAM",
        "Graphics": "Sapphire Radeon HD 5770 1GB",
        "Storage": "560 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "DVloper",
        "Platform": "PC",
        "Game Size": "282 MB",
        "Repack By": "GOG",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/plzty5btmvty"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/granny-3-free-download-preinstalled-steamrip.jpg"
}