{
    "page_url": "https://steamrip.com/greak-memories-of-azur-free-download-l1/",
    "title": "Greak: Memories of Azur",
    "description": "Get Greak: Memories of Azur PC game for free instantly and play pre-installed on SteamRiP\nGreak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion. Greak is the name of the main character, and the smallest brother of three. He belongs to a magical race called the Courines, which are currently under the attack of an enemy invasion from a faction called the Urlags.\nThis battle has been going on for a long time, and the Courines are starting to flee their own lands. Greak’s goal is to reunite with his brother (Raydel) and his sister (Adara) and then escape the lands of Azur by Building an Airship piece by piece. Throughout the game, you will find each sibling in different scenarios, and once you do, they will join the adventure and help you progress through the game.\nFeatures:",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/greak-memories-of-azur-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/greak-memories-of-azur-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core 2 Duo E6750 or AMD Athlon 64 X2 6400+",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce 8800 GT, 512 GB or AMD Radeon HD 6570, 1 GB",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Navegante Entertainment",
        "Platform": "PC",
        "Game Size": "1.06 GB",
        "Repack By": "CODEX",
        "Version": "v1.0.6.114 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/biu32uecxseo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/greak-memories-of-azur-free-download-torrent-steamrip-1.jpg"
}