{
    "page_url": "https://steamrip.com/green-hell-free-download-1u/",
    "title": "Green Hell Spirits of Amazonia 3 Directly Download",
    "description": "GREEN HELL is an Open World Survival Simulator set in the uncharted unique setting of the Amazonian rainforest. You are left alone in the jungle without any food or equipment, trying to survive and find your way out. Clinging to life, the player is set on a journey of durability as the effects of solitude wear heavy not only on the body but also the mind. Red Wings: American Aces\nHow long can you survive against the dangers of the unknown? On this journey, you won’t get any help from the outside world. Equipped only with your bare hands you’ll have to learn actual survival techniques to build shelters, make tools, and craft weapons in order to hunt and defend yourself.\nConstantly threatened by the jungle you’ll fight with both wild animals and tropical sicknesses . Players will also have to face the traps set by your own mind and fears that crawl in the darkness of the endless jungle. You are thrown deep into the emerald and impenetrable Amazonian rain forest. The green hell. Your goal is to survive in the depths of a nightmarish environment using truly intuitive means to escape.\nHaving only a radio at your disposal you will follow the familiar voice of a loved one through this endless and inhospitable jungle, unveiling bit by bit how you got there in the first place. What you discover will be worse than what you fought so hard against to survive .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/green-hell-spirits-of-amazonia-part-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/green-hell-spirits-of-amazonia-part-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-bit",
        "Processor": "3.2 GHz Dual Core Processor",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660, Radeon RX 460 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Creepy Jar",
        "Platform": "PC",
        "Game Size": "7.3 GB",
        "Released By": "CODEX + Steamless",
        "Version": "v2.9.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/b9nu956g34kl",
        "https://megadb.net/coyxd5fe7hij"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/green-hell-spirits-of-amazonia-part-3-preinstalled-steamrip.jpg"
}