{
    "page_url": "https://steamrip.com/green-hell-vr-free-download-x1/",
    "title": "Green Hell VR Directly Download",
    "description": "Green Hell VR is the most complex and authentic survival game for VR. The game faithfully recreates the dangerous conditions of the Amazon jungle. Alone and stranded, you will never feel safe. To survive, you have to face your weaknesses. Maintaining hunger, thirst, fatigue and mental health is going to be an integral part of your journey. DNF Duel\nWild animal attacks and tropical diseases could strike you down at any time and out of nowhere if you are not prepared. Since you won’t get any help from the outside world, you need to craft your tools and weapons, learn how to build shelters, and heal nasty wounds. You are Jake Higgins, a famous anthropologist, who is thrown deep into the emerald and impenetrable Amazonian rain forest.\nThe green hell. Surrounded by predators with only your trusty smartwatch, backpack, and the survival guide you grabbed just before leaving home, you will follow the familiar voice of a loved one through this endless and inhospitable jungle, unveiling bit by bit how you got there in the first place. What you discover will be worse than what you fought so hard against to survive. Crafting you find yourself lost in the Amazon with almost nothing, so knowing how to craft crafting is your best friend.\nThe VR experience makes crafting even more authentic as you need to find the right elements and combine them to make tools, weapons, bandages, and more. Building construct yourself a safe place to spend the night as sleeping on bare ground in the jungle may not be the best idea. Build a temporary shelter or find a perfect location, gather materials, and construct your base to cook what you found during your exploration, and to protect yourself from dangers lurking in the shadows.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/green-hell-vr-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/green-hell-vr-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP or higher",
        "Processor": "Intel/AMD Dual Core @ 1.8Ghz+",
        "Memory": "1 GB RAM",
        "Graphics": "OpenGL compatible graphics card",
        "Storage": "2400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Incuvo",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.7 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hucy7w679xiu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/green-hell-vr-preinstalled-steamrip.jpg"
}