{
    "page_url": "https://steamrip.com/grim-dawn-definitive-edition-free-download-g1/",
    "title": "Grim Dawn Definitive Directly Download",
    "description": "Enter an apocalyptic fantasy world where humanity is on the brink of extinction, iron is valued above gold and trust is hard earned. This ARPG features complex character development, hundreds of unique items, crafting and quests with choice & consequence.\nDual Class Combine any of six distinct classes with over 25 skills and modifiers per class. Base classes include Soldier, Demolitionist, Occultist, Nightblade, Arcanist and Shaman . Hundreds of Item Skills – Augment your class build with a diverse array of over 250 unique skills granted by items and equipment add-ons. Collect hundreds of Items\nCommon, magical, rare, epic and legendary classes of loot. Plus over 20,000 possible magical affix combinations and over 200 rare affixes. Quests with Choice and Consequence – You will face tough decisions that leave significant impacts upon the world. Strangers on the road, desperate families and even entire villages may live or perish based on your actions. Currently over 35 quests with 75+ lore notes to be collected. Friendly and Enemy Factions – Earn favor with human factions to unlock additional quest lines, vendor discounts and special faction-based items and augments. Some neutral factions can be turned into allies but aiding one will make the enemy of another.\nHostile factions will remember your deeds and deepen their hatred of you, sending out large packs and elite heroes to hunt you down. Devotion, an additional layer of skill customization allows you to acquire bonuses and powerful secondary effects for your class skills. Mini Maker: Make A Thing\nThese are unlocked from a giant constellation map with points acquired by finding and restoring destroyed or corrupted shrines hidden throughout the world. Rebuild the World – Help human enclaves survive and flourish by securing vital necessities, rebuilding structures and rescuing survivors who can then lend their services to your cause.\n4 Person Multiplayer Connect with Friends or make new allies in glorious multiplayer. Multiplayer encounters will put your teamwork to the ultimate challenge. Fast-paced Visceral Combat Enemy blood spatters, ragdoll physics and satisfying enemy death effects. Smash in doors and fight house to house, leaving a path of demolished furniture in your wake.\nRotatable Camera If you choose to survey the full beauty of the world and always fight from the most optimal angle. Levels are still designed so that players are not forced to rotate the camera; it is purely optional. Secrets and Perils Abound – 200+ Enemy heroes and bosses, hand-configured with their own unique arrays of deadly skills. 20+ secret areas hidden behind crumbling walls, hidden gaps and mysterious locked doors. Explode obstacles or repair structures to open new paths.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/grim-dawn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/grim-dawn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP / Windows Vista / Windows 7 / Windows 8 / Windows 10",
        "Processor": "x86 compatible 2.3GHz or faster processor (Intel 2nd generation core i-series or equivalent)",
        "Memory": "2 GB RAM",
        "Graphics": "512MB NVIDIA GeForce 6800 series or ATI Radeon X800 series or better",
        "DirectX": "Version 9.0c",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Crate Entertainment",
        "Platform": "PC",
        "Game Size": "7.3 GB",
        "Released By": "Razor1911",
        "Version": "v1.2.1.0 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1r6f0f90jmq6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/grim-dawn-preinstalled-steamrip.jpg"
}