{
    "page_url": "https://steamrip.com/gripper-free-download-s1/",
    "title": "Gripper Directly Download",
    "description": "Enter the burnout seat of None, a cyber biker who is stuck inside a collapsing world. Race through post-apocalyptic landscapes connected by treacherous tunnels. Explore dead lands with the help of your mechanized cat buddy. Defeat relentless bosses by gripping and ripping out their hearts .\nRide, slide and dodge as you master the Gripper’s unique bike movement and combat mechanics. Go wheel-to-wheel with murderous monster trucks, giant arachnids, mechanized titans, and screen- shattering snakes. Crush them, rip out their weapon and use against them. Build the bike you want, from energy boosters to spawnable drones, mines and gadgets. The Last of Us Part I\nControl the battlefield with your bike’s hook. Use it to grip the environment, grab and throw explosives or even rip enemies apart. Gripper challenges you to find unique ways to slay the bosses.\nNone’s story is one of mystery and loss. Traverse the dystopian cyber landscapes in search of answers to your past. Help None make vital choices. Every answer you uncover is another loved one you put at risk, so go forth and save your family.\nKill. Upgrade. Repeat. Each grueling encounter will reward you with a new special ability, lethal gadgets, and sometimes rare skins. Customize your Gripper experience to both play and look how you want. If you’re going to be ripping out hearts, you must make sure you look good",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/gripper-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/gripper-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8.1 / 10 x64",
        "Processor": "Intel Core i5-760 or equivalent / AMD Athlon II X4 645 AM3 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 460 (1024 MB) / Radeon HD 6850 (1024 MB)",
        "DirectX": "Version 11",
        "Storage": "2201 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Heart Core",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "Tenoke",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/itwsv1xc5jit"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/gripper-preinstalled-steamrip.jpg"
}