{
    "page_url": "https://steamrip.com/gross-free-download-1z/",
    "title": "GROSS Directly Download",
    "description": "Get ready for a thrilling and innovative gaming experience with GROSS, a hybrid of tower defense and first person shooter genres. With its fresh and unique mechanics, you’ll be hooked from the start as you strategize and defend your way to victory. Children of Silentown\nIn GROSS, you are tasked with defending your base against waves of enemy attackers in classic tower defense fashion. You have the freedom to build barricades and turrets to create mazes and launch attacks on the enemy, as well as place traps on the ground for added defense. During the construction phase, you can experiment with different combinations of turrets and barriers to come up with the most effective obstacle course for your attackers.\nAnd don’t worry about time limits or wasted resources you can sell everything you build for a full refund until the next combat phase begins. So if you love the strategy and satisfaction of building the ultimate tower defense setup, GROSS is the game for you Once you are done building your defenses , get ready for intense, fast-paced combat! With a huge arsenal of guns at your fingertips, each featuring different ammo types, you’ll have to make split-second decisions to take down waves of zombies .\nFull metal jacket rounds can pierce through multiple enemies and even objects, while hollow points send foes flying and give you some breathing room. Incendiary rounds ignite zombies and keep them burning, and grenade and rocket launchers can deal massive damage to groups of enemies – but watch out, they may also destroy valuable cash pickups.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/gross-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/gross-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Quadcore CPU",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1070/1660",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "hangry owl games",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n688ghojweaq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/gross-preinstalled-steamrip.jpg"
}