{
    "page_url": "https://steamrip.com/ground-branch-free-download-t1/",
    "title": "GROUND BRANCH Directly Download",
    "description": "In GROUND BRANCH, you will play as the elite paramilitary arm of the CIA’s Special Activities Center/Special Operations Group (SAC/SOG) and lead other special operations forces through challenging deniable ops all over the globe. With deliberate, calculated and unforgiving gameplay, GROUND BRANCH aims to be the true rebirth of the tactical realism genre of the late ’90s and early 2000s. Powered by Epic’s Unreal Engine 4, GB puts the “tactical” back in “ tactical shooter” no compromises.\nGROUND BRANCH’s unique True First-Person System improves world immersion and awareness of your surroundings, providing zero disconnect between your view and your character’s physical presence in the environment . See your foot sticking out of cover? Better tuck it in enemies may be able to see it (and shoot it) too, but only if their line of sight and muzzle are verifiably unobstructed. Cameras are placed at the character’s eyes and bullets originate from the weapon’s muzzle. In GROUND BRANCH, what you see is what you get.\nSay goodbye to pre-defined kits and fully customize your character and gear from basic appearance and outfit to in-depth vest and weapon platform customization, down to individual pouch and attachment placement. What you bring to your mission is determined only by your loadout choice, with realistic consequences: With the upcoming encumbrance and stamina system, too much equipment will impact your character’s speed and performance; place a scope too forward on the rail and your sight picture will be too small; bring a long rifle into CQB and weapon collision may prove a hindrance",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/ground-branch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/ground-branch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64-bit",
        "Processor": "Intel Core i5-2500K / AMD FX-8350",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 2GB / AMD Radeon HD 7850",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Early Access",
        "Developer": "BlackFoot Studios",
        "Platform": "PC",
        "Game Size": "35.3 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v04092024 | Early Access + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/ILa2Dq",
        "https://buzzheavier.com/xa157tx9rnmx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/ground-branch-preinstalled-steamrip.jpg"
}