{
    "page_url": "https://steamrip.com/grouls-free-download/",
    "title": "Grouls",
    "description": "Grouls is a horror game that challenges your courage and plunges you into a dark adventure. Witness the journey of a young man named Denis as he confronts a sinister fate in an old and abandoned house. In his quest to uncover the whereabouts of his missing family, Denis must collect body parts scattered throughout this dark house and find a way to escape from the clutches of the ominous entities within. Myth Or Reality: Snowbound Secrets Collector’s Edition\nTerrifying Atmosphere: Grouls stands out with its atmosphere that immerses you in deep darkness and terrifying moments. At every step, the secrets of the house and the ghosts of its dark past will haunt you. Challenging Puzzles and Mysteries: Solve hidden puzzles, gather clues, and unveil the secrets of the dark entities lurking within the house. Be cautious with every step you take, as each decision you make will determine Denis’s fate. Multiple Endings: The decisions players make will shape Denis’s destiny. Summon your courage to find Denis’s missing family and confront the darkness, or risk being trapped in eternal darkness forever. Thrilling Gaming Experience: Grouls offers a suspenseful gaming experience that draws you into an unforgettable nightmare, where danger lurks around every corner.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/grouls-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/grouls-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1060",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy",
        "Developer": "OxygenStudio",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "DOGE",
        "Version": "Build 14810552",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/0HHT4L",
        "https://megadb.net/jve8kynfqd9h",
        "https://buzzheavier.com/64gl20vmko4b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/grouls-preinstalled-steamrip.jpg"
}