{
    "page_url": "https://steamrip.com/grow-song-of-the-evertree-free-download-s1/",
    "title": "Grow Song of the Evertree Free",
    "description": "Over time, the Worlds of Alaria faded. The Evertree – where many worlds resided on its countless branches – is now nothing more than a sapling, its splendor long erased from memory. No one knows how to make it grow. But you are different. You hear the sun as it sings across the sky. You hear the language of rain against the earth. You are the last of the Everheart Alchemists and it is your ancestral task and privilege to care for the Evertree. Discover a Vibrant Unique World at Your Own Pace Find unique places, blooming with fantastic fauna and flora as you are encouraged to explore this beautiful world at your own pace.\nHow do you want to spend your time? Exploring caves and solving puzzles, collecting minerals and flowers, fishing or catching bugs it’s up to you Learn to craft World Seeds through Alchemy to generate totally new worlds with unique characteristics. Tend those worlds to rejuvenate them and see how they change, and watch as new properties emerge before your very eyes You can generate unique meadows, deserts, frozen worlds andoh , well Alchemy is not an exact science, some seeds may contain unexpected surprises .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/grow-song-of-the-evertree-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/grow-song-of-the-evertree-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i3-6100",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Prideful Sloth",
        "Platform": "PC",
        "Game Size": "1.80 GB",
        "Version": "Build 8284513 | Full  +Winds of Change Update",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4zz3c6sni9ff"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/grow-song-of-the-evertree-free-download-preinstalled-steamrip.jpg"
}