{
    "page_url": "https://steamrip.com/gruel-free-download/",
    "title": "GRUEL",
    "description": "Welcome to the endless temple of GRUEL. Get wacky weapons, destroy freaky creatures and collect massive amounts of gold! In this first-person boomer-shooter its time to say goodbye to your basic ways of tactical gunman-ship and embrace the House of Golf 2\nIn the temple of GRUEL, nothing is certain. Who knows what room comes next? On top of that, the temple is ENDLESS ! That means you can get ∞ amounts of gold! So gain as much treasure from the temple as you possibly can, and let you top the charts!\nTo guard the amazing treasures you can find, there are hordes of monsters that just came out of the radiated freaks factory for you to pummel into oblivion! But they will not go down without a fight. From floating jellyfish to psycho magicians . We got them all!\nTo defeat those crazy freaks, we will need guns. Tons of them. Luckily , our dealer just got us a ton of bargain bin weapons ready to use. They break, They don’t have a ton of ammo, but they can shoot fish, prism shards, acid or even.. coins?! Get creative with this big arsenal of innovative throw-away weaponry ! But do not forget your biggest gun, your kick!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/gruel-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/gruel-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or upwards",
        "Processor": "Intel core i3 1.6 GHz",
        "Memory": "3 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 745",
        "DirectX": "Version 11",
        "Storage": "60 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Mick Sengers, Cheesebaron",
        "Platform": "PC",
        "Game Size": "84 MB",
        "Released By": "Kirigiri (csrin)",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tb9d50udmah5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/gruel-preinstalled-steamrip.jpg"
}