{
    "page_url": "https://steamrip.com/guilty-gear-strive-free-download-2j/",
    "title": "GUILTY GEAR -STRIVE-",
    "description": "Immerse yourself in new gameplay mechanics designed to be simple and welcoming for newcomers to fighting games, but deep and artistic for veterans. Ride ablaze into an alternate heavy metal-inspired future filled with action, style and fun Guilty Gear Aim is that the latest entry within the Guilty Gear fighting game franchise to receive critical acclaim Embark on the ultimate confrontation with This Man, the person liable for all the destruction and damage to the planet and its inhabitants. Join Saul Badguy, his rival Ki Kiske, and a shared starter roster of 15 unique characters as they face a tremendous conclusion to a story that’s been within the making for 20 years Chernobylite\nGuilty Gear -Strive- brings variety of latest and innovative game play mechanics designed to permit players new the series to quickly learn the basics while maintaining the deep, creative gameplay Guilty Gear is praised for. New additions to the series like a wall-breaking mechanic will leave new and exciting approaches to battle. It’s an honest game to make certain . The combat is fun, characters unique, and music great. But at the top of the day, in it’s current state which we will assume to be its first season, the sport lacks a big amount of prior titles freedom, damage on specific combo starters and reversals is ridiculous, and therefore the wall breaks inconsistency prevent it being a simple recommendation for all players. Medieval Dynasty",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/guilty-gear-strive-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/guilty-gear-strive-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/10 (64-bit  required)",
        "Processor": "AMD FX-4350, 4.2 GHz / Intel Core i5-3450, 3.10 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon HD 6870, 1 GB / GeForce GTX 650 Ti, 1 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Arcade, Fighting",
        "Developer": "Arc System Works",
        "Platform": "PC",
        "Game Size": "27.9 GB",
        "Version": "v1.2.5.0 | Full  + All DLCs + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/VCXAqp",
        "https://buzzheavier.com/0gtj3qox0wsf",
        "https://datanodes.to/sv87tvdifptz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/guilty-gear-strive-free-download-preinstalled-steamrip.jpg"
}