{
    "page_url": "https://steamrip.com/gun-club-vr-free-download-1a/",
    "title": "Gun Club VR Download Direct Link",
    "description": "Take to the range with an arsenal of the world’s most powerful weaponry in Gun Club VR. Addictive gameplay and unsurpassed realism combine to make Gun Club VR the ultimate virtual weapon simulator. The only thing missing is the smell of the gunpowder . Bringing the historic theatre of World War II right into the Gun Club VR experience, the Allied range includes an all new environment hosting dozens of new weapons & events to progress through.\nYour favourite firearms come to life with Gun Club VR’s highly detailed and fully interactive weapon models. Developed on real-world ballistics , you can handle, load, cock and fire these weapons. Flick off the safety, select burst or full auto, extend the stock or rack the slide to clear a round: gun Club VR provides the total gun range experience. Pistols , SMGs, shotguns, assault rifles, grenade launchers; dozens of the most iconic weapons in the world, all intricately modelled with complete interactivity.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/gun-club-vr-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/gun-club-vr-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8.1, 10 x64",
        "Processor": "Intel Core2 Duo E4500 (2 * 2200) or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce 7300 GT (512 MB), Radeon X1300 Pro (256 MB)",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "The Binary Mill",
        "Platform": "PC",
        "Game Size": "3.75 GB",
        "Released By": "CODEX",
        "Version": "v1.0.17 (HTC Vive, Oculus Rift, WMR, Valve Index) – Full Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4gz5k7qb47lj",
        "https://buzzheavier.com/6qnpq5gk356h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/gun-club-vr-free-download-preinstalled-steamrip.jpg"
}