{
    "page_url": "https://steamrip.com/gunbrella-free-download-q1/",
    "title": "Gunbrella",
    "description": "Gunbrella is a gritty noir-punk action-adventure set in a world dependent on a rapidly diminishing natural resource. Fill the rain-soaked boots of a gruff woodsman on a quest for revenge, entering an unfamiliar town armed only with the titular Gunbrella, a high-caliber firearm that doubles as an umbrella.\nYour hard-nosed investigation soon becomes entangled with the inner workings of a creepy cabal of ghouls and gangsters, cops and cultists, and the fallout of corporate exploitation. Engage in thrilling, side-scrolling action making full use of the Gunbrella’s unique maneuverability and close-quarters combat capabilities.\nThe Gunbrella is more than just a weapon – use it to glide, swing, dash, and dive around the world and discover seemingly unattainable secrets along the way. From a small town menaced by cult kidnappings to a junkyard fortress ruled by a ruthless trash gang, explore a diverse assortment of unusual locations and interrogate bizarre characters on your quest for answers. Need For Speed The Run\nKeep track of findings in your trusty notebook, and remember to retrace your steps. Salvage scrap and spare parts to trade for different munitions and upgrades for your impermeable arsenal . As your search deepens, and you conjure increasingly ghastly agents of the supernatural, you’ll need all the help you can get.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/gunbrella-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/gunbrella-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 x64",
        "Processor": "Intel Core i3-4160 / AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GT 640 / Radeon HD 7750",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "doinksoft",
        "Platform": "PC",
        "Game Size": "626 MB",
        "Released By": "TENOKE",
        "Version": "Build 12177024 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wm6pqmiie129"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/gunbrella-preinstalled-steamrip.jpg"
}