{
    "page_url": "https://steamrip.com/gunvolt-chronicles-luminous-avenger-ix-2-free-download-1y/",
    "title": "Gunvolt Chronicles Luminous Avenger 9 2 Download",
    "description": "Luminous Avenger iX 2 takes the series’ original speedy and stylish 2D action gameplay to the next level as Copen rips through enemies with his new “Break-Shift” form. His new destructive capabilities makes the high-speed action more satisfying than ever INTI CREATES is proud to present new apeX of cutting-edge 2D action with Luminous Avenger iX 2 With his new spinning blade weapon, the Razor Wheel, Copen rips through any enemy standing in his way as he traverses an enormous tower. HighFleet\nA wide variety of stages with powerful boss characters lurking in them await him. Copen earns a new EX Weapon for his arsenal whenever he defeats a boss. He uses these weapons to target enemies’ weak points to bring them down faster; a key strategy to clearing stages and ascending the tower quickly. Copen’s Bullit Dash that allows him to fly freely through the air has also been powered up\nSuper-stylish maneuvers reward those who master the Bullit Dash’s high-speed capabilities Copen takes on all challenges by changing seamlessly between his two forms: the power-focused “Break-Shift” and the speed-enhanced “ Bullit -Shift.”",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/gunvolt-chronicles-luminous-avenger-ix-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/gunvolt-chronicles-luminous-avenger-ix-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8.1, 10",
        "Processor": "2 Ghz or faster processer",
        "Memory": "8 GB RAM",
        "Graphics": "2GB VRAM (NVIDIA GeForce)",
        "DirectX": "Version 9.0c",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "INTI CREATES CO., LTD.",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "GOLDBERG",
        "Version": "Build 8365022 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jnmx919t23uo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/gunvolt-chronicles-luminous-avenger-ix-2-preinstalled-steamrip.jpg"
}