{
    "page_url": "https://steamrip.com/hades-free-download-a2/",
    "title": "Hades Free Download Directly",
    "description": "Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant’s critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor , and the character-driven storytelling of Pyre. As the immortal Prince of the Underworld, you’ll wield the powers and mythic weapons of Olympus to break free from the clutches of the god of the dead himself, while growing stronger and unraveling more of the story with each unique escape attempt.\nThe Olympians have your back Meet Zeus, Athena, Poseidon , and many more, and choose from their dozens of powerful Boons that enhance your abilities. There are thousands of viable character builds to discover as you go. A fully-voiced cast of colorful , larger-than-life characters is waiting to meet you Grow your relationships with them, and experience thousands of unique story events as you learn about what’s really at stake for this big, dysfunctional family. New surprises await each time you delve into the ever-shifting Underworld , whose guardian bosses will remember you. Use the powerful Mirror of Night to grow permanently stronger, and give yourself a leg up the next time you run away from home.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/hades-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/hades-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "1GB VRAM / DirectX 10+ support",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Supergiant Games",
        "Platform": "PC",
        "Game Size": "10.5 GB",
        "Repack By": "Mr_GOLDBERG emu",
        "Version": "Build 10929685 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hqawzfivqeq9",
        "https://gofile.io/d/zdQAWs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/hades-free-download-preinstalled-steamrip.jpg"
}