{
    "page_url": "https://steamrip.com/half-dead-2-free-download-1j/",
    "title": "HALF DEAD 2 Directly Download",
    "description": "Get HALF DEAD 2 PC game for free instantly and play pre-installed on SteamRiP\nYou are one among the foremost bloodthirsty criminals within the galaxy. the amount of your victims is nearly quite people hanged for the betrayal of the Empire. They caught you, and it seems that you simply definitely will face execution . But the corrupt galactic system gives you a second chance. The Emperor , for his personal pleasure, starts hosting galactic games of survival among the foremost bloodthirsty killers, and therefore the people that are even worse: democratic rebels. For that purpose, they built up an enormous network of rooms crammed with deadly traps.\nA manic smile appears on your face, because you recognize that the foremost deadly thing within the universe is you. Firstly, the complex consists of several floors, each of which has about a dozen rooms connected by doors, and you will need to visit each of them and find a passage to the next floor. Secondly, there may be a trap in every such room. The Greatest Penguin Heist of All Time\nSomewhere it can be acid dripping from the ceiling, a saw spinning along an axis and sawing everything in a row, or even a mechanical snake grinding everything that catches its eye – there are many such options, and all are deadly. Moreover, the most interesting thing is that you do not recognize. What a trap awaits you in the room until you go inside.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/half-dead-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/half-dead-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64bit",
        "Processor": "Intel Core i3",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660 / AMD Radeon RX 360 / Laptop NVIDIA GTX 860M or MX150",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Massively Multiplayer",
        "Developer": "Room710Games",
        "Platform": "PC",
        "Game Size": "1.26 GB",
        "Repack By": "GOG",
        "Version": "v1.01 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/half-dead-2-free-download-torrent-steamrip.jpg"
}