{
    "page_url": "https://steamrip.com/half-life-2-free-download-1n/",
    "title": "Half-Life 2",
    "description": "1998. HALF-LIFE sends a shock through the game industry with its combination of pounding action and continuous, immersive storytelling. Valve’s debut title wins more than 50 game-of-the-year awards on its way to being named “Best PC Game Ever” by PC Gamer, and launches a franchise with more than eight million retail units sold worldwide .\nBy taking the suspense , challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player’s presence affects everything around them, from the physical environment to the behaviors even the emotions of both friends and enemies.\nThe player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people he cares about are counting on him. Crash Bandicoot 4: It’s About Time",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/half-life-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/half-life-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Vista, XP",
        "Processor": "1.7 Ghz",
        "Memory": "512 MB RAM",
        "Graphics": "DirectX 8.1 level  Card (requires support for SSE)",
        "Storage": "6500 MB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Valve",
        "Platform": "PC",
        "Game Size": "9.2 GB",
        "Released By": "TiNYiSO | Thanks to ComicSans/Fitgirl repacks",
        "Version": "Build 16431800 Full  | 20th Anniversary Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4cw0nfvb3ifp",
        "https://buzzheavier.com/oqde6ntz13c7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/half-life-2-free-download-preinstalled-steamrip.jpg"
}