{
    "page_url": "https://steamrip.com/hand-in-hand-free-download/",
    "title": "Hand In Hand",
    "description": "Hand In Hand is a 2D split screen puzzle platformer, where the player can control two characters at once, or two players can play in co-op mode on one device. Little Kitty, Big City\nTwo soulmates live in a fairytale world. But when evil came to their world, they lost each other. Now both of them need to head towards each other, facing many difficulties and dangers along the way. And only by finding a fragile connection between one another and going hand in hand will they be able to defeat evil and meet again. It’s a story about how we can help one another even when you’re apart, and be far from one another even when you’re nearby. It’s a story about the importance of relationships and mutual support. But every story has an even deeper meaning.\nSPLIT SCREEN\nThe game works in splitscreen mode, with one character on each screen in their respective locations. The game has two modes. The first is single-player mode, where one player simultaneously controls both characters with one joystick. In this mode, the player must demonstrate sophisticated controller skills.\nThe second is local co-op mode, where two players control the characters using two joysticks . Here, both players control their respective characters. Each mode has its advantages . Single-player mode requires you to show great dexterity and reaction speed, and co-op mode allows you to feel the joy of playing the game with your family or friend. Try both game modes , we hope you’ll like it and enjoy completing it.\nTHE CHARACTERS INTERACT WITH AND HELP EACH OTHER\nEach character has their own part of the level in a common location . However, some parts of the level are interconnected . This means that the characters can interact and help each other complete the level. Characters can move keys and objects from one part of the screen to another, and most puzzles are need to be solved by both characters working together, connecting parts of the screen and solving puzzles together.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/hand-in-hand-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/hand-in-hand-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "WIN8-64 bit",
        "Processor": "Intel i5-760 (4*2800), AMD Phenom II",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 650 / Radeon HD 7510",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "MaxMedia",
        "Platform": "PC",
        "Game Size": "837 MB",
        "Released By": "TENOKE",
        "Version": "Build 12937397 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qtt47bap7pd4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/hand-in-hand-preinstalled-steamrip.jpg"
}