{
    "page_url": "https://steamrip.com/happys-humble-burger-farm-free-download-1v/",
    "title": "Happy’s Humble Burger Farm Download",
    "description": "Get Happy’s Humble Burger Farm for free instantly and play pre-installed on SteamRiP\nCongratulations! You’ve just been hired to work the night shift You’ll be all by yourself, we trust you can handle it You’ll be grilling patties, operating deep fryers, and pouring drinks at our quiet restaurant on the edge of town. The customers sure do love the menu; they can’t get enough of the Happy’s Deluxe, Fantastic Fowl, and Poppin’ Pork sandwiches. The fries and salmon nugs are also a big hit. I hear rumors of Happy-Dogs and desserts in the near future, too When each customer makes an order, it’s up to you to make a plan and execute it well.\nIf you give customers the wrong order, or take too long, it’ll count as an infraction. If you get three of those infractions, well let’s just say Happy the Humble Heifer isn’t as joyful when the customers are upset. DO NOT UPSET HAPPY. TRUST US. But hey, you’ll do fine Just as long as you don’t upset Happy , you’ll do great We believe in you. Baldur’s Gate: Dark Alliance",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/happys-humble-burger-farm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel(R) Core(TM) i3-4170",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 730",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Scythe Dev Team",
        "Platform": "PC",
        "Game Size": "10.6 GB",
        "Version": "v1.17.0 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sn1rytsmhnli"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/happys-humble-burger-farm-preinstalled-steamrip.jpg"
}