{
    "page_url": "https://steamrip.com/hard-time-iii-free-download/",
    "title": "Hard Time III",
    "description": "The toughest prison sim in the yard is back to serve its 3rd consecutive sentence – combining classic moments from the OG with the best aspects of 2D, while putting out a few hits of its own A fully developed police role challenges you to tackle crime from either side of the prison fence, while a larger world beyond it makes life worth living. Explore it with a wider range of vehicles , as well as animals and hundreds of fully interactive props & weapons. A combat system perfected by wrestling is further enhanced by mind-blowing gunplay that allows you to shoot at ANY moment! Reinforced by a creative crafting system, you’ve only ever run out of ammo when you’ve run out of ideas. Shadows of Doubt\nAll now presented with higher resolution visuals and a smoother frame rate, with a wide variety of camera angles to fine-tune to your liking. Feel the consequences of your actions with grotesque scarring and severed limbs, as you fight to keep yours intact for as long as possible! Rub shoulders with hundreds of other characters, and stake your reputation on saying the right words to get through each day that unfolds in real-time. A new dialogue system allows YOU to initiate conversations instead waiting for the drama to come to you.\nUpon earning access to the inbuilt editor, you can save your changes to each character to make the world your own. To prepare for a life of crime, you can also blow off steam in a special “ Fight Scene” mode – where you select WHO fights WHERE and with WHAT to see who survives ! This even extends to multiplayer opportunities, where other controllers can choose any other character on the scene to either help or hinder.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/hard-time-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/hard-time-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel(R) Celeron(TM) 1.1gHz",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible video card",
        "DirectX": "Version 11",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Simulation",
        "Developer": "MDickie",
        "Platform": "PC",
        "Game Size": "269 MB",
        "Released By": "N/A csrin",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/98tbtcbub9ht"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/hard-time-3-preinstalled-steamrip.jpg"
}