{
    "page_url": "https://steamrip.com/hard-bullet-free-download-1s/",
    "title": "Hard Bullet VR Directly Download",
    "description": "Hard Bullet is a physics sandbox action game that blends gunfights, cinematic effects, brutal melee encounters with insane tools and fun modifiers to create unique violent experience. Deep Interactions: disarm enemies, steal from holsters, kick with elbows, perform one-handed shotgun reloads and more in our innovative physics setup. Enemy Gore Body Damage: Accurate full body IK systems. You can start real gore mayhem with body dismembering, bullet holes and blood fountains. Builder Simulator\nSandbox: Use ammo workshop, giant generator, welding machine and built your own crazy weapons in this creative mode. Fast-paced Action: inspired by genre-defining classic Hong Kong action movies. Slow Motion and Tricks: control time like in famous PC and console blockbusters — perform slow motion jumps dual wielding and deal overpowered punches with fists.\nWeapons: Expect dozens of iconic pistols, submachine guns and shotguns, you’ll get some sweet rifles and machine guns as well. For those who want to make their own brutal experience. Fight dwarves with giant pencils, build physics machines and design torture chambers with deadly machines.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/hard-bullet-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/hard-bullet-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4590 / Ryzen 5 3600 or better",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1060 or better. Needs DirectX 11.3 Shader Model 5.1",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation, Early Access",
        "Developer": "GexagonVR",
        "Platform": "PC",
        "Game Size": "5.9 GB",
        "Released By": "N/A",
        "Version": "Build 8912696 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/f54v9zndd38r",
        "https://megadb.net/g3dcw05vnp8c"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/hard-bullet-preinstalled-steamrip.jpg"
}