{
    "page_url": "https://steamrip.com/haste-broken-worlds-free-download/",
    "title": "Haste",
    "description": "HASTE: Broken Worlds plunges you into a thrilling , high-speed third-person running experience set against the backdrop of a disintegrating universe. Your objective is to race through a diverse array of collapsing worlds, demanding mastery of movement and strategic use of items and abilities. Each of the ten Shards presents a series of procedurally generated levels that must be flawlessly navigated to unlock the subsequent Shard. Along your desperate journey, you will encounter enigmatic challenges and a cast of memorable characters, all while seeking answers regarding the cataclysmic destruction and a potential means of escape.\nThe core gameplay revolves around exhilarating, high- velocity running where maintaining momentum is paramount. Landing each movement with precision is crucial; a successful landing builds speed, while a misstep can prove costly. Quick thinking and constant awareness of the rapidly changing environment are essential to outrun the impending cosmic destruction . Throughout your perilous runs, you will collect Sparks, a vital resource used in designated shop levels to acquire a wide variety of items. These items offer extensive customization options, influencing crucial attributes such as speed, damage output, luck, and health, allowing you to tailor your build for each attempt to conquer a Shard .\nNavigate the procedurally generated levels with breakneck speed as you progress through each Shard, requiring successful completion of every stage before exhausting your limited lives to advance. The acquisition and strategic combination of items are key to survival, encouraging experimentation with diverse builds to enhance your chances of success. Your personal odyssey through the broken worlds will be a distinct and individual experience, as you desperately strive to outpace the unfolding apocalypse. Discover spectacular biomes and confront four distinct and formidable bosses that guard the secrets of the collapsing universe . Furthermore, master four unique abilities that can provide crucial advantages in your desperate race against time, and unlock an endless mode for a truly relentless test of your skills. TETRIS THE GRAND MASTER 4 -ABSOLUTE EYE-",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/haste-broken-worlds-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/haste-broken-worlds-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10",
        "Processor": "Intel Core i5-2400 @ 3.1 GHz or AMD FX-6300 @ 3.5 GHz or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 670 or AMD R9 270 (2GB VRAM with Shader Model 5.0 or better)",
        "DirectX": "Version 10",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Racing",
        "Developer": "Landfall",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "0xdeadc0de",
        "Version": "v1.5.b | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/2webizlzcsh1",
        "https://buzzheavier.com/7lgahhd7vdlj",
        "https://megadb.net/yyzi2fu5bdji"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/haste-broken-worlds-preinstalled-steamrip.jpg"
}