{
    "page_url": "https://steamrip.com/have-a-nice-death-free-download-1x/",
    "title": "Have a Nice Death Directly Download",
    "description": "Discover and explore the darkly -charming, procedurally-generated departments of Death Inc., where you’ll meet a diverse cast of memorable characters like your affable pumpkin -headed assistant, Pump Quinn—who are always willing to share the latest office gossip Sharpen your skills (and scythe) through fast-paced hack n’ slash combat, utilizing over 30 unique weapons and spells you can find and upgrade to create devastating combinations Since Death can’t die, use what you’ve learned and earned to overcome the numerous minions and bosses in each department of Death Incorporated over and over.\nA performance review after every run guarantees that you’ll unlock interesting items and upgrades that will help you progress on your journey. Taking more power for yourself is a controversial move in Death Incorporated’s company culture. For instance, adopting a Curse upgrade for yourself might result in the Labor Inspector granting your subordinates enhanced powers, or worse, raising the cost of koffee and other items that are vital to your work output. Horror",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/have-a-nice-death-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/have-a-nice-death-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-Bit)",
        "Processor": "I5",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce 970 GTX or AMD Radeon R9 290x Card or Higher",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Magic Design Studios",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released by": "CODEX",
        "Version": "v1.0.4.55150 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wntx73q8gtbf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/have-a-nice-death-preinstalled-steamrip.jpg"
}