{
    "page_url": "https://steamrip.com/havendock-free-download-w1/",
    "title": "Havendock",
    "description": "Havendock is a resource management, base building, simulation game where you try to survive in the middle of the sea and build a thriving town. You attract settlers onboard and manage them, while trying to meet their needs. Create your own character. This is your life now, stay positive Collect resources from floating debris. Build facilities to become self-sufficient. Arrange your settlement the way you want and at your own pace. Raise and feed animals – make fluffy new friends, they just want to help. Neon Echo\nWelcome new survivors – manage tasks and production to keep everyone happy and healthy . More settlers means more needs to be met, but don’t worry. You’ll teach your new pals how to work, and they’ll help you automate the things you like less. Master mad science – push past the limits of modern engineering and common sense. From basic devices like water distiller or coffee maker to robots that help you further automate your work, power plants, submarine, and even a rocket . Invite your friends and play in co-op mode. Have fun but keep in mind that you’ll encounter a spectacular number of bugs as long as this is work-in-progress mode.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/havendock-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/havendock-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-bit)",
        "Processor": "Dual core 3 GHz+",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 700 series or similar",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "YYZ",
        "Platform": "PC",
        "Game Size": "435MB",
        "Released By": "TENOKE emu",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/slackk3ppzi9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/havendock-preintalled-steamrip.jpg"
}