{
    "page_url": "https://steamrip.com/hedon-bloodrite-free-download-1p/",
    "title": "Hedon Bloodrite",
    "description": "Get Hedon Bloodrite (Extra Thicc Edition) for instantly and play pre-installed on SteamRiP\nHedon Bloodrite merges Hedon I and II into an entirely hand crafted 20+ hours singleplayer experience inspired by not only the best retro FPS games of the 90s, but also games like Arx Fatalis and Thief. Hedon mixes high octane action with exploration and puzzle solving, creating a challenge that encourages creativity and wit.\nEmbark on an adventure across an underground world where ancient and medieval civilizations meet with uncanny crystal-powered technologies.\nImmerse yourself in the whistling of cave drafts and the humming of the mossy crystals as you ponder your next move.\nShatter your foes with a lined-up axe throw, lob acid at them from your potion launcher or ignite them with the flamethrower included into your goblin-crafted shotgun.\nSharpen your wits and your sense of exploration – there won’t be many arrows to point you through the mysteries of the Underworld.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/hedon-bloodrite-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/hedon-bloodrite-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit",
        "Processor": "2.4 GHz Dual-Core",
        "Memory": "4 GB RAM",
        "Graphics": "Dedicated GPU – anything capable of running OpenGL 4.0",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Zan_HedonDev",
        "Platform": "PC",
        "Game Size": "608 MB",
        "Released By": "GOG",
        "Version": "v2.4.2 | Full  + Extra Thicc Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ni62p04jr1l0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/hedon-bloodrite-free-download-preinstalled-steamrip.jpg"
}