{
    "page_url": "https://steamrip.com/helvetii-free-download-t1/",
    "title": "Helvetii Directly Download",
    "description": "Around a hundred years BC, all of Gaul is far from Roman control. In the lands controlled by the Helvetii , a Roman legion was subjugated by young warchief Divico, blessed by an ancient boon brought to him from parts unknown. However, this victory came at a great cost, as soon the result of the war chief’s pact would turn into a curse; an ever spreading rot crawling through his land, and slowly corrupting his mind and heart.\nMonsters and cultists start appearing throughout the land, and a shadowy figure makes his move, taking advantage of the chaos he helped create. With the help of the trusted yet reclusive druid Nammeios and the curious half-beast Renart, Divico sets his journey to undo the source of the rot and restore what was lost inside him. Through his own martial prowess and powers conferred by the old gods, the fight ahead promises to be intense. A disgruntled war chief, a snarky fox or a wise druid. IDIOTIC (The Game)\nThree characters with their unique playstyle and special attacks that will help you dominate the legions of monsters. Regardless of whatever items or summons you find, you will never be completely helpless in Helvetii. Regardless of power ups, your core moveset will always feel complete from the get-go. With a wide variety of abilities and situations, it’s not just about finishing the fight, but doing it in style Take your time to master each character with acrobatic combos, using the terrain at your advantage and mercilessly juggling your opponent for the highest ranks, and highest rewards.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/helvetii-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/helvetii-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or above",
        "Processor": "2 GHz Dual Core",
        "Memory": "2 GB RAM",
        "Graphics": "nVidia® 8800 GT / AMD® 4670 or faster",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Team KwaKwa",
        "Platform": "PC",
        "Game Size": "449 MB",
        "Released By": "CODEX emu",
        "Version": "Build 10471943 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/syo1mba137my"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/helvetii-preinstalled-steamrip.jpg"
}