{
    "page_url": "https://steamrip.com/heroish-free-download-1u/",
    "title": "HEROish Directly Download",
    "description": "HEROish is an epic MOBA -meets-castle-defense adventure. Build your deck of deployable minions and supercharged hero abilities as you play through a beautiful world across three different campaigns. Then climb the ranks as any of the six heroes and villains in fast-paced 1v1 or 2v2 competitive battles .\nPlay as one of six HERO-ish champions from the Imperial, Cursed, or Feral factions, all with unique abilities and play-styles. Summon hordes of skeletons, ferocious bearzerkers, or healing clerics. Pick from dozens of minion types to fight by your side, many with special abilities. Picking minions that work well together is key to victory. Assemble a 12-card deck of spells and minions unique to your hero. Middle-earth: Shadow of Mordor GOTY\nFight it out in real-time combat, playing cards to tip the scales . Take part in an epic story that unfolds across three campaigns. Explore the map, collect new minions, level up, and upgrade your deck. A well-timed spell can turn the tide of battle. Use your mana wisely to unleash devastating attacks, empowering auras, or devious traps.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/heroish-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/heroish-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1",
        "Processor": "Intel Core i5-4360U",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD  5000 w/ DirectX 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, RPG, Strategy",
        "Developer": "Sunblink",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "TENOKE",
        "Version": "Build 10156563 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a9x0lwxldrcr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/heroish-preinstalled-steamrip.jpg"
}