{
    "page_url": "https://steamrip.com/heros-hour-free-download-1w/",
    "title": "Hero’s Hour Free Directly Download",
    "description": "Hero’s Hour is an accessible, yet-deep and content-rich Strategy Roleplaying Game. Take control of your hero, explore the world, build up your town, fight fast-paced battles, level up your hero and amass an army large enough to take out the opponents before they take you out.\nWhile exploring the overworld and developing your town and army are both turn-based, giving you time to think and plan out your next moves, in battles your units will do the best to fight for themselves in real time all hundreds of them. Cast spells and give attack orders to swing the tide of battle or just sit back and watch as your might unfolds. Mad Max\nHero’s Hour brings impactful procedural generation to the strategy game formula, ensuring that every time you play, there will be new areas to explore and strange buildings to enhance your hero or army. Seek out obelisks to start you on small procedural quests that send you around the world. You won’t even be able to use the same build order each time you play the same faction .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/heros-hour-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/heros-hour-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft 64bit Windows 7 or younger",
        "Processor": "Dual-core 2Ghz CPU",
        "Memory": "512 MB RAM",
        "Graphics": "AMD Radeon HD 6250 or better DirectX11 compatible graphics card",
        "DirectX": "Version 11",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Benjamin “ThingOnItsOwn” Hauer",
        "Platform": "PC",
        "Game Size": "554 MB",
        "Released By": "TENOKE emu",
        "Version": "v2.7.2 | Full  (Latest) + Rogue Realms DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0rl3ueyrsyga"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/heros-hour-preinstalled-steamrip.jpg"
}