{
    "page_url": "https://steamrip.com/heroes-of-eternal-quest-free-download-h1/",
    "title": "Heroes of Eternal Quest",
    "description": "No one could have imagined that the once peaceful world would be irretrievably lost. One day, everything fell apart, and the world turned into a massive pyramid . Various of creatures found homes on different “layers”, each based on how high or low they were. With no physical paths connecting these layers, we could only travel using huge “portals”.\nThe surviving humans live in the lowest, poorest areas of this new world. They call it the “Tower of Shards ” and hope to reach the top of the world one day, breaking free from an unfair destiny.\nWhile we won’t give in to this strange fate, only a few people, known as “the Marked “, can safely travel through the “portals”. They’re our last hope. Endless Expeditions: Since humans are living in areas with few resources, it’s up to “the Marked” to start expeditions to bring back resources home. Unlock different characters, buildings, and items to equip your heroes and use their skills at the right time, making each journey unique.\nBase Building & Gear Merge: With the resources you’ve collected, you can build and expand human homes in many fun ways. As supplies grow and new buildings pop up, humans can start to help “the Marked” with all kinds of battle structures like buildings, gear, and other supplies. Expand your stronghold and merge equipment for stronger setups.\nStrategic Deck Building: With every new building in the stronghold, you’ll unlock a bunch of fun, mysterious cards. The cards you use will change how you can support in battles. Always be ready to change up your cards based on what’s happening in the expedition.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/heroes-of-eternal-quest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/heroes-of-eternal-quest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core 2 Duo E4500 @ 2.2GHz or AMD Athlon 64 X2 5600+ @ 2.8 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 240 GT or Radeon HD 6570 – 1024 MB (1 gig)",
        "DirectX": "Version 9.0c",
        "Storage": "1350 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Drakkar Game Studio",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "SKIDROW",
        "Version": "v1.0.16a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/HCL6um",
        "https://megadb.net/bq7yv44s2u2y",
        "https://1fichier.com/?9jvi5c7mnbg9rvtbt1hu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/heroes-of-eternal-quest-preinstalled-steamrip.jpg"
}