{
    "page_url": "https://steamrip.com/hero-siege-free-download-1s/",
    "title": "Hero Siege",
    "description": "Hero Siege Download PC Game In Direct Link for free on SteamRIP\nHero Siege is a Hack ‘n’ Slash game with roguelike- & RPG elements. Annihilate hordes of enemies, grow your talent tree, grind better loot and explore up to 7 Acts enhanced with beautiful Pixel Art graphics! This game offers countless hours of gameplay and up to 4 player online multiplayer Choose from up to 17 classes for your journey through the world of Hero Siege 8 Classes are available in the base game and the rest can be unlocked as extra content via DLC Every class has 2 unique talent tree, set of abilities and unique voice acting Like any good Hack N Slash game, Hero Siege has an Loot/ Inventory system.\nLoot drops can be of several different rarities such as Normal , Magic, Rare, Legendary, Mythic and Satanic The loot system gives you the opportunity to build your Hero just the way you want Gather up to 3 friends and fight together against the forces of evil! The online multiplayer also has leader boards for Hero Levels and Wormhole rankings. Every class has its own solo leader board. In the end of every season, the best players are awarded with seasonal rewards The world is randomly generated so the zones are always fresh and different filled with secret dungeons, crypts, treasure and hazards The game consists of 7 Acts with 5 levels + end boss each. The levels contain secret dungeons that can be explored .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/hero-siege-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/hero-siege-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5+",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 7 Series 2 GB+",
        "Storage": "900 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Massively Multiplayer, RPG",
        "Developer": "Elias Viglione, Jussi Kukkonen",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "Mr_GOLDBERG | Ty lanternjoe (csrin)",
        "Version": "v6.7.1.0 HF4 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6dzzt41cv8z3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/hero-siege-free-download-preinstalled-steamrip.jpg"
}