{
    "page_url": "https://steamrip.com/highwater-free-download/",
    "title": "Highwater",
    "description": "Highwater is a whimsical, 3D adventure game with an isometric turn-based puzzle-combat system set in a flooded, post-apocalyptic world. Navigate by boat, discover islands , find new allies to help battle foes, and experience a humorous tale about friendship in this melancholic and atmospheric escape.\nAmid the Great Climate Catastrophe , the flooded region of Hightower has become a kind of safe zone between the two dry regions: the nearly global ravaged land of the War Zone, and the fortified city of Alphaville, where the ultra-rich live behind giant walls. Out of the Park Baseball 25\nWith life on Earth becoming untenable for humans, and rumors of an escape to Mars floating around, Nikos begins a risky journey, picking up friends along the way. First to Hightower, then beyond to cross the impenetrable border of Alphaville, battling insurgents and stealing food along the way. Will Nikos and his friends manage to sneak onto the rocket in time?\nRich, Story-Driven Adventure Earth may be flooded, but it’s one heck of a view on the water. With a sense of humor , determination, and some great tunes, Nikos and friends will work together to explore the water-filled environment around them and embark on an adventure to evacuate to Mars and start a new life.\n3D Exploration & Discovery Float along the vast waterways freely in your boat and explore the many different islands of a beautiful world where you’ll encounter danger, interact with fellow citizens, gather resources, and fight for a chance to escape to a new life.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/highwater-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/highwater-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 or later",
        "Processor": "Intel Core i3",
        "Graphics": "Nvidia Geforce 650M or equivalent",
        "DirectX": "Version 9.0",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Demagog Studio",
        "Platform": "PC",
        "Game Size": "789 MB",
        "Released By": "SKIDROW",
        "Version": "Build 13581272 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fbb1bmv7jfi6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/highwater-preinstalled-steamrip.jpg"
}