{
    "page_url": "https://steamrip.com/highrise-city-free-download-g1/",
    "title": "Highrise City",
    "description": "Obviously, you as a player will compare Highrise City with other games. If you are comparing the game with other city builders, keep in mind that the focus of Highrise City are the production chains – the results of these will lead to an ever growing city. Your Only Move Is HUSTLE\nThe game is more than a traditional city builder and has a strong influence of economy simulations . It was developed by a small team as a passion project during the last 8 years while 7 years the game was a one man project. Highrise City offers a new spin on City Simulations & Tycoon games expanding the economy and resource management aspect.\nExperience a modern take on the genre enriched with a complex resource based economy system. Highrise City combines two genres in new and interesting ways: City Builders and traditional Economy & Resource Management Simulations. Highrise City offers you challenging gameplay and gives you all the possibilities and tools you need to create a living and breathing city.\nTake care of your city and make it grow and flourish into a giant Metropolis In Highrise City you do not only build a city, you also actively manage it by handling the economical supply for it. Organize and build supply chains in an efficient way and make sure your economy is well balanced to guarantee a steady growth. By doing so you will be able to create true megacities .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/highrise-city-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/highrise-city-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7 4770 @ 3.5Ghz",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce GTX 760",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Fourexo Entertainment",
        "Platform": "PC",
        "Game Size": "7.6 GB",
        "Released By": "GOG",
        "Version": "v2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/n3i69N",
        "https://megadb.net/y0dtrayc0771"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/highrise-city-preinstalled-steamrip.jpg"
}