{
    "page_url": "https://steamrip.com/hitman-absolution-free-download-1i/",
    "title": "Hitman Absolution Download Direct Link",
    "description": "Get Hitman Absolution PC game for free instantly and play pre-installed on SteamRiP\nHitman: Absolution follows the Original Assassin undertaking his most personal contract to date. Betrayed by the Agency and hunted by the police, Agent 47 finds himself pursuing redemption in a corrupt and twisted world. Showcasing Glacier 2 technology: HITMAN: ABSOLUTION has been built from the ground up, boasting a cinematic story, distinctive art direction and highly original game and sound design. Freedom of Choice: Stalk your prey , fight them head on or adapt as you go along.\nAs Agent 47 the choice is yours thanks to highly evolved g ameplay mechanics and a ground-breaking AI system. Experience a Living, Breathing World: In the world of Hitman: Absolution every moment can become a story as unique characters, rich dialogue and Hollywood standard performances combine to create a gameplay experience like no other. Disguises: As Agent 47, the identity of almost anyone you meet is yours for the taking. Immobilise your prey, steal their outfit and use your instinct to blend in and deceive your enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/hitman-absolution-free-download-crack-steamrip-1.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/hitman-absolution-free-download-steamrip-1.jpg"
    ],
    "system_requirements": {
        "Operating system": "Windows Vista, 7",
        "Processor": "Intel Core 2 Duo 2,4 GHz, AMD Athlon X2 4400+",
        "RAM": "2 GB (Vista / 7)",
        "Video card": "GeForce 8600 or Radeon HD2900",
        "Free space on hard disk": "24 GB"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Io-Interactive A/S",
        "Platform": "PC",
        "Game Size": "14 GB",
        "Repack By": "GOG",
        "Version": "v1.0.447.0 | Updated version + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/3q",
        "https://buzzheavier.com/az9idxyg840b",
        "https://1fichier.com/?2vxvezgpxktfj971ibt9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/hitman-absolution-free-download-preinstalled-steamrip.jpg"
}