{
    "page_url": "https://steamrip.com/hoa-free-download-1m/",
    "title": "Hoa Download",
    "description": "Get Hoa PC game for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nHoa is a beautiful puzzle-platforming game that features breathtaking hand-painted art, lovely music, and a peaceful, relaxing atmosphere. Experience the magic of nature and imagination as you play the main character, Hoa, on her journey through breathtaking environments back to where it all began.\nBreathtaking hand-painted art Step into a painting that lives – explore a vast world of meticulously crafted sceneries of stunning hand-painted art.\nCaptivatingly story-telling and emotionally -charged, Hoa’s exceptional score, originally composed and live-recorded, brings its world to life with a touch of nostalgia. Mafia III: Definitive Edition\nLovely creatures\nKeep an eye out for delightful magical creatures along the way. Most of them want to be friends, some might even tell you a little story or two. Cuteness guaranteed. Navigate with a keen eye and solve exploration-based puzzles. Relax to the organic rhythm of subtle storytelling while being intrigued by endless little wonders. Be a child – it’s easier and harder than it may seem.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/hoa-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/hoa-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64bit)",
        "Processor": "AMD / Intel CPU running at 2.8 GHz or higher",
        "Memory": "4 GB RAM",
        "Graphics": "AMD/NVIDIA graphic card,",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Skrollcat Studio",
        "Platform": "PC",
        "Game Size": "1.42 GB",
        "Repack By": "SEWN",
        "Version": "v1.05 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7d5qcw7hwv1x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/hoa-free-download-preinstalled-steamrip.jpg"
}