{
    "page_url": "https://steamrip.com/hollow-knight-free-download-d1/",
    "title": "Hollow Knight Free Download Direct Link",
    "description": "Godmaster – Take your place amongst the Gods . New Characters and Quest. New Boss Fights. Available Now Lifeblood – A Kingdom Upgraded! New Boss. Upgraded Bosses. Tweaks and Refinements across the whole game. The Grimm Troupe – Light the Nightmare Lantern. Summon the Troupe. New Major Quest. New Boss Fights. New Charms. New Enemies. New Friends. Hidden Dreams – Mighty new foes emerge! New Boss fights. New Upgrades. New Music. Brave the Depths of a Forgotten Kingdom Beneath the fading town of Dirtmouth sleeps an ancient, ruined kingdom. Many are drawn below the surface , searching for riches, or glory, or answers to old secrets. Hollow Knight is a classically styled 2D action adventure across a vast interconnected world. Explore twisting caverns, ancient cities and deadly wastes; battle tainted creatures and befriend bizarre bugs; and solve ancient mysteries at the kingdom’s heart.\nClassic side-scrolling action, with all the modern trimmings. Tightly tuned 2D controls. Dodge, dash and slash your way through even the most deadly adversaries. Explore a vast interconnected world of forgotten highways, overgrown wilds and ruined cities. Forge your own path! The world of Hallownest is expansive and open. Choose which paths you take, which enemies you face and find your own way forward. Evolve with powerful new skills and abilities! Gain spells, strength and speed. Leap to new heights on ethereal wings. Dash forward in a blazing flash. Blast foes with fiery Soul Equip Charms! Ancient relics that offer bizarre new powers and abilities. Choose your favourites and make your journey unique An enormous cast of cute and creepy characters all brought to life with traditional 2D frame-by-frame animation. Over 130 enemies! 30 epic bosses Face ferocious beasts and vanquish ancient knights on your quest through the kingdom. Track down every last twisted foe and add them to your Hunter’s Journal",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/hollow-knight-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/hollow-knight-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo E5200",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 9800GTX+ (1GB)",
        "DirectX": "Version 10",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Team Cherry",
        "Platform": "PC",
        "Game Size": "1.22 GB",
        "Repack By": "GOG",
        "Version": "v1.5.78.11833 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/4XiCAc",
        "https://buzzheavier.com/ibozyrc7vpjq",
        "https://megadb.net/d/3r"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/hollow-knight-free-download-torrent-steamrip.jpg"
}