{
    "page_url": "https://steamrip.com/holoparade-free-download-h1/",
    "title": "HoloParade Directly Download",
    "description": "“HoloParade” is a fan game of hololive and the first title to serve as a test case for “holo Indie”. Collect, nurture, and enjoy watching your favorite characters! It’s a 2D tower defense game that offers depth, strategy, and can also be enjoyed casually. LEGO City Undercover\nIt is a general term for a game brand for derivative work games, produced using the “game creator support program” with the aim of co-creating with fans and creators of hololive Production around the world.\nThe basic system is a classic 2D tower defense game where you summon characters from your base and march them forward to destroy the enemy’s base to win. While the controls are simple, the gameplay is profoundly deep. With over 65 characters, each possessing a variety of abilities like ally healing support and self-destruct attacks, skillful combination and flexible formation are key to enjoying the game.\nAdditionally, there’s an element inspired by parades called the ‘Symphony Effect,’ where various effects are activated based on the musical instruments played by the characters in march. This adds further strategic depth to the formation of your parade squad and the order of their summoning .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/holo-parade-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/holo-parade-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Core i5 2.8 Ghz or better",
        "Memory": "4 GB RAM",
        "Graphics": "GPU 4GB VRAM",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Roboqlo",
        "Platform": "PC",
        "Game Size": "309 MB",
        "Released By": "N/A",
        "Version": "Build 12875760 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/486ibly1ug59"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/holo-parade-preinstalled-steamrip.jpg"
}