{
    "page_url": "https://steamrip.com/honey-i-joined-a-cult-free-download-n1/",
    "title": "Honey, I Joined a Cult direct Download",
    "description": "Get Honey, I Joined a Cult PC game for free instantly and play pre-installed on SteamRiP\nIn Honey, I Joined a Cult you must build and expand your base, manage your cultists and resources, and increase your faith, funds and following. Every great cult needs great interior design. Place, design and decorate rooms to keep your cultists happy. There is a whole host of weird and wonderful room options, each with a vital role to play in your cult. Gaokao.Love.100Days\nFrom polygraph rooms and spirit chambers to energy spas and the dreaded ministry of alteration. A cult is only as good as its name. Choose yours wisely when picking for your cult, cult leader, the Divine Being that they worship, the Holy Room in which they prove their dedication and the followers that will become the cultists of tomorrow! Make your cult your own by deciding on. Starmancer\nBeing snappy dressers isn’t enough, your cult must run like a well-oiled hypno wheel. Set schedules for your cultists, level them up and manage food and maintenance systems. Assign tasks to your cultists based on a priority system, who said micro-management doesn’t work? Gas Station Simulator Cultists have needs too and you’ll have to ensure that all of yours are fed, watered and having lots of fun! You must take care of your cult’s physical and mental well-being to allow them to be the best cult members they can possibly be.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/honey-i-joined-a-cult-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/honey-i-joined-a-cult-free-download-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-4690K or AMD FX-8370",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GTS 250, 1 GB or AMD Radeon HD 5750, 1 GB",
        "Storage": "450 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Sole Survivor Games",
        "Platform": "PC",
        "Game Size": "370 MB",
        "Released By": "N/A",
        "Version": "v1.0.109 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jz2k2u463deb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/honey-i-joined-a-cult-free-download-preinstalled-steamrip.jpg"
}