{
    "page_url": "https://steamrip.com/hooked-on-you-a-dead-by-daylight-dating-sim-free-download-j1/",
    "title": "HOY A Dead by Daylight Dating Sim",
    "description": "You wake up on the beach of a strange island. Your memory, wiped. Your pockets, empty. Not another living soul in sight. Except of course the four lusty Killers playing volleyball in the sand nearby. Who are you? How did you get here? Why is the ocean talking to you? Unravel these mysteries and find out what makes each character tick as you flirt, banter, and woo your way into their hearts in this darkly comedic adventure. But choose your words wisely.\nThese Killers are passionate and powerful in equal measure, and this seductive dream can become a nightmare quicker than you think. Get drawn into a choice-driven dating sim, where Killers become lovable, nothing is quite what it seems, and your Dead by Daylight fantasies can finally come true. Order a tropical cocktail, take a long sip, and quench that thirst. Love, Money, Rock’n’Roll\nDid you know The Entity has a beach Realm? Not many do. Explore multiple locations, both spooky and serene, on this island paradise at the edge of eternity. Romance different characters with each playthrough to visit new, exciting areas as you enjoy cameos from a few familiar faces along the way. Flirt with 4 completely different, yet equally tantalizing Dead by Daylight Killers. Choose the right words to help them shed their inhibitions, while unlocking deeply intimate sides of their personalities.\nEarn multiple unique endings for each Killer, from passionate true love, to platonic friendship, to bitter loathing. Just like real dating Prove yourself to your paramour by mastering a series of flirtatious minigames to advance the plot. Answer quizzes, hunt for treasure, carve meat, and more, earning praise or scorn based on your performance.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/hooked-on-you-a-dead-by-daylight-dating-sim-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/hooked-on-you-a-dead-by-daylight-dating-sim-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core 2 Duo E6550, 2.33 GHz or AMD Athlon 64 X2 6400+",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce 9800 GT, 1 GB or AMD Radeon HD 6670, 1 GB",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Psyop",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.16.11 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/b58zz9l54glt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/hooked-on-you-a-dead-by-daylight-dating-sim-preinstalled-steamrip.jpg"
}