{
    "page_url": "https://steamrip.com/horizon-chase-2-free-download-k1/",
    "title": "Horizon Chase 2 Directly Download",
    "description": "Horizon Chase 2 is the evolution of the award-winning racing franchise. Born under the arcade sign, this game fulfills your senses through immersive and high-speed gameplay. This is the golden era of arcade racing brought to life over a modern and completely evolved experience. Axis Football 2024\nThe classic 90’s signature gameplay keeps you in complete control of your cars at all times. Forget complex setups: you are one tick away from overtakes, forks, and nitrous. Surpass your rivals in the blink of an eye. Easy to play, but hard to master, this game demands sharp racing skills and quick reflexes to beat your opponents and cross the finish line.\nPlay every game mode with your friends! Join them on the couch with the split-screen multiplayer or assemble an Online Crew to race for bragging rights. You can decide to compete head-to-head for glory or progress together in the World Tour. No matter where you are, it’s Arcade racing for everyone.\nUnleash the thrill of competition with Playground, our adrenaline- fueled game mode designed for ultimate online racing and exhilarating challenges. Take on opponents from multiple locations in heart-pounding Online Races. Test your mettle with electrifying Challenges where every turn brings new surprises. Step into the driver’s seat, embrace the competition, and let your racing prowess shine in the Playground.\nRace through an entirely 3D world, each turn revealing a distinct artistic style. Soak in the pulsating hues of each terrain, from sunlit plains to thunderous storm clouds, all enhanced by a soundtrack from the legendary Barry Leitch. This game takes arcade play and morphs it into an artistic marvel. New horizons will steer you to the beauty of a stunning and inviting visual trip and there’s no turning back.\nRed or blue? Solid paint jobs or complex decals ? When visiting the Garage Shop, you can customize your car to match your own personal style. Unlock new cosmetic items, and upgrade your stats throughout the World Tour. Race all game modes to achieve your full collection of car customizations. Winning never felt so good.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/horizon-chase-2-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/horizon-chase-2-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Racing",
        "Developer": "Aquiris Game Studio",
        "Platform": "PC",
        "Game Size": "4.9 GB",
        "Released By": "CHRONOS",
        "Version": "Build 1.5.0_1305 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8yc44c8kmtz8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/horizon-chase-2-preinstalled-steamrip.jpg"
}