{
    "page_url": "https://steamrip.com/hot-dogs-horseshoes-hand-grenades-free-download-r1/",
    "title": "Hot Dogs, Horseshoes and Hand Grenades Directly Download",
    "description": "Do you like hot dogs? How about horseshoes ? Hand grenades? (everyone likes hand grenades) Anyway, we’ve got all that, and guns. SO MANY GUNS. So if you like ordnance, meat, and groan-worthy puns, this is the VR sandbox game for you.\nHot Dogs, Horseshoes and Hand Grenades (H3VR for short), is the heaping pile of our mad obsessive VR experiments. This is an impressionistically developed experience. We’re 6+ years and a 100+ updates in so far, so expect it to mutate, expand, contract, somersault, and occasionally explode along the way to final release.\nAssemble your ultimate range companion from nearly 500 Firearms and 250 Attachments. Customize your perfect loadout, be it tacti-cool or utterly cursed and save it for future play. (Coming Later This Year: Share your creations with your friends too) Try out your favorite platforms on H3’s suite of Firing and Demolitions ranges. Improve your aim and reaction time in the M.E.A.T.S. target shooting trainer and Compete on global leaderboards. SpongeBob SquarePants\nCombat some of the most sophisticated AI Agents in VR (yup, even though they’re hot dogs), at range or in melee. Dive into a Wiener’s Weird World; a land overtaken by confused but affable sentient meat and the ruins of bizarre firearm themed attractions . Experience an absurd fragmentary tale told through multiple genres of game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/hot-dogs-horseshoes-hand-grenades-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/hot-dogs-horseshoes-hand-grenades-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1 or later, Windows 10",
        "Processor": "CPU: Intel i5-4590, AMD FX 8350 equivalent or better",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1060/970, R9 290 equivalent or better",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Early Access",
        "Developer": "RUST LTD.",
        "Platform": "PC",
        "Game Size": "16.2 GB",
        "Released By": "N/A",
        "Version": "Build 18079396 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/cxs9ctc6atdv",
        "https://datanodes.to/ur3l3azjudrk/Hot-Dogs-HHG-SteamRIP.com.rar",
        "https://1fichier.com/?03hnby8vwly0irfsc4jv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/hot-dogs-horseshoes-hand-grenades-preinstalled-steamrip.jpg"
}