{
    "page_url": "https://steamrip.com/hot-wheels-unleashed-free-download-o1/",
    "title": "HOT WHEELS UNLEASHED",
    "description": "Get HOT WHEELS UNLEASHED PC game for free instantly and play pre-installed on SteamRiP\nProve your skills by competing in awesome races and get ready for pure fun Drift, charge the booster and launch yourself into spectacular loops. But be careful If you’re too slow gravity will do its job. The bigger the challenge, the greater the glory. Race side by side with your friends in split screen mode for 2 players or face up to 12 opponents in online challenges. Waiting to host your races are enormous interactive environments with their own distinguishing features , where every object can become an integral part of the track.\nUnleash your creativity with the most exciting track editor ever Build your track by taking advantage of what surrounds you, and create amazing layouts inside and outside the race course. Bend and stretch the iconic “orange piece”, add loops, special boosters , obstacles and special elements to make an incredible amusement park for your races. Furnish your own personal room with a huge number of elements that you will collect during your adventure and host the most amazing races inside it.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/hot-wheels-unleashed-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/hot-wheels-unleashed-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1 64-Bit or later",
        "Processor": "Intel Core i5-2500K / AMD FX-6350",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 960 / GeForce GTX 1050",
        "DirectX": "Version 11",
        "Storage": "22 GB available space"
    },
    "game_info": {
        "Genre": "Racing",
        "Developer": "Milestone S.r.l.",
        "Platform": "PC",
        "Game Size": "27 GB",
        "Repack By": "CODEX emu",
        "Version": "Update 29 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/eiktrmbx5rqd",
        "https://datanodes.to/ysisfq5hrac8/HOT-WHEELS-UNLEASHED-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/hot-wheels-unleashed-free-download-preinstalled-steamrip.jpg"
}