{
    "page_url": "https://steamrip.com/house-party-free-download-q3/",
    "title": "House Party Free Download Directly",
    "description": "Sweet news Your buddy Derek invited you to a rager at Madison’s house. Surrounded by a group of eccentric partygoers, you must navigate your way through the night no matter how wild it gets Step into a sandbox adventure party game where even your simplest choices can impact the game in a magnificent way. Explore thousands of unique branching narratives with fifteen distinct NPCs that react based on your every remark and action, paving the way for tons of hours of wild, steamy, and hilarious entertainment. House Party’s gameplay starts with the conversations and grows with the decisions made along the way.\nWith no true ending but dozens of stories to navigate , the night is what you make it. Explore a two-story house jam-packed with over fifty hidden items to discover, where every object has a purpose and some can be used in a variety of ways. Change the party’s music with the mp3 player, invite a surprise guest over with the laptop, get shitfaced drunk by drinking as much booze as you can find, and well, we’ll leave the most exciting surprises up to you to discover.\nShow these items to an NPC and they may react with varying dialogue or relationship fluctuations. If your end goal is sex, most of these hidden objects are vital for completing an NPC’s personal storyline and unlocking their steamiest scenes. And sometimes you don’t need any items to cause a ruckus. House Party is an adult game, and your character comes fully “equipped” to make plenty of chaos all on their own.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/house-party-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/house-party-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Intel Pentium G4500, AMD FX8350 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Direct X 11 GPU w/ 2GB Available Video Memory",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "Eek! Games, LLC",
        "Platform": "PC",
        "Game Size": "5 GB",
        "Released By": "GOG",
        "Version": "v1.4.2.13172 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/KMjkPp",
        "https://buzzheavier.com/uk0tmvpy0vt0",
        "https://megadb.net/8k7orsw0hbmh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/house-party-free-download-preinstalled-steamrip.jpg"
}