{
    "page_url": "https://steamrip.com/house-flipper-h2f/",
    "title": "House Flipper 2",
    "description": "It doesn’t matter if you’re a makeover veteran or if you’re only starting out – you’ll feel at home in no time House Flipper 2 introduces new mechanics and revamps the ones from the original game. The good old hammer, the trusty paint roller, and the sturdy mop, all await your return! The new visuals make our fixer-uppers look crisp as never before DUSK HD\nWhy renovate a house when you can just build one? Unleash your creativity in the Sandbox Mode Use it to recreate real-life buildings or design projects that exist in your imagination. Remember: building from scratch is no easy task! But let’s face it, it’s definitely worth putting in extra effort to design the house of your dreams.\nBetween the mountain tops and the endless sea, there lies the town of Pinnacove. A place where time slows down, and the friendly residents are ready to entrust you with their homes. Can you discover some of the stories within these walls? Your old pal Tom, who seems to know everybody in the neighborhood , will gladly share some local knowledge with you.\nDo you enjoy building? Choose the Sandbox Mode which allows you to construct houses from scratch. Or maybe you prefer cleaning and decorating? In the Story Mode, you will delve into long and engaging renovation projects, as well as deal with some quick jobs. Sit back and relax, here comes the new age of House Flipper.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/house-flipper-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/house-flipper-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "AMD Ryzen 5 1st gen / Intel Core i5 7th gen",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 580 4GB / NVIDIA GeForce GTX 1060 6GB",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Frozen District, Empyrean",
        "Platform": "PC",
        "Game Size": "12.1 GB",
        "Released By": "RUNE emu",
        "Version": "v1.9.2.0 Hotfix | Full  + Supporter Pack DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/HncWhx",
        "https://datanodes.to/nysck6i2p715",
        "https://buzzheavier.com/xdio6twznjh5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/house-flipper-2-preinstalled-steamrip.jpg"
}