{
    "page_url": "https://steamrip.com/house-builder-free-download-1s/",
    "title": "House Builder Directly Download",
    "description": "House Builder Download PC Game In Direct Link for free on SteamRIP\nLet us take you on a trip to various spots on the globe and experience true architectural variety. You will try to build a mud hut in Africa, an igloo in the Arctic, a Canadian house, a log cabin in Siberia, traditional house made of bricks, airbricks or concrete and many, many more Every house consists of hundreds elements you need to match according to rules of construction. See how the construction technologies differ from each other. Learn how to apply proper materials and procedures during building process.\nBuild houses brick by brick , element after element, down from the foundations and up to the roof. Learn different structures of buildings, construction materials, their features and properties. Build simple constructions made of primitive materials, but also ultramodern buildings featuring the latest technological discoveries. Use various tools depending on the situations and requirements. Improve your skills, use better equipment to be able to build complex structures quickly and efficiently.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/house-builder-free-download-screenshots-steamrip-1.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/house-builder-free-download-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1, Windows 10 (64-bit versions only)",
        "Processor": "Intel Core i5-2400 or AMD FX-6300 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 670 or AMD R9 270",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "FreeMind S.A.",
        "Platform": "PC",
        "Game Size": "17.2 GB",
        "Released By": "TENOKE",
        "Version": "Build 18886010 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/yn6AA6",
        "https://buzzheavier.com/wdkr5x1ra9k9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/house-builder-free-download-preinstalled-steamrip.jpg"
}