{
    "page_url": "https://steamrip.com/hrot-free-download-1x/",
    "title": "HROT Directly Download",
    "description": "HROT game for free instantly and play pre-installed on SteamRiP\nHROT is a single-player retro FPS set in a small socialist country neighboring Soviet Union ( Czechoslovakia ) after an unspecified disaster in 1986. Those times were dark and terrifying and so is the game. You start in a civil defense shelter deep under a Prague Metro station. As a proud holder of the military readiness badge you know what your duty is: put on a non-functioning gas mask, load the vz. Guns’n’Stories: Bulletproof VR\n52 pistol and protect the peace and your socialist homeland from the strange intruders *. The classic gameplay and vibe of romeric shooters from 1990s including a fitting brown retro aesthetic. You’ll find a shotgun, a vz. 13 SMG, a rocket launcher and even some secret experimental Soviet battery-powered weapons (e.g. a ball lightning launcher). If you run out of ammo, you might find the hammer and sickle coming in handy.\nHandcrafted levels inspired by real locations with an emphasis on historical details. Every level contains socialist paraphernalia which nowadays can only be found in museums or your grandma’s attic (Eastern Bloc only).",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/hrot-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/hrot-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP",
        "Processor": "2.5 GHz Dual Core",
        "Memory": "2 GB RAM",
        "Graphics": "Intel HD 4400",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Spytihněv",
        "Platform": "PC",
        "Game Size": "204 MB",
        "Released By": "CODEX emu",
        "Version": "v1.3 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uhmcfr80mc10"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/hrot-preinstalled-steamrip.jpg"
}