{
    "page_url": "https://steamrip.com/humankind-l2/",
    "title": "HUMANKIND",
    "description": "Get HUMANKIND PC game for free instantly and play pre-installed on SteamRiP\nHUMANKIND is a historical strategy game, where you’ll be re-writing the entire narrative of human history and combining cultures to create a civilization that’s as unique as you are. Combine up to 60 historical cultures as you lead your people from the Ancient to the Modern Age. Create and rule your own unique people by combining 60 historical cultures, from ancient times to the present day. Borderlands 3\nStarting the game as a small tribe in the Neolithic era, get to the ancient era as the Babylonians, then meet the ancient era in the guise of the Maya, enter the Middle Ages as the Umayyads, write the history of the New time on behalf of the British, and so on. Each culture brings its own characteristics to the gameplay, so the options for game scenarios are almost endless.\nFrom humble origins as a Neolithic tribe, transition to the Ancient Era as the Babylonians, become the Classical era Mayans, the Medieval Umayyads, the Early Modern era British, and so on. Each culture will add its own special gameplay layer, leading to near-endless outcomes. Face historical events, take impactful moral decisions, and make scientific breakthroughs . Discover the natural wonders of the world or build the most remarkable creations of humankind. Each game element is historically authentic. Combine them to build your own vision of the world .\nEach battle in HUMANKIND™ plays out like a mini turn-based board game on top of the actual world map. Unstack your armies and command each of your units, including the emblematic units of your culture and their special abilities. Construct siege weapons to besiege and occupy cities. Fight in large battles spanning multiple turns, and don’t hesitate to bring in reinforcements!\nIn HUMANKIND, you’ll be playing the leader of your society as an avatar that you create and customize! Your avatar will evolve visually over the course of the game as your civilization develops. You’ll also be able to level up your leader via a meta-progression system to unlock custom looks that you can showoff to strangers and friends alike in multiplayer matches up to 8 players.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/humankind-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/humankind-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 64-bit",
        "Processor": "Intel i5 4th generation / AMD FX-8300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 770 / AMD R9 290",
        "DirectX": "Version 11",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "AMPLITUDE Studios",
        "Platform": "PC",
        "Game Size": "16 GB",
        "Repack By": "RUNE",
        "Version": "v1.0.28.4623 | Full version + all DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/O0ASb9",
        "https://datanodes.to/rb8q0gxf1fpu/HUMANKIND-SteamRIP.com.rar",
        "https://buzzheavier.com/0d6eae0rtpht"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/humankind-free-download-preinstalled-steamrip.jpg"
}