{
    "page_url": "https://steamrip.com/huniepop-2-double-date-free-download-1c/",
    "title": "HuniePop 2: Double Date Download",
    "description": "Take a trip to an exotic island paradise for a steamy new adventure in this long awaited sequel to the popular dating sim / puzzle game hybrid, HuniePop! An era of darkness and destruction draws near as an ancient evil of limitless lechery, the Nymphojinn, will soon be awoken by a cosmic super-period of unspeakable PMS. Reunite with Kyu, your old love fairy sidekick, and travel to the island of Inna De Poona to develop your double dating prowess and overcome the insatiable lust of the demonic pair.\nA blend of old friends and fresh faces make up a twelve character cast, each with their own unique personality, problems and preferences Double dates encourage you to split your time and attention between two girls with an all new “Stamina” system Revamped gameplay systems create a stronger connection between the “Sim” and “Puzzle” portions of the game! Loads of new date gifts to give with a wide variety of strategic effects, and plenty of old ones too! A brand new “Baggage” system that introduces new twists and challenges as you progress on your dates! Explore the exotic island of Inna De Poona with over twenty touristic tropical locations to visit! A sweeping soundtrack inspired by a mix of seaside styles including Hawaiian, Caribbean and classic American surf rock",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/huniePop-2-double-date-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1)+",
        "Processor": "1.2 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX® 10 Compatible  Card",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Simulator, Indie",
        "Developer": "HuniePot",
        "Platform": "PC",
        "Game Size": "585 MB",
        "Released By": "GOG",
        "Version": "v1.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/13jnwxwbz9p9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/huniepop-2-double-date-free-download-preinstalled-steamrip.jpg"
}