{
    "page_url": "https://steamrip.com/i-am-legion-stand-survivors-free-download/",
    "title": "I Am Legion: Stand Survivors",
    "description": "Summon up to eight powerful stands and face waves of enemies together. Get ready for epic battles like never before. Each stand has unique skills and fighting styles: from the crushing blows of melee warriors to the dazzling spells of mages that light up the battlefield . Whether you prefer close combat or flashy magic, your stands’ powers make every fight thrilling!\nOver 100 different stands and loads of hero archetypes mean endless ways to build your dream team. Choose strength-based heroes with high-defense or attribute-boosting stands for an indestructible tank squad , or pick mage heroes to supercharge your spellcasters for massive damage. Your choice of heroes and stands will shape your unique combat style. Mix and match to discover countless strategies and keep every battle fresh and exciting!\nMine resources and forge powerful gear with random attributes . Combine identical items to create higher-level gear with evolving bonuses. Whether you favor attack, defense, magic, or physical builds, crafting gear always brings new surprises! Sell gear anytime with proportional ore refunds, and experiment with different gear to find your perfect upgrade path. Rogue: Genesia",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/i-am-legion-stand-survivors-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/i-am-legion-stand-survivors-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7+",
        "Processor": "2 Ghz",
        "Memory": "2048 MB RAM",
        "Graphics": "128MB, OpenGL 3+",
        "DirectX": "Version 11",
        "Storage": "350 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "JA Game Studio",
        "Platform": "PC",
        "Game Size": "129 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.4a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ynfxo891acgv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/i-am-legion-stand-survivors-preinstalled-steamrip.jpg"
}