{
    "page_url": "https://steamrip.com/i-am-future-free-download-1q/",
    "title": "I Am Future Cozy Apocalypse Survival Directly Download",
    "description": "You wake up on an overgrown skyscraper roof – not a living soul in sight. Cosmopolis , once a mighty array of metal and glass, lies shattered in ruins and flooded. Operation Wolf Returns: First Mission VR The decades-long struggle between UNICORP and the rival corporations pursuing transhumanism ideas seems to have been over for good when society collapsed. Now it is up to you to try and solve the mystery of the last days of civilization and your sudden awaking. Or you can just build your own future and enjoy the view of what remains of humankind.\nStarting from scratch on an empty roof, explore your surroundings, find the necessary resources, tools and gadgets.Old microwaves, rusty cars and antique computers – all will be handy! Carefully disassemble the devices to get the necessary details and put them to use for creating futuristic gadgets according to the blueprints you’ll get you hands on. By the way, have we mentioned that you will get to have a cyborg hand? Upgrade it too. Make some friends so you won’t get too lonely! Upload AI into buildings . Create bots that do your chores.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/i-am-future-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/i-am-future-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win10 x64",
        "Processor": "2-core / 4-thread CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 750ti",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Simulation, Strategy, Early Access",
        "Developer": "Mandragora",
        "Platform": "PC",
        "Game Size": "826 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.3.4.027r | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dztczfrex7wr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/i-am-future-preinstalled-steamrip.jpg"
}