{
    "page_url": "https://steamrip.com/i-expect-you-to-die-free-download-1p/",
    "title": "I Expect You To Die VR Free Download",
    "description": "Get I Expect You To Die VR for free instantly and play pre-installed on SteamRiP\n​​I Expect You To Die is a virtual reality puzzle game that places you in the well-polished shoes of an elite secret agent. You must attempt to survive deadly situations in immersive and dangerous locales. Complete each operation using problem-solving skills and wits oh, and the power of telekinesis that all our agents are equipped with. Use it and whatever resources you can find to escape each situation or die trying. Nidhogg\nIn the story, you will have to take control of a secret agent, who is always sent to the most dangerous missions. But the bottom line is that in his role you will not have to shoot enemies and create chaos, but survive by solving puzzles and sorting out situations that he constantly finds himself in during missions. In other words, this is not an action movie, but a real puzzle game in which you will have to use not dexterity and accuracy, but logical thinking and pure reason.\nThe best thing about this game is that its gameplay is based on virtual reality technology, thanks to which you can completely and completely immerse yourself in the atmosphere that reigns here. You will find yourself right in the body of a secret agent, you will personally feel everything that he feels, you will personally find yourself in situations that can sometimes lead to death, and you will experience on your own skin , as it is when your life hangs in the balance.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/i-expect-you-to-die-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/i-expect-you-to-die-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64 bit or newer",
        "Processor": "Intel i5-4590 equivalent or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R9 290 or greater",
        "Storage": "916.29 MB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Schell Games",
        "Platform": "PC",
        "Game Size": "635 MB",
        "Repack By": "SEWN",
        "Version": "v4211987 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fsyh3tbwlbr5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/i-expect-you-to-die-free-download-preinstalled-steamrip.jpg"
}