{
    "page_url": "https://steamrip.com/i-wani-hug-that-gator-free-download-i1/",
    "title": "I Wani Hug that Gator! Directly Download",
    "description": "Just great; just when Inco was getting ready to move on into his Senior year, his parents decide to uproot his life and move half-way across the country Guess it’s time to start all over. Sure, Inco didn’t have many friends (or any) back at his old school, and sure, he was so low on the social ladder that he had to get a deep-sea diving lesson\nI Wani Hug that Gator is a multi-ended, choices-matter visual novel about second chances and the power of accepting who you are. Shape how Inco makes the most of his final year, and how the relationships he makes along the way will develop. One relationship in particular has him feeling all fuzzy inside RC Revolution\nThe Prehistoric Romance a Million-and-One Years in the making If there’s one good thing to come out of Inco’s sudden relocation, it’s Olivia . Bold and brash, Olivia seems particularly gifted in getting under Inco’s skin. No matter how Inco slices it, he and Olivia seem destined to go together like a particularly scaly sandwich. But the outcome of such a pairing is yet to be determined\nWait, am I being graded on this?! Make friends, reconcile enemies, and figure out how Inco could possibly repair his miserable excuse for a social life. But be warned: The choices you make expands the relationships with Inco’s classmates and determines which of the four unique endings you receive. Maybe Inco should’ve spent a little less time studying and a bit more time learning how to relate to people",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/i-wani-hug-that-gator-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/i-wani-hug-that-gator-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Vista or higher",
        "Processor": "2.0 GHz Core 2 Duo",
        "Memory": "2 GB RAM",
        "Graphics": "OpenGL 2.0",
        "DirectX": "Version 9.0c",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie",
        "Developer": "Cavemanon",
        "Platform": "PC",
        "Game Size": "855 MB",
        "Released By": "TENOKE",
        "Version": "v1.7.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/znruuf9o7bjs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/i-wani-hug-that-gator-preinstatlled-steamrip.jpg"
}