{
    "page_url": "https://steamrip.com/icarus-free-download-1u/",
    "title": "ICARUS First Cohort",
    "description": "ICARUS First Cohort Survival game for free instantly and play pre-installed on SteamRiP\nICARUS is a session-based PvE survival game for up to eight co-op players. Endure a savage alien wilderness on Icarus, humanity’s greatest mistake. Survive its brutal environment as you explore, harvest, craft and hunt while seeking your fortune. Live Cohort omicron From their orbital station, prospectors drop to the planet surface for limited time sessions, where they learn to endure the alien environment, complete faction missions and search for valuable exotic materials .\nThose that survive return to orbit as seasoned veterans, omnicron converting their exotics into advanced technology, and taking on ever more challenging drops with newfound knowledge. Those that get left behind… are lost forever. Icarus was once destined to be a second Earth, but when terraforming collapsed – the air turned toxic and humanity’s hopes of colonizing a new world died. Icarus became a joke, a symbol of humanity reaching for the stars and failing. Yet when xeno- biologists discovered the cause of the failure – exotic matter – new interest was ignited. Valuable beyond reckoning, these ‘exotics’ sparked a gold rush, fueling political tensions on Earth, and bringing prospectors flocking to Icarus .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/icarus-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/icarus-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit versions)",
        "Processor": "Intel i5 8400",
        "Memory": "16 GB RAM",
        "Graphics": "Nvidia GTX 1060 6GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Simulation",
        "Developer": "RocketWerkz",
        "Platform": "PC",
        "Game Size": "30.8 GB",
        "Repack By": "Goldberg emu (InsaneRamZes)",
        "Version": "v2.1.9.118433 + 11 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/iZh6wn",
        "https://qiwi.gg/file/9Gnf7066-ICARUS-SteamRIP",
        "https://1fichier.com/?br7m6n5bjfs2zku8vlpr&af=62851"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/icarus-free-download-preinstalled-steamrip.jpg"
}