{
    "page_url": "https://steamrip.com/icbm-free-download-1r/",
    "title": "ICBM Directly Download",
    "description": "ICBM is a real-time strategy game of nuclear destruction. Research new technologies, build up your nuclear stockpile and use a combination of ships, planes and missiles to strike at the heart of your opponents’ cities while keeping your population safe from harm.\nTake command of one of the continents of the world and prepare yourself for global nuclear conflict. It is your job to ensure the complete and total destruction of your enemies, while you do all in your power to prevent enemy retaliation against your peace-loving citizens. BIT.TRIP RERUNNER\nResearch and develop your nuclear arsenal. Will you focus on developing new technologies, or mass producing existing ones? It takes a true strategist to research and build a balanced force that can deal with a multitude of enemy tactics.\nIn ICBM, you can try out different strategies every time you play. Will you overwhelm your enemy with intercontinental ballistic missiles? Use bombers to deliver massive payloads? Or maybe use submarines to deliver nukes from the least expected locations? These strategies and more can all be used to ensure victory. ICBM has 20 unit types and 12 nuclear weapon types to use, plus 44 technologies to explore.\nTake the time to carefully plan your next move, or just nuke your opponents as fast as you can. Increase the contamination speed for a swift and painless nuclear war, or slow it down for an endless nightmare . In ICBM, you can constantly adjust the game speed to your own pace.\nUse diplomacy to gain strategic advantages . Share information, technologies or even the location of your nukes with your allies to wage war against common enemies. Be aware however that these alliances do not have to last and you might find yourself fending off attacks by your former friends.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/icbm-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/icbm-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/10",
        "Processor": "4th Core i3 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Direct X Or OpenGL Compatible Video card",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "SoftWarWare, K-Project",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "GOG",
        "Version": "v1.02.03 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7cko3sjtt1wz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/icbm-preinstalled-steamrip.jpg"
}