{
    "page_url": "https://steamrip.com/icbm-escalation-free-download/",
    "title": "ICBM: Escalation",
    "description": "ICBM: Escalation is a grand RTS game that plunges players into the high-stakes world of global warfare , where every decision could tip the balance between survival and annihilation. Command vast armies, develop cutting-edge technology, and wield the most devastating weapons ever created to ensure your faction’s supremacy. Whether by conventional forces or through nuclear firepower, you’ll need to conquer or obliterate your enemies to secure dominance in a volatile global arena. Grocery Store Simulator\nCONVENTIONAL & NUCLEAR WARFARE Take charge of a continent-spanning faction and build up an unstoppable military force. Construct a nuclear stockpile, research groundbreaking tech, and deploy a combination of nuclear submarines, strategic bombers, and intercontinental ballistic missiles to cripple your adversaries. But nuclear warfare is not the only path to victory. ICBM: Escalation introduces new victory conditions that emphasize conventional warfare, allowing players to invade enemy territory, weaken their resources, and force their surrender through tactical superiority. The two new modes, Standoff and Conquest, add fresh layers of strategy and pacing compared to the high-speed Blitz Mode, which returns as the most similar mode to the original ICBM.\nRESEARCH & DIPLOMACY Progress through multiple technological eras, from early Cold War advancements to near-future innovations, including stealth warships and space-based weapon systems. The revamped diplomacy system adds new layers of intrigue, allowing players to form research agreements, negotiate ceasefires, and broker deals over captured territories. World-spanning diplomatic measures, such as international treaties banning specific weapons, offer fresh strategic possibilities that can reshape the course of global conflict.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/icbm-escalation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/icbm-escalation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 10/11",
        "Processor": "4-core CPU",
        "Memory": "8 GB RAM",
        "Graphics": "GPU GTX 970",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "SoftWarWare",
        "Platform": "PC",
        "Game Size": "4.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7v9mpww8hsrf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/icbm-escalation-preinstalled-steamrip.jpg"
}