{
    "page_url": "https://steamrip.com/idigging-free-download/",
    "title": "iDigging",
    "description": "iDigging is an exciting cooperative (up to 5 people) first-person game with bright , stylized, cute graphics where you play as a protagonist who decides to challenge the rules and laws. In this game, you’ll dig your way to success despite the bans and threats. Doloc Town\nThe life of your character is not going well: his wife left him for the neighbor because he has no job and no money, and his house is empty. However, one day, the main character decides to change his life. In the game world, there is a strict ban on digging on your own property — all underground resources belong to the state since someone found treasure buried beneath the ground . But our hero decides to find this treasure and regain his status.\nYou can dig endlessly in your backyard , exploring different layers of soil to find valuable resources and useful items such as furniture for your house, accessories, metals, jewels, and much more. Everything you find can be sold to earn money and improve your home, making it a cozy place to live. The more you dig, the better your life becomes, and the more you surpass your neighbor who lives nearby.\nHowever, your neighbor isn’t that simple. He constantly spies on you and might call the police if he notices anything suspicious . The police come regularly to check if you’ve been digging, and if they find any traces, you’ll be in big trouble. You’ll have to use your wits and various tools to hide your actions and conceal the dug holes from prying eyes. To do so, you can use camouflage carpets, upgrade your digging tools, and employ other tricks.\nThroughout the game, you’ll be able to improve your tools, starting with simple shovels and pickaxes and advancing to powerful mechanical devices like drills or dynamite. You’ll also have access to various bombs and even guard dogs to protect you from the pesky neighbor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/idigging-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/idigging-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 11",
        "Processor": "Intel Core i3 / AMD Athlon II X3",
        "Memory": "2000 MB RAM",
        "Graphics": "NVIDIA Geforce GTX 660 / ATI Radeon HD 7850",
        "Storage": "1600 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation",
        "Developer": "TWEN",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yfusxeytiwmf",
        "https://buzzheavier.com/j5fano3zy3bt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/idigging-preinstalled-steamrip.jpg"
}