{
    "page_url": "https://steamrip.com/immortals-of-aveum-free-download/",
    "title": "Immortals of Aveum",
    "description": "Immortals of Aveum is a single-player first person magic shooter that tells the story of Jak as he joins an elite order of battlemages to save a world on the edge of abyss.\nWith legions of soldiers on both sides of the Everwar, he must uncover the mysteries of Aveum’s troubled past, if there’s any hope for saving its future. Riders Republic\nMaster three forces of magic and unleash spells with deadly skill in a game that defies FPS conventions.\nBe The Battlemage Join the order of Immortals, the champion protectors of Lucium , and become Jak, an elite Triarch Magnus.\nMaster Your Magic Fast, fluid, first person spell-based combat that’s easy to learn and satisfying to master, where players are rewarded for clever chained attacks and well-timed counters.\nUnleash Your Arsenal of Spells Unlock and upgrade more than 25 spells and 80 talents. Discover, upgrade and craft hundreds of pieces of magical gear to synergize your playstyle across all three forces of magic.\nSave a World on the Edge of Abyss Jak and Lucium’s elite Immortals must race to uncover the mysteries of Aveum’s past, if there’s any hope of saving its future .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/immortals-of-aveum-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/immortals-of-aveum-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10 (64 bit) or later (Win 11 recommended for Intel 12th and 13th gen CPUs)",
        "Processor": "AMD Ryzen 5 2600X Intel Core i7-8700K",
        "Memory": "16(Dual-channel) GB RAM",
        "Graphics": "AMD Radeon RX 580 (8GB) NVIDIA GeForce GTX 1070 (8GB)",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Ascendant Studios",
        "Platform": "PC",
        "Game Size": "57 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.6.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/OLGYRR",
        "https://buzzheavier.com/4z8z65wvvkri"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/immortals-of-aveum-preinstalled-steamrip.jpg"
}