{
    "page_url": "https://steamrip.com/immortals-fenyx-rising-free-download-1n/",
    "title": "Immortals Fenyx Rising",
    "description": "Get Immortals Fenyx Rising PC game for free instantly and play pre-installed on SteamRiP\nImmortals Fenyx Rising is a fast-paced, cool third-person RPG action adventure in which you’ll have to travel to Ancient Greece and fight Typhon to save the Greek Gods The events of the game take place in the vastness of Ancient Greece, where the real chaos began to happen. Typhon, the ancient rival of the Greek Gods, broke free and now wants to destroy the Gods and enslave the world. Tetris Effect: Connected\nAnd everything can work out for him if you do not stand up to protect this world. Take a blade in your hands and start fighting, learn how to break the curse, how to defeat Typhon, and how to save the Gods along with the whole world here. Well, first of all, it would be worth saying that this game was created by the developers of “ Assassin’s Creed”, and that is why you will meet a lot of different mechanics in it, which were also involved in the series about assassins.\nFor example, you will have at your disposal something like “ Eagle Vision”, a rather familiar system of character leveling, towers with control points, only now in the form of statues and rocks, and not only. What the game really differs from its own kind is the combat system. The developers have worked with all their hearts on the combat system. And it’s worth noting that they managed to make it really unique and interesting. Here you will find fast dynamic fights, a sea of ​​different combinations of attacks based on numerous skills and the combined use of skills, and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/immortals-fenyx-rising-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "WINDOWS 7, 8, 10 (64-BIT Required)",
        "Processor": "Intel Core i5-2400 / AMD FX-6300",
        "RAM": "8 GB of",
        "Video card": "GeForce GTX 660 2 GB / AMD R9 280X 3 GB",
        "Free space on hard disk": "34 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Ubisoft",
        "Platform": "PC",
        "Game Size": "36.5 GB",
        "Repack By": "Mr_GOLDBERG emu",
        "Version": "v1.3.4 | Full  + Gold Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/3FD531F2D3",
        "https://buzzheavier.com/n8bpr90puoji",
        "https://1fichier.com/?jwzv9gpw0irhk7renga9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/immortals-fenyx-rising-free-download-preinstalled-steamrip.jpg"
}