{
    "page_url": "https://steamrip.com/in-silence-free-download-1u/",
    "title": "In Silence",
    "description": "In Silence game for free instantly and play pre-installed on SteamRiP\nIn Silence is being developed in order to provide a different online horror experience. You can hunt survivors as Rake by using your hypersensitive senses or play as a survivor yourself, use proximity voice chat and work together with other survivors to either escape Rake, or fight back. Rake’s vision depends on sound. The less sound there is, the less Rake’s able to see. Rake can hear the slightest bit of noise over huge distances and run at an incredible speed. With traits like these, It’s not hard to guess what Rake could do in the right hands.\nYou may be a heartbeat away from being face to face with a monster because of a step you took, a toy you stepped on, or a vase you broke But was it your plan all along? You could use noise that objects like a TV or a Radio make in order to distract Rake and escape the area, or maybe to set up a trap instead. As a Survivor, you have two choices. Either try to escape by repairing a car and leaving with it, or open a secret armory and hunt the monster down. Every match you’ll play is going to be different. Your perks, escape points, roles and the item placement will all be randomized . You will always feel uneasy because there’s no way to predict how the game will go. Watch_Dogs",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/in-silence-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/in-silence-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 – 64 bit",
        "Processor": "Intel i5 or new-gen i3 / AMD equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "2GB Video RAM",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Ravenhood Games",
        "Platform": "PC",
        "Game Size": "2.75 GB",
        "Repack By": "SEWN",
        "Version": "v1.01 | Updated  (Latest) + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/zaK020",
        "https://megadb.net/sojoghs8qcrj",
        "https://buzzheavier.com/msefv4pkya8t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/in-silence-free-download-preinstalled-steamrip.jpg"
}