{
    "page_url": "https://steamrip.com/incursion-red-river-free-download/",
    "title": "Incursion Red River",
    "description": "Incursion Red River is a tactical cooperative extraction shooter based in a de-stabilized Vietnam. As a contractor to private military organizations that stand to gain from the chaos of a war-torn country, you will engage in ruthless combat, discover dark secrets, and play to your advantage as the story unfolds.\nVietnam has fallen into a civil war. Gangs , militia and private military organizations churn the collapsed state to their own advantage, and require contractors to do their dirty work. Lies pollute the geopolitical state of Vietnam as factions churn the chaos for personal advantage. Infection Free Zone\nFrom 1950 to 1970, the Russian-backed People’s Liberation Army successfully defended Vietnam against American forces. Vietnam rebuilds and prospers over the next few decades, especially through arms exports, thanks to significant Soviet support. However, the Soviet Union’s collapse in 1990 leaves Vietnam vulnerable. Western economic infiltration and cultural transformation begins to shift Vietnam’s geopolitical landscape. By 2013, China’s interest in Vietnam intensified, resulting in the formation of a China backed Vietnam Communist Union Party. A front for a private military organization designed to sabotage Western influences .\nOver the next 2 years, covert and black-ops conflict between the US and China lead to Vietnam’s societal collapse. International intervention started in 2015 , but degraded over the next 3 years into conflict involving various PMCs and militias, driven more by profit and opportunism than by governmental allegiances, set against the backdrop of a once-prosperous country now engulfed in lawlessness and war.\nIncursion Red River lets you play with up to three of your friends. Complete contracts and challenges from three different PMCs to increase your reputation and rewards. Access the vendor to purchase limited quantities of weapons and gear. Whether you prefer to be scoped from afar or like keeping things close and personal, you choose how you get the task done. Shoot and loot your way through the tropics of Vietnam to gain influence and wealth, or die trying and lose it all.\nIncursion Red River provides the player with a balanced first-person experience that feels realistic, yet fun. Equipment and weapons influence ergonomics and combat playstyle, so you will need to pick your loadout carefully. Simulated ballistic systems affect weapons and have unique characteristics that can be adjusted with attachments. Bringing in the right gear, having a proper plan of attack, and emphasizing tactical plays will maximize the success rate for deployments .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/incursion-red-river-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/incursion-red-river-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64bit)",
        "Processor": "Intel Core i5-7600K / AMD Ryzen 5 1600",
        "Graphics": "NVIDIA GeForce GTX 1060",
        "DirectX": "Version 12",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Action, Early Access",
        "Developer": "Games Of Tomorrow GmbH",
        "Platform": "PC",
        "Game Size": "18.5 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.14.0 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ryqpqm09t69t",
        "https://gofile.io/d/cytDrg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/incursion-red-river-preinstalled-steamrip.jpg"
}