{
    "page_url": "https://steamrip.com/indoorlands-free-download-1r/",
    "title": "Indoorlands Directly Download",
    "description": "Build your own indoor amusement park, manage it and convince your visitors with individually designed halls, coasters and rides that you even can control yourself. Will you manage to exceed the needs of your visitors? You are the boss: Let your creativity run free and run your own customized park that fully immerse your guests into another world.\nYou always wanted to create your very own and unique ride and then control it? That’s now possible with the new “ Create your Ride” mode. Choose from a variety of components and create your very own flatride. Then share your creation with other players around the world in our workshop. My Gaming Club\nWith the latest update you can even create your own, huge rollercoaster halls with individual coaster tracks. Those are also shareable via STEAM workshop. Build, expand, and manage your own park. Take up the challenge and progressively unlock different types of halls, rides, decorations, shops and visitor types. Level up your buildings, choose individual perks and adjust price/quality, so your guests are ultimatively satisfied .\nYou can choose from a variety of themes and combine them freely – there are no limits to your creativity. Design your park piece by piece: Indoorlands makes a designer out of you with over 1000 decoration objects Your rides are the center of attention at Indoorlands . Not only can you control them and paint them individually, you can also record and save your own ride programs. Choose from your different ride programs and let them play automatically .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/indoorland-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/indoorland-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1+)/8.1/10 64bit",
        "Processor": "64-bit processor",
        "Memory": "4 GB RAM",
        "Graphics": "Dedicated graphics card with Shader Model 3.0 capabilities",
        "DirectX": "Version 10",
        "Storage": "2000 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Pixelsplit, Pixelsplit Simulations",
        "Platform": "PC",
        "Game Size": "602 MB",
        "Released By": "GOG",
        "Version": "v1.2.2f1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s7b8mrzv7tie"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/indoorland-preinstalled-steamrip.jpg"
}