{
    "page_url": "https://steamrip.com/industries-of-titan-free-download-q1/",
    "title": "Industries of Titan Directly Download",
    "description": "Industries of Titan is an industrial city building sim/strategy game set on Saturn’s moon, Titan. Create a sprawling industrial city and compete with other rival corporations to stake your claim to the industries of Titan. As the Founder of a new city-corporation, and backed by the unforgiving and mysterious Council, you’ve been granted new headquarters in Titan’s inhospitable atmosphere.\nThere, you’ll need to explore the ruins of a forgotten civilization while bearing the onslaught of ruthless rebels and competition from your corporate rivals. The Council expects much from you. Do you have what it takes to truly thrive? On Titan, precious construction materials and technological artifacts are locked away in ancient, massive ruins. SpellForce: Conquest\nUse these materials and artifacts to construct roads and transportation, build residences for citizens, power your city, and generate profit. Design your city, and expand from just a few devices to a massive metropolis Survey and salvage the ruins of a lost civilization for ancient artifacts Balance the needs of the Council, your city, your citizens, and your employees to produce a powerful, efficient economy\nDive inside your factories and kickstart your economy by building devices to refine resources. Grow your corporate empire on Titan one sector at a time via Campaign Mode. Sectors vary in terms of their environment, degree of rebel activity, Rivals you may encounter, and victory conditions, giving you a new scenario to tackle each time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/industries-of-titan-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/industries-of-titan-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-bit",
        "Processor": "3.2 GHz Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660, Radeon R7 370 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy",
        "Developer": "Brace Yourself Games",
        "Platform": "PC",
        "Game Size": "6.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h17fu8ib7njn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/industries-of-titan-preinstalled-steamrip.jpg"
}