{
    "page_url": "https://steamrip.com/infinitode-2-free-download-q1/",
    "title": "Infinitode 2 Tower Defense Free Download",
    "description": "Infinitode 2 Tower Defense Download PC Game In Direct Link for free on SteamRIP\nA strategy in the Tower Defense genre, in which the player will have to build towers to protect his base from endless waves of enemies. The player will be a volunteer in the Artificial Intelligence training program and will gradually discover new towers, abilities and ways to mine resources. The game has 6 game stages and 50+ unique levels with inimitable chiptune compositions, as well as a map editor. Live leaderboards at each level and unique bosses at the end of each stage .\nThe game has 15+ different types of towers with unique characteristics and skills, effective against different enemies. New towers become available during the passage of the storyline. Towers gain experience, which further increases their strength and allows the player to choose unique abilities. Each tower can be upgraded up to level 10, which improves its main characteristics. The game has modifiers that enhance the characteristics of neighboring towers, increase the speed of mining and give other bonuses .\n400+ unique research that unlock additional abilities and improve the stats of towers . Endless research tree is available in an Endless mode. At all levels, even custom ones, you can mine resources to research new technologies and improve characteristics . Miners are also improved by research and can bring nice bonuses.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/infinitode-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/infinitode-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "WINDOWS® 7, 8.1, 10 (64-BIT Required)",
        "Processor": "Intel Celeron G1840, AMD A6-9500 or better (2+ cores, 2.0 GHz+)",
        "Memory": "256 MB RAM",
        "Graphics": "Integrated – Radeon HD 6750, Intel HD  510 with 256 MB Video RAM or better",
        "DirectX": "Version 9.0",
        "Storage": "128 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Prineside",
        "Platform": "PC",
        "Game Size": "809 MB",
        "Repack By": "GOG",
        "Version": "v1.8.4 | Updated Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wvzkss08fv8u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/infinitode-2-free-download-preinstalled-steamrip.jpg"
}