{
    "page_url": "https://steamrip.com/infinity-strash-dragon-quest-the-adventure-of-dai-0w/",
    "title": "Infinity Strash: DQ The Adventure of Dai",
    "description": "The legendary DRAGON QUEST The Adventure of Dai manga and anime arrives as an exhilarating action RPG Relive the events of the anime in INFINITY STRASH as you take charge of Dai and the Disciples of Avan in their battle against the Dark Army Bond Memories: These items recreate iconic scenes from the original manga. Earn and equip them to augment your abilities according to your playstyle. ENDER MAGNOLIA\nTemple of Recollection : Play through over 100 room combinations in the endless dungeon, where monsters and traps change each time you enter. Hack and slash through hordes of enemies to reach the final floor. It has been many years now since The Hero restored peace to the land In a world tormented by the forces of evil, a swordsman and his companions set out to defeat Hadlar, the Dark Lord.\nOn an isolated island in the southern seas, a boy named Dai lives among monsters,yearning to become a hero himself someday. Everything changes when the Dark Lord is revived. With a new crisis facing the world, Dai makes a promise to his mentor, encounters new friends, and slowly learns about his own inescapable fate. This is the beginning of Dai’s adventure , and his quest to become a true hero",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/infinity-strash-dragon-quest-the-adventure-of-dai-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/infinity-strash-dragon-quest-the-adventure-of-dai-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 / 11 64-bit",
        "Processor": "AMD Ryzen3 1200 / Intel® Core™ i5-3330",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ RX 560 / NVIDIA® GeForce® GTX 950",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Square Enix, GameStudio Inc., KAI GRAPHICS INC.",
        "Platform": "PC",
        "Game Size": "12.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/9CA8009E10",
        "https://buzzheavier.com/mt1jpa6f7sys",
        "https://megadb.net/3dqp12x1m5dw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/infinity-strash-dragon-quest-the-adventure-of-dai-preinstalled-steamrip.jpg"
}