{
    "page_url": "https://steamrip.com/infraspace-free-download-1s/",
    "title": "InfraSpace",
    "description": "Out on the edges of human space, you can’t build a city by spending credits . Instead, you’ll have to put your first astronauts to mining work and get some raw materials. Once you have some iron, carbon, sand, and sulfur, it’s time to set up your first steel mill and concrete factory to start laying down some infrastructure.\nEven necessities like food and oxygen require a steady production chain that must not be broken InfraSpace simulates every. single. car. Each resource you ever produce needs to be transported to a factory for processing and each product needs to go to a habitat for consumption.\nYour road network can handle a lot, but without your oversight it will grind to a halt and drown in traffic eventually. Build highways, roundabouts, and multi lane roads to ensure the production heart of the city keeps beating. Your first colonists will be astronauts, the best and the bravest humanity has to offer. Give them food and shelter and they’ll keep your outpost running no matter what.\nAs your settlement grows, you need to cover the increasing workload by employing scientists and engineers, which require a few more creature comforts. Any city of sufficient size will sooner or later be home to more and more families as well, so make sure your schools can handle it and you are able to deliver the latest VR-edutainment products as well.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/infraspace-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/infraspace-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 10",
        "Processor": "Intel i5",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 4000",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Dionic Software",
        "Platform": "PC",
        "Game Size": "2.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.2.359 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/r7sqfpaqdh9i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/infraspace-free-download-preinstalled-steamrip.jpg"
}