{
    "page_url": "https://steamrip.com/inside-the-backrooms-free-download-1y/",
    "title": "Inside the Backrooms Directly Download",
    "description": "Inside the Backrooms is a Co-op online horror game up to 3 players, where you and your friends will fight to escape from the different levels of the backrooms, solving different puzzles with different mechanics in each one. This game is based on the famous creepypasta with many real references implemented such as iconic entities and important elements. Offroad Horizons: Arcade Rock Crawling\nYou will have to explore each room, look for elements that help you to continue advancing throughout the game and unlock new areas, but the further you go, more dangerous it will be, you must pay close attention in the area, identify each entity and know how to avoid them if you want to survive. Look for supplies, store them in your inventory, explore all the rooms, solve puzzles, unlock areas of the map, interact, try to collect everything you find. The main objective of Inside the Backrooms is to engage players with its gameplay, difficulty and atmosphere. There are countless identical rooms with an old, dirty carpet and pale yellowish walls, where at first glance it gives you a gloomy and bad feeling where you realize that it is not a safe place.\nThe game currently has 4 levels, each level is huge and is designed to be more difficult than the previous one and each one with different puzzles and mechanics. The game is compatible with VR for those who want to live the most terrifying experience in the backrooms, If you have an Oculus Quest device you can’t miss the experience of being trapped in the backrooms in virtual reality.\nIn this game you will find several entities, currently 6 entities, all based on the original creepypasta , each entity will have different ways of attacking and manifesting, so it will be important to know it’s behavior of each of these and avoid at all costs that several entities finds you at the same time, if this happens, you will have a bad time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/inside-the-backrooms-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/inside-the-backrooms-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit or higher",
        "Processor": "Intel Core i5-2300 2.8 GHz / AMD FX-6300, 3.5 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 760, (2 GB VRAM) | AMD Radeon HD 7870, (2 GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Early Access",
        "Developer": "MrFatcat",
        "Platform": "PC",
        "Game Size": "7.9 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v0.5.3 | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/inqLvK",
        "https://datanodes.to/ahk0lkw389ch/Inside-the-Backrooms-SteamRIP.com.rar",
        "https://megadb.net/ecijc0vmghrt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/inside-the-backrooms-preinstalled-steamrip.jpg"
}