{
    "page_url": "https://steamrip.com/inside-free-download-1w/",
    "title": "INSIDE",
    "description": "INSIDE Download PC Game In Direct Link for free on SteamRIP\nAfter the success of “ Limbo ” the German studio “ Playdead ” took up the creation of a new game. In “Inside” the player becomes a boy living alone in a colorless world. In the new game, the player will have to go through a difficult path, solving riddles and puzzles , avoiding deadly traps and trying to survive.\nIn the game, there are semi-flooded rooms in a scientific complex, the environment of which exacerbates the already gloomy world of “Inside”. Detailed scenes of distorted physics and sudden twists in the storyline will blow your mind.\nThe world “Inside” will place the player in a repulsive , but alluring, eerie, and sometimes disgusting secret game reality, where only the best can cope with their fears and survive. Hunted and alone, a boy finds himself drawn into the center of a dark project.\nTry Playdead’s award-winning indie adventure game. INSIDE is a dark, narrative-driven platformer combining intense action with challenging puzzles. It has been critically acclaimed for its moody art style, ambient soundtrack and unsettling atmosphere.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/inside-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/inside-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 (64-bit  required)",
        "Processor": "Intel Core 2 Quad Q6600 @ 2.4 GHz, AMD FX 8120 @ 3.1 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GT 630 / 650m, AMD Radeon HD6570 or equivalent",
        "DirectX": "Version 9.0c",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Playdead",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "GOLDBERG",
        "Version": "v13.08.2021 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ku3wlhzj88ou"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/inside-preinstalled-steamrip.jpg"
}