{
    "page_url": "https://steamrip.com/instruments-of-destruction-free-download-p1/",
    "title": "Instruments of Destruction Directly Download",
    "description": "Instruments of Destruction features an advanced physics -based destruction system. You can demolish every structure in the game piece by piece thanks to a fully interactive physics system, and every object in the world interacts with the destruction in some way.\nThe game also features an advanced GPU -driven particle system and GPU-driven grass and surface rocks. Each element of the world complements the destruction system and interacts with each other and together they create a physical, visceral world to play with. Build a vehicle your way, with an ever-expanding array of parts and pieces. Dealer’s Life 2\nUsing an intuitive vehicle construction system that also lets you customize your vehicles’ appearance and controls, you’ll always have fun creating your next awesome invention . From simple splitters and joints to fully-simulated treads and ropes, a large variety of parts are available to start the game, while more advanced parts (like giant chainsaws and rocket thrusters) unlock by playing the game. Each new part unlocks countless new possibilities, and you’ll also unlock numerous pre-built vehicles that highlight the unlocked parts and provide inspiration for further experimentation .\nWhile some vehicles will perform better than others in accomplishing your objectives, it’s always a bit more fun to get creative and go a little off script. Optional bonus objectives and other hidden bonuses will reward more creative builders and add further replayability. Each island features 3 modes of play (Normal, Challenge, and Expert), plus Sandbox mode lets you play with no limits and even more control over how the world behaves.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/instruments-of-destruction-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/instruments-of-destruction-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "4-core 1.5+GHz processor",
        "Memory": "8 GB RAM",
        "Graphics": "card with 2GB RAM (Geforce 780 or better)",
        "DirectX": "Version 11",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation, Strategy",
        "Developer": "Radiangames",
        "Platform": "PC",
        "Game Size": "956 MB",
        "Released By": "TENOKE emu",
        "Version": "v1.11c | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4744g9u8td4f"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/instruments-of-destruction-preinstalled-steamrip-1.jpg"
}