{
    "page_url": "https://steamrip.com/insurgency-sandstorm-free-download/",
    "title": "Insurgency: Sandstorm",
    "description": "Insurgency: Sandstorm is a team-based, tactical FPS based on lethal close quarters combat and objective-oriented multiplayer gameplay. Sequel to the indie breakout FPS Insurgency, Sandstorm is reborn, improved, expanded, and bigger in every way. Experience the intensity of modern combat where skill is rewarded, and teamwork wins the fight. Prepare for a hardcore depiction of combat with deadly ballistics, light attack vehicles, destructive artillery, and HDR audio putting the fear back into the genre. [REDACTED]\nAn intense atmosphere putting the terror into modern combat Move with speed and caution as you push through the war-torn environments of a fictional contemporary conflict in the Middle East. Death comes fast, ammunition must be carefully managed, and the environment must be tactically navigated at every step toward victory .\nInsurgency: refined and expanded For the first time in an Insurgency game, customize your character to show your veterancy with diverse sets of clothing, uniforms, accessories, and character voices. Coordinate fire support with your team, engage enemies with vehicle mounted machine guns, and go head to head in small scale high speed PvP and co-op matches. Wield new weapons and new upgrades to outmaneuver , outflank, and outsmart the enemy.\nWar at its realest Continuing Insurgency’s acclaim as the most atmospheric shooter, Sandstorm is built on Unreal 4 to bring its gritty close-quarters combat into a whole new era of realism. Skill is rewarded, and survival is paramount . Feel every bullet, and fear every impact.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/insurgency-sandstorm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/insurgency-sandstorm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/8/10 (64 bits)",
        "Processor": "Intel Core i5-4440 (3.10GHz)/AMD FX-6300 (3.50GHz)",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760/AMD Radeon HD 7970",
        "DirectX": "Version 11",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "New World Interactive",
        "Platform": "PC",
        "Game Size": "23.3 GB",
        "Released By": "Mr_GOLDBERG | Ty Christsnatcher",
        "Version": "v1.17.0.343179 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/8W18N4",
        "https://buzzheavier.com/cbbp2je6cwhf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/insurgency-sandstorm-preinstalled-steamrip.jpg"
}