{
    "page_url": "https://steamrip.com/into-the-radius-2-free-download/",
    "title": "Into the Radius 2",
    "description": "Dive into the eerie world solo, immersing yourself in a solitary and haunting experience. Or, assemble a team of up to two players in Early Access (and up to four players by Full Release) and venture into the depths of uncertainty, bravely confronting the dangers of the Radius as a united force.\nIn Into the Radius 2, each weapon has been meticulously crafted with incredible attention to detail. Each firearm has its own unique handling and characteristics, making your gameplay truly immersive and authentic.\nNot only will you have a wide array of classic and modern firearms at your disposal, but you can also customize them to match your preferred playstyle. Attachments, optics , stocks, and more can be personalized to create the perfect weapon for you. shapez 2\nRemember that if you want to harness the full power of these weapons, it’s crucial to stay on top of their maintenance. Make sure to clean and take care of your firearms regularly, ensuring they’re always in top-notch condition to tackle the challenges head-on.\nIn a surreal world ravaged by monstrous creatures and unforgiving terrain , survival is your ultimate goal. Scrounge for resources, defend yourself against dreadful enemies, and strategically manage your equipment to outlast the odds.\nThe Player Base, your haven amidst the chaos, provides a central hub to craft, trade , and plan your next move. Use your hard-earned loot to acquire essential gear, but choose wisely, for every item has its value.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/into-the-radius-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/into-the-radius-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel i5-7600k | Ryzen 5-3600",
        "Memory": "16 GB RAM",
        "Graphics": "Nvidia RTX 2060",
        "VR Support": "OpenXR; Important Note: HTC Vive Wands Not Supported",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation, Early Access",
        "Developer": "CM Games",
        "Platform": "PC",
        "Game Size": "12.2 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "Build 15366104 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/PC25ID",
        "https://megadb.net/uelga8rfhyof"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/into-the-radius-2-preinstalled-steamrip.jpg"
}