{
    "page_url": "https://steamrip.com/into-the-radius-vr-free-download-1w/",
    "title": "Into the Radius VR Download",
    "description": "Into the Radius VR Download PC Game In Direct Link for free on SteamRIP\nInto the Radius is a single-player survival shooter developed exclusively for Virtual Reality headsets. Stalk through the surreal post-apocalyptic Pechorsk Radius Zone where physics-based interaction, realistic weapon handling, and moody atmosphere will get your adrenaline pumping as you struggle to survive in an unforgiving dystopian environment. Open-world exploration , climbing, stealth, and a dynamic day/night cycle. This creepy immersive VR survival shooter is inspired by ‘Roadside Picnic’ In 1987 the ‘Pechorsk Event’ changed everything for the quiet Soviet mining town. Ranch Simulator\nLocals described the event as a short earthquake , which caused clouds of dust to rise into the sky, reducing visibility to almost nothing. After the dust settled, they stated seeing a huge dark-red orb in the sky, with black ash floating around the area. By 2002, The United Nations Pechorsk Special Committee (UNPSC) still administers the exclusion zone around the Pechorsk Radius, and no one is allowed to enter aside from the UNPSC specialists. Inside, it has been almost completely abandoned and stands as an isolated and blighted territory. Rumors, conspiracies, and legends continue to emerge – alluding to wondrous artifacts, deadly anomalies, and bizarre entities that inhabit the once quiet mining region .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/into-the-radius-vr-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/into-the-radius-vr-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Graphics": "Geforce 1070 6 GB",
        "DirectX": "Version 11",
        "Additional Notes": "For Rift, Rift S or Vive"
    },
    "game_info": {
        "Genre": "Indie",
        "Developer": "CM Games",
        "Platform": "PC",
        "Game Size": "8 GB",
        "Repack By": "VREX",
        "Version": "v1.05526 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/q96an8bju5ee",
        "https://1fichier.com/?f0sri0j3p0qbogvnfh19",
        "https://megadb.net/ddo96k84p329"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/into-the-radius-vr-preinstalled-steamrip.jpg"
}