{
    "page_url": "https://steamrip.com/inzoi-free-download/",
    "title": "inZOI",
    "description": "inZOI invites players to step into the role of a master storyteller, crafting entire worlds and the lives within them. More than just a simulation, this game aims to highlight the beauty and depth of everyday experiences, encouraging players to find meaning in the unfolding narratives. Characters, known as Zois, live with genuine autonomy, forming relationships and making choices that lead to unexpected consequences like spreading rumors or adapting to evolving trends.\nYou’ll shape the cities they inhabit, drawing inspiration from real-world locations and manipulating elements like weather and architecture to create the perfect stage for your stories, all rendered in stunning detail thanks to Unreal Engine 5. AI Limit\nUnleash your imagination with inZOI’s incredible customization tools. Design unique Zois from head to toe, with over 250 options to tweak everything from their physical appearance to their fashion sense. Build personalized homes and businesses, mixing and matching architectural features and decorating interiors with an array of customizable furniture . Bring your characters to life with facial and motion capture, allowing you to create dynamic videos that showcase their stories.\nFurthermore, inZOI utilizes on-device generative AI, enabling you to use text prompts to create custom patterns for clothing, props, and furniture , or even transform 2D images into 3D objects. With limitless creative freedom, the possibilities are truly endless.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/inZOI-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/inZOI-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel i5 10400, AMD Ryzen 5 3600",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA RTX 2060 (6G VRAM), AMD Radeon RX 5600 XT (6G VRAM)",
        "DirectX": "Version 12"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Simulation, Early Access",
        "Developer": "inZOI Studio",
        "Platform": "PC",
        "Game Size": "22 GB",
        "Released By": "RUNE",
        "Version": "v20250701.5443.W | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/IFHy4F",
        "https://datanodes.to/4d3jx8nui8uh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/inzoi-preinstalled-steamrip.jpg"
}