{
    "page_url": "https://steamrip.com/iron-lung-free-download/",
    "title": "Iron Lung",
    "description": "Iron Lung is a short dread-driven submarine horror game from the developer of DUSK, The Moon Sliver, and Squirrel Stapler .\nSet entirely within a claustrophobic one-man submarine nicknamed the “Iron Lung,” you must blindly navigate an ocean of blood to take photographs of key locations, and hope whatever lives below doesn’t find you.\nThere is only a single porthole on the sub, and it needs to be closed due to depth pressure, so you have to navigate purely via an incomplete map, proximity sensors, sound, and a primitive external camera which can be used to take the pictures you need to complete your mission, or to get a grainy low resolution visual of what’s happening outside.\nSuccess will require resourcefulness and patience.\nDecades ago, every known star and habitable planet mysteriously vanished, along with whatever and whoever happened to be on them, leaving behind an empty universe of asteroids and lifeless moons where the only remnants of humanity are those who were on space stations or starships at the time. With supplies gradually dwindling and infrastructure falling into disrepair, the survivors have spent the subsequent years frantically searching for any trace of remaining natural resources. Up until now they have been unsuccessful…\nThen, a mysterious anomaly known as a Blood Ocean (which is exactly what it sounds like) was discovered on an otherwise barren moon. It’s not the first Blood Ocean found since the vanishing, but initial scans show a collection of potentially useful anomalous locations in a deep undersea (underblood?) trench that require further investigation. Casino Simulator",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1846170/ss_88dfadc6433914520fa9b48c91260bd5a1251c27.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1846170/ss_2356416dc8749fb2ec956e83b7b714dab974b69a.600x338.jpg",
        "https://buzzheavier.com/h4twz7mbm7g6"
    ],
    "system_requirements": {
        "OS *": "Windows 7/8/9/10",
        "Processor": "Any made within the last decade",
        "Memory": "1 MB RAM",
        "Graphics": "Any made within the last decade",
        "Storage": "200 MB available space",
        "Sound Card": "Any",
        "Additional Notes": "You can run this"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation",
        "Developer": "David Szymanski",
        "Platform": "PC",
        "Game Size": "263 MB",
        "Released By": "Goldberg + Likulau CSF",
        "Version": "Build 12439138",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/h4twz7mbm7g6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/Iron-Lung_featured_final.jpg"
}