{
    "page_url": "https://steamrip.com/iron-meat-free-download/",
    "title": "Iron Meat",
    "description": "Iron Meat is a fast-paced, run-and-gun shooter that immerses players in a world overrun by The Meat–an all-consuming interdimensional biomass. With a mix of classic arcade and console mechanics, players will battle against mutated victims and machines, dodge bullet barrages, and crush bosses in nine levels of gore-ific brutality. As Vadim, fight back against The Meat and stop the terrors spawned from scientist Yuri Markov’s experiments on the Moon. G.I. Joe: Wrath of Cobra\nMULTI-PHASE BOSS FIGHTS Iron Meat pays homage to classic run-and-gun titles from the past, with intense boss fights fixed into multiple phases. With three difficulty settings to choose from, players can put their skills to the test, where a higher difficulty is rewarded with an even more challenging boss battle .\nMULTIPLAYER COUCH CO-OP Who says you have to take on The Meat invasion alone? With 2-player couch co-op, you can grab a buddy to leave a trail of bloody , Meat-infected corpses together! It’s double the firepower, double the carnage, and double the MEAT!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/iron-meat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/iron-meat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-Bit",
        "Processor": "Intel Core i5-4300 or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Integrated GPU",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Ivan Valeryevich Suvorov, Retroware",
        "Platform": "PC",
        "Game Size": "416 MB",
        "Released By": "SKIDROW",
        "Version": "Build 15226694 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/88soyzdg1z60"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/iron-meat-preinstalled-steamrip.jpg"
}