{
    "page_url": "https://steamrip.com/isles-of-sea-and-sky-free-download/",
    "title": "Isles of Sea and Sky",
    "description": "You awaken as a castaway on an untouched, unfamiliar island with no memory of how you arrived and unsure what to do next. Explore ancient islands, forging your own path as you uncover hidden secrets, solve compelling block-pushing puzzles, and unearth a mystifying narrative in this puzzle adventure game. With no set path or order, you determine your fate and decide which puzzles you want to solve first. Paper Trail\nGet stuck on a specific puzzle? Isles of Sea and Sky is open world and nonlinear , giving you the freedom to come and go as you please to specific puzzles, new areas, or return to old areas with a new perspective, allowing you to progress further in the game. Immerse yourself in the vibrant , serene, and retro-inspired atmosphere while discovering and unleashing extraordinary powers, gathering collectables, and awakening delightful new friends along the way.\nStay on your toes because unexpected elements spring to life or offer assistance when you least expect it. Discover a rich, memorable and universal narrative centered around the myth of creation, told only through imagery with no text.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/isles-of-sea-and-sky-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/isles-of-sea-and-sky-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel or AMD dual core",
        "Memory": "512 MB RAM",
        "Graphics": "DirectX9 or later compatible.",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Cicada Games",
        "Platform": "PC",
        "Game Size": "325 MB",
        "Released By": "CHRONOS",
        "Version": "v1.0b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uahq3qi4dpbg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/isles-of-sea-and-sky-preinstalled-steamrip.jpg"
}