{
    "page_url": "https://steamrip.com/isonzo-free-download-2q/",
    "title": "Isonzo Directly Download",
    "description": "World War One expands to the mountains of the Italian Front – beautiful but deadly in equal measure. Inspired by the two year struggle for control of the Isonzo river valley and the Alps during World War One, Isonzo elevates the WW1 Games Series, figuratively and literally. From the makers of Verdun and Tannenberg The new Offensive game mode puts you right in the middle of key historical offensives on the Italian Front. Lead the charge across stunning Italian landscapes as you choose your path to victory – cut paths through barbed wire, flank your enemies by following mountain trails, or man a mortar to blast a way through.\nShape a dynamic battlefield by laying sandbags and wire, placing ammo crates, deploying trench periscopes or sniper shields, and more. Take part in historical offensives from the Sixth Battle of the Isonzo to the Strafexpedition. Reflecting the course of the actual battles, as the attackers advance the fighting will shift through vastly different landscapes within a single offensive: from hillside fortresses to mountain trenches and fierce urban combat on city streets. RPG Time: The Legend of Wright\nEverything is recreated based on research and field trips, from sound effects and uniforms down to the houses, vineyards and trenches you’ll be fighting over. Call in support with a unique historically accurate flare system: flare guns can mark targets for artillery or biplane flybys, or different colored flares can be used to guide your team.\nOnce the big guns have softened up the enemy, finish the job at close quarters with an Arditi dagger or mountaineer’s pickaxe. Man heavy machine guns, mortars and even mountain guns for more direct fire support. Choose from six classes based on historical combat roles and build your loadout from a selection of weapons, equipment and perks linked to that class, giving flexibility and variety while staying grounded in what real soldiers might have carried. You’ll be operating wire cutters, bandaging yourself and wounded teammates, and blowing the whistle to start an assault. One shot can kill and even lighter injuries can lead to quickly bleeding out.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/isonzo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/isonzo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-Bit",
        "Processor": "Intel Core i5-4670K, AMD Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 970, AMD Radeon R9 290, 4GB VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Massively Multiplayer, Simulation, Strategy",
        "Developer": "M2H, BlackMill Games",
        "Platform": "PC",
        "Game Size": "14.2 GB",
        "Released By": "Goldberg",
        "Version": "v509.56308 (Build 15895330) + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/aGeW0T",
        "https://megadb.net/5d416s8okgcr",
        "https://buzzheavier.com/t8z00pmtqhsu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/isonzo-preinstalled-steamrip.jpg"
}