{
    "page_url": "https://steamrip.com/its-only-money-free-download/",
    "title": "It’s Only Money",
    "description": "It’s Only Money is a 3rd person open world simulation game where you take the role of an Undercity resident – someone forced to live amongst the sewers and subways by the newly elected evil Mayor.\nAlong with other Undercity residents, you will venture to the surface to steal, fight and destroy. Take down corporations owned by the Mayor’s corrupt cohorts . Win back the city for everyone, block by block. Buy houses, businesses, clothes, cars and whatever else your materialistic heart desires. Play alone or bring up to three friends to share in the chaos.\nRockhaven is your playground . Explore a dynamic city filled with shops, houses, activities, and missions. Unleash your creativity as you exploit the open world to your advantage: pickpocket the wealthy, steal cars for a wild joyride, or jack a UFO and take it for a spin! Test your combat skills with new moves available at the Dojo, or take on the Mayor’s inner circle in epic Takeover missions, including boss fights against his lieutenants.\nFeeling tactical? Recruit Homies from the Undercity, who follow, fight, and contribute to your street misdeeds, making every heist more thrilling .\nAs you claw back cash from the city’s elite, use your ill-gotten gains to purchase homes and businesses. Every house you buy brings more people back from the Undercity to the surface, allowing you to customise their living spaces for gameplay buffs and unique items. Invest in properties like the landlord you’ve always wanted to be. Become the 1%! Profit off the land and contribute nothing to society! Concentration of wealth? Sounds like a poor people problem. Kong: Survivor Instinct\nBusiness ownership isn’t just about money; it’s about power. Manage the Slimeway to create a steady income stream and unlock new gameplay opportunities. Want more action? Rake in cash, REP, and other rewards when you dive into some of the city’s tantalising , minimum wage earning side-hustle minigames.Hustling for a wage too boring for you? We got you covered. Go bigger with the latest addition to Rockhaven’s underground scene – the ‘Metro Dungeon’. A roguelite experience where every wave of enemies brings more upgrades and strange powers to make you feel absolutely unstoppable.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/its-only-money-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/its-only-money-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Simulation",
        "Developer": "Usual Suspects Studios",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "RUNE",
        "Version": "v1.0.0-9254 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zl8e1lw9ixcn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/its-only-money-preinstalled-steamrip.jpg"
}