{
    "page_url": "https://steamrip.com/journey-to-the-west-free-download-1k/",
    "title": "Journey to the West Directly Download",
    "description": "Forge your path as a heroic legend in Journey to the West Battle mythical creatures with your all-star squad, unique deck, powerful relics, and consumables! Uncover the twisted fates behind the omen of darkness, and fight your way to become the savior of the Realm of Divinity. Inner Ashes\nGet ready to embark on an adventure inspired by a classic novel, where you’ll take on the role of one of five legendary heroes, each comes with their unique powers Wukong, equipped with his special weapon, the Monkey King Bar, can unleash devastating AOE attacks, shapeshift to learn skills from any NPC, manipulate fire to inflict the burning status, and deftly dodge incoming attacks.\nThe Holy Monk has a unique ability to apply either a “good” or “evil” status on enemies, allowing him to either convert foes to his side and create new teams or unleash powerful attacks and create magic barriers to protect himself. He can also take advantage of curse cards, forming special strategies around them. White Dragon, traveling with his twin sister’s spirit (Dragon Princess), has the power to manipulate water and use Guardian Swords to trigger potent boosts. He stores unused energy as spirit power and can access it when needed. The Dragon Princess also has the ability to learn cards from companions , adding to their combined strength.\nThe Swine King is no ordinary hero, able to consume consumables to obtain hunger points and boost basic status, use transmutation to learn powers from enemies and absorb HP and Max HPs during combat. Additionally, he can transform into a monster when completing his eight principles. Last but not least, Faithful Devil is a versatile hero who deals increased damage based on an enemy’s position and can summon Spirits of Five Elements (Gold, Wood, Water, Fire, and Earth) into the enemy’s team. With their unique abilities, Faithful Devil can build strategies around each spirit and unleash deadly attacks on unsuspecting foes.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/journey-to-the-west-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/journey-to-the-west-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8/8.1, 10",
        "Processor": "2 GHz or above",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 10 or OpenGL 4.0 compatible or above",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "Z Studio",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.12.0b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kdr53mqfb8rx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/journey-to-the-west-preinstalled-steamrip.jpg"
}