{
    "page_url": "https://steamrip.com/jurassic-world-evolution-2-free-download-1u/",
    "title": "Jurassic World Evolution 2",
    "description": "Jurassic World Evolution 2 is the much- anticipated sequel to Frontier’s ground-breaking 2018 management simulation, Jurassic World Evolution, offering an all new narrative campaign voiced by cast members from across the Jurassic World film franchise, exciting new features, four engaging game modes, and an expanded roster of awe-inspiring dinosaurs. Learn what it takes to be a park management master in Campaign mode, a compelling, original narrative that puts you at the heart of the action following the earth-shattering events of Jurassic World Fallen Kingdom .\nWork alongside iconic characters from the films, including Dr. Ian Malcolm (voiced by Jeff Goldblum) and Claire Dearing (voiced by Bryce Dallas Howard), and lead the efforts to control, conserve, and contain wild dinosaurs now rampaging across the USA. Take control with deeper management tools and creative options. Construct a range of customisable new buildings and hire new Scientists, and shape your park to meet the needs of both your guests and dinosaurs.\nUnleash your creativity in Sandbox mode, or test your skills in Challenge mode as you deal with diverse locations and environmental calamities. Play through key moments of your favorite films with a twist. Experience ‘what-if’ scenarios from iconic Jurassic World and Jurassic Park films, each level set across eras and locations from all five movies. Dive into the Jurassic World franchise and see how events unfold when you take control.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/jurassic-world-evolution-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/jurassic-world-evolution-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit (min version 1809)",
        "Processor": "Intel i5-4590/AMD FX 8370",
        "Memory": "8 GB RAM",
        "Graphics": "(4GB VRAM) NVIDIA GeForce GTX 1050Ti (Legacy GPU: GeForce GTX 960) / AMD Radeon RX 470",
        "DirectX": "Version 12",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Frontier Developments",
        "Platform": "PC",
        "Game Size": "7.5 GB",
        "Released By": "CODEX",
        "Credits to": "machine4578 of CS.RIN",
        "Version": "v1.3.1 (test for developers) | Full  (Latest) + Premium Edition+ All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ak9qlwyb7ko3",
        "https://megadb.net/29gzys35xkvs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/jurassic-world-evolution-2-preinstalled-steamrip.jpg"
}