{
    "page_url": "https://steamrip.com/jusant-free-download-q1/",
    "title": "Jusant Directly Download",
    "description": "Enjoy meditative vibes in Jusant, an action-puzzle climbing game. Scale an immeasurably tall tower and ascend to new heights alongside your watery companion. Master your climbing tools, find your way up through diverse biomes, and piece together the tower’s past. Jusant is a brand-new action-puzzle climbing game and a meditative journey to the top of a tall tower. Challenge yourself at your own pace, explore different paths, and unravel the secrets from a bygone civilization . Slay the Princess\nMaster your climbing tools and watch your stamina meter to successfully navigate this mysterious and changing tower. As you go higher and hone your skills, you’ll have to figure out how best to use the tools at your disposal to get to where you want to go. Explore alternative paths to find clues about what happened here.\nPlay at your own pace. As you climb, you’ll come across breathtaking biomes full of flora and fauna, accompanied by a peaceful and atmospheric soundtrack. Brace yourself on arid, windy slopes, seek refuge in tunnels lit only by bioluminescence, and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/jusant-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/jusant-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-6700 (4 * 3400), AMD Ryzen 5 1500X (4 * 3500) or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX (1050 Ti) 4096 MB, Radeon RX (570 )8192 MB",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "DON’T NOD",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "RUNE emu",
        "Version": "v1.07 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/i9ei8guwtp9w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/jusant-preinstalled-steamrip.jpg"
}