{
    "page_url": "https://steamrip.com/kanjozoku-game-free-download-1s/",
    "title": "Kanjozoku Game Directly Download",
    "description": "Kanjozoku Game 90s Osaka Kanjo Illegal street racing. Feel like an street racer and drive on japanese autobahns. True 90s and 2000s JDM Cars to drive and tune. Engine Tuning: Internals, Turbochargers , ECU, Fuel, Intake, Exhaust, etc. Body Tuning: Bumpers, Hoods, Fenders, Lights, etc. Suspension Tuning: Wheels, Rims, Tyres, Camber, Coilovers, Spacers etc. Load custom vinyls/liveries to the car. Online Races: Time Attack, Minimum Speed, Do not Crash, Avoid Traffic, etc. Online Car Meets and Hotspots. High Speed Police Chases. Rating system: Avoid traffic at high speeds, complete races, escape police chases. Riffle Effect\nplay online and PvP with someone else to gain more rating. As far as what I have played, I can say the state of the game is playable and can get casual enjoyment out of it. Yes, quite rough for what it is right now, however, the structure is there and believe this game has lot’s of potential. I’ll have another section for this later. For what the game gives you, several cars, plenty of upgrades. Both Performance and Body Work. Let’s not forget Stance and Wraps as well.\nThe game does have a good Eurobeat vibe. You have a Highway course, which unfortunately is one way and no exits. Expect some moderate grind, aliviated somewhat by the starting initial money. Races are composed of three random optional criteria: Minimum speed, Collisions permitted or not (not between players, only the traffic), and race lenght, you will always race against the clock, independently if there are players racing with you or not, they don’t influence rewards. this game to have a little more realistic / similar to realistic arcade, grippy physics. The problem is that with the current physics, when you drive a car (in my case, the EF Civic) in this game, it constantly slides, behaves unpredictably and unpleasantly.\nIt would be great to rework the physics model, and it would also be cool if you finalized the sounds of the engines. For example, the sounds of all Honda engines (d and b series) are completely different from the real sound. In reality, they sound loud and pleasant, like a lawn mower (hehehe), but in the game they sound like ordinary engines, so that very pleasant feeling that you want to get from the sound of a VTEC engine is lost.\nCar handles basically how it should be with FWD understeering alot in top speed and RWD kinda snapping to corners but would Oversteer when turning to hard. AWD would understeer but forcing to turn would snap it hard to corners potentially oversteering it. They got the basics right tho’ still kinda robotic in a way.\nTHIS GAME HAS SOUL AND A VERY NICE CHARM TO IT.\nDespite being quite a simple game I had a real blast cruising through the midnight city with other players. Thank you for bringing a game like this alive. The physics is surprisingly well done for arcade racing, 19 iconic cars (I’m sure there will be more), online mode with cops and the ability to race with other players. Nice VHS style menu design if I’m not mistaken .\nSome of the disadvantages include some bugs, low-quality car sound, incomplete map, few options for tuning and only two game modes. Overall, I recommend this game if you want to support a promising project, you like the JDM theme in racing, and kanjo. AI traffic is insane tho’, they have turn signals as an info but would change lane in a split second it lights up forcing to have inhumane reactions when racing.\nThe traffic AI would make those “No crash” race a living nightmare tho’ still enjoyable in a way. Car tuning is basic and simple tho’ i hope theres more to it in future updates like controlling the boost and setting up the gear time etc. Car modification is there starting from bumpers to side skirts even to wide body kits (Front fenders and rear fenders option).\nSince its set in osaka i would expect the map to be inspired from the Hanshin Expressway, tho’ driving around and seeing the map itself looks as if its inspired by the Shuto Expressway from Tokyo instead which is kinda odd. But nevertheless driving feels enjoyable and the map feels lively. Here’s hoping the Dev adds more maps to choose and play I hope this changes.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/kanjozoku-game-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/kanjozoku-game-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10",
        "Processor": "i3",
        "Memory": "4000 MB RAM",
        "Graphics": "Intel HD",
        "DirectX": "Version 10",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Simulation, Sports",
        "Developer": "SG DEV",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/f38orj7xwdty"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/kanjozoku-game-preinstalled-steamrip.jpg"
}