{
    "page_url": "https://steamrip.com/katana-zero-free-download-1r/",
    "title": "Katana ZERO Free Download",
    "description": "Katana ZERO Download PC Game In Direct Link for free on SteamRIP\nKatana ZERO is a stylish neo-noir, action-platformer featuring breakneck action and instant-death combat. Slash, dash, and manipulate time to unravel your past in a beautifully brutal acrobatic display. Exceptional Combat: Overcome your opposition however the situation requires. Deflect gunfire back at foes, dodge oncoming attacks, and manipulate enemies and environments with traps and explosives. Leave no survivors. Hand-Crafted Sequences: Each level is uniquely designed for countless methods of completion. Defeat foes creatively, using spontaneous approaches to eliminate your enemy as you see fit. CODE VEIN\nUnconventional Storytelling: An enigmatic story told through cinematic sequences woven into the gameplay, twisting and folding to an unexpected conclusion. One of the most important features of the Katana ZERO gameplay is the presence of a potion called “Chronos”, which gives the character special abilities – after drinking this potion, the character can change time and even change the future with the past . And by the way, it is on this mechanics that the whole gameplay is based. You will need to learn how to use the potion and character skills as efficiently as possible. The second feature of this game is a well-thought-out combat system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/katana-zero-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/katana-zero-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 8.1, 10 x64",
        "Processor": "Intel Pentium E2180 (2 * 2000) or equivalent",
        "Memory": "1 GB RAM",
        "Graphics": "GeForce 7600 GT (256 MB)",
        "DirectX": "Version 10",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Askiisoft",
        "Platform": "PC",
        "Game Size": "189 MB",
        "Repack By": "GOG",
        "Version": "v1.0.5 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/48"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/katana-zero-free-download-preinstalled-steamrip.jpg"
}