{
    "page_url": "https://steamrip.com/keplerth-free-download-p1/",
    "title": "Keplerth Directly Download",
    "description": "Welcome to Keplerth Try to survive on a hostile alien planet in this 2D sandbox RPG, where you can choose to live alone, fight side by side with your friends, or experience the calamity of online multiplayer. Survive, build, farm, fight, and explore your way to victory in this open world adventure Discover a rich biosphere, unlimited resources and all sorts of hidden crises just waiting to arise\nBuild an elaborate home on the surface, or explore the dangers that lay beneath the surface. Fight against enemies from different factions, take on dungeons with your friends, and leave your mark on this mysterious world.\nGrab your weapons, treasure awaits you in the ruins Push the limits with genetic modification New gene editing and skill systems give players more complex character creation options. Put an end to the same old generic character builds by choosing from hundreds of possible weapon combinations , letting you create your own unique fighting styles Farming enthusiasts, this one’s for you Pick up tools, reclaim wasteland, manage your farm and reap the fruits of your labor. Become a breeding expert to make your farm the greatest this planet has ever seen",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/keplerth-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/keplerth-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Memory": "2 GB RAM",
        "Storage": "1500 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG, Simulation",
        "Developer": "TARO",
        "Platform": "PC",
        "Game Size": "463 MB",
        "Released By": "N/A",
        "Version": "v1.1.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/41iin0qj0h6l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/keplerth-preinstalled-steamrip.jpg"
}