{
    "page_url": "https://steamrip.com/kick-bastards-free-download-k1/",
    "title": "Kick Bastards Directly Download",
    "description": "You messed up. Now you are in Hell and you ain’t too happy about it. Use all your parkour skills to escape Hell and the Devil as he chases you across different dimensions. Kick Bastards is a parkour game with a heavy focus on varied and expressive movement mechanics. You will be pushed to master the deep movement systems to overcome varied challenges. Channel your inner speedrunner as you kick your way through everything at crazy speeds. Challenge yourself and fight for the top spot. Granny Remake\nDeep parkour movement system. Kick Bastards combines real world parkour moves with fantastical elements that you can combine and combo to create exciting lines. High speed gameplay. There is NO CAP on your speed so you can build up crazy speed by comboing your moves together. Ultimate kicking simulation!! That’s right you kick stuff in the game called Kick Bastards. In fact you will kick a lot of stuff, so much stuff. All your kicking fantasies will be satisfied. Find your line! Every level is built so that you can find loads of different lines through them, including ones we don’t even know about! Varied and beautiful stages. We put a lot of love and hard work into making the levels both exciting to play and great to look at!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/kick-bastards-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/kick-bastards-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-8400H",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 570",
        "DirectX": "Version 12",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Something Something Games",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "TENOKE",
        "Version": "Build 13112661",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/5DE60FA4BE",
        "https://megadb.net/2j7zdvmbe3nx",
        "https://buzzheavier.com/79a22sybenrq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/kick-bastards-preinstalled-steamrip.jpg"
}