{
    "page_url": "https://steamrip.com/killer-frequency-free-download-1z/",
    "title": "Killer Frequency Directly Download",
    "description": "The year is 1987, and as the clock strikes midnight in small-town Gallows Creek, USA, former big city radio DJ Forrest Nash is live on air in what will turn out to be the graveyard shift of a lifetime. In this horror comedy , you must solve puzzles to save callers from being hunted down by a mysterious killer. Where every call is life and death, can you save the inhabitants of Gallows Creek? Cruise Ship Manager\nStep into the shoes of a late-night radio talk-show host new in town and fallen from grace. The Police Chief is dead so the townsfolk turn to you for help, as apparently you, Forest Nash are the only person in town who can run a phone line. Use branching dialogues to interact with a variety of eccentric small-town personalities including potential victims and suspects.\nExplore your surroundings , gather clues, make decisions, solve satisfying riddles, and try to help each of your callers survive the night. Jump back in time to 1987 with this slasher inspired puzzler explore an authentically detailed radio station and interact with dozens of physics-based objects straight from a bygone era, including a working cassette and record player. With a fully voiced cast and a killer original soundtrack of 80’s inspired tunes from rock classics to synthwave",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/killer-frequency-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/killer-frequency-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i3-540 or AMD Phenom II X4 965",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 730, 2 GB or AMD Radeon HD 6670, 1 GB",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Team17 Digital",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "RUNE",
        "Version": "Build 10987519 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qpu0ewclbuaa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/killer-frequency-preinstalled-steamrip.jpg"
}