{
    "page_url": "https://steamrip.com/kindergarten-2-free-download-m1/",
    "title": "Kindergarten 2 Directly Download",
    "description": "Kindergarten 2 is the long awaited sequel to 2017’s Kindergarten After the events that occurred on Monday, the children have been rezoned to an all new school. Discover all new areas and new characters as you assist the children with their various assignments. S.T.A.L.K.E.R.: Shadow of Chernobyl\nWhether it’s helping Cindy find a new boyfriend , or helping the janitor with his war on Bob, there’s always someone who can be assisted. Play through the same wonderful Tuesday over and over again, in what has been described as “ Groundhog Day with messed up children.” Much more important here is the gameplay. And by the way, conditionally the gameplay in Kindergarten 2 can be divided into several parts.\nThe first part is the study of the surrounding world. Traveling around the kindergarten, you will discover strange places, meet different characters, communicate with children, help, find various objects and more. The second part of the gameplay is based on the performance of various story and additional tasks. Somewhere you will have to help someone, somewhere you will have to complete some assignment, and somewhere you will have a task from the “ incredible ” category. Well, the third direction is the passage of various tests.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/kindergarten-2-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/kindergarten-2-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo 2.1 ghz or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "2nd Generation Intel Core HD  (2000/3000), 512MB",
        "DirectX": "Version 9.0",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Con Man Games, SmashGames",
        "Platform": "PC",
        "Game Size": "100 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2.00 (Build 10089775)  | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/k5v1oi18izy4",
        "https://buzzheavier.com/j767r36tabbp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/kindergarten-2-preinstalled-steamrip.jpg"
}