{
    "page_url": "https://steamrip.com/kingdoms-deck-free-download/",
    "title": "Kingdom’s Deck",
    "description": "Kingdom’s Deck is a game about survival and growing your kingdom . As the ruler of the land, you must navigate the challenges of staying alive, taking care of your people’s requirements, building a powerful army, and protecting your fort from approaching threats Badlands Crew\nStep into the role of the king, entrusted with the fate of an entire realm. Your journey is guided by your collection of cards, each with a specific purpose. Some cards help you build crucial structures, like food production, resources, and fortifications . Others strengthen your military forces. Your leadership hinges on using these cards wisely, and choosing the right moments and places to play them.\nIn this ever-changing kingdom , peace is a rare luxury, as the relentless darkness continually menaces your realm. Prepare your army for defense and construct impenetrable walls to repel the sieges. Your unwavering determination is what will protect your lands .\nUnleash the elemental forces at your command with powerful spell cards. From fiery infernos to icy blasts, wield magic to turn the tides of battle in your favor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/kingdoms-deck-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/kingdoms-deck-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Ivan Aco",
        "Platform": "PC",
        "Game Size": "746 MB",
        "Released By": "TENOKE",
        "Version": "Build 18261318 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cbwleobxcz8v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/kingdoms-deck-preinstalled-steamrip.jpg"
}