{
    "page_url": "https://steamrip.com/king-of-seas-free-download-1t/",
    "title": "King of Seas",
    "description": "Get King of Seas PC game for free instantly and play pre-installed on SteamRiP\nKing of Seas is an ARPG adventure game set in a nautical pirate world. Become the most legendary pirate of all time as you embark on an epic adventure across the boundless and ominous sea. Discover lost islands and treasures, fight rival pirates and menacing monsters all in your bid to become king of the sea. Shape your own adventure: Dive into a magnificent, nautical world. Complete quests to shape your journey and meet unique characters along the way. But be warned, the world around you will react and change depending on the actions you take. Naval routes will change and with each conquered settlement the difficulty adapts to make for a more challenging adventure .\nWeather the storms: Changes in the weather can knock you off your sea legs. From thick fog to dangerous storms, sail at your own risk and watch out for the direction of the wind. You could be blown right into an enemy’s path if you don’t strategize well enough. Customize your ship: Choose from five different types of highly customisable ships: The Sloop, Brig, Flute, Frigate and Galleon .\nWith over 900 items available to collect and deck out your ship with you can create a battle-ready vessel that’s the envy of rival pirates. Trade with other settlements: Each settlement produces their own unique products. Buy them at the lowest price possible and sell them to other settlements where they are in high demand. Line your pockets with gold and spend on improvements to your ship and on brand new skills.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/king-of-seas-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/king-of-seas-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 bit Windows 10 / 8 / 7",
        "Processor": "Intel Core i5-2500K 3.3GHz / AMD FX-8150 3.6GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 550 Ti / Radeon HD 6790 2GB VRAM*",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "3DClouds",
        "Platform": "PC",
        "Game Size": "1.23 GB",
        "Repack By": "GOG",
        "Version": "v1.20 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n2ys8svdjd5v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/king-of-seas-free-download-preinstalled-steamrip.jpg"
}