{
    "page_url": "https://steamrip.com/kings-bounty-ii-free-download-m4/",
    "title": "King’s Bounty II Free",
    "description": "Get King’s Bounty II PC game for free instantly and play pre-installed on SteamRiP\nDarkness descends over the world of Nostria. Conspiracies, sabotage , and necromancy are overshadowing the country. But maybe a saviour – the kingdom’s last hope – is already here, to fight back and finally restore peace and order in Nostria King’s Bounty II is the long-awaited sequel to the legendary King’s Bounty video games franchise, one of the most iconic representatives of the turn-based RPG genre. Expanding on this legacy with an entirely new epic story, factions , enemies, and new features to forge an open and breaking fantasy world Antara.\nWith the kingdoms in disarray , counties demanding independence, bandits prowl the roads, all the overseas nations have denied the King’s authority over them, and blighted creatures lie in wait for the unwary, new accidental heroes emerge as a last hope. Minecraft Windows 10 Edition\nThey are determined to bring order to the chaos . Play as one of them, recruiting, developing, and commanding your personal army on a non-linear adventure of betrayal, sacrifice, and survival. Fighting for your own future, outsmarting enemy in uniquely turn-based combat, making difficult decisions, and experience the intensity of one of the classic sagas in an exciting new way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/king-bounty-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/king-bounty-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-4690 or AMD FX-9370",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 970 or AMD Radeon RX 480",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "1C Entertainment",
        "Platform": "PC",
        "Game Size": "20.6 GB",
        "Released By": "CODEX",
        "Version": "v1.7 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/1vz4yp6x7rja",
        "https://datanodes.to/ryghlmoa102v/Kings-Bounty-II-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/king-bounty-2-free-download-preinstalled-steamrip.jpg"
}