{
    "page_url": "https://steamrip.com/king-arthur-knights-tale-free-download-1h/",
    "title": "King Arthur Knight’s Tale Directly Download",
    "description": "You are Sir Mordred, the nemesis of King Arthur, the former black knight of the grim tales. You killed King Arthur, but with his dying breath, he struck you down. You both died and yet, you both live. The Lady of the Lake, the ruler of the mystical island of Avalon brought you back to end a true nightmare. She wants you to go on a knightly quest. She wants you to finish what you have begun.\nKill King Arthur or whatever he has become after she took his dying vessel to Avalon. Experience a unique hybrid between turn-based tactical games and traditional, character-centric RPGs This dark fantasy version of the Arthurian mythology invites you to manage a team of heroes on the dangerous battlefield, while also engaging in moral choices, hero management, and the rebuilding of Camelot. The Serpent Rogue\nExplore a land of nightmares where vile monsters and magical creatures lurk within castles and forests. The battle between Arthur and Mordred brought death, both of them falling at the hands of each other, and now the consequences unfold. Arthur, resurrected in Avalon, is now an undying mad king, his pain slowly turning this magical place into a nightmare version of Britannia. You are Mordred, brought back to life to find Arthur, and ultimately, kill him to end this accursed condition. Gather your knights and send them on quests involving deep, tactical battles! Assemble a team of heroes, selecting from six classes (Defender, Champion, Marksman, Vanguard, Arcanist, Sage). Level them up, gain unique skill points, equip the best items looted from missions. But beware! Heroes can die, and the treatment of their injuries, curses, diseases take time.\nBetween missions, make sure that Camelot has the right facilities for recovery, and prepare different heroes for different quests. Heroes are your main resources – but no mere numbers They have their own distinct personalities, goals, rivalries (even unique traits, skills and bond benefits). They will observe your decisions closely! Settle disputes, grant favours, select heroes who can work together, send them on missions they are comfortable with. Tread carefully, because their loyalty depends on many factors. They can even leave and turn against you",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/king-arthur-knights-tale-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/king-arthur-knights-tale-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-4690 / AMD FX 4350",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 780 / AMD Radeon R9 280X",
        "DirectX": "Version 12",
        "Storage": "120 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "NeocoreGames",
        "Platform": "PC",
        "Game Size": "37 GB",
        "Released By": "FLT",
        "Version": "v1.3.0b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ssuszeyenaja",
        "https://1fichier.com/?31vhsnik33d2gyviyzyo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/king-arthur-knights-tale-preinstalled-steamrip.jpg"
}