{
    "page_url": "https://steamrip.com/kingpin-reloaded-free-download-k1/",
    "title": "Kingpin: Reloaded",
    "description": "In a stylized noir art deco gangland that never was, the Kingpin rules above all else with a bloody fist. When his lieutenant Nikki Blanco leaves a no-name thug battered and broken, the upstart criminal rises from a puddle of blood pipe in hand and revenge in mind. Arizona Sunshine 2\nKingpin: Reloaded brings new life to the Quake II engine classic. 4K resolution and improved graphics in Enhanced mode enable the beautifully-depicted metropolitan nightmare to shine. Controller support makes the game more accessible for anyone wanting to explore the depths of Kingpin’s depravity. Improvements like new quest and conversation systems make Reloaded even better than the original.\nStalk lamp-lit streets and take down rival gangs to let the Kingpin know his end is nigh. Kingpin’s immersive sim elements allow you to recruit other gangsters and increase your influence through multiple hub-based missions. Run with the gang on a violent warpath with upgradeable weapons. Location-based damage leads to bloody, thrilling battles: kneecap, maim, or go for the head.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/kingpin-reloaded-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/kingpin-reloaded-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows® 10/11",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 1660",
        "DirectX": "Version 10",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Slipgate Ironworks",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.02 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6nbv3kl5nfe3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/kingpin-reloaded-preinstalled-steamrip.jpg"
}