{
    "page_url": "https://steamrip.com/kingdom-eighties-free-download-t1/",
    "title": "Kingdom Eighties Directly Download",
    "description": "Kingdom Eighties is a standalone expansion to the award-winning Kingdom series: A singleplayer adventure of micro-strategy and base building, inspired by the neon lights of the eighties. You play as The Leader, a young camp counselor who will have to defend their town and family from the relentless attack of the mysterious Greed. What are these monsters, and why are they trying to steal their family legacy, the Crown of Creation?\nRecruit the neighborhood kids and assign them roles as soldiers or builders. Use coins to build and expand your kingdom, and fortify it by raising walls and defensive turrets. And be prepared for when the night comes –the Greed will attack you without mercy. If you lose your crown, everything is doomed Every game in the Kingdom series holds secrets. Explore the surroundings to unlock mounts, discover technology upgrades and weapons, and learn how to manage your resources wisely to survive. Prison Boss VR\nBuilding upon the well-known mechanics from the previous Kingdom games, Kingdom Eighties will deep dive into the lore and worldbuilding of the series. And if you’re new to it, the story elements will fluently guide you through the gameplay mechanics. You will meet three supporting characters along the way: The Champ, The Tinkerer, and The Wiz .\nEach one has different abilities that you can combine to solve puzzles and find the solution to each level. The summer camp is just the beginning! You will travel through different locations never seen before in the Kingdom series. Find some fresh wheels at the skateboard park, visit the shops on Main Street, and free the New Lands Mall from the Greed. Kingdom’s iconic, handcrafted art style is back, now with a neon touch coming directly from the eighties aesthetics. Chill and vibe with the synthwave OST from Andreas Hald, and travel back to the wonder days of bike riding and summer camps, when everything seemed possible.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/kingdom-eighties-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/kingdom-eighties-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel 4th Gen Dual Core 2.0Ghz",
        "Memory": "2 GB RAM",
        "Graphics": "Nvidia GTX Series 8",
        "DirectX": "Version 9.0c",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "Fury Studios",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "RUNE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bg1o1uz7lo4w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/kingdom-eighties-preinstalled-steamrip.jpg"
}