{
    "page_url": "https://steamrip.com/kingdom-rush-5-alliance-td-free-download/",
    "title": "Kingdom Rush 5: Alliance TD",
    "description": "With greater power and menace than ever before, Kingdom Rush 5: Alliance offers a fresh, exhilarating experience, building upon the fast-paced and captivating gameplay that made its predecessors award-winners.\nAs a formidable evil arises, an unexpected alliance is taking shape! It will take the finest warriors of Linirea and the relentless Dark Army together to stop it. Beware They may journey side by side for now, but the ever-changing winds of fate could swiftly alter their course. PATHOGEN X\nPrepare to harness the formidable might of two heroes on the battlefield YES, you can now play with TWICE the dragons!! Double the fire-breathing fun, double the chaos—just make sure they don’t argue over who gets to hoard the most gold\nBoss around all the heavy hitters like Paladins , Archers, Mages, Necromancers, and a bunch more. Just watch out they don’t start arguing about who’s the real hero of the party as the enemies sneak by\nAre you poised for the ultimate clash? Embark on an epic journey alongside the brave warriors of Linirea and the relentless Dark Army as they unite to conquer a colossal foe.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/kingdom-rush-5-alliance-td-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/kingdom-rush-5-alliance-td-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "OpenGL 3.0 compliant with 1.0GB of video RAM.",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Ironhide Game Studio",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v5.00.20 | Full  + Colossal Dwarfare Campaign",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ri7ru0qb5cpl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/kingdom-rush-5-alliance-td-preinstalled-steamrip.jpg"
}