{
    "page_url": "https://steamrip.com/kingdom-two-crowns-free-download-s0/",
    "title": "Get Kingdom Two Crowns PC game for free instantly and play pre-installed on SteamRiP",
    "description": "Get Kingdom Two Crowns PC game for free instantly and play pre-installed on SteamRiP\nKingdom Two Crowns is a side-scrolling micro strategy game with a minimalist feel wrapped in a beautiful, modern pixel art aesthetic. Play the role of a monarch atop their steed and recruit loyal subjects, build your kingdom and protect it from the greedy creatures looking to steal your coins and crown. In the brand-new campaign mode, monarchs must now work to build a kingdom that stands over time until finding a way to defeat the Greed for good. Explore the environments to discover new mounts and secrets hidden in the deep.\nBut you don’t have to rule alone Introducing a cooperative play experience that is totally unique to Kingdom Two Crowns, monarchs can now choose between a classic solo experience or seek the assistance of a friend, working together locally or online, dropping in or out at will. Dead Lands: Enter the dark lands of Kingdom. Play as unique monarchs, including the Shardbinder Miriam , with powerful traits from the gothic horror action-RPG Bloodstained.\nRide the gigantic beetle steed to lay out traps, the eerie undead mount that summons barriers impeding the progress of the Greed, and from Bloodstained the mythic demon horse “Gaming” with its powerful charge attack. Building your Kingdom has never been spookier",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/kingdom-two-crowns-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/kingdom-two-crowns-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel 4th Gen Dual Core 2.0Ghz",
        "Memory": "2 GB RAM",
        "Graphics": "Nvida GTX Series 8",
        "DirectX": "Version 9.0c",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Simulation, Strategy",
        "Developer": "Stumpy?Squid, Fury Studios, Coatsink",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "RUNE emu",
        "Version": "v2.1.3 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/l9jqwr4emlur"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/kingdom-two-crowns-free-download-preinstalled-steamrip.jpg"
}