{
    "page_url": "https://steamrip.com/king-arthur-legion-ix-free-download/",
    "title": "King Arthur: Legion IX",
    "description": "“This title is going to be great if you enjoyed Knight’s Tale, which a lot of people did, or you want a Roman themed campaign!” – Mortismal Gaming Cryptmaster\nKing Arthur: Legion IX is a turn-based, character-centric tactical RPG in the King Arthur: Knight’s Tale universe – a dark fantasy version of the Arthurian myth. King Arthur: Legion IX welcomes new players to the mythical land of Avalon with an all-new story and heroes, also offering tough challenges to returning veterans.\nA new threat looms over Avalon as the long-lost, infamous Ninth Legion of Rome has set foot on the mythical island. Their commander, the fallen hero, Gaius Julius Mento was granted a demonic legion by their dead emperor, Septimus Sulla to find a way out of Tartarus. But when they accidentally arrive to the magical realm of the Lady of the Lake, Gaius Julius Mento decides to subjugate the island and establish Eternal Rome there. First, however, he must gather his lost legion\nPlay through a Roman-themed campaign as Gaius Julius Mento, a tribune of the undead Ninth Legion, as he discovers Avalon. Battle the monsters of nightmares, challenge the Pict tribes, the monstrous Fomorians and the cunning Sídhe. Experience the might of the Old Faith and Christianity and face the knights of Sir Mordred’s Round Table through 15 handcrafted missions .\nFind, rebuild and protect the remains of the only Roman colony in Avalon and choose your path to victory. By the end of the campaign, you’ll have to choose: do you want to become a powerful demon, or will you reject the might of Emperor Sulla and restore your humanity ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/king-arthur-legion-ix-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/king-arthur-legion-ix-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-4690 / AMD FX 4350",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 780 / AMD Radeon R9 280X",
        "DirectX": "Version 12",
        "Storage": "39 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "NeocoreGames",
        "Platform": "PC",
        "Game Size": "33.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/rd02txelfzhl",
        "https://datanodes.to/94cn4yeoq2y3/King-Arthur-Legion-IX-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/king-arthur-legion-ix-preinstalled-steamrip.jpg"
}