{
    "page_url": "https://steamrip.com/kitaria-fables-free-download-1n/",
    "title": "Kitaria Fables Free",
    "description": "Get Kitaria Fables PC game for free instantly and play pre-installed on SteamRiP\nKitaria Fables is a delightfully cute action adventure RPG with farming and crafting! Enter the cute world of Kitaria and take on the quests of your animal neighbours as they face a rising tide of darkness. Real time combat, exploration and dungeoneering sit alongside farming for provisions and the crafting of weapons and armour, and forging new spells to increase your power. A peaceful land where nature lives in harmony – until now. As the wildlife around Paw Village becomes increasingly aggressive, The Empire has called upon you to investigate and defend its citizens. Little Dog Bob\nMake your way to Paw Village to your Uncles home, and from your new base, explore the huge world teaming with wildlife, resources and loot to help you in the long journey ahead. Wield melee weapons and bows and forge new spells. Kit your loadout in a way which suits your preferred style of battle and craft magic , weapons and armour which compliment your play style. Do your prefer to burn your enemies from a distance, freeze them where they stand, or trust in sword or bow to do your damage ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/kitaria-fables-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/kitaria-fables-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 bit Windows 10 / 8 / 7",
        "Processor": "Intel Core i5-2500K 3.3GHz / AMD FX-8150 3.6GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 550 Ti / Radeon HD 6790 2GB VRAM*",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Twin Hearts",
        "Platform": "PC",
        "Game Size": "564 MB",
        "Repack By": "GOG",
        "Version": "v1.0148 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jbhpl6o1je4l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/kitaria-fables-free-download-preinstalled-steamrip.jpg"
}