{
    "page_url": "https://steamrip.com/kithack-model-club-free-download/",
    "title": "KitHack Model Club",
    "description": "Welcome to KitHack Model Club! From the creator of the original Kerbal Space Program and a tiny team of just three dedicated developers. KitHack Model Club combines state-of-the-art physics with endless customization options that will see you and your friends bringing your wildest RC creations to life.\nWith the opportunity for limitless adventure and built from the ground up for multiplayer, KitHack Model Club is the ultimate model-building platform. Amanda the Adventurer 2\nBe it a plane, boat, car, or an ingenious hybrid of all three, you can construct anything you can imagine by simply attaching parts together in the Vehicle Editor. Give it wings, wheels, engines, rockets, paintball guns and more; then really make it your own by adding paint and decals.\nAnd your every design decision counts! Even the slightest tweaks you make on your vehicle will influence how it handles, as the simulation takes its actual geometry into account for aerodynamics, buoyancy, wheel friction and everything else.\nShow off your creation by taking it into multiplayer matches with up to 16 players, or share it on the Steam Workshop, to join an ever-growing collection of player made vehicles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/kithack-model-club-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/kithack-model-club-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Quad Core CPU (Intel Core i7 or equivalent)",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce GTX 10X0 Series or above",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Racing, Simulation",
        "Developer": "Floating Origin Interactive",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "TENOKE",
        "Version": "v1.5.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7v6y1af9ah82"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/kithack-model-club-preinstalled-steamrip.jpg"
}