{
    "page_url": "https://steamrip.com/knights-of-honor-ii-sovereign-free-download-1v/",
    "title": "Knights of Honor 2 Sovereign",
    "description": "Become the King and wrestle over control of Europe in this fresh take on medieval real-time grand strategy. Knights of Honor II: Sovereign includes all the depth players desire while being the gate-way game to the grand strategy genre, presenting the world as a living, breathing miniature, alive and ripe for the taking. Choose your royal court carefully and determine the destiny of your people, be it riches , conquest, intrigue, trade, or defeat! Raise armies to defend your lands or take war to the enemy even jump into battle directly in action-packed RTS combat .\nThe path is open: become the true Sovereign of your people. Start your campaign with one of 200+ historical kingdoms and expand your territory over 300+ provinces. Build up your economy and produce valuable goods while making sure your lands can support your military .\nChoose out of over 100 different military units ranging from English longbowman over fierce Nordic warriors to powerful siege engines and assemble great armies to defend your borders and bring the fight to your enemies. You don’t trust someone else to make the right tactical decisions? Startup Company\nThen lead your men into battle yourself Knights of Honor II: Sovereign offers exciting real-time strategy field battles and sieges with up to four armies. Knights of Honor II: Sovereign supports multiplayer with up to 6 players and various game modes: Conquer the medieval world together in co-op or fight each other in teams or free-for-all games You or your friends want a fresh new challenge from the normal game experience?\nNo problem: Choose one of several victory conditions like Peasant Rush, War for Goods or First Blood and more Plus, if you have a limited amount of time, you can control the duration of the match by either time or generations of Sovereigns as well.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/knight-of-honor-2-sovereign-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/knight-of-honor-2-sovereign-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "AMD FX-8350 or Intel Core i5-2500K",
        "Memory": "8 GB RAM",
        "Graphics": "Radeon HD 7870 / GeForce GTX 750-Ti",
        "DirectX": "Version 11",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Black Sea Games",
        "Platform": "PC",
        "Game Size": "7.2 GB",
        "Released By": "GOG",
        "Version": "Build 30794 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/41ka6ouuivaa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/knight-of-honor-2-sovereign-preinstalled-steamrip.jpg"
}