{
    "page_url": "https://steamrip.com/kong-survivor-instinct-free-download/",
    "title": "Kong: Survivor Instinct Directly Download",
    "description": "A sudden Titan attack prompts massive evacuation efforts-but not everyone makes it to safety before the devastation ensues. Caught in the crossfire between battling monsters, many residents become trapped in the collapsing city—your only daughter among them Kong: Survivor Instinct is a 2.5D action-adventure game that combines realistic platforming, challenging combat, and metroidvania-style exploration during a thrilling quest of survival worthy of the Monsterverse franchise. DRAGON QUEST MONSTERS: The Dark Prince\nTRUE MONSTERVERSE ADVENTURE Influence the Titans with Monarch tech and use their enormous strength to your advantage as you navigate a treacherous maze of collapsing buildings, toxic leaks, and raging fires. Scavenge for resources, weapons, and tools to solve environmental puzzles and defend yourself against both human and monster enemies.\nFACE THE LEGENDARY KONG Explore and survive as you encounter Kong in all his majestic glory, face the formidable Abaddon, and confront other new and returning superspecies and Titans! Whether you scavenge through half-destroyed buildings or fight off mercenaries, these enormous monsters are nearby, directly or indirectly impacting your gameplay. Though the Titans pose a lethal threat, you can – and must – influence their behavior with the ORCA Σ, a new prototype inspired by Monarch’s technology.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/kong-survivor-instinct-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/kong-survivor-instinct-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 8.1, Windows 10",
        "Processor": "Intel Core i5-2400 / AMD Phenom II X6 1100T",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950 2GB / AMD Radeon RX 460 2GB",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "7Levels",
        "Platform": "PC",
        "Game Size": "6.3 GB",
        "Released By": "RUNE",
        "Version": "Build 16096420 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/j4qaOg",
        "https://buzzheavier.com/jdf42jit2j0i",
        "https://megadb.net/j5uyoku52nak"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/kong-survivor-instinct-preinstalled-steamrip.jpg"
}