{
    "page_url": "https://steamrip.com/konosuba-gods-blessing-on-this-wonderful-world-love-for-these-clothes-of-desire-free-download-k1/",
    "title": "MegaDBDOWNLOAD HERE",
    "description": "Follow Kazuma and company, as they discover a mysterious “Black Slab” which curses them with desires contrary to their personality. The gang must now find and feed ingredients to the slab to create outfits which match and fulfil their new desires, and thus break their curse. Are you ready to meet Darkness as a ruthless dominatrix? How about Aqua as a prim and proper goddess? Or Megumin as the proud leader of the Lolita League?\nWitness a new story in visual novel form Featuring a full cast of fan-favourite characters from the series, this wild adventure gives you the chance to build up affection with up to seven heroines Fill out a weekly planner for each character based on their strengths to earn funds and resources which can be used for making outfits. Each of them has her own story endings and special dress-up CGs, so pick your words wisely and avoid invoking their wrath! Your choices matter Collect resources to create outfits by completing tasks and quests .\nManage your finances carefully to afford the materials you are missing, and prioritise gathering the outfit-specific ingredients you will need. Once the mystical outfits have been made it’s time to play dress-up! Be ready for twists and turns as your favourite characters’ personalities change with each curse and desire-fulfilling piece of clothing. Pixel Noir",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/konosuba-gods-blessing-on-this-wonderful-world-love-for-these-clothes-of-desire-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/konosuba-gods-blessing-on-this-wonderful-world-love-for-these-clothes-of-desire-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core 2 Duo E8400 or AMD Phenom II X2 550",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 730, 2 GB or AMD Radeon HD 6670, 1 GB",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "MAGES. Inc.",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "TENOKE",
        "Version": "Build 12540946 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zuoi8224ueyy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/konosuba-gods-blessing-on-this-wonderful-world-love-for-these-clothes-of-desire-preinstalled-steamrip.jpg"
}