{
    "page_url": "https://steamrip.com/kujlevka-free-download-1s/",
    "title": "Kujlevka",
    "description": "Russia, 1992. The ordinary village of Kujlevka is no stranger to challenging times. In this dark and otherworldly period of Russian history, the current financial crisis and rising crime rates appear bleak in comparison . And when a flying saucer crashes into local chairman’s house, it’s up to you to meet the aliens.\nOf all the locations on Earth , this forgotten settlement becomes a bustling center for science, exploration, and the supernatural; you’re merely the poor chap whose home became the saucer’s crash site.\nAssuming the role of the collective farm’s headmaster , you must filter visitors before let them inside the UFO. These guests from outer space are in no hurry to interact with humans, they’d much rather steadily observe our species and our vast dreams and desires. What exactly might these extraterrestrial beings have planned? This isn’t your stereotypical alien encounter. Pro Basketball Manager 2023\nYou will be tasked to learn about these otherworldly beings before they can properly study you. Kujlevka lets you play a role in charting a course through a financially and politically turbulent time in Russian history. Beyond static dialog and walls of text, you can explore village life in Kujlevka through a mesmerizing atmosphere of the protagonist’s dreams.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/kujlevka-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/kujlevka-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 and higher, 64 bit",
        "Processor": "Intel Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 650",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Callback",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/goztmdbcy1nb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/kujlevka-preinstalled-steamrip.jpg"
}