{
    "page_url": "https://steamrip.com/kulebra-and-the-souls-of-limbo-free-download/",
    "title": "Kulebra and the Souls of Limbo",
    "description": "As Kulebra you’ll explore Limbo, a vibrant, Latin American flavored afterlife full of danger, intrigue, humor, sneakery, and deep, dark mystery. You’ll be using many tricks and skills to help the colourful (literally) residents of Limbo accept and embrace their issues of loss, trauma , and the consequences of not letting go as they repeat their days again, and again. Last Vanguard\nA keen eye, sharp wits, sneakery , and good old-fashioned detective work will be required to accomplish your tasks. But you’re a Bright Soul. It’s what you are called to do, because untangling an afterlife is no easy feat, especially when you don’t have feet.\nDeath is not the end of delight . From the colours to the characters, this wonderful and fantastic journey through Limbo is woven with humour and lighthearted fun. Mystery, puzzles , exploration and joy await Kulebra.\nPerfect for beginner and veteran adventure game fans alike, Kulebra combines classic adventure gameplay with modern sensibilities. Light action and stealth sequences mix up traditional adventure game play, giving Kulebra a quicker pace\nClues discovered in conversation, exploration, and puzzle solving will help you discover the deeper mysteries of the citizens of Limbo and of Limbo itself, but you don’t need to remember everything. Your handy notebook is always available to you to reference, even in the most tense situations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/kulebra-and-the-souls-of-limbo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/kulebra-and-the-souls-of-limbo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 SP1+, Windows 10",
        "Processor": "AMD A6-5200 APU 2.0Ghz",
        "Memory": "2 GB RAM",
        "Graphics": "Radeon HD 8400-R3",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Galla",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "GOG",
        "Version": "v1.0.13 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/drmzaax0z7be",
        "https://megadb.net/z96oobdk4tvq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/kulebra-and-the-souls-of-limbo-preinstalled-steamrip.jpg"
}