{
    "page_url": "https://steamrip.com/kur-free-download-1p/",
    "title": "KUR Free",
    "description": "Everything was fine on the Mars colony until the robot spiders started murdering people and wearing their flesh. Now you’ve got to wade into the carnage and and save the day again, or you’ll probably get a bad rating on your freelance murder-for-hire profile. Destroy drones, ravage robots and stomp some skull-bearing spider droids in a dark-humor drenched take on the classic 90’s shooter.\nGood news though, you’ve got some entirely untested and incredibly dangerous technology at your disposal to get the job done. How about a Strength Augmented Boot that can kick clean through the torso of a murderous fleshbot? Yep. That’s not all! The Boot jumps, The Boot slides, and The Boot sends your enemies flying through the air like a dive bar bouncer who’s had quite enough. The Last Spell\nIf the idea of kick-murdering a horde of epidermis-adorned crome chuds doesn’t get the ol’ blood pumping, first go see a doctor, and then let’s talk guns. We’ve got them, there’s a ton of them, and they absolutely go boom. Too good for merely eviscerating your foes? Feel free to hit them with the shrink ray and laugh maniacally as their tiny form sails through the air compliments of your fancy footwork .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/kur-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/kur-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "2.4 GHz Dual Core CPU or higher",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 or equivalent",
        "DirectX": "Version 9.0"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Really Ragdoll",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "DARKSiDERS",
        "Version": "v1.0.1 |  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/e0r4naz2tl42"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/kur-preinstalled-steamrip.jpg"
}