{
    "page_url": "https://steamrip.com/la-noire-ww2/",
    "title": "L.A. Noire Directly Download",
    "description": "Using groundbreaking new animation technology, MotionScan, that captures every nuance of an actor’s facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.\nAmid the post-war boom of Hollywood’s Golden Age, Cole Phelps is an LAPD detective thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what’s right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Dead Space 2\nThis complete edition of L.A. Noire includes the complete original game and all previously released downloadable content including the “Nicolson Electroplating” Arson case, the “Reefer Madness” Vice case, “The Consul’s Car” Traffic case, “ The Naked City” Vice case and “A Slip of the Tongue” Traffic case.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/l-a-noire-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/l-a-noire-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-Bit Service Pack 1",
        "Processor": "Intel CPUs – Dual Core 2.2 GHz to Quad Core 3.2GHz; AMD CPUS",
        "Memory": "2 GB to 8 GB"
    },
    "game_info": {
        "Genre": "Adventure, Strategy",
        "Developer": "Team Bondi, Rockstar Leeds",
        "Platform": "PC",
        "Game Size": "13 GB",
        "Released By": "Razor1911",
        "Version": "v2675.1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/D079E2642E",
        "https://buzzheavier.com/18er35qz7hus",
        "https://1fichier.com/?wtyqxscncdqdris31sdx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/l-a-noire-preinstalled-steamrip.jpg"
}