{
    "page_url": "https://steamrip.com/labyrinthine-free-download/",
    "title": "Labyrinthine",
    "description": "Embark on a heart-pounding journey into the realm of nightmares with Labyrinthine, a cooperative horror game that will make you question your every step. Gather your courage and team up with friends as you enter the abandoned Happisburg hedge maze, or dive headfirst into the spine-chilling case files, where every investigation leads to unspeakable horrors. Twas The Night\nPrepare to be gripped by fear as you encounter a variety of unique monsters, each with their own sinister AI and mechanics. Stay on your toes as you traverse the maze’s twisted paths and unravel the dark secrets that lie within. Labyrinthine offers two distinct gaming experiences. In the story mode, you will follow the enigmatic trail of Joan, the mysterious fairground worker, uncovering the maze’s haunting history and facing terrifying challenges together.\nHowever, if you’re seeking the ultimate test of bravery, venture into the case files – procedurally generated mazes that promise endless variation and escalating difficulty. Each investigation reveals new horrors, forcing you to adapt and strategize with your fellow players. Solve puzzles , gather essential items, and survive the nightmarish encounters that await.\nAs you delve deeper into the case files, you will discover a leveling system that unlocks not only new monsters and maps but also rare cosmetics .\nWith cooperative play at its core, Labyrinthine encourages teamwork and communication to overcome the malevolent forces that lurk in the shadows. But be warned, in this maze of terror, splitting up may be your only chance to stay one step ahead of the lurking evils.\nIf you are a true horror enthusiast, Labyrinthine promises an experience like no other. Immerse yourself in an atmosphere of dread and anticipation as you navigate the ever-changing maze, surrounded by the unknown.\nAre you ready to face the darkness together, or will you succumb to the horrors that await? Step into Labyrinthine and find out if you have what it takes to escape the nightmare.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/labyrinthine-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/labyrinthine-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 – 64bit",
        "Processor": "Intel i5 or AMD Equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "ATI HD7900 series or Nvidia Equivalent.",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Valko Game Studios",
        "Platform": "PC",
        "Game Size": "10.3 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v06.12.2024 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/MLDE9a",
        "https://buzzheavier.com/aq03mjb8cttw",
        "https://megadb.net/0khapl9xib5q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/labyrinthine-preinstalled-steamrip.jpg"
}