{
    "page_url": "https://steamrip.com/last-light-free-download-m2/",
    "title": "Last Light",
    "description": "Get Last Light PC game for free instantly and play pre-installed on SteamRiP\nThe hospital is enclosed in darkness . All you have to light your way, is a flashlight, and the dim glow of candles. Who awaits Lumi in the darkness Those who conceal themselves in the dark . Those who sense your presence by catching the faintest of sounds. Being ambushed by a demon completely out of the blue, or out of the dark, rather? That is the kind of experience this game will deliver. If a demon finds you, don’t hesitate to run. Having the courage to flee may be your most important tactic .\nThe key points to this game are the hospital’s geography, lockers, and items. Items that can be found in the field include those for improving visibility, and for directly opposing the demons. Diaries, serving as clues to what happened in the tragedy-stricken past, can be found throughout the hospital. A characteristic of this game is that the difficulty gradually rises as the story progresses. Even for those who feel the game lacks a bit in challenge, there will be an utterly despairing ending waiting for you. Plants VS Zombies GOTY Edition",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/last-light-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/last-light-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "window 10 64bit",
        "Processor": "intel(R) Core(TM) i3-3220T CPU @ 2.80GHz (4CPUs),~2.8GHz",
        "Memory": "8 GB RAM",
        "Graphics": "GTX1050ti",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Team Corn Field",
        "Platform": "PC",
        "Game Size": "1.65 GB",
        "Repack By": "SEWN",
        "Version": "v1.0.2.0 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8bp2p3ghwy3n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/last-light-free-download-preinstalled-steamrip-1.jpg"
}