{
    "page_url": "https://steamrip.com/last-train-home-free-download-l1/",
    "title": "Last Train Home",
    "description": "Embark on a desperate mission through the depths of a war-torn wasteland. Your goal is to guide Czechoslovak soldiers back home onboard an armored train, but the path ahead is fraught with peril. Caught in the middle of a brutal civil war between Russia’s Red and White Armies, your unit must remain in fighting shape, managing what little resources you have and maintaining morale at all costs. Venture through the bleak and unforgiving landscape of Siberia, where the freezing cold and the merciless environment will push you to your very limit. Resources are scarce and your crew is exhausted, but you must keep pushing forward.\nAs you journey through the heart of the conflict, the horrors of war will surround you. The fate of your legion rests on the actions of a few key soldiers, as you engage in real-time battles that will determine the outcome of your mission. You must choose your tactics wisely, using every skill at your disposal to safeguard your troops and complete your mission. With careful training and development, your squads will become a seasoned legion of comrades, brothers and sisters , ready to face any challenge that comes their way. Gangs of Sherwood\nThe decisions you make along the journey will determine the fate of your comrades. Inspired by historical events, of the Czechoslovak Legion and their determination to return to their newly formed republic following The Great War, this mission will test your courage and your will to survive. The Last Train Home is in your hands.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/last-train-home-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/last-train-home-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 64 bit",
        "Processor": "3 GHz Quad-Core",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia® GeForce™ GTX 1050-Ti (4GB) / AMD® Radeon™ RX 570 (4GB)",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Ashborne Games",
        "Platform": "PC",
        "Game Size": "22 GB",
        "Released By": "RUNE Emu",
        "Version": "v1.0.0.32413 + 3 DLC | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/923B40793D",
        "https://buzzheavier.com/n1ifunyv3jfl",
        "https://datanodes.to/dqkr8x5za5c6/Last-Train-Home-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/last-train-home-preinstalled-steamrip.jpg"
}