{
    "page_url": "https://steamrip.com/last-epoch-free-download-l1/",
    "title": "Last Epoch Directly Download",
    "description": "Last Epoch combines time travel, exciting dungeon crawling, engrossing character customization and endless replayability to create an Action RPG for veterans and newcomers alike. Travel through the world of Eterra’s past and face dark empires, wrathful gods and untouched wilds – to find a way to save time itself from\nEmbark on your adventure as one of five powerful classes and, through your journey, ascend into a unique Mastery Class that unlocks more specialized abilities and build-options. Dungeon Core\nEvery skill has its own augment tree that will allow you to control, alter, and empower your playstyle. Transform your skeletons into archers, your lightning blast into chain lightning, or make your serpent strike summon snakes to fight alongside you Fill your arsenal with magic items that you may craft to perfection, change the rules of your build with powerful unique and set items, and always have that next upgrade just on the horizon with Last Epoch’s deep and randomized loot system.\nThe items you wield are yours to forge Last Epoch’s community-revered crafting system allows you to control your character’s power progression, featuring robust and deterministic upgrade mechanics. Travel to different moments of time where you will discover the many factions and secrets that exist within the world of Eterra and fight to set the timeline onto a new path.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/last-epoch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/last-epoch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5 2500 or AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "nVidia GTX 660ti or AMD R9 270 with 2+ GB of VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Eleventh Hour Games",
        "Platform": "PC",
        "Game Size": "14.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.2.6.3 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/cSS8F6",
        "https://buzzheavier.com/kjyybdmeuze3",
        "https://datanodes.to/qn081c7k8n87"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/last-epoch-preinstalled-steamrip-1.jpg"
}