{
    "page_url": "https://steamrip.com/legend-of-keepers-career-of-a-dungeon-manager-free-download-1p/",
    "title": "Legend of Keepers Career of a DM",
    "description": "Each run will be different but players will keep some of their Master’s bonuses between runs. Like we’ve already mentioned, our game is a mix between Roguelite and Dungeon Management. How did we achieve that? By running many tests to find the perfect balance between management and dungeon phases\nFirst, you will have to plan your defense against a group of adventurers . Check their stats and resistances, then place the best traps and monsters to defeat them When you think your dungeon is ready, let the crawl begin\nYou will then be able to watch those heroes die! It’s a reversed dungeon crawler: heroes will move through your dungeon and will trigger the traps you placed. When a group of adventurers encounters a group of monsters you positioned in your dungeon, a turn-based fight will happen HeroQuest (Board Game), Naheulbeuk (French audio series) GWENT: Rogue Mage\nKaamelott (the best French series), Monty Python (English series). Video games: Darkest Dungeon, Slay the Spire, Dungeon Keeper, Final Fantasy, Divinity, For the King, Chroma Squad, Battle Brothers, West of Loathing and so many more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/legend-of-keepers-creer-of-a-dungeon-manager-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/legend-of-keepers-creer-of-a-dungeon-manager-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Core i3 or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 11 and/or OpenGL 3.3 compatible video card",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Goblinz Studio",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "GOG",
        "Version": "v1.1.0.2 | Full  + 4 DLCs/Bonuses",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ju6qckgn9cgu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/legend-of-keepers-creer-of-a-dungeon-manager-preinstalled-steamrip.jpg"
}