{
    "page_url": "https://steamrip.com/legendary-hoplite-free-download-l1/",
    "title": "Legendary Hoplite",
    "description": "Play as Dio, a young commander inspired by the old heroes from Greek mythos like Achilles, Hector, and Perseus. He uses spears, swords and shields to slay thousands of monsters attacking the city of Ithaca. Dio has yet to discover his true power with a wide selection of gear to be used, godlike powers to be summoned and entire new armies to be drafted for battle . This is a war for the fate of mankind. HELLCARD\nThe monsters that will try to breach your defense are many and varied. You’ll need to think carefully about combat tactics and power balance, especially when dealing with legendary bosses. The most important goal is to not let the enemy pass through the gate. Fight against the beasts and legendary tribes from Greek mythology. They will use all their might to break through your ranks and shatter the line of defense.\nThe mundane weapons of the world are not enough to repel the attacks of the mighty monsters. Dio needs the weapons with deadly power, the artifacts blessed by the Gods themselves. Besides strategically arranging the armies, you’ll need to upgrade them through battles to match the stronger and more unusual enemies. The classic skill tree upgrade system combined with the sets of war technique provide the required versatility. Changing them will open up tactical options and let your defenders vanquish the ever-changing monster waves.\nYour enemies are the beasts and legendary races from Greek mythology who conflicted with humans since the dawn of time and have long wanted to exterminate them. The legions of the dead started this war, gathered the army and attacked Ithaca in great numbers. The beasts and monsters from around the region took advantage of the opportunity to advance their forces. Pay special attention to the bosses. They are creatures of legend that caused much suffering to mankind. Now, they will use their impetuous primordial strength to break through our defenses .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/legendary-hoplite-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/legendary-hoplite-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, Windows 11",
        "Processor": "Dual Core 2 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 4600 (AMD or NVIDIA equivalent)",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Strategy",
        "Developer": "TripleBricksGames",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.3.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/99pgfxr9dy5j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/legendary-hoplite-preinstalled-steamrip.jpg"
}