{
    "page_url": "https://steamrip.com/legends-of-kingdom-rush-free-download-n1/",
    "title": "Legends of Kingdom Rush Free Download",
    "description": "Embark on an epic journey through the medieval fantasy world of Kingdom Rush in this amazing RPG game with roguelike elements An extraplanar menace of unprecedented proportions is attacking the realm Lead a party of heroes to stop this foe in a highly engaging combat system that is easy to learn but hard to master. 6 Legendary Heroes, like the mighty paladin Gerald Lightseeker or the cunning shadow assassin\nAsra Daggerfall, will be awaiting your command. 12 Companion Heroes, with different skills and powers, like the resourceful forest ranger, the volatile dwarven bombardier, or the menacing dark knight will follow your Legends to victory Unlock all of these fantastic heroes as you push through more and more dangerous lands.\nStrategically move your heroes on a hex-based grid to best fit their skills to your combat tactics. Switch and match your heroes and companions until you find your ideal team for each battle Learn more about the Kingdom Rush universe with over 100 narrative events while you fight your way through lush forests, rugged mountains, and devastated wastelands. Prove yourself as a legend, playing Daily Challenges and competing for the top spot in our weekly Leaderboard. Engage in countless intense battles separate from adventures in the new Quick-Play Arena mode Face hordes of enemies with a randomly assigned party and combat diversifiers. Fight the new Elite units, the Kingdom’s most dangerous enemies",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/legends-of-kingdom-rush-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/legends-of-kingdom-rush-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "OpenGL 3.0 compliant with 512MB of video RAM.",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "ronhide Game Studio",
        "Platform": "PC",
        "Game Size": "591 MB",
        "Released By": "N/A",
        "Version": "v3.1.0 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mdm6uy06nrp1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/legends-of-kingdom-rush-preinstalled-steamrip.jpg"
}