{
    "page_url": "https://steamrip.com/lego-pirates-of-the-caribbean-the-video-game-free-download-u1/",
    "title": "LEGO Pirates of the Caribbean The Video Game Free Download",
    "description": "Get LEGO Pirates of the Caribbean The Video Game for free instantly and play pre-installed on SteamRiP\nLEGO Pirates of the Caribbean : The Video Game is an action adventure game that brings the Pirates of the Caribbean world and all its colorful characters to life in LEGO Brick form. Players will experience all the memorable scenes from all four films in the humorous and quirky LEGO Video Games style. NFS Games Experience the swashbuckling adventure, irreverent humor, memorable characters and amazing creatures of the Pirates of the Caribbean universe (content from all 4 films), through action-adventure gameplay, engaging puzzles and hilariously quirky LEGO cutscenes .\nPlay as Jack Sparrow, Captain Barbossa , Davy Jones and all of your other favorite Pirates of the Caribbean characters, each with their own personalities Experience your favorite sequences from all four films in an all-new way with the “LEGO twist” that takes players from the port of San Juan to the pirate haven of Tortuga and everywhere in-between Local Co-op play, one of the most beloved features of the LEGO video game series, returns to allow you to team up and enjoy the adventure with others.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/lego-pirates-of-the-caribbean-the-video-game-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/lego-pirates-of-the-caribbean-the-video-game-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7 / XP SP3",
        "Processor": "2.7 GHz Intel Pentium 4 class or AMD Athlon or equivalent processor",
        "Memory": "2 GB RAM",
        "Graphics": "256 MB 3D video card"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Traveller’s Tales",
        "Platform": "PC",
        "Game Size": "7.4 GB",
        "Repack By": "GOG",
        "Version": "v1.0 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/len1x2rlyya8",
        "https://megadb.net/hvos6zlt918r"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/lego-pirates-of-the-caribbean-the-video-game-preinstalled-steamrip.jpg"
}