{
    "page_url": "https://steamrip.com/lego-bricktales-free-download-1o/",
    "title": "LEGO Bricktales Directly Download",
    "description": "Embark on an epic adventure across a world of beautiful LEGO diorama biomes crafted brick by brick as you search for inspiration to help your grandfather reinvigorate his rundown amusement park with your little robot buddy in tow. Your journey will take you to the deepest jungle, sun-drenched deserts, a bustling city corner, a towering medieval castle, and tropical Caribbean islands.\nHelp the minifigures of these worlds by solving puzzles and unlock new skills throughout the story to further explore these worlds and uncover the many secrets and mysteries they contain From purely aesthetic creations, such as a market stand or music box, up to functional physics-based puzzles like building a crane or gyrocopter – each diorama offers a variety of construction spots with the freedom of intuitive brick-by-brick building .\nIn each spot you are given a set of bricks and it’s up to you to figure out a unique build that will work. On top of specific puzzles and quests , there are additional builds in the amusement park so you can customize the rides to make them your own Your grandfather, a genius inventor, has called you for help\nHis beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren’t made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology. As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather’s amusement park",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/lego-bricktales-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/lego-bricktales-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8, 10, 11",
        "Processor": "3 GHz Dual-Core or better",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 960 / Radeon R9 380 or better",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Simulation",
        "Developer": "ClockStone",
        "Platform": "PC",
        "Game Size": "425 MB",
        "Released By": "GOG",
        "Version": "v1.3 r17934 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x7woso5ks217"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/lego-bricktales-preinstalled-steamrip.jpg"
}