{
    "page_url": "https://steamrip.com/lego-star-wars-the-skywalker-saga-free-download-k1/",
    "title": "LEGO Star Wars The Skywalker Saga",
    "description": "The galaxy is yours in LEGO Star Wars: The Skywalker Saga. Experience memorable moments and nonstop action from all nine Skywalker saga films reimagined with signature LEGO humor. The digital edition includes an exclusive classic Obi-Wan Kenobi playable character.\nExplore the Trilogies in Any Order – Players will relive the epic story of all nine films in the Skywalker Saga, and it all starts with picking the trilogy of their choice to begin the journey. Play as Iconic Heroes and Villains –More than 300 playable characters from throughout the galaxy. Discover Legendary Locales – Players can visit well known locales from their favorite Skywalker saga films .They can unlock and have the freedom to seamlessly travel to 23 planets as they play through the saga or explore and discover exciting quests.\nCommand Powerful Vehicles – More than 100 vehicles from across the galaxy to command. Join dogfights and defeat capital ships like the Super Star Destroyer that can be boarded and explored. Immersive Player Experiences String attacks together to form combo chains and fend off oncoming attacks. New blaster controls and mechanics allow players to aim with precision, or utilize the skills of a Jedi by wielding a lightsaber and using the power of The Force. LEGO STAR WARS The Force Awakens\nUpgradable Character Abilities – Exploration rewards players as they uncover Kyber Bricks which unlock new features and upgraded abilities across a range of character classes, including Jedi, Hero, Dark Side, Villain, Scavenger, Scoundrel, Bounty Hunter, Astromech Droid, and Protocol Droid.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/lego-star-wars-the-skywalker-saga-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/lego-star-wars-the-skywalker-saga-screenshots-steamrip.jpg.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-2400 or AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 750 Ti or Radeon HD 7850",
        "DirectX": "Version 11",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "TT Games",
        "Platform": "PC",
        "Game Size": "29.4 GB",
        "Released By": "FLT",
        "Version": "v1.0.0.44657 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/AE51B283DF",
        "https://buzzheavier.com/qti3paiyxshg",
        "https://1fichier.com/?pa8tg6d6g6t03kde6xgv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/lego-star-wars-the-skywalker-saga-preinstalled-steamrip.jpg"
}