{
    "page_url": "https://steamrip.com/lego-the-lord-of-the-rings-free-download-s2/",
    "title": "LEGO The Lord of the Rings Free Download",
    "description": "LEGO The Lord of the Rings Download PC Game In Direct Link for free on SteamRIP\nBased on The Lord of the Rings motion picture trilogy , LEGO The Lord of the Rings follows the original story-lines of The Lord of the Rings: The Fellowship of the Ring, The Lord of the Rings: The Two Towers , and The Lord of the Rings: The Return of the King, taking players through the epic story events re-imagined with the humor and endless variety of LEGO play.\nTrusted with the dangerous task to destroy an ancient magical ring that threatens all that is good, Frodo is forced to leave his peaceful home. But the ring wants to be found and the road to Mount Doom, the only place where it can be destroyed, will be perilous and riddled with Orcs and fouler things. To help Frodo, a Fellowship is formed Aragorn the Ranger, Gandalf the Wizard, Legolas the Elf, Gimli the Dwarf, Boromir a Man of Gondor, and Frodo’s Hobbit friends Sam , Merry and Pippin. Players relive the legend through the LEGO mini-figures, as they explore wonders, solve timeless riddles, and overcome endless foes in their quest to destroy the Ring .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/lego-the-lord-of-the-rings-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/lego-the-lord-of-the-rings-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® XP SP3, Vista, or Windows® 7",
        "Processor": "Dual Core CPU @ 2GHz (Pentium D or better)",
        "Memory": "1GB RAM",
        "Hard Disk Space": "8 GB free HDD space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Traveller’s Tales",
        "Platform": "PC",
        "Game Size": "5.07 GB",
        "Repack By": "MEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/45"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/lego-the-lord-of-the-rings-free-download-preinstalled-steamrip.jpg"
}