{
    "page_url": "https://steamrip.com/lens-island-free-download-t1/",
    "title": "Len’s Island Free",
    "description": "Get Lens Island PC game for free instantly and play pre-installed on SteamRiP\nYou’re new to town , with only the tools in your backpack and a can-do attitude you build a new life for yourself on the beautiful island nearby. Unravel the dark secrets the island holds as you venture deeper into the caves to search for what past travellers have sought after.\nLen’s Island is a blend of peaceful building, farming and crafting, mixed with intense combat, dungeon battles and exploration. Build the home of your dreams. Build wherever you want, make it as big as you want, and choose from a range of materials to let your creativity run wild! Len’s Island uses a unique modular building system that allows anyone to feel like a seasoned home designer .\nLooking for some more action ? Len’s Island is a fast-paced, skill-driven dungeon crawler with a strong focus on engaging a wide range of combat types and loadout combinations. If you’re getting bored of building your home, tending to your crops and meeting the local townsfolk, there are deep, dark caves below the island with plenty to explore.\nTend to your crops Use farms to grow the food that fuels your ventures into the dungeons and long days exploring the Islands; as well as grow exotic plants and flowers to sell back to the villagers for gold. Grow large-scale farms throughout the forest, or care for small garden beds on your balcony. Or if you’re not the green-thumb type, place some pot plants and call it a day.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/lens-island-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/lens-island-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or higher (64-bit)",
        "Processor": "2.4 Ghz Dual Core CPU",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB Dedicated Memory",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Flow Studio",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "0xdeadc0de (Ty Owla for CSF, csrin)",
        "Version": "v1.0.13 (Build 19150723) + Co-op | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/vlbbttq2ce0z",
        "https://megadb.net/k7yyr8g35ds0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/lens-island-free-download-preinstalled-steamrip.jpg"
}