{
    "page_url": "https://steamrip.com/life-is-strange-before-the-storm-farewell-free-download-n3/",
    "title": "Life is Strange: Before the Storm Farewell Free direct Download",
    "description": "Get Life is Strange: Before the Storm Farewell for free pre-installed\nLife is Strange : Before the Storm is a new three part; standalone adventure set three years before the first game in the BAFTA award-winning franchise. You play as sixteen-year old Chloe Price who forms an unlikely friendship with Rachel Amber, a beautiful and popular girl destined for success.  When Rachel learns a secret about her family that threatens to destroy her world, it is her newfound friendship with Chloe that gives her the strength to carry on. No longer alone the girls must confront each other’s demons and together, find a way to overcome them. Gold Rush: The Game\nThe plot of the game revolves around a girl named Chloe Price, who experienced a terrible tragedy the day before – her father died in a car accident. It is very difficult for the girl to survive the loss, and on top of that, her friend Max also left the city. The girl begins to drink, skip the academy, and even gets involved in such events, from which the whole life begins to turn upside down. But everything changes with the appearance of a new girlfriend , the first beauty of the school, a girl named Rachel Amber",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/life-is-strange-before-the-storm-farewell-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/life-is-strange-before-the-storm-farewell-free-download-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or above (64-bit Operating System Required)",
        "Processor": "Intel Core i3-2100 (3.1GHz) or AMD Phenom X4 945 (3.0GHz)",
        "Memory": "3 GB RAM",
        "Graphics": "AMD Radeon R7 250 or NVIDIA Geforce GTX 650",
        "DirectX": "Version 11",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Deck Nine, Feral Interactive (Mac), Feral Interactive (Linux)",
        "Platform": "PC",
        "Game Size": "18.42 GB",
        "Repack By": "CODEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/6wo9fwbftxi1",
        "https://1fichier.com/?h0w9wbjdjhcevvd5a9dg",
        "https://megadb.net/5klaecwlembv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/life-is-strange-before-the-storm-farewell-free-download-preinstalled-steamrip.jpg"
}