{
    "page_url": "https://steamrip.com/limbo-free-download-1w/",
    "title": "LIMBO Free Directly Download",
    "description": "LIMBO Download PC Game In Direct Link for free on SteamRIP\nLIMBO is a dark, but at the same time very atmospheric 2D platformer in which you have to go in search of the protagonist’s sister, overcoming obstacles, traps and all kinds of dangers In the story, you will play as a little boy who went in search of his younger sister.\nSuddenly he finds himself on the edge of an incomprehensible gloomy forest – the location is called the so-called edge of Hell. And it is from this moment that your adventures begin. But don’t think it will be easy. In this incomprehensible place, you will not find friends, and everyone you meet will try to kill you or escape.\nThe most interesting thing is the gameplay. It would seem that a roguelike simply cannot exist without battles – and nevertheless, there are no battles in this roguelike. All the enemies that you meet, you will have to overcome using ingenuity . In general, the whole LIMBO gameplay is aimed at interacting with the outside world.\nSomewhere you will need to pull the rope so that a stone falls, with the help of which it will be possible to climb higher, and somewhere you will have to use a boat to swim across the dangerous section of the lake. There are many options, and at the same time, every decision you make will be accompanied by a trap .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/limbo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/limbo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Vista, 7",
        "Processor": "2 GHz",
        "Memory": "512MB",
        "Hard Disk Space": "150MB"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Playdead",
        "Platform": "PC",
        "Game Size": "122 MB",
        "Repack By": "GOG",
        "Version": "v3.0.0.1a | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/iczzlivay6pp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/limbo-preinstalled-steamrip.jpg"
}