{
    "page_url": "https://steamrip.com/little-misfortune-free-download-1m/",
    "title": "Little Misfortune",
    "description": "Get Little Misfortune PC game for free instantly and play pre-installed on SteamRiP\nIn the story , you will play as an unusual little girl of eight years old, Ramirez Hernandez, who can no longer look at her mother, tormented by problems. Now she decided to fix it and embarks on a long journey in search of Endless Happiness for her mother. But there are several “ buts “.\nFirst, the path is very long and anything can happen along the way. Secondly, together with you and Ramirez , the mysterious Mr. Voice will go on a journey , commenting on everything that happens and giving hints. And thirdly, during the journey you will encounter a huge number of riddles, puzzles and unpredictable events.\nLittle Misfortune is an interactive story, focused on exploration and characters, both sweet and dark, where your choices have consequences. Starring Misfortune Ramirez Hernandez, an imaginative 8-year-old, who seeks the prize of Eternal Happiness, as a gift to her Mommy .\nLed by her new friend, Mr. Voice, they venture into the woods, where mysteries are unraveled and a little bit of bad luck unfolds. Sharing the same universe with the cult video game Fran Bow, created by the visionary dev-duo Killmonday Games. Bloons TD 5",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/little-misfortune-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/little-misfortune-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit or higher",
        "Processor": "Intel(R) Core(TM) i5-6300U CPU @ 2.5 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Intel(R) HD  520",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Killmonday Games AB",
        "Platform": "PC",
        "Game Size": "1.92 GB",
        "Repack By": "GOG",
        "Version": "v1.0 (Fancy Edition) | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wtx59tly8hlh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/little-misfortune-free-download-preinstalled-steamrip.jpg"
}