{
    "page_url": "https://steamrip.com/little-goody-two-shoes-free-download-w1/",
    "title": "Little Goody Two Shoes Directly Download",
    "description": "There once was Elise , a vibrant and ambitious young lass with a big dream – becoming filthy rich. In spite of this, the stars didn’t seem to have reserved our protagonist much fortune in life. Elise, who came from humble beginnings, had no choice but to spend her days away assisting her fellow neighbours with menial tasks to make a living. One day, Elise discovers a pair of beautiful shiny red shoes buried in her backyard – what a surprise! Bewitched, Elise embarks on a fearful journey that pulls her closer and closer into the heart of the mysterious Woods Song of Nunu: A League of Legends Story\nWill Elise risk it all for the sake of a dream come true, or settle for her humble day-to-day life? The ending of this tale is yours to write Little Goody Two Shoes is a horror narrative adventure game, set in a hand-painted fairy tale environment. There are 10 possible endings to fit your choices and actions in the game.\nBut there’s more than meets the eye here, as you must also manage multiple aspects of Elise’s life in the village to stay alive. Remember, all decisions matter in this story During the day, you will need to strengthen Elise’s bonds with her fellow villagers and work to make a living by playing fun minigames . But once the moon rises, make sure to keep Elise fed, healthy and sane in the multiple encounters with deadly foes as she makes her way further into the Woods .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/little-goody-two-shoes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/little-goody-two-shoes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-540 or AMD Phenom II X4 965",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 640, 2 GB or AMD Radeon R7 240, 2 GB",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG",
        "Developer": "AstralShift",
        "Platform": "PC",
        "Game Size": "5.2 GB",
        "Released By": "TENOKE",
        "Version": "Build 12464502 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qbjosi4perz3",
        "https://buzzheavier.com/lob0orp30g2a",
        "https://datanodes.to/b9y48woiv2iy/Little-Goody-Two-Shoes-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/little-goody-two-shoes-preinstalled-steamrip.jpg"
}