{
    "page_url": "https://steamrip.com/little-orpheus-free-download-o1/",
    "title": "Little Orpheus Directly Download",
    "description": "The year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia , a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. He promptly vanishes.\nThree years later he emerges claiming to have saved the world. He has also lost the atomic bomb powering the Little Orpheus. He is taken to a top-secret bunker deep below the Ural mountains to be debriefed by the fearsome General Yurkovoi , a man so frightening even Stalin won’t buy him a drink. The General rolls up his sleeves, fixes Ivan with a steely glare and say “So where have you been comrade? And where is my bomb?” And Ivan looks him right back in the eye and says “Well General, you might not believe what happened to me, but I’ll do my best. Because it happened like this” Disney Dreamlight Valley\nJoin our bold yet hapless hero as he explores lost civilizations, undersea kingdoms , prehistoric jungles and lands beyond imagination. Gasp as he battles the subhuman tribe of the Menkv and escapes the clutches of dreadful monsters Cheer as he triumphs over impossible odds and brings socialism to the subterranean worlds",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/little-orpheus-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/little-orpheus-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "AMD FX 6300 X6 / Intel Core i5-3570K",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB VRAM, Radeon 7870 / GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "The Chinese Room",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "CODEX Emu + Steamless",
        "Version": "v4.0.0 (build 8267993) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5skwmqj5alkw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/little-orpheus-preinstalled-steamrip.jpg"
}