{
    "page_url": "https://steamrip.com/little-big-adventure-twinsens-quest-free-download/",
    "title": "Little Big Adventure – Twinsen’s Quest",
    "description": "Step into Twinsun’s fantastical world in this action-adventure remake! Little Big Adventure – Twinsen’s Quest brings brand new visuals, new music by the original composer, and smoother gameplay to the iconic classic released back in 1994. LEGO Horizon Adventures\nEmbark on a Timeless Adventure, Reimagined Twinsen is back in this remake featuring a new stylish makeover and modernized gameplay. Faithful to the original game, Little Big Adventure – Twinsen’s Quest takes you on an epic journey on a small planet harboring both magic and technology.\nA Tale of Destiny and Heroism On a planetoid with two suns, four species lived in perfect harmony But that all changed when the brilliant scientist Dr. FunFrock invented cloning and teleportation, bringing the inhabitants under his total control. End the clone occupation while playing as Twinsen, a model citizen turned fugitive. Armed with your mysterious Magic Ball, explore beautiful landscapes , solve intricate puzzles, and face formidable foes\nWhether you’re a long-time fan or new to the series, Little Big Adventure – Twinsen’s Quest offers an adventure like no other. Are you ready to become the hero Twinsun needs?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/little-big-adventure-twinsens-quest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/little-big-adventure-twinsens-quest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 4460",
        "Memory": "8 GB RAM",
        "Graphics": "nVidia GeForce GTX 970",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "[2.21]",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "GOG",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3o283k29yzjn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/little-big-adventure-twinsens-quest-preinstalled-steamrip.jpg"
}