{
    "page_url": "https://steamrip.com/living-with-sister-monochrome-fantasy-free-download/",
    "title": "Living With Sister: Monochrome Fantasy Download",
    "description": "Living in a fantasy world, it’s always been your dream to grow up to be a famous adventurer just like your father. Reality proves to be more boring than fiction, however, as your days are mostly spent doing odd jobs for the villagers. With your friends by your side, you enter the Tournament of the Eights and strive for something greater: the chance to become the top guild in the country. Will you realize your ambitions, or will your hopes slip through your fingers and doom you to a life of monochrome monotony? Golden Record Retriever\nAs a member of your town’s Adventurers’ Guild , it’s your job to protect the townsfolk. Go on hunts, kill dangerous beasts, and hone your abilities to better tackle whatever challenges tomorrow brings.\nOnce you get home from work, you’ll have your sister to attend to. She’s a very sickly girl who needs a lot of help. Manage your household finances well, build up your relationship with your sister, and who knows, perhaps you might even be able to solve the mystery behind her illness .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/living-with-sister-monochrome-fantasy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/living-with-sister-monochrome-fantasy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows® 7/8/8.1/10",
        "Processor": "Intel Core2 Duo or better",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 9/OpenGL 4.1 capable GPU",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie",
        "Developer": "Inusuku",
        "Platform": "PC",
        "Game Size": "475 MB",
        "Released By": "N/A (csrin)",
        "Version": "v1.02 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rvzzzn281sre"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/living-with-sister-monochrome-fantasy-preinstalled-steamrip.jpg"
}