{
    "page_url": "https://steamrip.com/lobotomy-corporation-monster-management-simulation-free-download-l1/",
    "title": "Lobotomy Corporation Directly Download",
    "description": "Monsters beyond your imagination , and you: The Manager. Monsters beyond your imagination, and you: The Manager. A roguelite monster-management simulation inspired by the likes of the SCP Foundation, Cabin in the Woods, and Warehouse 13. Order your employees to perform work with the creatures and watch as it unfolds; harness greater energy, and expand the facility. One disaster will lead to another, until everything has fallen into chaos. “I give you a warm welcome to Lobotomy Corporation.” Wolfenstein: The New Order\nOur game was inspired by the monsters birthed of various inspirations featured in games, film, and series, such as the SCP Foundation , Cabin in the Woods, and Warehouse 13. Going further, it was developed with this thought: “What if those monsters were real, and your job were to manage them?”\nYou will be playing as the Manager of Lobotomy Corporation, a company in which such creatures are contained and managed. Order your employees to perform work with and on the creatures and watch the results expectantly. Gather energy produced by the monsters and fulfill the quota each day, expand the facility, and manage even more strange beings. In this game, the player will face an ever-present sense of tension and dread as they progress through each day.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/lobotomy-corporation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/lobotomy-corporation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 8.1 or later",
        "Processor": "Intel(R) Core(TM) i5-3570",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 550 ti or Radeon hd 6570",
        "DirectX": "Version 9.0c",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "ProjectMoon",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2.13f1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qby8k0rsz2dk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/lobotomy-corporation-preinstalled-steamrip.jpg"
}