{
    "page_url": "https://steamrip.com/loddlenaut-free-download-l1/",
    "title": "Loddlenaut Direcly Download",
    "description": "Loddlenaut is an ocean cleanup adventure set on a vibrant alien planet. Play as an interstellar custodian who is tasked with cleaning up the pollution left behind by spacefaring mega-corporation. Befriend local axolotl-like creatures and explore sunken corporate ruins as you revive the planet’s lush ecosystems. The Exit 8\nYour mission: Clean up the ocean planet of GUP-14 after it was abandoned by GUPPI, a mega-corporation that makes and sells everything from soda to spaceships. When you first arrive on the planet, you’ll find yourself amid murky waters, oil spills, and scattered junk.\nWithin the polluted environments, you’ll find remnants of GUPPI’s buildings , ships, and machinery all sunken to the ocean floor. Discover clues about the planet’s past inhabitants as you clean up the mess they left behind using an assortment of high-tech gadgets. As you clean up the planet, you’ll run into axolotl-like aliens known as “loddles.” Protect them from the polluted waters and feed them aquatic fruits while you make their planet habitable again. Depending on their diet, loddles will grow in different ways and develop unique traits and abilities that will further enable them to survive on this polluted planet.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/loddlenaut-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/loddlenaut-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SPI+ or later",
        "Processor": "Intel / AMD Dual Core @ 1+ GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Radeon RX 550",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Moon Lagoon",
        "Platform": "PC",
        "Game Size": "346 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.2.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0ldnipw8n5s5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/loddlenaut-preinstalled-steamrip.jpg"
}