{
    "page_url": "https://steamrip.com/lollipop-chainsaw-repop-free-download/",
    "title": "LOLLIPOP CHAINSAW RePOP",
    "description": "The cheerleader Juliet, born into a family of zombie hunters , uses her trusty chainsaw to rip and tear through the undead! But now that RePOP adds speedier chainsaw action and auto-fire for her chainsaw blaster, the action never slows down till the very end! And it’s not just the gameplay that’s been improved, the visuals and soundtrack have been powered up too STAR WARS Jedi: Survivor\nDon’t miss out on this unparalleled zombie hunting adventure The story starts in San Romero High School, the largest high school in the district, somewhere on the west coast of the US of A. Protagonist Juliet Starling, is an exemplary student of San Romero who passionately loves cheerleading.\nUnbeknownst to most, however, her family, the Starlings , has been a lineage of zombie hunters, guiding the undead to beyond since ancient times The incident unfolds on Juliet’s birthday. She heads to school to meet her boyfriend, but as she pedals her bicycle into the school grounds, she is greeted by the sight of her former schoolmates , who have all been turned into zombies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/lollipop-chainsaw-repop-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/lollipop-chainsaw-repop-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10 64bit",
        "Processor": "Intel Core i5-8400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060(6GB)",
        "DirectX": "Version 12",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "DRAGAMI GAMES, LTD.",
        "Platform": "PC",
        "Game Size": "14 GB",
        "Released By": "TENOKE",
        "Version": "Build 15664141 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CKHn3X",
        "https://buzzheavier.com/d9xgmdkgbpwx",
        "https://megadb.net/r34q5rmvfme0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/lollipop-chainsaw-repop-preinstalled-steamrip.jpg"
}