{
    "page_url": "https://steamrip.com/look-outside-free-download/",
    "title": "Look Outside",
    "description": "Look Outside is a survival horror RPG set in a single apartment building . A mysterious event turns anyone who looks out the window into grotesque monsters , leaving the world in absolute chaos. Scavenge the building to seek food, supplies, and weapons while encountering strange characters – human and otherwise.\nSurvival Horror & Resource Management Plan tense expeditions outside your apartment as you fend off grotesque monsters dwelling in and around your building. Return to your home with gathered resources and partial answers to your questions to recuperate by playing games, making dinner, crafting tools, and getting to know your neighbors turned allies.\nInventive Turn-Based Combat Clash with over 150 hand-crafted creatures in turn-based combat that accounts for space between you and your foes as you wield makeshift weapons and items you’ve gathered in the corridors of the building. Cataclismo\nImpeccable Body Horror Aesthetic Meet your macabre fate in a bizarre world teeming with an unconventional and occasionally psychotic cast of characters – some of which you can recruit and offer safe harbor in your apartment as the mystery unravels.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/look-outside-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/look-outside-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 x64",
        "Processor": "Intel Core i5-2500 / AMD Phenom II X4 965",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 750 / Radeon RX 560X",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG",
        "Developer": "Francis Coulombe",
        "Platform": "PC",
        "Game Size": "811 MB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vdqtyr2100t7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/look-outside-preinstalled-steamrip.jpg"
}