{
    "page_url": "https://steamrip.com/loop8-summer-of-gods-free-download-1g/",
    "title": "Loop8 Summer of Gods Directly Download",
    "description": "Your choices shape the world in this coming-of-age RPG set in 1980s rural Japan. Step into the life of Nini, a newly earthbound teen who arrives in the quaint Japanese town of Ashihara in August 1983. Explore the town, befriend its people, and face off against the Kegai in turn-based battles where the outcomes depend on the relationships you’ve built and the decisions you’ve made. Use Nini’s special connection to the gods to reset the world, with each loop allowing Nini and his allies to relive the 8th month over and over until they get it right or the Kegai overcome them entirely. Amnesia: The Bunker\nBuild bonds with Ashihara’s residents while protecting the town from the ever-present threat of the Kegai, repeating the cycle to uncover how your everyday actions impact your battles in the Underworld, and vice versa. Your adventure takes place in a nostalgic and beautifully recreated snapshot of a rural Japanese townscape. Head downtown to recharge at a local restaurant, or hang out at the shops to strengthen your bonds with other characters.\nThough the deadline for humanity’s extinction draws ever closer, Ashihara’s fate remains in your hands. Repeatedly return to the start of August, alter your actions, and see how they turn the tides of destiny across multiple endings. Loop8’s emotion-driven AI system responds to every action you take and decision you make. Characters’ emotions and stories will vary greatly based on your choices , making each playthrough wholly unique.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/loop8-summer-of-gods-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/loop8-summer-of-gods-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5-3470 / AMD FX-8300",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA Geforce GTX 660 / Radeon HD7870",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "Marvelous Inc.",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Released By": "TENOKE",
        "Version": "Build 11185902 | Full  7 DLCs + ArtBook",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rxf71oaspmnc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/loop8-summer-of-gods-preinstalled-steamrip.jpg"
}