{
    "page_url": "https://steamrip.com/lords-and-villeins-free-download/",
    "title": "Lords and Villeins: The Great Houses Free Download",
    "description": "Experience a highly complex simulation of markets within a sophisticated feudal city-builder. The royals entrusted you to settle and govern a new land, and it is your duty to exploit its riches for the benefit of the realm, your own wealth, and if you feel generous, the villagers alike! In order to do this, you will zone out plots, build houses, determine taxation policies, set priorities, and grow the supply chain alongside your population.\nFamilies are the centerpiece of Lords and Villeins. Their profession dictates their occupation in the economy and the kind of businesses they can run. Once you assign them a plot of land and build their house, they will do so almost completely autonomously, all the while managing their stock , setting aside produce to pay taxes, and trading with other families and caravans for supplies and to maximize their profit .\nYour role is to direct and regulate the economy. Balance the supply and demand, secure critical resources, and maintain stable growth. Lords and Villeins offers you a sandbox with an in-depth simulation and a great variety of strategies to manage it! Ranging from a fully communist economy where all produce is taxed and redistributed from your warehouse to a free marketplace with little to no intervention. Flame Keeper\nLogistics will challenge your management skills . As your settlement grows, you need to keep in mind the travelling distances, storage placements, private markets, and housing while reflecting on the terrain and its natural resources in order to fully optimize the productivity of each villager.\nHighly customizable gameplay lets you craft the exact kind of game that fits your taste Between a great variety of game modules and difficulty sliders, you can tweak the experience and focus on the elements of the game that you enjoy the most. While Lords and Villeins is primarily an economically driven game and military conflict plays only a small role, there are tons of options to explore and play with",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/lords-and-villeins-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/lords-and-villeins-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Pentium i5-3470",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 660",
        "DirectX": "Version 11",
        "Storage": "750 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Honestly Games",
        "Platform": "PC",
        "Game Size": "519 MB",
        "Released By": "TENOKE",
        "Version": "Build 14817361 | Full  + Lords and Villeins: The Great Houses",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nuvkz5lxtmzv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/lords-and-villeins-preinstalled-steamrip.jpg"
}