{
    "page_url": "https://steamrip.com/lords-of-the-fallen-free-download-1z/",
    "title": "Lords of the Fallen Directly Download",
    "description": "Lords of the Fallen introduces an all-new, epic RPG adventure in a vast, interconnected world more than five times larger than the original game. After an age of the cruellest tyranny, the demon God, Adyr, was finally defeated. But Gods do not fall forever. Now, aeons later, Adyr’s resurrection draws nigh.\nAs one of the fabled Dark Crusaders , journey through both the realms of the living and the dead in this expansive RPG experience, featuring colossal boss battles, fast challenging combat, thrilling character encounters, and deep, immersive storytelling. Will your legend be one of light or one of darkness? Star Trek: Infinite\nFully customise your character’s appearance from a wide array of visual options, before selecting one of nine character classes. Whichever starting path you take, develop your character to your own playstyle by upgrading stats, weapons, armour and spells. Only those that master the deep, tactical combat can hope to survive. Choose from 100s of uniquely brutal weapons, or forgo metal for magic with devastating attacks of the arcane.\nExperience the expansive, single player campaign alone, or unite with other lampbearers in online co-op. You are free to journey together for as long as you or they desire, collecting vigor (xp) and any weapons or gear enemies drop, ready to bring them back to your own world. Key items and quest progression won’t be transferred, to retain the integrity of your own tale. For those playing online, be warned, as heroes from other realms can, and will invade.\nAfter an age of the cruellest tyranny , the demon God, Adyr, was finally defeated. But Gods… do not fall forever. Now, aeons later, Adyr’s resurrection draws nigh. As one of the fabled Dark Crusaders, journey through both the realms of the living and the dead in this expansive RPG experience, featuring colossal boss battles, fast challenging combat, thrilling character encounters, and deep, immersive storytelling. Will your legend be one of light or one of darkness?\nExplore A Vast, Interconnected World Journey across two expansive, parallel worlds in your epic quest to overthrow Adyr. While the living realm presents its own brutal challenges, untold terrors lurk in the nightmarish realm of the dead.\nDefine Your Own Legend Fully customise your character’s appearance from a wide array of visual options, before selecting one of nine character classes. Whichever starting path you take, develop your character to your own playstyle by upgrading stats, weapons, armour and spells.\nMaster Fast, Challenging Fluid Tactical Combat Only those that master the deep, tactical combat can hope to survive. Choose from 100s of uniquely brutal weapons, or forgo metal for magic with devastating attacks of the arcane.\nUnite or Fight in Online Multiplayer Experience the expansive, single player campaign alone, or unite with other lampbearers in online co-op. You are free to journey together for as long as you or they desire, collecting vigor (xp) and any weapons or gear enemies drop, ready to bring them back to your own world. Key items and quest progression won’t be transferred, to retain the integrity of your own tale. For those playing online, be warned, as heroes from other realms can, and will invade .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/lords-of-the-fallen-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/lords-of-the-fallen-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "intel i5 8400 | AMD Ryzen 5 2600",
        "Memory": "12 GB RAM",
        "Graphics": "6GBs VRAM | NVIDIA GTX-1060 | AMD Radeon RX 590",
        "DirectX": "Version 12",
        "Storage": "45 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "HEXWORKS",
        "Platform": "PC",
        "Game Size": "33.3 GB",
        "Released By": "Mr_Goldberg Emu",
        "Version": "v2.0.19 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/HOpWsP",
        "https://buzzheavier.com/b0mcbqkffvaz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/lords-of-the-fallen-preinstalled-steamrip.jpg"
}