{
    "page_url": "https://steamrip.com/lost-in-random-the-eternal-die-free-download/",
    "title": "Lost in Random: The Eternal Die",
    "description": "Lost in Random : The Eternal Die blends dynamic real-time action, tactical combat, and risk-reward dice mechanics for thrilling second-to-second battles. Bioshock Remastered\nUnravel an original stand-alone story as Queen Aleksandra , the once great ruler of Random on a mission for vengeance and redemption .\nWield an arsenal of four unique weapons, unleash powerful card-based abilities, harness elemental relics and strategically roll your trusted die- companion , Fortune, to shift the tide of battle. Or take on high-stakes wager games where the right roll could lead to incredible rewards or crushing consequences.\nEven death isn’t final – return to the Sanctuary to unlock new weapons, buy powerful upgrades, and take on quests from your allies to prepare for your next run. Explore four dynamic biomes, each teeming with danger, secrets, and unpredictable challenges. Lose yourself in a haunting world of gothic whimsy, vivid landscapes, and an enchantingly atmospheric soundtrack.\nWith alternative endings to discover and a fully voiced cast of quirky characters, The Eternal Die invites you back into the world of Random for another unforgettable chapter.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/lost-in-random-the-eternal-die-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/lost-in-random-the-eternal-die-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-4590 3.70 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 650",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Stormteller Games",
        "Platform": "PC",
        "Game Size": "3.3 GB",
        "Released By": "RUNE emu",
        "Version": "Build 18840901 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n6z7kqg3mvh4",
        "https://buzzheavier.com/oc8o59n5b5rt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/lost-in-random-the-eternal-die-preinstalled-steamrip.jpg"
}