{
    "page_url": "https://steamrip.com/lost-scavenger-free-download-1n/",
    "title": "Lost Scavenger Directly Download",
    "description": "How long could you survive in a parallel universe where the Mist dictates its rules? Would you be able to find the way to your homeworld, or will you adapt to live under the Mist domain? Fight for resources, try to survive and discover the secrets of this world. This is your story. Lost Scavenger is a hardcore game about surviving in an open world that is overrun by the Mist. You play as an ordinary guy that has fallen into an anomaly and found himself in a world that has been haunted by the Mist for the last 30 years. Total War: THREE KINGDOMS\nHow far could you make it in a dying world in which every step may be your last one? Would you be able to find the way to your homeworld , or will you adapt to live under the Mist domain? Unique world. The postapocalyptic world shrouded in impenetrable Mist. Small anclaves of survivours are scattered around what has left of the world. Do you have what it takes to find your path through all this? Active pause. It triggers after your every action so you can thoroughly read your surroundings, make assessions and plan your further actions. One life only.\nYour character lives only once. If they die, they die. Game over. And yet, it is a cruel world you’re going into No grind. No character leveling, no skill trees, no EXP whatsoever. Instead, you have to learn to play better, use your strengths and compensate your weaknesses. Git gud Randomly generated world. Different biomes, weather conditions, anclaves and quests make every playthrough unique. Immersive simulation. The narration is dynamic and depends on your world generation settings and actions that you perform in that world. Every playthrough is a new story. And it is not necessary to follow the storyline: you can just wander around the world to try yourself.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/lost-scavenger-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/lost-scavenger-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 32/64-bit (7SP1/8/8.1/10)",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 660m",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation, Strategy, Early Access",
        "Developer": "Rockbee",
        "Platform": "PC",
        "Game Size": "914 MB",
        "Released By": "N/A",
        "Version": "v0.3.363 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/doheixog7gt6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/lost-scavenger-preinstalled-steamrip.jpg"
}