{
    "page_url": "https://steamrip.com/lost-records-bloom-rage-free-download/",
    "title": "Lost Records: Bloom & Rage",
    "description": "Rewind back to the 90s and live the defining summer of four high school girls as they forge bonds through their growing friendship, their punk band, and an unexplained event that will forever change their lives.\nLet’s talk about Lost Records and its main character, Swann. Imagine being a teenager in 1995, living in a small Michigan town called Velvet Cove. That’s Swann. Summer’s almost over, and her family’s about to move to Canada. Just when things are about to change drastically, she gets tangled up with the local bullies, which unexpectedly leads to a close friendship with three other girls: Nora, Kat, and Autumn.\nNora and Autumn dream of musical stardom , and Swann, who secretly longs to be a filmmaker, becomes their documentarian. She films them practicing, creating music videos, and even turning an old, seemingly abandoned cabin in the woods into their own secret hangout. SCP: 5K\nWhat’s interesting about Swann is that even though you play as her, she often feels more like a supporting character than the star of the show. She’s shy and struggles with social anxiety, which can make it hard to watch her sometimes. She really shines as one piece of this tight-knit group of friends .\nAs Swann, you carry a camcorder everywhere. You can use it to film short clips of anything you want. These clips act like collectibles – you might be asked to film a certain number of birds or pieces of graffiti, for example. But the really cool part is that when you film specific characters or scenes, these clips turn into “memoirs.” These are short montage videos that you can actually edit by choosing and rearranging the different shots. While this sounds creative, in practice, it doesn’t feel super open-ended.\nThis whole camcorder mechanic ties into a common theme in coming-of-age stories: the idea of constantly looking back, even while you’re still living the moment. Think about characters like Dawson from Dawson’s Creek, who ends up creating a TV show about his life. Or the nostalgic feel of The Wonder Years opening credits. Or even Max’s photography in Life Is Strange, another game from the same developers, Don’t Nod, that Lost Records often brings to mind. It’s like everyone’s trying to capture and preserve their own story as it unfolds.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/lost-records-bloom-rage-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/lost-records-bloom-rage-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-2700K or AMD FX-8350",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Ti, 4GB or AMD Radeon RX 560, 4GB or Intel ARC A380, 6GB",
        "Storage": "48 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "DON’T NOD",
        "Platform": "PC",
        "Game Size": "50.6 GB",
        "Released By": "RUNE emu",
        "Version": "v2.03.131125 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/OJoGlM",
        "https://buzzheavier.com/85vprs7293a5",
        "https://datanodes.to/ipiivy8eytk4/Lost-Records-BaR-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/lost-records-bloom-rage-preinstalled-steamrip.jpg"
}