{
    "page_url": "https://steamrip.com/lost-epic-free-download-1u/",
    "title": "LOST EPIC Premium Edition Directly Download",
    "description": "The latest game from Team EARTHWARS , the creators of the 300,000 DL hit game. The player becomes the deity-defying knight, God Slayer, and explores the world known as Sanctum to bring the Pantheon of Six to their knees. Each weapon has its own unique move. You can customize your knight by combining your favorite Divine skills. By activating your Divine skill at the right moment, you can take down an enemy and deliver massive damage. You can further advance the battle by upgrading the character stats according to the weapon you often use. Focusing on specific stats and creating a strength , skill or magic build will also be effective in advancing your quest. Bear and Breakfast\nCompleting quests given from the many characters will progress the sub-story, and earn rewards for the player. Certain quests require you to fight against enemies known as the Elite. Defeating the Elites can give you powerful rewards. When you start to say to yourself try acquiring materials through cultivating or fishing and craft items! If you find some enemies difficult at times, a good preparation could save you. That is not all, throughout Sanctum, there are hidden items that will surely help you in your venture . Search the corners that tickle your senses and you may find something.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/lost-epic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/lost-epic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 4460",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 750 Ti",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "oneoreight, Team EARTHWARS",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.01.1 | Final Release + Digital Artbook + Soundtrack",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/l48gw8u7026n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/lost-epic-preinstalled-steamrip.jpg"
}