{
    "page_url": "https://steamrip.com/lost-but-found-free-download/",
    "title": "Lost But Found",
    "description": "Lost But Found is a combination of a job simulator & hidden object-finding game. Your attention to finding the right item passengers need, and managing them in a tidy manner will earn you money!\nIn a top-down table, you are an officer who collects the lost items in an airport . Organize those items in the table. When people who lost their items request them, see if you have the item, then give it to them.\nYou are expected to be an honest officer, but there is expensive, tempting items, which you are able to steal and sell in the black market. Lost But Found is filled with little fun mechanics, that will make your role-playing experience fun! The Dark Pictures Anthology: The Devil in Me\nYou are expected to make sure every passenger in the airport gets their lost item, when you don’t have the item, you have the option to take their contact number, to call them when you find their lost items.\nMaking money, and buying upgrades to make your job easier in the office is necessary. With the interactive upgrade system, where every item you buy has a function, that will either make your job easier or increase your earnings.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/lost-but-found-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/lost-but-found-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Pentium CPU G860",
        "Memory": "1 GB RAM",
        "Graphics": "NVIDIA GeForce 840M",
        "DirectX": "Version 8.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation, Strategy",
        "Developer": "Rogue Duck Interactive",
        "Platform": "PC",
        "Game Size": "225 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cfqzfcf4036l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/lost-but-found-preinstalled-steamrip.jpg"
}