{
    "page_url": "https://steamrip.com/lovecrafts-untold-stories-2-free-download-t1/",
    "title": "Lovecraft’s Untold Stories 2 Directly Download",
    "description": "Lovecraft’s Untold Stories 2 is an action RPG with rogue-like elements that continues the story where Lovecraft’s Untold Stories left off, taking the characters to a new stage in their fight against the Unknown, in a completely new graphics style. Loot drops of randomized gear and resources to craft your own, explore old and new procedurally generated locations , defend yourself against dozens of different enemies and face off against epic bosses The Wandering Village\nBeware, for the game is more challenging than ever before, and the tough nightmarish creatures opposing you will not give up easily The Surrealist Artist Ardois-Bonnot presented his painting called Dream Landscape in the Paris Spring Salon of 1926. The moment the painting was uncovered, it caused a sudden riot among the public, and people screamed and ran all over the place.\nSoon after the exhibition , Ardois-Bonnot fell into a strange deep sleep from which no one could wake him up. Rumors abound that shortly before this attack of ‘sleeping sickness ’, he was at the verge of completion of his greatest masterpiece which would change the world. This time, you will have access to 6 different playable characters, old and new, each one with a different playstyle.\nThe Detective, the Witch, and the Professor from the first part, which continue their fight against the Great Old Ones, and the Medium, the Veteran, and the Alienist who join the group of adventurers. One of the new elements that we are including in Lovecraft’s Untold Stories 2 is the possibility of crafting your own equipment. Find blueprints and resources to create and improve new items (clothes, weapons and consumables), and see how every item changes the appearance of your character.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/lovecrafts-untold-stories-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/lovecrafts-untold-stories-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/8.1/10",
        "Processor": "Any 64-bit Intel or AMD CPU",
        "Memory": "1024 MB RAM",
        "Graphics": "512 MB video memory. Intel integrated graphics supported.",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "LLC Blini Games",
        "Platform": "PC",
        "Game Size": "766 MB",
        "Released By": "GOG",
        "Version": "v0.9.036b | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wmevqfd0gkno"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/lovecrafts-untold-stories-2-preinstalled-steamrip.jpg"
}