{
    "page_url": "https://steamrip.com/lumberjack-simulator-free-download-p1/",
    "title": "Lumberjack Simulator",
    "description": "Get Lumberjack Simulator for free instantly and play pre-installed on SteamRiP\nAre you ready to put your forestry and logging skills to the test? In this simulator game, you navigate an open world, the vehicles and the trees being in accordance with real-world physics. You can interact with the terrain (altering it in the process), cruise around in the off-road automobiles, and start putting some callouses on your palms by swinging around a chainsaw, an axe, and other tools. Hobo Cat Adventures\nUnlike any other simulation game, this game encourages you to master the wilderness. Each tree is like something straight out of a real-life forest, and you can cut it down however you like, paring away the branches with your hand axe and selling off the valuable logs at the local mill. How will you invest your proceeds? Machines, new land, truck upgrades : there are many options available to you. This is your business; run it how you see fit.\nThese badass forestry vehicles feature realistic steering, suspension , gear shifts, and transmission. For truck enthusiasts, these vehicles will be familiar – the models straight out of the logging industry. You set the controls too, changing the drive mode depending on the terrain that you need to cross. Don’t get stuck. You choose when to enter and exit your vehicles, when you use your tools, which tools to use, and how to clear and move trees. Be careful: you are going to need a plan if you want to thrive in the logging business.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/lumberjack-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/lumberjack-simulator-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1+",
        "Processor": "2.5GHZ or higher",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 960 or equivalent",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Every Single Soldier",
        "Platform": "PC",
        "Game Size": "1.75 GB",
        "Repack By": "PLAZA",
        "Version": "Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s7wvnu0mxa1i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/lumberjack-simulator-free-download-preinstalled-steamrip.jpg"
}