{
    "page_url": "https://steamrip.com/lumencraft-free-download-v1/",
    "title": "Lumencraft Directly Download",
    "description": "Lumencraft is a top-down action shooter with tower defense elements. Emerge into a fully destructible environment where light and shadow play key roles. Build your base, dig some tunnels and find lumen humanity’s only chance for survival. The year 2221: More than two centuries ago, the surface of the planet became uninhabitable. Car Detailing Simulator\nThe remnants of humanity struggle to survive without electricity and light. Dreams of a better future died long ago, but a recently discovered mineral has brought a spark of hope. Lumen, a crystal with high energy potency, may be the last chance for a struggling civilization .\nScouts, brave miners, have been sent underground to a settlement near the Lumen deposits. New scouts continue to join this mission , but so far, no one has returned. It seems that the darkness of the underground holds more than just natural riches With a lot of effort and a set of original algorithms, 2Dynamic Games have transformed the open-source Godot Engine into a completely new tool.\nThis allows every bit of terrain (pixel, as we used to call them) to be destroyed, and maps can be painted as if in a drawing program. What’s more? Dynamic lights and pixel-perfect interaction with the fully destructible terrain. Dread atmosphere created through the impactful sound design and a unique 2Dynamic lighting system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/lumencraft-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/lumencraft-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Requires a 64-bit processor and operating system",
        "Processor": "Dual Core CPU @3Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "Dedicated GPU 2 GB VRAM, OpenGL 3.3 support",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Simulation, Strategy",
        "Developer": "2Dynamic Games",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "SSE",
        "Version": "v9027 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1ubnku6m7alb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/lumencraft-preinstalled-steamrip.jpg"
}