{
    "page_url": "https://steamrip.com/lunacid-free-download/",
    "title": "Lunacid Directly Download",
    "description": "From the creator of Lost in Vivo and Spooky’s Jump Scare Mansion, Lunacid is a horror ARPG from a bygone era. Immerse yourself in a dark, desperate world full of foes, lost souls, and hidden secrets .\nA World Shrouded in Darkness Long ago, the Great Beast arose from the sea and covered the earth in poison fog. Choking out the land of both life and light, a new era of wonderous misery began. Centuries have passed. The once hallowed halls and bustling streets are mere shadows. Those deemed undesirable are thrown into the Great Well, a pit of chaos and disease. Cast into its depths for crimes unknown, you awaken in this moonlit subterranean world. Your only hope lies with the sleeping Old One deep below. But many perils lie between you and your ultimate goal.\nAn Era Lost to Time From the mind of horror master Akuma Kira, Lunacid harkens to a lost era of first-person ARPGs. Legendary for their meticulous design and dense dungeons, the King’s Field series was the Dark Souls before there was a Dark Souls. Long abandoned by AA/AAA developers, the mantle of “ King’s -Like” is left to the humble indie. Which is great, because that’s where all the cool weird stuff comes from anyways.\nThe world of Lunacid is bursting at the seams with new things to discover, from hidden magics to secret areas. This isn’t just the odd room with a chest in it; entire new areas await those with a watchful eye. Esoteric puzzles and cryptic hints galore are sure to confound and delight even the experienced dungeon delver.\nTactile Combat Take yourself back to a time before dodge rolling. Swipe, backstep, block, and overcome foes with patience and persistence. Featuring a robust body targeting system and unique elemental weaknesses /resistances, each encounter becomes a skilful yet deadly dance of death. Begin your journey as a thief, knight, cleric, or… vampire? Building your character up to you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/lunacid-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/lunacid-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core i3 1.3 GHz",
        "Memory": "4 MB RAM",
        "Graphics": "2GB Intregraded graphics",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG",
        "Developer": "KIRA LLC",
        "Platform": "PC",
        "Game Size": "789 MB",
        "Released By": "RUNE emu",
        "Version": "v2.1.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2eypxpaf8tcu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/lunacid-preinstalled-steamrip.jpg"
}