{
    "page_url": "https://steamrip.com/lunar-remastered-collection-free-download/",
    "title": "LUNAR Remastered Collection",
    "description": "Dive into the enchanting worlds of LUNAR: Silver Star Story Complete and LUNAR 2: Eternal Blue Complete, two beloved JRPGs that have captured the hearts of gamers for generations .\nLUNAR: Silver Star Story LUNAR: Silver Star Story introduces Alex, an aspiring Dragonmaster who bands together with his friends to combat the perilous emergence of the Magic Emperor and stop him from taking over the world.\nLUNAR 2: Eternal Blue LUNAR 2: Eternal Blue picks up a thousand years later, and follows Hiro and his friends as they set out in search of the Goddess Althena alongside an enigmatic girl named Lucia. On this grand quest, fend off enemies like Borgan and White Knight Leo, who hunt down the group to eradicate what they deem to be the “Destroyer of Lunar.”\nThis definitive remastered edition features enhanced graphics, audio, and quality-of-life improvements that will satiate that hunger for 90s nostalgia –better than you remember! Embark on these two adventures with updated language support, now available in English, Japanese, Simplified Chinese, Traditional Chinese, Korean , French, and German. Mandragora: Whispers of the Witch Tree\nEngage in turn-based combat using your party’s arsenal of magic, skills, and items. Each character possesses defined strengths and unique skills that can be leveled up and learned throughout your journey. In LUNAR 2: Eternal Blue Complete, explore the Crest System, in which characters may acquire benefits such as stat boosts and high-level magic from crest synergies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/lunar-remastered-collection-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/lunar-remastered-collection-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i7-8700",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050 Ti",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG",
        "Developer": "ASHIBI Co., Ltd., GAME ARTS Co., Ltd.",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "RUNE emu",
        "Version": "Build 18155215 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/68q2moh8s6wl",
        "https://megadb.net/imgqlwix8sg6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/lunar-remastered-collection-preinstalled-steamrip.jpg"
}