{
    "page_url": "https://steamrip.com/lysfanga-the-time-shift-warrior-free-download-l1/",
    "title": "Lysfanga The Time Shift Warrior Directly Download",
    "description": "After half a millennium of peace, a new danger hangs over Antala . Its fate depends on you, Imë, Lysfanga of the New Kingdom, protector of the realm. The ancient cities, previously locked in time, are now free again, and an old evil has escaped, threatening the peace. Slot Shots Pinball Ultimate Edition\nBut you won’t be alone. Gifted with temporal powers from the Goddess of Time herself, something no other Lysfanga has had before, you have the ability to rewind time in combat to summon clones of your past-selves to help you. Master your power to become legion, and crush hordes of the escaped demons , known as the Raxes.\nWith your army of past-selves, progress through the ancient cities to extend your arsenal of weapons and learn new spells, preparing for the much greater threat ahead\nUse Imë’s godlike powers to rewind time a few seconds in the past and summon clones of yourself – remnants – to create an army and overpower your enemies.\nChallenge your skills and your wits to outdo yourself. Master and replay each arena to beat your high scores, and challenge yourself by changing the difficulty settings and adding combat modifiers to unlock new rewards.\nEach arena can be approached in countless ways. Adapt your strategy and use all the tools at your disposal to emerge victorious . Success will only depend on your combination of remnants, spells and weapons.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/lysfanga-the-time-shift-warrior-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/lysfanga-the-time-shift-warrior-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel Core I5-2300 @ 2.80GHz / AMD Ryzen 3 3200G",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GX 780 [3GB] / Radeon RX 580",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Strategy",
        "Developer": "Sand Door Studio",
        "Platform": "PC",
        "Game Size": "9.5 GB",
        "Released By": "RUNE",
        "Version": "Build 13371529 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/SyX9Al",
        "https://megadb.net/mt3r3e3hzc2i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/lysfanga-the-time-shift-warrior-preinstalled-steamrip.jpg"
}