{
    "page_url": "https://steamrip.com/mad-tracks-free-download-q1/",
    "title": "Mad Tracks Directly Download",
    "description": "Mad Tracksis a colorful and most dynamic action game where you find yourself in a huge world of cars and try to grab victory into your own hands. You will become a participant in bright and a little crazy racing competitions that will take place in numerous locations.\nEach location is full of unexpected twists and turns and surprises, which will perfectly diversify the race and make it more difficult. The game will allow you to have a great time and have fun, which will definitely please all fans of the genre.\nYou will immerse yourself in the atmosphere of toy cars, one of which you will control, breaking through your place in the top lines of the rating table. Try to always control the situation on the road so that no opponent can outwit you. The opponents will be professionals in racing battles, so you should pay special attention to developing your skills as a racer. As you progress, you will collect special bonuses that will allow you to win even more functional cars. As for the mechanics, it will not cause you any difficulties in overcoming the tests. This game is ready to give you a fun pastime without a single disappointment .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/mad-tracks-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/mad-tracks-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8, 10, 32/64-bit",
        "Processor": "Intel Core™ Duo or faster",
        "Memory": "512 MB RAM",
        "DirectX": "Version 9.0c",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Racing",
        "Developer": "Loadinc Entertainment",
        "Platform": "PC",
        "Game Size": "238 MB",
        "Released By": "DARKSiDERS",
        "Version": "v1.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x1cjk07beq8h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/mad-tracks-preinstalled-steamrip.jpg"
}