{
    "page_url": "https://steamrip.com/mafia-three-definitive-edition-free-download-1m/",
    "title": "Mafia 3 Definitive Edition Free Download",
    "description": "Get Mafia III: Definitive Edition for free instantly and play pre-installed on SteamRiP\nMafia III: Definitive Edition (Mafia 3) – this is the most complete and modified version of the third part of the famous series of mafia action games with a third-person view. Here you will find adventures, shootouts , showdowns, bloody business and much more.\nThe plot of the game, as in the original version, revolves around Lincoln Clay, a Vietnam War veteran who became a real mobster after the war. Now he has a new life, money, power and much more, but everything changes at the very moment when the Italian mafia attacks his group. It would seem that in the 60s and 70s this happened all the time. But this time it’s different. Devil May Cry 5\nClay is not one of those who forgets and forgives offenses, and now he wants revenge, and you will help him in this. In other words, the same original story awaits you Well, first of all, it would be worth saying that you can download Mafia III: Definitive Edition torrent from us and play not only the original story of Lincoln Clay, but also all the plot additions that came out earlier for the third part, and special bonus sets , and many many others. In other words, this edition will allow you to fully enjoy the work of “2K”.\nMafia III: Definitive Edition includes the main game, all Story DLC (Faster, Baby Stones Unturned, Sign of the Times) and Bonus Packs (Family Kick-Back Pack and Judge, Jury & Executioner Weapons Pack) bundled in one place for the first time.\nPart three of the Mafia crime saga – 1968, New Bordeaux, LA. After years of combat in Vietnam, Lincoln Clay knows this truth: family isn’t who you’re born with, it’s who you die for. When his surrogate family is wiped out by the Italian Mafia, Lincoln builds a new family and blazes a path of revenge through the Mafioso responsible.\nNEW BORDEAUX, LA:\nA vast world ruled by the mob and detailed with the sights and sounds of the era\nA LETHAL ANTI-HERO:\nBe Lincoln Clay, orphan and Vietnam veteran hell bent on revenge for the deaths of his surrogate family\nREVENGE YOUR WAY:\nChoose your own play-style; brute force, blazing guns or stalk-and-kill tactics, to tear down the Mafia\nA NEW FAMILY ON THE ASHES OF THE OLD:\nBuild a new criminal empire your way by deciding which lieutenants you reward, and which you betray\nOwn Mafia III: Definitive Edition to unlock Lincoln’s Army Jacket and Car in both Mafia and Mafia II Definitive Editions",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/mafia-iii-definitive-edition-free-download-steamrip-1.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/mafia-iii-definitive-edition-free-download-crack-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel I5-2500K, AMD FX-8120",
        "Memory": "6 GB RAM",
        "Graphics": "2GB of Video Memory & NVIDIA GeForce GTX 660, AMD Radeon HD7870",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Hangar 13, Aspyr (Mac)",
        "Platform": "PC",
        "Game Size": "37 GB",
        "Repack By": "CODEX",
        "Version": "v1.100.0 Update 1 | Updated  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/4E7A073FA5",
        "https://buzzheavier.com/72thu82rzg5b",
        "https://1fichier.com/?unf8lzda38rzicu37gkc",
        "https://datanodes.to/d2yj92c452bc/Mafia-III-DE-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/mafia-iii-definitive-edition-free-download-preinstalled-steamrip.jpg"
}