{
    "page_url": "https://steamrip.com/mafia-definitive-edition-free-download-3j/",
    "title": "Mafia: Definitive Edition Free Download Direct link",
    "description": "Get Mafia: Definitive Edition for free instantly and play pre-installed on SteamRiP.\nMafia: Definitive Edition features a number of gameplay mechanics and offers multiple options and features while progressing through the game’s many missions. because the player progresses through the sport on-screen tutorials provides a brief explanation of the feature or task when a replacement mechanic is first encountered. In addition to, This guide will plan to briefly explain many of those features et al. not mentioned. Part one among the Mafia crime saga – 1930s, Lost Heaven, IL Re-made from the bottom up, rise through the ranks of the Mafia during the prohibition of gangland\nAfter a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore. Live the lifetime of a Prohibition-era gangster and rise through the ranks of the Mafia. Faithfully recreated, with expanded story, gameplay and original score. this is often the Mafia you remembered and far more. Own Mafia: Definitive Edition to unlock Tommy’s Suit and Cab in both Mafia II and Mafia III Definitive Editions. GUILTY GEAR -STRIVE-",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/mafia-definitive-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/mafia-definitive-edition-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {},
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Team17, Mouldy Toof Studios",
        "Platform": "PC",
        "Game Size": "35 GB",
        "Repack By": "CPY",
        "Version": "Build 7368608 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/D3A95FF047",
        "https://buzzheavier.com/9lgps5dsumpd",
        "https://1fichier.com/?lck717w8akcrb65b7gyx",
        "https://datanodes.to/hid3yrncxrk0/Mafia-Definitive-Edition-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/mafia-definitive-edition-free-download-preinstalled-steamrip.jpg"
}