{
    "page_url": "https://steamrip.com/maglam-lord-free-download-s1/",
    "title": "MAGLAM LORD Directly Download",
    "description": "MAGLAM LORD is a vibrant action JRPG straight from the depths of hell Boasting exploration, real-time combat, weapon crafting and relationship building. MAGLAM LORD is an unexpected combination that truly has no equal. Simple and refreshing hack and slash action-RPG Experience the high speed action battle by simple game play Defeat the furious monsters and collect materials to create your own new weapons Coordinate battles by decorating your weapons with premium effects Floppy Knights\nYou can arrange the battles as you wish by decorating the weapons you made When decorating your weapons, not only the battles become more advantageous, but also the attack effect Enjoy the terrifying but exciting royal story filled with character drama and cute love The main character wakes up in bed and realizes that he/she suddenly became one of the endangered species . So the key factor in preventing extinction is”MARRIAGE”!? Enjoy the story of adventure and marriage with the many attractive and loving characters",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/maglam-lord-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/maglam-lord-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10 64bit",
        "Processor": "Intel® Core(TM) i3-4330",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 1030",
        "DirectX": "Version 12",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "FELISTELLA Inc.",
        "Platform": "PC",
        "Game Size": "5.3 GB",
        "Released By": "DARKSiDERS",
        "Version": "Build 8156297 | Full  + Special Pack DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6c7epou8c24l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/maglam-lord-preinstalled-steamrip.jpg"
}