{
    "page_url": "https://steamrip.com/mago-free-download-1n/",
    "title": "Mago",
    "description": "A classic magical adventure with beautiful pixel art and intuitive controls. Travel a vast world with many levels, mini-games, and secret locations Hand-crafted levels, each with its own challenges: from colorful teapot prairie, a humongous tree guarded by a fierce centipede , ancient ruins of a mysterious civilization that rests on the back of a huge bird this journey has it all Use your magic wand to purify evil from the world, solve riddles by affecting your surroundings. Some levels allow you to use a powerful mecha robot. It’s time to show the villain’s enemies what you are made of (metal, mostly) Volcano Princess\nEach level presents a different challenge, each boss a new threat to overcome . By collecting secret orbs in each level you unlock new items and improvements. Can you find them all? Looking to take a break? In the town of Musicalia you can buy new upgrades and meet interesting characters, some you might even recognize Listen to a beautiful soundtrack brimming with nostalgia that will instantly bring back the nostalgia of the golden age of video games .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/mago-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/mago-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "3.2 ghz dual core",
        "Memory": "4 GB RAM",
        "Graphics": "2 GB",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Dream Potion Games",
        "Platform": "PC",
        "Game Size": "420 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11573660 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6jycfytdsq67"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/mago-preinstalled-steamrip.jpg"
}