{
    "page_url": "https://steamrip.com/mahokenshi-free-download-1k/",
    "title": "Mahokenshi Directly Download",
    "description": "Wielding both blade and magic, it is your duty to protect the floating Celestial Islands from powerful opponents who seek to corrupt them. Challenge your fate and build your card deck to defeat foes and complete missions. Evolve your character with every playthrough , and become the Mahokenshi the world needs.\nWhere will you start your journey? Will you hail from the sturdy House of Sapphire ? The cunning House of Topaz? The fierce House of Ruby? Or the secretive House of Jade? Each house draws its strength from a different elemental spirit and allows you to create different playstyles. There are more than 200 lovingly illustrated cards to discover. Begin with a basic set of cards and choose how to build your deck as you defeat formidable foes, uncover treasures, and find remote locations. Neptunia: Sisters VS Sisters\nBe careful, as each terrain offers different advantages , so plan your actions with the surroundings in mind. Evolve your playstyle and strategy in every mission and leverage the strengths of your samurai house to create powerful combos. Travel a vast array of vibrant and beautifully designed 3D maps.\nMeet the different people of the Celestial Islands, save villages, discover shrines and defeat deadly demons. See your battles brought to life with fully animated characters. Perform magical maneuvers, fiery attacks, strong defensive moves, and swift counterattacks on your way to restoring peace to the world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/mahokenshi-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/mahokenshi-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or higher",
        "Processor": "1st gen Intel i5 or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 770 series or AMD equivalent graphics card",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Game Source Studio",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "GOG",
        "Version": "Build 61931 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5nsjv7go4wym"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/mahokenshi-preinstalled-steamrip.jpg"
}