{
    "page_url": "https://steamrip.com/mandragora-whispers-of-the-witch-tree-free-download/",
    "title": "Mandragora: Whispers of the Witch Tree",
    "description": "Mandragora: Whispers of the Witch Tree is a dark fantasy action RPG featuring 40+ hours of gameplay, with more to explore in New Game Plus. Create your Inquisitor from one of six unique Classes, and wield blades and magic to battle nightmarish creatures. Craft hundreds of weapons and items, and learn powerful Talents to define your combat style. Explore a vast, interconnected world and unearth its secrets across 60 quests that will push your skills to their limits. GORN 2\nDEFY YOUR FATE Faelduum teeters on the edge of ruin . Dark forces seep into its reality through tears in the fabric of existence, unleashing monsters upon it.\nYou are an Inquisitor. Tasked with rooting out heretics and enforcing the King Priest’s will, your devotion has never wavered until now. One fleeting moment of defiance sets you on an irreversible path that leads to the heart of Faelduum’s unraveling fate. From the towering majesty of Crimson City, through festering darkness, and into the horrors of Entropy what will you become at journey’s end?\nSUCCUMB TO A DARK FANTASY WORLD Mandragora: Whispers of the Witch Tree features over 40 hours of gameplay with full English voice acting. Fall into a sinister, branching tale woven by Brian Mitsoda, set in a dark fantasy world stunningly realized in a rich painterly art style, and soundtracked by the haunting original compositions of Christos Antoniou (Septicflesh) and the FILMharmonic Orchestra Prague. 75 unique locations await your discovery, with new secrets, hidden treasures, and intriguing characters hidden across Faelduum’s vast expanse.\nMASTER SOULSLIKE COMBAT Choose from one of six unique Classes, including the Vanguard , Flameweaver, Spellbinder, Nightshade, Wyldwarden, and Vindicator.\nWhether by blade or magic, master your craft in brutal battles. Combat is simple to grasp with nuanced depth—dodge, parry, and strike with perfect timing to avoid a pitiful fate. Hunt in pursuit of wild wolves, vampires, and a whole bestiary crawling with relentless creatures and nightmarish bosses.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/mandragora-whispers-of-the-witch-tree-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/mandragora-whispers-of-the-witch-tree-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or Windows 11 (64-bit)",
        "Processor": "Intel Core i5-6500 or AMD Ryzen 5 1400 or similar",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1060 6 GB or AMD RX 480 or similar",
        "DirectX": "Version 12",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Primal Game Studio",
        "Platform": "PC",
        "Game Size": "15.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.5.3.2396 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/1TvY4b",
        "https://buzzheavier.com/944nc5w7w6xj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/mandragora-whispers-of-the-witch-tree-preinstalled-steamrip.jpg"
}