{
    "page_url": "https://steamrip.com/manhunt-2-free-download/",
    "title": "Manhunt 2",
    "description": "An experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Call of Duty: Black Ops Cold War\nDemented screams echo around the dank asylum that has caged you for the last six years. You open your eyes. A white-coated body slumps to the floor through your shaking hands. A bloody syringe slips from your arm. Waves of confusion and paranoia crash over you. You have no idea who you are or how you got here. The door to your cell is open. One choice. One chance. They took your life. Time to take it back.\nTaking place in the southern American city of Cottonmouth , Manhunt 2 follows the story of Daniel Lamb, an amnesia-stricken mental patient who attempts to uncover his past. He is guided by a fellow patient called Leo Kasper, a sociopathic assassin . Retaining much of its predecessor’s gameplay and mechanics, Manhunt 2 has players primarily control Lamb as he is hunted by bounty hunters, using stealth to sneak up and perform brutal executions on his targets. Other sections of the game also allow players to take control of Leo.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/manhunt-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/manhunt-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Horror",
        "Developer": "Rockstar London, Rockstar Toronto",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "Thanks to Elamigos/onetimer23/hal210 (csrin)",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m03cto05oeak",
        "https://buzzheavier.com/5gylyoatd8w5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/manhunt-2-preinstalled-steamrip.jpg"
}