{
    "page_url": "https://steamrip.com/maniac-free-download/",
    "title": "Maniac game",
    "description": "Welcome to Maniac where chaos is just waiting to be unleashed. Maniac is a throwback to times of the Original GTA’s of the world in which mayhem reigned supreme. With an arsenal of unlockable characters, weapons, and an ever-changing world. A Short Hike\nTry not to get Busted GTA meets Vampire Survivors with a dash of Fast and the Furious thrown in to make one hell of a chaotic mess Don’t feel crazy enough? We got you! With an arsenal of Democracy at your fingertips from highjacking Bulldozers, Buses, Cop Cars, Tanks, and then some, destruction is all around Six psychopaths with a myriad of skills, unlockable gear, and vehicular upgrades all just waiting to be unleashed\nA Chaotic Open World City, just waiting for the chains of mayhem to snap! With 11 unique districts and a built -in map editor, your playground awaits You Can’t Say Maniac without a system in place ready to deliver sheer destruction and chaos! With sick drifts from the driving physics to chain reactions ready to explode, the world is dynamic and ever- changing . All of this is backed up by an aggressive AI determined to catch you, so don’t get BUSTED",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/maniac-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/maniac-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 (SP1+)",
        "Processor": "X64 architecture with SSE2 instruction set support",
        "Memory": "1 GB RAM",
        "Graphics": "DX10, DX11, and DX12-capable GPUs",
        "DirectX": "Version 10",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Racing, RPG, Simulation",
        "Developer": "Transhuman Design",
        "Platform": "PC",
        "Game Size": "350 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.9.22 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/md9kw1koc8i3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/maniac-preinstalled-steamrip.jpg"
}