{
    "page_url": "https://steamrip.com/marco-the-galaxy-dragon-free-download-v1/",
    "title": "Marco & The Galaxy Dragon Download",
    "description": "Marco & The Galaxy Dragon Download PC Game In Direct Link for free on SteamRIP\nMarco & The Galaxy Dragon is a mix of anime and visual novel, a game in which you have to immerse yourself in a series of unusual events taking place in an alternative Japanese reality The game takes place far from planet Earth, and revolves around a girl named Marco.\nShe travels for a long time with a Dragon named Arko in search of adventures in different worlds, but throughout her life she is tormented by the fact that she does not remember anything about her past. But suddenly she finds out in another adventure that she has a mother.\nNow Marco by all means should not find her, but it will not be so easy to do this, because for this he will have to go to planet Earth, where everything is not at all the same as in the distant galaxies of the universe. In general, it will be interesting Well, first of all, it would be worth saying that this is essentially the most common visual novel, in which the emphasis is primarily on the storyline and dialogues that take place every minute.\nThere are no mind-blowing battles or battles with magic or anything else like that, as there is no full-fledged action. Everything here is based on the storytelling in which you are. naturally, you will play one of the most important roles. The gameplay itself here is incredibly simple and needs no explanation. GRIS",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/marco-the-galaxy-dragon-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/marco-the-galaxy-dragon-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/8.1/10",
        "Processor": "2GHz or higher",
        "Memory": "2 GB RAM",
        "DirectX": "Version 9.0c",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Simulation",
        "Developer": "TOKYOTOON",
        "Platform": "PC",
        "Game Size": "7.1 GB",
        "Repack By": "CODEX",
        "Version": "full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n4p0bt5j0fl1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/marco-the-galaxy-dragon-preinstalled-steamrip.jpg"
}