{
    "page_url": "https://steamrip.com/mario-golf-super-rush-1f/",
    "title": "Mario Golf: Super Rush Free Download Directly",
    "description": "Hit the green with up to four players locally* or online** and golf with friends from the Super Mario ™ series like Mario, Peach, Yoshi, and more Modes range from Standard Golf to the energetic Speed Golf and an exciting Golf Adventure. Simple motion or button controls make it easy for both new players and seasoned pros to drive and putt. Tee off at the same time with up to three other players* and race through the course to get your ball in first. Mayhem is par for the course as you hinder your opponents with dashes and Special Shots.\nYoshi can dash atop a giant egg and King Bob-omb can pelt the green with explosions In Battle Golf, watch out for obstacles like Thwomps, Chain Chomps, and banana peels as you navigate the neon-themed Super Golf Stadium. Enroll your Mii™ character in golf training at the famous Bonny Greens country club and go from beginner to pro! The stakes are high—you must also watch out for Wario and Waluigi’s tricks and even battle fearsome bosses. You’ll face off against your Mushroom Kingdom classmates and level up your character. You can bring your character (and their customized stats) into other modes, too.\nTHIS IS AN EMULATOR/ROM. RUN THE Ryujinx.EXE THEN START GAME",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/mario-golf-super-rush-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/mario-golf-super-rush-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer",
        "Processor": "Intel Core i3 M380",
        "Memory": "2 GB RAM",
        "Graphics": "Intel HD 4000",
        "DirectX": "Version 10",
        "Storage": "1200 MB available space"
    },
    "game_info": {
        "Genre": "Arcade, Sports, 3rd person",
        "Developer": "Camelot Software Planning",
        "Platform": "PC",
        "Game Size": "3.08 GB",
        "Repack By": "Ryujinx Switch Emulator",
        "Version": "v1.1.0 | Updated  + RYUJINX EMU for PC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p46oct8r6xgl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/mario-golf-super-rush-free-download-preinstalled-steamrip.jpg"
}