{
    "page_url": "https://steamrip.com/mark-of-the-ninja-remastered-free-download-m1/",
    "title": "Mark of the Ninja: Remastered",
    "description": "In Mark of the Ninja, you’ll know what it is to truly be a ninja. You must be silent, agile and clever to outwit your opponents in a world of gorgeous scenery and flowing animation. Marked with cursed tattoos giving you heightened senses, every situation presents you with options. Will you be an unknown, invisible ghost, or a brutal, silent assassin? Upgrade new tools and techniques that suit your playstyle and complete optional objectives to unlock entirely new ways to approach the game. Finish the main story to unlock a New Game Plus mode with even more options and challenges.\nLittle is known of the Ninja’s past, but it was known that he was a member of the Hisomu Clan and trained under its leader, Azai. Years later, having become a powerful warrior, The Ninja was chosen by Azai as a champion of the clan, and given cursed tattoo marks (by Dosan) that would enhance his senses and give him supernatural powers. Sworn to protect the clan, the marks were given with the understanding that they would eventually drive him insane, and he would have to kill himself before he could harm the Clan. Class of ’09",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/mark-of-the-ninja-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/mark-of-the-ninja-remastered-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS ": "Windows 7",
        "Processor": "Intel Core 2 Duo 2.4GHz processor (E6600)",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GT720 or AMD Radeon R7770 (1 GB)",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Klei Entertainment",
        "Platform": "PC",
        "Game Size": "7.2 GB",
        "Released By": "GOG",
        "Version": "v1.0",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/b4gJVC",
        "https://qiwi.gg/file/1TM45117-Mark-of-the-Ninja-RE-SteamRIP",
        "https://1fichier.com/?flz57er7m9b8890oh87e",
        "https://megadb.net/w98mpiv1tlsb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/mark-of-the-ninja-remastered-preinstalled-steamrip.jpg"
}