{
    "page_url": "https://steamrip.com/marvels-guardians-of-the-galaxy-free-download-1j/",
    "title": "Marvel’s Guardians of the Galaxy Directly Download",
    "description": "Fire up a wild ride across the cosmos with a fresh take on Marvel’s Guardians of the Galaxy . In this third-person action-adventure game, you are Star-Lord, and thanks to your bold yet questionable leadership, you have persuaded an oddball crew of unlikely heroes to join you. Some jerk (surely not you) has set off a chain of catastrophic events, and only you can hold the unpredictable Guardians together long enough to fight off total interplanetary meltdown.\nUse Element Blasters, tag-team beat downs, jet boot-powered dropkicks , nothing’s off-limits. If you think it’s all going to plan, you’re in for a world of surprises, with the consequences of your actions guaranteed to keep the Guardians on their toes. In this original Marvel’s Guardians of the Galaxy story, you’ll cross paths with powerful new beings and unique takes on iconic characters, all caught in a struggle for the galaxy’s fate. It’s time to show the universe what you’re made of.\nYou play as Star-Lord, so nothing’s off-limits with your bold combat style, from Element Blasters and jet boot-powered dropkicks to tag-team beat-downs. With the Guardians fighting at your side, call the shots and overwhelm your opponents with signature attacks. Meanwhile, the consequences of your decisions will range from light-hearted to downright unexpected as your journey unfolds. Your newly-formed band of legendary misfits is set to save the universe in this fresh but faithful take on the Guardians of the Galaxy.\nSomehow, you set off a chain of catastrophic events, leading to a wild ride through mind-blowing worlds inhabited by iconic and original Marvel characters. Turn up the all-star ‘80s mixtape and get ready to kick it. You’re the only thing holding the unpredictable Guardians together, so you’ll have to get better at this leadership thing fast. With this offbeat approximation of a family at your side, there will be tears and laughter as you set about tearing into the cosmos together. Whatever’s waiting around the next corner, you know it’s going to be a blast.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/marvels-guardians-of-the-galaxy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/marvels-guardians-of-the-galaxy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit Build 1903",
        "Processor": "AMD Ryzen 5 1400 / Intel® Core i5-4460",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 6GB / AMD Radeon™ RX 570",
        "DirectX": "Version 12",
        "Storage": "80 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Eidos-Montréal",
        "Platform": "PC",
        "Game Size": "36.3 GB",
        "Released By": "EMPRESS",
        "Version": "v2984448 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/E50411399E",
        "https://buzzheavier.com/jkx4vhdtsb2s",
        "https://1fichier.com/?iwr2mfk3ghz689qhayd8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/marvels-guardians-of-the-galaxy-preinstalled-steamrip.jpg"
}