{
    "page_url": "https://steamrip.com/marvels-spider-man-2-free-download-sp1/",
    "title": "Marvel’s Spider Man 2",
    "description": "Mask-up for more thrilling web-slinging heroics as Marvel’s SpiderMan 2 swings onto PC Developed by Insomniac Games in collaboration with Marvel, and optimized for PC by Nixxes Software.\nA city under siege!\nSpider-Men Peter Parker and Miles Morales face the ultimate test of strength inside and outside the mask as they fight to save the city, each other and the ones they love, from the monstrous Venom and the dangerous new symbiote threat. Enotria: The Last Song\nTraverse an expanded Marvel’s New York\nExplore a larger Marvel’s New York than ever before, featuring two new boroughs – Brooklyn and Queens – as well as locations like Coney Island, and more.\nSwing, jump, and utilize the new Web Wings to travel across the city, switching between Peter Parker and Miles Morales in open world exploration to experience different stories and epic new powers.\nExperience two playable Spider-Men\nWield Peter’s new symbiote abilities and Miles’ explosive bio-electric venom powers, and discover upgradeable, high-tech equipment that enhances the combat experience for extensive gameplay depth and variety.\nBattle iconic Marvel Super Villains\nFight against a variety of new and iconic villains, including an original take on the monstrous Venom, the ruthless Kraven the Hunter, the volatile Lizard , and many more!\nA more accessible Spider-Man experience\nSupport for a range of accessibility features strives to create a Marvel’s Spider-Man experience without barriers , that can be enjoyed by more players of different abilities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/marvel-spider-man-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/marvel-spider-man-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 (version 1909 or higher)",
        "Processor": "Intel Core i3-8100 or AMD Ryzen 3 3100",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 or AMD Radeon RX 5500 XT",
        "Storage": "110 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Insomniac Games, Nixxes Software",
        "Platform": "PC",
        "Game Size": "94.6 GB",
        "Released By": "RUNE + Fixed exe",
        "Version": "v1.526.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/956A8E8778",
        "https://buzzheavier.com/f9wmyj6bwidy",
        "https://datanodes.to/90zsm0hrjklm/Marvels-Spider-Man-2-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/marvel-spider-man-2-preinstalled-steamrip.jpg"
}