{
    "page_url": "https://steamrip.com/marvels-spider-man-miles-morales-free-download-o2/",
    "title": "Marvels Spider-Man: Miles Morales",
    "description": "Following the events of Marvel’s Spider-Man Remastered, teenager Miles Morales is adjusting to his new home while following in the footsteps of his mentor, Peter Parker, as a new Spider-Man. But when a fierce power struggle threatens to destroy his new home, the aspiring hero realizes that with great power, there must also come great responsibility. To save all of Marvel’s New York, Miles must take up the mantle of Spider-Man and own it. Marvel’s Spider-Man Remastered\nThe Rise of Miles Morales\nMiles Morales discovers explosive powers that set him apart from his mentor, Peter Parker. Master his unique, bio-electric venom blast attacks and covert camouflage power alongside spectacular web-slinging acrobatics, gadgets and skills. The Amazing Spider-Man 2\nA War for Power\nA war for control of Marvel’s New York has broken out between a devious energy corporation and a high-tech criminal army. With his new home at the heart of the battle, Miles must learn the cost of becoming a hero and decide what he must sacrifice for the greater good.\nA Vibrant New Home\nTraverse the snowy streets of his new, vibrant, and bustling neighborhood as Miles searches for a sense of belonging. When the lines blur between his personal and crime-fighting lives, he discovers who he can trust, and what it feels like to truly be home.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/marvels-spider-man-miles-morales-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/marvels-spider-man-miles-morales-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit 1909",
        "Processor": "Intel Core i3-4160, 3.6 GHz or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 950 or AMD Radeon RX 470",
        "DirectX": "Version 12",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Insomniac Games, Nixxes Software",
        "Platform": "PC",
        "Game Size": "37 GB (RAR)",
        "Released By": "Mr_GOLDBERG (Ty InsaneRamZes)",
        "Version": "v3.617.1.0 | Full  + DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/9ABB15311F",
        "https://buzzheavier.com/67pt5szrjk0h",
        "https://1fichier.com/?9joztsg5z41iej0h5i57"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/marvels-spider-man-miles-morales-preinstalled-steamrip.jpg"
}