{
    "page_url": "https://steamrip.com/marvels-spider-man-remastered-1u/",
    "title": "Marvels SpiderMan Remastered",
    "description": "Developed by Insomniac Games in collaboration with Marvel, and optimized for PC by Nixxes Software, Marvel’s Spider-Man Remastered on PC introduces an experienced Peter Parker who’s fighting big crime and iconic villains in Marvel’s New York. At the same time, he’s struggling to balance his chaotic personal life and career while the fate of Marvel’s New York rests upon his shoulders. Railroad Corporation\nBe Greater When iconic Marvel villains threaten Marvel’s New York, Peter Parker and Spider-Man’s worlds collide. To save the city and those he loves, he must rise up and be greater.\nFeel like Spider-Man After eight years behind the mask, Peter Parker is a crime-fighting master. Feel the full power of a more experienced Spider-Man with improvisational combat, dynamic acrobatics, fluid urban traversal and environmental interactions.\nWorlds collide The worlds of Peter Parker and Spider-Man collide in an original action-packed story. In this new Spider-Man universe, iconic characters from Peter and Spider-Man’s lives have been reimagined, placing familiar characters in unique roles.\nMarvel’s New York is your playground The Big Apple comes to life in Marvel’s Spider-Man . Swing through vibrant neighborhoods and catch breathtaking views of iconic Marvel and Manhattan landmarks. Use the environment to defeat villains with epic takedowns in true blockbuster action.\nEnjoy The City That Never Sleeps complete content Following the events of the main story of Marvel’s Spider-Man Remastered, experience the continuation of Peter Parker’s journey in Marvel’s Spider-Man: The City That Never Sleeps, three story chapters with additional missions and challenges to discover.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/marvels-spider-man-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/marvels-spider-man-remastered-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i3-4160, 3.6 GHz or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 950 or AMD Radeon RX 470",
        "DirectX": "Version 12",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Insomniac Games, Nixxes Software",
        "Platform": "PC",
        "Game Size": "53 GB",
        "Released By": "FLT/ Mr_GOLDBERG CS / InsaneRamZes Ty",
        "Version": "v2.1012.0.0 (Build 12423814) | Full  + DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/78ooEM",
        "https://buzzheavier.com/716go6imtzta",
        "https://1fichier.com/?tjy8f0ybk66ojeur0sv3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/marvels-spider-man-remastered-preinstalled-steamrip.jpg"
}