{
    "page_url": "https://steamrip.com/marvels-avengers-free-download-k2/",
    "title": "Marvel’s Avengers  Link",
    "description": "Get Marvel’s Avengers PC game for free instantly and play pre-installed on SteamRiP\nOnline access required for multiplayer and to download post-launch content. Free Square Enix Members account required for multiplayer only. Assemble your team of Earth’s Mightiest Heroes, embrace your powers, and live your Super Hero dreams. Marvel’s Avengers is an epic, third-person, action -adventure game that combines an original, cinematic story with single-player and co-operative gameplay*. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.\nMarvel’s Avengers begins at A-Day, where Captain America , Iron Man, the Hulk, Black Widow, and Thor are unveiling a new, hi-tech Avengers Headquarters in San Francisco. The celebration turns deadly when a mysterious enemy causes a catastrophic accident which results in massive devastation. Blamed for the tragedy, the Avengers disband. Five years later, with all Super Heroes outlawed and the world in peril, a sprawling adventure ignites when a determined young woman named Kamala Khan sets out to reassemble and rebuild the Avengers to stop the unchecked power of the secretive new force known as AIM. Ori and the Will of the Wisps",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/marvels-avengers-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/marvels-avengers-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "i3-4160 or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 950 / AMD 270 (min 2GB video ram)",
        "DirectX": "Version 12",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Crystal Dynamics, Eidos-Montréal, Nixxes",
        "Platform": "PC",
        "Game Size": "151 GB",
        "Repack By": "CODEX",
        "Version": "v2.0.3.0 (Endgame Edition) – Updated version (Latest) + all add-ons",
        "Preinstalled": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/D66549CE49",
        "https://buzzheavier.com/jln2b2bh5das",
        "https://1fichier.com/?ap7v651addlorxwm2tsu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/marvels-avengers-free-download-preinstalled-steamrip.jpg"
}