{
    "page_url": "https://steamrip.com/mary-skelter-2-free-download-1x/",
    "title": "Mary Skelter 2",
    "description": "Mary Skelter 2 game for free instantly and play pre-installed on SteamRiP\nWhat must you sacrifice to escape fate? Find out in this nightmarish dungeon-crawling RPG! The Nightmare continues in Mary Skelter 2! In this first-person dungeon crawler, play as fairy tale-inspired characters called Blood Maidens, each with deeply customizable character-specific classes.\nBalance between power and madness in turn-based battles with a blood-fueled transformation system, and escape a living prison while indestructible Nightmares give chase in real time. The Jail – a living prison that feeds on the humans trapped within its confines. The Jail appeared a number of years ago with the caving of the city around it. Fallout 4\nNow twisted creatures known as Marchens and treacherous Nightmares roam its halls. Otsuu and Little Mermaid are a part of a group of humans known as “Dawn” attempting to survive these horrors. They succeed in saving Alice and a young man named Jack on one mission. However, on their return back to base, Alice goes mad and begins attacking those around her.\nAlice strikes Jack, who was trying to protect Otsuu and Little Mermaid , knocking them down a chasm. Later, Otsuu and Little Mermaid awaken from the fall only to find Jack on the verge of death And so begins the tale of escaping from fate, led by a group of girls seeking sanctuary in this mad world, and of the young man who would transform into madness itself – a Nightmare .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/mary-skelter-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/mary-skelter-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 or later",
        "Processor": "2.13GHz Intel Core2 Duo or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible graphics card",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "Idea Factory",
        "Platform": "PC",
        "Game Size": "7.9 GB",
        "Released By": "CODEX",
        "Version": "v1.01 | full version (Latest) + 5 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1ahm7t0fmcwi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/mary-skelter-2-preinstalled-steamrip.jpg"
}