{
    "page_url": "https://steamrip.com/max-payne-three-4x/",
    "title": "Max Payne 3 Complete Edition Free Download",
    "description": "Max Payne 3 game for free instantly and play pre-installed on SteamRIP\nFor Max Payne, the tragedies that took his loved ones years ago are wounds that refuse to heal. No longer a cop, close to washed up and addicted to pain killers, Max takes a job in São Paulo, Brazil, protecting the family of wealthy real estate mogul Rodrigo Branco, in an effort to finally escape his troubled past. But as events spiral out of his control, Max Payne finds himself alone on the streets of an unfamiliar city, desperately searching for the truth and fighting for a way out.\nCombining cutting edge shooting mechanics with a dark and twisted story, Max Payne 3 is a seamless, highly detailed, cinematic experience from Rockstar Games. This complete edition of Max Payne 3 includes the complete original game and all previously released downloadable content including Deathmatch Made In Heaven, Painful Memories Pack, Hostage Negotiation Pack, Local Justice Pack, Silent Killer Loadout Pack, Cemetery Map, Special Edition Pack, Deadly Force Burst, Pill Bottle Item, and the Classic Max Payne 1 Character. Pupperazzi",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/max-payne-3-complete-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/max-payne-3-complete-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-Bit Service Pack 1",
        "Processor": "Intel Dual Core 2.4 GHZ – i7 3930K 6 Core x 3.06 GHZ / AMD Dual Core 2.6 GHZ – FX-8150 8 Core x 3.6 GHZ",
        "Memory": "2GB – 16GB RAM",
        "Hard Drive": "35GB of free HDD Space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Rockstar Studios",
        "Platform": "PC",
        "Game Size": "30.8 GB",
        "Released By": "Razor1911",
        "Version": "v1.0.0.272 (Complete Edition) | Full  (Latest) + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/16E9C77E2D",
        "https://buzzheavier.com/wxw8tufk1055",
        "https://1fichier.com/?6mmqarleyy4m0kjxhkvohttps://1fichier.com/?h59pntpd8o38v59y102a"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/max-payne-3-complete-edition-preinstalled-steamrip.jpg"
}