{
    "page_url": "https://steamrip.com/medieval-dynasty-free-download-o1/",
    "title": "Medieval Dynasty Digital Supporter Download",
    "description": "Get Medieval Dynasty for free instantly and play pre-installed on SteamRiP\nEurope in the early Middle Ages Nobles and clergy rule and the trade between nations brings prosperity as well as envy, distrust, and greed. Military conflict is everywhere and entire continents are changing. In Medieval Dynasty, you take on the role of a young man who has fled from war and wants to take his fate into his own hands. From being alone, inexperienced and poor you will develop into a master of many skills, a leader of your community and the founder of a prosperous dynasty which is meant to last and prosper for generations to come.\nDefending against wild animals while hunting for food, gathering resources and crafting equipment, building a house and erecting a whole bustling village while founding a family all contribute to a unique gameplay experience across many genres. Tough winters and unexpected events challenge your skills and dexterity as you strive to build your own legacy. Star Wars Empire at War\nYou can choose to follow the main chapters , solve the questlines or just roam around and explore the vast medieval world – but be careful as wolves or bears may try to take a bite from you Begin with the simplest things for your own survival like hunting and farming as well as building yourself a home. Found a family and have a heir – entice others to live near and work for you, erect many other buildings to transform your settlement into a vibrant village and, ultimately, a thriving dynasty that will reign for generations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/medieval-dynasty-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/medieval-dynasty-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 10",
        "Processor": "3 GHz Quad Core",
        "Memory": "8 GB RAM",
        "Graphics": "DirectX 11 compatible GPU, 4GB dedicated VRAM (GeForce GTX 970 / Radeon RX 480)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Simulation",
        "Developer": "Frontier Developments",
        "Platform": "PC",
        "Game Size": "20 GB",
        "Released By": "RUNE Emu",
        "Version": "v2.4.0.5 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/sfL8vY",
        "https://datanodes.to/izxdzablojma",
        "https://buzzheavier.com/4j3cih7zx4xe"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/medieval-dynasty-free-download-preinstalled-steamrip.jpg"
}