{
    "page_url": "https://steamrip.com/megs-monster-free-download-1u/",
    "title": "Meg’s Monster",
    "description": "Welcome to the Underworld—a land of monsters and mutants who eat humans for breakfast. One such monster—a hulking ogre by the name of Roy—has no interest in eating humans. But one day, he and his best friend Golan stumble upon a lost little girl named Meg , and discover something truly terrifying: the moment she starts wailing in fear, a blood-red hue washes over the sky, and the earth itself begins to tremble and quake.\nThat’s right: this small girl’s tears hold the power to bring forth the apocalypse—and the only way to stop it is for them to help find her mother so she can make it safely back home. Meg’s Monster is a short, story-driven JRPG with a big twist. Figment\nPlayers control Roy , who begins the game with 99,999 HP and is virtually untouchable—but the real concern is keeping Meg safe, because if she starts crying, it’s game over for everyone. Players will have to master the unique mechanics and mini-games baked into each battle , all while protecting Meg and using her favorite toys to keep her pacified.\nOver the course of their journey together, Roy and Meg will encounter a host of quirky and colorful characters, all lovingly rendered in Odencat’s trademark vibrant pixel aesthetic that makes even scary monsters look cute. There’s plenty of drama and intrigue to be found here—and even previously defeated enemies can be befriended through optional sub-events.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/megs-monster-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/megs-monster-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2G Hz",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 12 or OpenGL 2.1",
        "DirectX": "Version 9.0",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "170 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "BUILD 10665295 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/l24q322237by"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/megs-monster-preinstalled-steamrip.jpg"
}