{
    "page_url": "https://steamrip.com/mega-man-x-dive-offline/",
    "title": "MEGA MAN X DiVE Offline Directly Download",
    "description": "Mega Man X DiVE reimagined the world of the Mega Man X series, and now it’s getting an offline version Experience the exciting side-scrolling action we’ve all come to know and love in a whole new light Enter Deep Log, a digital world where the game data of the Mega Man X series has been archived.\nDue to a bug of unknown origins, the game data within Deep Log has become fragmented. With the help of a mysterious navigator, RiCO, the player dives into this digital world to set things straight. Take control of Hunter Programs, recreations of legendary characters such as X and Zero , defeat various forms of Irregular Data, and restore the fractured game data Jump, dash, fire your buster, and swing your saber.\nAll the actions you’d expect from the Mega Man X series are here. Acquire your favorite characters from across the Mega Man universe to add to your collection, and level them up to make them stronger With a mix of brand-new original characters and new designs for fan-favorites, there are plenty out there to discover\nAn All-New Original Story with Hundreds of Stages to Enjoy Immerse yourself in a new Mega Man tale that can only be experienced in Mega Man X DiVE. Blast and cut your way through hundreds of stages spanning multiple difficulty levels Make Your Characters Stronger with Weapons, Trine 5: A Clockwork Conspiracy",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/mega-man-x-dive-offline-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/mega-man-x-dive-offline-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 (64-BIT Required)",
        "Processor": "Intel® Core™ i5-4460 or AMD FX™-6300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 660 or AMD Radeon™ R7 260X",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "CAPCOM Co., Ltd.",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "TENOKE emu",
        "Version": "Build 11846221 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7hsuwse1asq6",
        "https://buzzheavier.com/hdojl6sb6my3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/mega-man-x-dive-offline-preinstalled-steamrip.jpg"
}