{
    "page_url": "https://steamrip.com/mega-man-battle-network-legacy-collection-vol12-1v/",
    "title": "Mega Man Battle Network Legacy Collection Vol. 1 + 2 Download",
    "description": "Note: This product is a bundle which includes Megaman Battle Network Legacy Collection Vol.1 and Mega Man Battle Network Legacy Collection Vol. 2. RAILGRADE\nThe Battle Network is back! Get ready to jack in to the net to face off against deadly enemy programs in electrifying grid based battles, and search the net for rare and powerful BattleChips to build the ultimate deck of special moves!\nThe renowned Mega Man Battle Network series, which has expanded into anime and comics, is back in the Mega Man Battle Network Legacy Collection. This bundle includes ten action-packed games plus additional features like a gallery of illustrations and music! In addition, online play is supported!\nIn 200X, the rapid advancement of Internet technology has created the “network age.” People have come to enjoy the benefits of network technology through portable exploration devices called “PET” and personality simulation programs called NetNavi. As the network world expands and life becomes more convenient, however, network crime is raging. Main character Lan Hikari and his NetNavi , MegaMan.EXE, join forces to confront these incidents.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/mega-man-battle-network-legacy-collection-vol-1-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/mega-man-battle-network-legacy-collection-vol-1-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit)",
        "Processor": "Intel Core i5-4460 3.4GHz or AMD FX-8300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950 2GB or AMD Radeon RX 460 2GB",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "CAPCOM Co., Ltd.",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "TENOKE | Ty Fitgirl",
        "Version": "Build 12361026 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qw9aomhm2ecz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/mega-man-battle-network-legacy-collection-vol-1-2-preinstalled-steamrip.jpg"
}