{
    "page_url": "https://steamrip.com/metal-gear-solid-v-ground-zeroes-free-download/",
    "title": "METAL GEAR SOLID V GROUND ZEROES",
    "description": "World-renowned Kojima Productions showcases another masterpiece in the Metal Gear Solid franchise with Metal Gear Solid V: Ground Zeroes. Metal Gear Solid V: Ground Zeroes is the first segment of the ‘Metal Gear Solid V Experience’ and prologue to the larger second segment , Metal Gear Solid V: The Phantom Pain launching thereafter. Sea Power Naval Combat in the Missile Age\nMGSV: GZ gives core fans the opportunity to get a taste of the world-class production’s unparalleled visual presentation and gameplay before the release of the main game. It also provides an opportunity for gamers who have never played a Kojima Productions game, and veterans alike, to gain familiarity with the radical new game design and unparalleled style of presentation.\nThe critically acclaimed Metal Gear Solid franchise has entertained fans for decades and revolutionized the gaming industry. Kojima Productions once again raises the bar with the FOX Engine offering incredible graphic fidelity and the introduction of open world game design in the Metal Gear Solid universe. This is the experience that core gamers have been waiting for.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/metal-gear-solid-v-ground-zeroes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/metal-gear-solid-v-ground-zeroes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows Vista SP2 x64, Windows 7 x64, Windows 8 x64 (64-bit  Required)",
        "Processor": "Core i5-4460 (3.20GHz) or better *Quad-Core or better",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 (2GB) or better (DirectX 11 graphics card required)",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "KONAMI",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "CPY emu | Ty lanternjoe for CSF (cs.rin.ru)",
        "Version": "Build 558266 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lsrv9qichpxk",
        "https://buzzheavier.com/wj3pfdpeqpzr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/metal-gear-solid-v-ground-zeroes-preinstalled-steamrip.jpg"
}