{
    "page_url": "https://steamrip.com/metal-slug-attack-reloaded-free-download/",
    "title": "METAL SLUG ATTACK RELOADED",
    "description": "METAL SLUG, the classic action shooter, retains its detailed 2D pixel look and is now a tower defense game with beginner-friendly controls Willy’s Wonderland – The Game\nHelp familiar characters grow, and build the strongest deck. Use all sorts of strategies to crush enemy bases! The game also features “ANOTHER STORY”, which fans won’t want to miss, and “GALLERY” Mode. War it out with players all over the world for the highest title!\n■METAL SLUG is now a tower defense game METAL SLUG, beloved for its detailed 2D pixel art graphics and unique, comical setting, is now a tower defense game of the epic proportions !\n■Over 300 characters duke it out There are over 300 super unique characters in the game! Five factions including the Regular Army, Rebel Army, Space Army, and more wage all-out war! You’ll want to pay attention to how the massive war machines jitter as they move around!\n■Hard-core action with easy controls The controls make it so that anyone can have fun playing! Gameplay is easy, but hard to master! Train your favorite characters and build your unique deck!\n■Must-see stories for METAL SLUG fans “ANOTHER STORY” follows the characters in a lengthy sequel to the story, and “GALLERY” Mode allows you to view art and listen to the music in the game!\n■Battle online against players from all over the world In addition to “ROOM BATTLE” to battle friends, there’s also “MATCHING BATTLE ” in which you can fight other players around the world for the highest title of “Super Devil”",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/metal-slug-attack-reloaded-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/metal-slug-attack-reloaded-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i7-4790",
        "Memory": "16 GB RAM",
        "Graphics": "Intel HD Graphics 4600",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation, Strategy",
        "Developer": "SNK CORPORATION",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "SKIDROW",
        "Version": "Build 14672669 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/o8itne6fbyz0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/metal-slug-attack-reloaded-preinstalled-steamrip.jpg"
}