{
    "page_url": "https://steamrip.com/metal-gear-solid-v-the-phantom-pain-free-download-2m/",
    "title": "METAL GEAR SOLID V THE PHANTOM PAIN Directly Download",
    "description": "Konami Digital Entertainment continues forth the ‘METAL GEAR SOLID V Experience’ with the latest chapter, METAL GEAR SOLID V: The Phantom Pain. Ushering in a new era for the franchise with cutting-edge technology powered by the Fox Engine, MGSV: The Phantom Pain will provide players a first-rate gaming experience as they are offered tactical freedom to carry out open-world missions .\nNine years after the events of MGSV: GROUND ZEROES and the fall of Mother Base, Snake a.k.a. Big Boss, awakens from a nine year coma. The year is 1984. The Cold War serves as the backdrop as nuclear weapons continue to shape a global crisis. Driven by revenge, Snake establishes a new private army and returns to the battlefield in pursuit of the shadow group, XOF. Surviving Mars\nThe METAL GEAR SOLID team continues to ambitiously explore mature themes such as the psychology of warfare and the atrocities that result from those that engage in its vicious cycle. One of the most anticipated games of the year with its open-world design, photorealistic visual fidelity and feature-rich game design, MGSV: The Phantom Pain will leave its mark as one of the hallmarks in the gaming industry for its cinematic storytelling, heavy themes, and immersive tactical gameplay.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/metal-gear-solid-v-the-phantom-pain-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/metal-gear-solid-v-the-phantom-pain-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7×64, Windows 8×64, Windows 10×64 (64-bit  Required)",
        "Processor": "Intel Core i5-4460 (3.40 GHz) or better; Quad-core or better",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 (2GB) or better (DirectX 11 card Required)",
        "DirectX": "Version 11",
        "Storage": "28 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Konami Digital Entertainment",
        "Platform": "PC",
        "Game Size": "27.6 GB",
        "Released By": "CODEX",
        "Version": "v1.15 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/B2FFDC84E4",
        "https://buzzheavier.com/rku5dkkw4xea",
        "https://1fichier.com/?2xx5ahh9uv6nwwb0dfto"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/metal-gear-solid-v-the-phantom-pain-preinstalled-steamrip.jpg"
}