{
    "page_url": "https://steamrip.com/metal-slug-tactics-free-download/",
    "title": "Metal Slug Tactics",
    "description": "Metal Slug Tactics brings the explosive charm and nostalgic fun of the cult METAL SLUG series to the tactical scene! Get ready for an intense ride through the best of both worlds: classic arcade action and roguelite tactical thrills. Jump into the combat zone and revive your METAL SLUG nostalgia in a whole new way!\nTACTICAL RPG WITH ROGUELIKE ELEMENTS Metal Slug Tactics offers a fresh perspective on the iconic battles of the METAL SLUG series. Lead your squad to victory through strategic guile and superior firepower in a perfect blend of classic action and tactical depth. Unleash powerful special attacks and shape the outcome of each encounter !\nGET YOUR GEAR, SOLDIERS! MISSION START! Choose between iconic brothers-in-arms from across the METAL SLUG series and create the perfect team to stop Morden’s devious plans. Quadrober Simulator\nDetermine the best weapon loadouts and mods to maximize combo efficiency on the battlefield. Launch simultaneous attacks with the “SYNC” mechanic to deal massive damage to the enemy! And if your team is in trouble, you can always call in some reinforcements and watch the big guns at work: heavy artillery, airstrikes, the glorious METAL SLUG itself – you name it, you get it",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/metal-slug-tactics-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/metal-slug-tactics-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-2550k or AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 730, 2GB or AMD Radeon HD 7570, 1GB",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Strategy",
        "Developer": "Leikir Studio",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "RUNE",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/570fp8k51zfv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/metal-slug-tactics-preinstalled-steamrip.jpg"
}