{
    "page_url": "https://steamrip.com/midnight-fight-express-free-download-1g/",
    "title": "Midnight Fight Express Directly Download",
    "description": "An unexpected hero emerges on the city’s darkest night. You’re Babyface , a former member of the criminal underworld lured back into “the life” by a mysterious AI drone. Your mission against impossible odds: Fight your way across the city before sunrise, and prevent a citywide criminal takeover together. Engage in a brutal and hyper-kinetic brawling ballet, using every environmental tool and street fighting technique at your disposal.\nLevel up your abilities to take down the mounting onslaught of bozos , cronies, and crime lords. Tangle with waves of foes with the finesse of an action-movie master. Punch, dodge, counter, and finish off enemies in fluid and visceral combat featuring mo-cap animation by motion artist and stunt performer Eric Jacobus. Custom difficulty modes allow any player to direct the action to their preference. Level up, power up, and tap into a sprawling skill tree to unleash a dizzying array of devastating fighting moves. Islets\nDevelop your own signature style, and master over-the-top combos that leave the criminals wondering what hit ’em. Complement your melee moves with knives, axes, and sledgehammers. Wield a wild array of pistol fire, shotgun blasts, and explosives. Weaponize everything from furniture to toilet plungers. Take advantage of the urban world around you to score increasingly outrageous takedowns and clean up the streets.\nCustomize your character’s appearance, and unlock a huge variety of cosmetic options ranging from the ultra-suave to the mega-outlandish. Unlock more 150+ pieces of clothing, equip skins for you and your AI ally Droney, and make a lasting impression as you fight to save the streets. Battle across the city’s 41 hand-crafted levels to the beat of a pulsing, infectious soundtrack by artist Noisecream, and channel the nonstop midnight energy of the metropolis.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/midnight-fight-express-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/midnight-fight-express-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i7-7500U (2 * 2700) or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Intel HD  620 or equivalent",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Jacob Dzwinel",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Released By": "GOG",
        "Version": "v1.021 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4s9r6xptie45",
        "https://buzzheavier.com/wr9b7pwyl6lw",
        "https://datanodes.to/788fpm47amsw/Midnight-Fight-Express-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/midnight-fight-express-preinstalled-steamrip.jpg"
}