{
    "page_url": "https://steamrip.com/mile-high-taxi-free-download-1w/",
    "title": "MiLE HiGH TAXi Directly Download",
    "description": "Get ready to take on the role of the ultimate sci-fi hover taxi driver in this fast-paced adventure! Experience heart-pumping action as you race against the clock in a vibrant, futuristic city inspired by “The Fifth Element”, with arcade-style gameplay reminiscent of “ Crazy Taxi “. This pulse-pounding ride will have you on the edge of your seat. As you speed through the narrow, vibrant skyways, you’ll encounter a cast of hilarious and chatty pedestrians, as well as impatient and over-the-top passengers. Munchkin Digital\nEvery moment counts in this high-stakes all-or-nothing game. Rise to the challenge and come out on top With an “ easy ” setting and three different game play modes to choose from, you’ll have plenty of opportunities to improve your skills and test your limits. Most players can master the controls for a hover taxi in under one hour of intense gameplay and be able to confidently navigate the city streets. Get ready to accept the challenge, take the wheel, and show off your skills as you become a top player in this fast-paced adventure",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/mile-high-taxi-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/mile-high-taxi-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i3",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 680 (30fps+) Will run as low as Intel UHD-630",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Racing, Simulation",
        "Developer": "Cassius John-Adams",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/i8rzajerlrey"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/mile-high-taxi-preinstalled-steamrip.jpg"
}