{
    "page_url": "https://steamrip.com/mind-over-magic-free-download/",
    "title": "Mind Over Magic",
    "description": "Build and optimize a magic school while keeping powerful mages alive and inspired. Prepare them to explore the horrors of the Underschool, a deadly subterranean gauntlet. Study lost arcana, grow exotic plants, brew potions, and raise undead servants. But don’t forget to stop the deadly fog from consuming everything in its path.\nConjure Your Own Magic School Build the ultimate magic school, brick by brick. Design every room to fit your vision. Unlock new furniture, wallpaper, lighting, and decorations to personalize every detail. Experiment with layouts to discover hidden efficiency bonuses and create the perfect balance of design and function .\nExplore the Deadly Underschool Beneath your school lies a mysterious labyrinth filled with dark secrets, deadly magic, and ghastly creatures. The deeper you explore, the greater the rewards—but danger doesn’t always stay underground.\nRaise Magical Beasts & Unlock Their Potential Research and discover mystical beasts to serve your school and unlock powerful new resources. These creatures require food, affection, and magical care to grow into valuable allies, providing rare materials for crafting and construction. Disney Infinity 3.0: Gold Edition\nIf you’re truly ambitious, tackle the challenge of raising a dragon to aid your school. Dragons demand specialized students to become caretakers , but in return, they grant your mages the ability to embark on daring quests beyond the school walls—uncovering secrets, gaining unique powers, and shaping the future of your academy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/mind-over-magic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/mind-over-magic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB VRAM",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Sparkypants",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u9ugxd0d31lh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/mind-over-magic-preinstalled-steamrip.jpg"
}