{
    "page_url": "https://steamrip.com/minecraft-1d/",
    "title": "Minecraft Game Download",
    "description": "Minecraft is a 3D sandbox game created by Swedish game developer Markus “Notch” Persson. It is maintained by Mojang Studios, a part of Xbox Game Studios, which in turn is part of Microsoft. Minecraft focuses on allowing the player to explore, interact with and modify a dynamically-generated map made of one-cubic-meter-sized blocks. In addition to blocks, the environment features plants, mobs and items. Some activities in the game include building, mining for ore, fighting hostile mobs and crafting new blocks and tools by gathering various resources found in the game. PC Building Simulator\nThe game’s open-ended model allows players to create structures, creations and artwork on various competitive or collaborative multiplayer servers or their single-player maps. Other features include redstone circuits for logic computations and remote actions, minecarts and tracks, and a mysterious underworld called the Nether. A designated but completely optional goal of the game is to travel to a dimension called the End and defeat the ender dragon.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/05/Minecraft-Free-Download-Crack-Steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/05/Minecraft-Free-Download-Steamrip.png"
    ],
    "system_requirements": {
        "OS": "Windows XP Service Pack 3",
        "Processor": "Core 2 Duo 2GHz or equivalent",
        "Memory": "3 GB RAM",
        "Graphics": "ATI or NVIDIA card w/512 MB RAM",
        "DirectX": "Version 9.0",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Building, Simulation",
        "Developer": "Mojang",
        "Platform": "PC",
        "Game Size": "526 MB",
        "By": "SKLauncher/cs.rin.ru",
        "Version": "v1.20.4/v1.17.1 | Full version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ce0k7kfy49sa",
        "https://megadb.net/ug3t25uoap6l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/05/Minecraft-Free-Download-PC-Steamrip.jpg"
}