{
    "page_url": "https://steamrip.com/minecraft-win-10-edition-m1/",
    "title": "Minecraft Windows 10 Edition Download",
    "description": "Get Minecraft Win 10 Edition PC game for free instantly and play pre-installed on SteamRiP\nPrepare for an adventure of limitless possibilities as you build, mine, battle mobs, and explore the ever-changing Minecraft landscape. The Village & Pillage Update is here! Create new communities. Survive new threats. Explore all-new villages\nExplore infinite worlds and build everything from the simplest of homes to the grandest of castles. Play in creative mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armor to fend off dangerous mobs. Create, explore and survive alone or with friends on mobile devices, Switch, Xbox One and Windows 10.\nMinecraft on Windows 10 also runs on Windows Mixed Reality and Oculus Rift devices, and supports all the Minecraft features you know and love. EXPAND YOUR GAME: Marketplace – Discover the latest community creations in the marketplace. Rustler\nGet unique maps, skins, and texture packs from your favorite creators. Slash commands – Tweak how the game plays: you can give items away, summon mobs, change the time of day, and more. Add-Ons – Customize your experience even further with free\nAdd-Ons If you’re more tech-inclined, you can modify data-driven behaviors in the game to create new resource packs.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/minecraft-windows-10-edition-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit) version 14393.0 or higher & Xbox One",
        "Processor": "Intel i7-6500U /  AMD A8-6600K or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce  940M / AMD Radeon HD  8570D",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Arcade",
        "Developer": "Mojang Studios",
        "Platform": "PC",
        "Game Size": "53.2 MB Launcher",
        "Multiplayer By": "Online-fix.me",
        "Version": "v1.20 UWP-Fix V3 (Support any version | Universal Fix) | (Full ) + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.xbox.com/en-us/games/store/minecraft-for-windows/9nblggh2jhxj",
        "https://megadb.net/8accjm9rloxi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/minecraft-windows-10-edition-free-download-preinstalled-steamrip.jpg"
}