{
    "page_url": "https://steamrip.com/mini-airways-free-download/",
    "title": "Mini Airways",
    "description": "Mini Airways is a real-time management game with an air traffic control theme. You will play as a busy air traffic controller in the game: directing planes to take off and land, clearing air traffic , upgrading airspace And most of all, don’t let them crash Each airport can accommodate up to 4 people online and supports the use of the Workshop map. You can work with your friends to jointly manage the same airspace to reduce the impact of mistakes and challenge higher scores NO-SKIN\nFast-paced, real-time ATC gameplay: Manage airspace, clear planes for takeoff and landing, and avoid near misses! In addition to the normal arrangement of takeoffs and landings, you also need to face the challenges of mountains, no-fly zones, and peak landing hours, so please concentrate Every time you finish one day’s management, you will be able to pick an upgrade for your airspace and airport: auto holding, accelerating turns, increasing airspace , waypoints upgrade and customize airports to keep flights running more smoothly.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/mini-airways-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/mini-airways-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Window 10 or newer",
        "Processor": "2GHz or better",
        "Memory": "1 GB RAM",
        "Graphics": "1366×768 minimum resolution, post-2012 graphics hardware",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "CCC Games",
        "Platform": "PC",
        "Game Size": "923 MB",
        "Released By": "TENOKE",
        "Version": "v0.11.3f1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x47yw0aidf1i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/mini-airways-preinstalled-steamrip.jpg"
}