{
    "page_url": "https://steamrip.com/mirrors-edge-free-download-4n/",
    "title": "Mirror’s Edge Free",
    "description": "Get Mirror’s Edge PC game for free instantly and play pre-installed on SteamRiP\nIn a city where information is heavily monitored , agile couriers called Runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a Runner called Faith and this innovative first-person action-adventure is your story. Mirror’s Edge™ delivers you straight into the shoes of this unique heroine as she traverses the vertigo-inducing cityscape , engaging in intense combat and fast paced chases.\nWith a never before seen sense of movement and perspective, you will be drawn into Faith’s world. A world that is visceral, immediate, and very dangerous. Live or die? Soar or plummet ? One thing is certain, in this city you will learn how to run. From the makers of the groundbreaking Battlefield franchise, Mirror’s Edge is an action- adventure experience unlike any other. Zombieland VR: Headshot Fever",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/mirrors-edge-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/mirrors-edge-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "Processor": "3.0 GHz or faster",
        "Memory": "1 GB RAM or more",
        "Graphics": "DirectX® 9.0c compatible video card, Shader Model 3.0 required. Video card must have 256 MB,",
        "NVIDIA": "GeForce 6800 or better",
        "Hard Drive": "8 GB free space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "DICE",
        "Platform": "PC",
        "Game Size": "5.71 GB",
        "Repack By": "GOG",
        "Version": "v1.01 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/fuuec8",
        "https://megadb.net/u1xttzuqt64h",
        "https://buzzheavier.com/19yskzqc2zwq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/mirrors-edge-free-download-preinstalled-steamrip.jpg"
}