{
    "page_url": "https://steamrip.com/mirrors-edge-catalyst-free-download/",
    "title": "Mirror’s Edge Catalyst",
    "description": "Follow Faith, a daring free runner, as she fights for freedom in the city of Glass. What appears to be an elegant, high-tech city on the outside, has a terrible secret hidden within. Explore every corner from the highest beautifully lit rooftops to the dark and gritty tunnels below. The city is huge, free to roam and Faith is at the center of it all. Through the first-person perspective, combine her fluid movement and advanced combat with the city’s surroundings to master the environment and uncover the conspiracy.\nTRAVERSAL Hit top speed quickly zipping down wire lines. Balance on pipes before smoothly dropping to a hang before climbing, hand over hand, under an obstacle. Run vertically and horizontally on any wall and use your environment to swing around corners or over gaps.\nFOCUS Fast, light, and agile, Faith must stay focused and use her movement to survive. Focus is gained from free running, and once Faith has Focus enemies cannot hit her. Focus is lost from low speed and being attacked, so it is essential to maintain a balance of out-traversing opponents and engaging them directly.\nMOMENTUM Build momentum to do daring jumps between rooftops or stylish slides through tight spaces. Use the new Shift move to get a short burst of acceleration in any direction. For a quick change of plan, tweak any move with Quickturn, a rapid 180 or 90 degree turn.\nCOMBAT Deliver devastating full body Heavy Traversal Attacks that throw your opponents stumbling into walls, over railings, and into each other. Use your momentum to flow right through KrugerSec as you string together a series of Light Traversal Attacks, building focus, and keeping speed. Outmaneuver opponents as you Shift behind them for a kick to the back. Or take advantage of a stun with a few rapid punches before Shifting away to avoid retaliation or a counter. Final Fantasy VIII – Remastered\nGADGETS Faith’s running skills, martial arts knowledge, and determination is expanded on with a few pieces of hardware used to traverse the city and rise against the oppression smothering the citizens of Glass.\nNOTE: ONLINE FEATURES FOR THIS TITLE HAVE BEEN DISCONTINUED.",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1233570/ss_116c113eb5b453bba9b00dc6650f61685e1ee40e.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1233570/ss_1efcfc1a83e30309c0710fe7ea8928eef4c26ca4.600x338.jpg",
        "https://gofile.io/d/IG4lXo",
        "https://buzzheavier.com/7mcycn8pnq0t"
    ],
    "system_requirements": {
        "OS *": "Windows 7 64-Bit (use the latest Service Pack)",
        "Processor": "Intel i3-3250 / AMD FX-6350. (Note: Mirror’s Edge Catalyst requires at least 4 logical cores to run)",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce® GTX 650 Ti 2GB or better / AMD Radeon™ R9 270x or better",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "DICE",
        "Platform": "PC",
        "Game Size": "23.3 GB",
        "Released By": "CPY",
        "Version": "v1.0.3.47248",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/IG4lXo",
        "https://buzzheavier.com/7mcycn8pnq0t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/Mirrors-Edge™-Catalyst_featured_final.jpg"
}