{
    "page_url": "https://steamrip.com/mirthwood-free-download/",
    "title": "Mirthwood",
    "description": "an enchanting RPG life sim. Fleeing a continent swept with war your arrival in a new land provides a fresh start. Experience an immersive medieval fantasy world sandbox that allows you to choose who you want to be.\nManage your own homestead , build a farm, plant and harvest crops, rear animals, and upgrade your facilities to craft items and gear. Build a peaceful life for your family and trade your goods from town to town.\nMirthwood features a rich, fully realized world, with gorgeous hand-drawn graphics, immersive sound effects, and an original musical score. Explore an open world comprised of six diverse regions and three distinct towns, with much to discover – and uncover. Battle Storms, Winter, & Disease with survival-lite elements as you progress through a bewitching world . Empire of the Ants\nTake up a sword or ready your bow in real-time combat , Mirthwood will pit you against a variety of enemies from Bandits to werewolves. Equip yourself with a collection of weapons, armor, and clothing. Level and specialize your character in your chosen combat class to improve your ability to survive the dangers of Bleakwood.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/mirthwood-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/mirthwood-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Dual-core CPU @ 2Ghz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 1080, AMD Radeon RX 5700",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation",
        "Developer": "Bad Ridge Games",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.63p3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/erlpr0ylvizr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/mirthwood-preinstalled-steamrip.jpg"
}