{
    "page_url": "https://steamrip.com/misao-definitive-edition-free-download/",
    "title": "Misao: Definitive Edition",
    "description": "MISAO is a horror- adventure game in which you search for a young girl who has disappeared in a cursed school. Just three months ago, a young girl went missing. Petit Petit Petit Her name is Misao. She was a classmate of the player’s character. Quiet and reclusive, this plain girl was often the target of bullies.\nProtagonist In this game you can choose a female or male protagonist. This will not have a major impact on the story itself, but some of the dialogue and scenes differ slightly for the different genders and personalities.\nMisao A young girl who went missing. In the classroom she is considered is a plain, reclusive girl. Her grudge is at the root of this story.\nTohma A boy with a handsome face, popular with the girls. But he is no knight in shining armor.\nSaotome An attractive girl, popular with the boys. Nicknamed “Otome”.\nAyaka A girl with her head in the clouds. She has a thing for her teacher Sohta.\nYoshino She is the ringleader of the bullies who harassed Misao.\nKudoh A boy with a mature, collected personality. A childhood friend of Misao.\nKurata A handsome, kind teacher who has earned the respect of his students.\nOnigawara President of the student council. A mysterious figure who seems to know a lot about recent events.\nLibrary A mysterious young woman who got her name from spending copious amounts of time in the library. She can offer the player hints.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/misao-de-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/misao-de-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 or Greater",
        "Processor": "Intel Core 2 1.06Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "Integrated graphics",
        "DirectX": "Version 9.0",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "sen",
        "Platform": "PC",
        "Game Size": "177 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.06 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9mz6789dxvj6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/misao-de-preinstalled-steamrip.jpg"
}