{
    "page_url": "https://steamrip.com/mist-slayer-free-download-w1/",
    "title": "Mist Slayer",
    "description": "We are aware of some ongoing issues that we are working hard to resolve , including:\nThere is still much room for improvement , and we are continuously releasing patches to polish and expand the game. We appreciate your patience and understanding. As our first game, we are committed to honing Mist Slayer into something truly special AMID EVIL\n4 characters with different combat styles: the balanced Buckler , ranged Archer, heavy hitting Claymore, and agile Assassin. Each has unique attacks and abilities as well as robust action mechanics like dodging, gurading, and parrying.\nPowers system based on the five elements philosophy: Metal, Wood, Water, Fire, and Earth. These five attribute types have rock-paper-scissors relationships, and players can combine powers to form unique combat builds. Hundreds of Inscriptions add further variances to battles, some with tradeoffs. Matching different inscriptions can lead to unexpected synergies. Players can also obtain WeaponSeals that alter attack forms, adding more room for experimentation with powers andinscriptions.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/mist-slayer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/mist-slayer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-6400 / AMD FX-8320",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 960 / R9 280",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Moju Games",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/byi7w0olkclr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/mist-slayer-preinstalled-steamrip.jpg"
}