{
    "page_url": "https://steamrip.com/model-builder-free-download-y1/",
    "title": "Model Builder Directly Download Link",
    "description": "Model Builder game for free instantly and play pre-installed on SteamRIP\nJoin the latest trend in simulation games, bring out your creativity and make awesome looking models . Cut out, assemble, paint, and then customize your models! Build planes, tanks, ships, figures, and so much more. Sell your creations for-profit to expand your toolkit .\nCreate stunning and epic scale models for the world to see. Go on a fascinating journey in the footsteps of grandfather Stan and his achievements, unlocking secrets of the past, take on commission and competitions as you become the master modelling craftsman. There’s plenty to choose from in terms of what you can assemble and once you are done, there’s a ton more to unlock. Expect dozens of hours of fun and much more in post-release updates. Clownfield 2042\nChoose the model that you want to create, feel the satisfaction of snipping out the model parts, step by step build your model, and apply finishing touches, so it is ready for painting . You have a wide variety of tools at your disposal – everything you need to assemble your impressive models and make them shine.- Unlock new tools to help with precision work and finishes.\nYou will feel like a pro in no time. Now it’s time to get creative! You can take the serious route and stick to the brief, or why not make the model your own and pimp it up. With plenty of paint to choose from, use the airbrush tool, or apply with fine detail and top it off with some impressive decals. Your creativity is the limit.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/model-builder-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/model-builder-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "64bit CPU: Intel Core i5-9400 / Ryzen 5 2600",
        "Memory": "8 GB RAM",
        "Graphics": "GPU: 4GB NVIDIA GeForce GTX 1050Ti / AMD Radeon RX 570, or higher",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "Moonlit S.A., Kuba Wójcik",
        "Platform": "PC",
        "Game Size": "15.5 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.7 | Full  + Into The Stars DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qr6vm8uq3qlg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/model-builder-preinstalled-steamrip.jpg"
}