{
    "page_url": "https://steamrip.com/momodora-moonlit-farewell-free-download-m1/",
    "title": "Momodora Moonlit Farewell Directly Download",
    "description": "Momodora: Moonlit Farewell presents the account of the greatest calamity to befall the village of Koho, five years after the events of Momodora III. Once the toll of an ominous bell is heard, the village is soon threatened by a demon invasion. The village’s matriarch sends Momo Reinol, their most capable priestess, to investigate the bell and find the bellringer responsible for summoning demons. It is their hope that by finding the culprit, they will also be able to secure the village’s safety, and most importantly, the sacred Lun Tree’s, a source of life and healing for Koho… Beer Factory\nGorgeous pixel art and animation. Action-packed gameplay focusing on melee combos, dodging enemy attacks, and firing arrows at enemies. The “Sigil” system, which allows for greatly customizable play styles. Intense and core-shaking boss battles. Deep exploration into a world rich in lore and atmosphere. Freely adjustable difficulty levels, allowing you to relax and explore the alluring world at your own pace or take on mighty foes for a real challenge",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/momodora-moonlit-farewell-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/momodora-moonlit-farewell-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS ": "Windows 7",
        "Processor": "Intel Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX750 Ti",
        "DirectX": "Version 10",
        "Storage": "1.5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Bombservice",
        "Platform": "PC",
        "Game Size": "224 MB",
        "Released By": "CHRONOS",
        "Version": "v1.1.f30",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/spyzqbvg2knx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/momodora-moonlit-farewell-preinstalled-steamrip.jpg"
}