{
    "page_url": "https://steamrip.com/mon-bazou-free-download-1v/",
    "title": "Mon Bazou",
    "description": "Get Mon Bazou for free instantly and play pre-installed on SteamRiP\nBuild your crappy vehicle into a race car by installing the parts yourself. Make money by cutting wood, racing at night or delivering pizza . Maybe you want to manage a sugar shack and make tons of maple syrup or build yourself a big garage? You need to keep yourself fed by drinking delicious Maple Syrup and eating Poutine, welcome to Canada!It’s taking place in 2005 with the hot scene of tuned cars and wanna-be streets racers.\nYou are an ordinary country man who decided to equip his old rattle car so that it can participate in races. Of course, you will make all the improvements yourself, but this requires a lot of money. There are many parts to buy and install to keep your old car competitive with other racers. You can try to make money in many different ways, for example, you can deliver food. The game takes place in Canada in 2005. Besides working on your car, you also need to think about how to feed yourself. And of course, the easiest and most profitable way to make money is to grow weed or make alcohol .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/Mon-Bazou-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/Mon-Bazou-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1+) and Windows 10",
        "Processor": "x86, x64 architecture with SSE2 instruction set support.",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 500 series or better",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Racing, Simulation, Early Access",
        "Developer": "SantaGoat",
        "Platform": "PC",
        "Game Size": "593 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.381 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jvwzfe8xj8b2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/Mon-Bazou-preinstalled-steamrip.jpg"
}