{
    "page_url": "https://steamrip.com/monaco-2-free-download/",
    "title": "Monaco 2",
    "description": "Monaco is a city overflowing with luxury and greed, which makes it a perfect target for you and your international gang of criminal masterminds. The best of the best have been assembled, and they’ll need to work together using their unique abilities to rob the city blind . Do you and your friends have what it takes to bring the city of Monaco to its knees? Into the Dead: Our Darkest Days\nTHE CREW They say there’s no honor among thieves, but they’ve never met your crew! Team up with up to three other players in local or online multiplayer and plan your heist. However, nothing ever goes exactly according to plan in Monaco, so you’ll need to work together and improvise if you want to get away with your haul of riches.\nNew characters mean all new ways to play! Assemble your team from a selection of eight playable characters, each with their own unique abilities and playstyles. Need to adapt? Switch your character mid-run to overcome whatever obstacles stand between you and untold riches !\nTHE PLAN Every heist requires careful planning. With Blueprint Mode, you can look at the level’s layout before you start the mission, allowing you to case the joint before you and your friends fleece it for all its worth.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/monaco-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/monaco-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 770 2gb graphics card",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Strategy",
        "Developer": "Pocketwatch Games",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.0.18962 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/74j7cvb16czz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/monaco-2-preinstalled-steamrip.jpg"
}