{
    "page_url": "https://steamrip.com/monster-hunter-rise-sunbreak-free-download-3o/",
    "title": "MONSTER HUNTER RISE SUNBREAK",
    "description": "Rise to the challenge and join the hunt In Monster Hunter Rise, the latest installment in the award-winning and top-selling Monster Hunter series, you’ll become a hunter , explore brand new maps and use a variety of weapons to take down fearsome monsters as part of an all-new storyline. The PC release also comes packed with a number of additional visual and performance enhancing optimizations.\nFerocious monsters with unique ecologies Hunt down a plethora of monsters with distinct behaviors and deadly ferocity. From classic returning monsters to all-new creatures inspired by Japanese folklore , including the flagship wyvern Magnamalo, you’ll need to think on your feet and master their unique tendencies if you hope to reap any of the rewards Firework Simulator\nChoose your weapon and show your skills Wield 14 different weapon types that offer unique gameplay styles, both up-close and from long range. Charge up and hit hard with the devastating Great Sword; dispatch monsters in style using the elegant Long Sword; become a deadly maelstrom of blades with the speedy Dual Blades; charge forth with the punishing Lance; or take aim from a distance with the Bow and Bowguns. These are just a few of the weapon types available in the game, meaning you’re sure to find the play style that suits you best.\nHunt, gather and craft your way to the top of the food chain Each monster you hunt will provide materials that allow you to craft new weapons and armor and upgrade your existing gear. Go back out on the field and hunt even fiercer monsters and earn even better rewards You can change your weapon at any of the Equipment Boxes any time, so the possibilities are limitless",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/monster-hunter-rise-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/monster-hunter-rise-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit）",
        "Processor": "Intel Core i3-4130 or Core i5-3470 or AMD FX-6100",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 1030 (DDR4) or AMD Radeon RX 550",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "36 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "CAPCOM Co., Ltd.",
        "Platform": "PC",
        "Game Size": "32.2 GB",
        "Released By": "EMPRESS",
        "Co-op by": "Online-fix.me",
        "Version": "v13.0.0.1 | Full  + 223 DLCs Activated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/rtozwr2nstix",
        "https://1fichier.com/?edwaan95rozvf1k5t3tv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/monster-hunter-rise-preinstalled-steamrip.jpg"
}