{
    "page_url": "https://steamrip.com/monster-prom-3-monster-roadtrip-free-download-j1/",
    "title": "Monster Prom 3 Monster Roadtrip Directly Download",
    "description": "Hit the road with “Monster Prom 3: Monster Roadtrip”, a vibrant sequel that twists the Monster Prom formula in an exciting new way. At its core, this is a very similar game: a multiplayer narrative adventure full of colorful characters and fresh funny dialogues. But this time the goal isn’t getting a date, but surviving a road trip (although you still can score a date if you play wisely).\nYou and up to 3 friends will face all kinds of wacky conflicts , choosing from options in order to manage your road trip resources. If a resource hits zero you can kiss your trip goodbye But fulfill the right requirements and you may reach one of the dreamy destinations that will put an epic end to this experience .\nYES There’s still the option of dating. This time flirting is not the core of the game, but you can still get a date with Polly, Scott, or one of the 10+ available hitchhikers by the end of the game TONS of beautiful art like you have never seen before in these series (seriously, there’s A LOT of art packed in here) The Jackbox Party Pack 9\nEven if it’s a co-op game, there’s a social competitive aspect that will provide a thrill for the game. Choosing how much to seek your own benefit and how much to focus on the group goal Several brand new characters, and some beloved characters from previous games will be making a comeback Radio stations to choose from, with different music genres to build the perfect mood",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/monster-prom-3-monster-roadtrip-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/monster-prom-3-monster-roadtrip-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or higher",
        "Processor": "Anything from the last 5 years",
        "Memory": "4 GB RAM",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Beautiful Glitch",
        "Platform": "PC",
        "Game Size": "913 MB",
        "Released By": "GOG",
        "Version": "v0.26 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ubfy42ild6g3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/monster-prom-3-monster-roadtrip-preinstalled-steamrip.jpg"
}