{
    "page_url": "https://steamrip.com/monster-train-2-free-download/",
    "title": "Monster Train 2",
    "description": "Powerful beings known as Titans have seized control of Heaven . A makeshift alliance is formed between former angels and demons, who must learn to work together against their common foe.\nNow, you must command these clans aboard newly forged trains, and embark on your journey through Hell, Heaven, and the Abyss, to defeat the Titans before they destroy this world.\nChaos awaits beyond the gates!\nYou’re in command! Choose from a selection of five brand new clans, each with its own unique strengths and gameplay to forge strategies fitting your personal playstyle. With three vertical levels to defend against dangerous new enemies, you’ll need to recruit powerful new units, upgrade cards, and experiment to survive. Can you defeat the all-new and ultra-challenging Titans? Yes, Your Grace 2: Snowfall\nReach your deck’s full build potential with all new Room and Equipment Cards . Room Cards add impressive boosts to your train, allowing you new strategic advantages over your foes. Equipment Cards can be applied to units, giving them a variety of bonuses to aid you in battle\nThe Covenant Outpost is the bustling hub that you’ll visit after each run. From here, you’ll have access to Monster Train 2’s core features, as well as experience character interactions that move the story forward.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/monster-train-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/monster-train-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64 Bit",
        "Processor": "Intel Core i5-4670K / AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 760 (2048 MB) Radeon R7 260X (2048 MB Intel UHD  630",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Shiny Shoe",
        "Platform": "PC",
        "Game Size": "2.7 GB",
        "Released By": "TENOKE",
        "Version": "Build 18525662 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/yq1c8juv8206",
        "https://megadb.net/a3u3nq0bifiw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/monster-train-2-preinstalled-steamrip.jpg"
}