{
    "page_url": "https://steamrip.com/monster-harvest-free-download-m1/",
    "title": "Monster Harvest Free",
    "description": "Get Monster Harvest PC game for free instantly and play pre-installed on SteamRiP\nGet ready to set out on an adventure of a lifetime as you start a new life in Planimal Point. Develop your own farm, build, and customise your own house, craft your own furniture, make some delicious jams and mutate your crops to create loyal and fierce companions you can take into battle During your journey through Planimal Point you’ll discover strange Slimes which can mutate your crops in ways you would never have imagined Depending on the season, the Slime or the crop you mutate, you’ll be able to create up to 72 different mutations Planimals are loyal mutated crops that stay by your side through thick and thin.\nThey’ll be a key companion to you as you adventure across Planimal Point, taking part in thrilling turn-based battles and exploring dungeons as you try to bring down the evil SlimeCo. Planimal Point has three unique seasons which will affect the way you play, with strange weather and seasons shifting what you can grow – watch out for the strange mutations as they change by season. Cute Bite",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/monster-harvest-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/monster-harvest-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8 or Windows 10 only",
        "Processor": "1.2GHz processor",
        "Graphics": "Dedicated graphics card with 128 MB"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Maple Powered Games",
        "Platform": "PC",
        "Game Size": "189 MB",
        "Repack By": "GOG",
        "Version": "v08.09.2021 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rkqczto0pj2j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/monster-harvest-free-download-preinstalled-steamrip.jpg"
}