{
    "page_url": "https://steamrip.com/mooliis-dreamland-free-download-1j/",
    "title": "Moolii’s Dreamland Directly Download",
    "description": "Moolii’s Dreamland is a 2D hand-drawn horizontal flying Bullet-hell indie game that restores classic arcade gameplay. Players will play as the little fox Moolii. One night, Moolii was forced to bed by her mom. While she was in sleep, she experienced physical oppression and alarm from the family pets, and the mischief of friends and relatives, thus entering a world of strange dreams. In her nightmare, Moolii got powerful skills, allowing her to destroy all the monsters Baldur’s Gate 3\nSome of the animals, scenes and characters in the game are all inspired by people and things around the developer. For example, there are five ferrets, a dog and two sugar gliders raised by the developer, who will accompany you in the game in a strange but cute way. In addition, the design for each stage is not only purely about horizontal flying, but also has some brainstorming ideas and designs, waiting for you to explore\nThe game was developed by a solo developer, inspired by the FC console from our childhood classic: Salamander and other classics. The gameplay of Moolii’s Dreamland is more about flying bullet-hell game in a horizontal version. Once you go forward, there is no turning back. It requires our players’ bravery. So don’t be afraid, use the combo trick of ammos and melee attacks, fight a way out for Moolii",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/mooliis-dreamland-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/mooliis-dreamland-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "windows7",
        "Processor": "i3-6100",
        "Memory": "2048 MB RAM",
        "Graphics": "GTX 650",
        "Storage": "1024 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "WOWOH CAT",
        "Platform": "PC",
        "Game Size": "275 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11858143 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qpqvzf3uoc0o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/mooliis-dreamland-preinstalled-steamrip.jpg"
}