{
    "page_url": "https://steamrip.com/moonlighter-free-download/",
    "title": "Moonlighter",
    "description": "Since the release, Moonlighter has been updated with tons of new content. From the smallest changes like key bindings improvements, bug fixes and balance tweaks, to huge innovations that we have promised in our Road Map current version of Moonlighter delivers the original experience with a range of game-changing enhancements for players old and new.\nConfront unfamiliar mini-bosses using brand-new weapons, armor, rings and amulets. Wander around 100 fresh room patterns, with the help of 9 brave Companions , and discover even more lore and story. Finish the main adventure to unlock New Game+ mode with additional challenges and options. Harold Halibut\nDuring a long-passed archaeological excavation, a set of Gates were discovered. People quickly realized that these ancient passages lead to different realms and dimensions – providing brave and reckless adventurers with treasures beyond measure. Rynoka, a small commercial village, was founded near the excavation site providing refuge and a place for adventurers to sell their hard-earned riches. Moonlighter is an Action RPG with rogue-lite elements following the everyday routines of Will, an adventurous shopkeeper that dreams of becoming a hero.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/moonlighter-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/moonlighter-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel(R) Core(TM)2 Quad 2.7 Ghz, AMD Phenom(TM)II X4 3 Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 260, Radeon HD 5770, 1024 MB, Shader Model 3.0",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Digital Sun",
        "Platform": "PC",
        "Game Size": "586 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.15.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/t1u7fz82cz5l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/moonlighter-preinstalled-steamrip.jpg"
}