{
    "page_url": "https://steamrip.com/moonglow-bay-free-download-1r/",
    "title": "Moonglow Bay",
    "description": "Moonglow Bay Download PC Game In Direct Link for free on SteamRIP\nMoonglow Bay is set along the Eastern Canadian coastline during the 1980s and offers players a diverse and emotionally charged story, complemented by a relaxing, slice-of-life fishing RPG . You play as a rookie angler, struggling to fulfil your partner’s final wish by keeping a business afloat in the face of impending bankruptcy. Whether playing solo or with a friend in drop-in-drop-out local co-op, you’ll need to cook your catch of the day, then sell a variety of recipes to upgrade your shop , gear, and fishing boat.\nCombining a playful voxel art style with a sumptuous soundtrack, your journey is split into several distinct story arcs featuring a fully-inhabited town to traverse and the potential for epic encounters with the rumored Mystical Monsters of Moonglow. With your journal and rod in hand, explore the furthest reaches of the ocean , from frigid glaciers to boiling geysers, and learn to cast nets, set traps and fish through ice, documenting over 100 varied aquatic species while uncovering the secrets of Moonglow Bay. Mount & Blade II: Bannerlord",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/moonglow-bay-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/moonglow-bay-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i3 Skylake | AMD FX-6000",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon R7 260X | NVIDIA GeForce GTX 750 Ti",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG",
        "Developer": "Red Hook Studios",
        "Platform": "PC",
        "Game Size": "777 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4vgul8xt0w3b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/moonglow-bay-free-download-preinstalled-steamrip.jpg"
}