{
    "page_url": "https://steamrip.com/moonshine-inc-free-download-1m/",
    "title": "Moonshine Inc. Directly Download",
    "description": "We love moonshin ’. There ain’t nothin’ better than good booze. In Appalachia, we know it well. We’ve got moonshine in our blood in the case of some old-timers, maybe even literally. We love to talk about likker, make it, drink it all day long and we love to share it too How ’bout that, my gaming friend?\nWhat’s your alcohol of choice? Do you maybe know how to make it? The process is a complex one, but with our know-how, we can shed some light on it, if you’d like; a little bit of moonlight – moonshine – to guide you through the processes of fermentation, distillation, and bottling. But that’s too much to write about here just check out the .gif below to see how we went about it. Makin’ booze is pure fun, but if you’re makin’ money too now that’s the way to live. However, for that, you need to be smart, manage your base right, and not piss off the boys in blue Retro Gadgets\nWe tried to capture the life of a moonshiner as realistically as possible. You’ll be managing workers who’ll be crafting and maintaining your equipment, you’ll be buying ingredients , unlocking technologies, planning deliveries and finances, making sure you remain as discreet as possible and deciding whom to trust and with whom to work.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/moonshine-inc-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/moonshine-inc-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4460 3.20 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Ti",
        "DirectX": "Version 11",
        "Storage": "18 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Klabater",
        "Platform": "PC",
        "Game Size": "11 GB",
        "Released By": "FLT",
        "Version": "v0.92 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/amtm0jnvoqx0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/moonshine-inc-preinstalled-steamrip.jpg"
}