{
    "page_url": "https://steamrip.com/mortal-kombat-kcomplete-edition-1z/",
    "title": "Mortal Kombat complete Edition",
    "description": "The newest chapter of the iconic fighting franchise is now available! Experience the deadliest tournament with all the kombatants and their unique fatalities . Players enter the realm to face the Kombatants in Mortal Kombat Komplete Edition, delivering all of the downloadable content (DLC), including intrepid warriors Skarlet, Kenshi and Rain, as well as the notorious dream stalker Freddy Krueger. Additionally, the game offers 15 Klassic Mortal Kombat Skins and three Klassic Fatalities (Scorpion, Sub-Zero and Reptile). Golf VS Zombies\nMortal Kombat Komplete Edition features dynamic gameplay including Tag Team , Challenge Tower and a full feature length story mode. Players choose from an extensive lineup of the game’s iconic warriors and challenge their friends in traditional 1 vs. 1 matches, or gamers can spectate battles and interact directly with Kombatants online during the King of the Hill mode. The game supports the Mortal Kombat Tournament Edition Fight Stick and delivers full controller capability. Players will also be able to access achievements and leaderboard stats",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/mortal-kombat-komplete-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/mortal-kombat-komplete-edition-screenshot-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "NetherRealm Studios, High Voltage Software",
        "Platform": "PC",
        "Game Size": "8.8 GB",
        "Released By": "FLT",
        "Version": "Build 344915 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/9klqvyqn0i3e",
        "https://megadb.net/l4a6iyd5bvw2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/mortal-kombat-komplete-edition-preinstalled-steamrip.jpg"
}