{
    "page_url": "https://steamrip.com/mount-blade-ii-bannerlord-free-download-1r/",
    "title": "Mount and Blade 2 Bannerlord Direct",
    "description": "Mount & Blade II Bannerlord Download PC Game In Direct Link for free on SteamRIP\nThe horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour , summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashes of the old. Mount & Blade II: Bannerlord is the eagerly awaited sequel to the acclaimed medieval combat simulator and role-playing game Mount & Blade: Warband.\nSet 200 years before, it expands both the detailed fighting system and the world of Calradia. Bombard mountain fastnesses with siege engines, establish secret criminal empires in the back alleys of cities, or charge into the thick of chaotic battles in your quest for power.\nExplore, raid and conquer your way across the vast continent of Calradia, making friends and enemies along the way. Raise your own army and lead it into battle, commanding and fighting alongside your troops in the thick of the action. Play the game the way you want to play it Plot your own path to power in a dynamic sandbox adventure where no two playthroughs are the same.\nCreate and develop your own character to match your playstyle. Progress skills by performing actions as you gain access to a selection of perks that represent your mastery of a talent.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/mount-and-blade-2-bannerlord-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/mount-and-blade-2-bannerlord-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-bit only)",
        "Processor": "Intel Core i3-8100 / AMD Ryzen 3 1200",
        "Memory": "6 GB RAM",
        "Graphics": "Intel UHD  630 / NVIDIA GeForce® GTX 660 2GB",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Simulation, Strategy",
        "Developer": "TaleWorlds Entertainment",
        "Platform": "PC",
        "Game Size": "35.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.2.12.66233 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/OsHAXL",
        "https://buzzheavier.com/j2nl1bovcg7u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/mount-and-blade-2-bannerlord-free-download-preinstalled-steamrip.jpg"
}