{
    "page_url": "https://steamrip.com/move-or-die-free-download-s2/",
    "title": "Move or Die Free Download Directly",
    "description": "20 seconds, constantly changing mechanics and a lot of yelling. These are the keywords that perfectly describe a round of Move or Die, the 4-player friendship ruining party game where rules change every single round. Slap your friends’ controllers out of their hands while playing on the same couch, challenge players online from around the world or pretend to practice offline with AI bots. Select what game modes you want to play from an ever-growing list of developer and community-generated modes, each with their own outrageous mechanics and level design crafted to promote hours of good old friendship-ruining fun.\nPlay online to gain XP and level up, unlocking awesome characters and game modes in the process, or try to work your way up the daily challenge leader boards where players go against AI bots in survival-like matches. As its name suggests, Move or Die forces players to take action. In fact, not moving literally makes your character explode. And, with just 20 seconds per round, Move or Die is a quick game to pick up, but a hard one to put down.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/move-or-die-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/move-or-die-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "10",
        "Processor": "If it’s a laptop with no dedicated GPU, CPU should be less than 3 years old.",
        "Memory": "8 GB RAM",
        "Graphics": "Dedicated GPU recommended",
        "Network": "Broadband Internet connection",
        "Storage": "700 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Those Awesome Guys",
        "Platform": "PC",
        "Game Size": "571 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v17.2.2 | Full Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/l1v4q9l0mjjp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/move-or-die-free-download-torrent-steamrip.jpg"
}