{
    "page_url": "https://steamrip.com/moving-out-free-download-1x/",
    "title": "Moving Out  Link",
    "description": "Moving Out game for free instantly and play pre-installed on SteamRiP\nMoving Out is a ridiculous physics-based moving simulator that brings new meaning to “couch co-op” Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you’ll take on moving jobs all across the busy town of Packmore.\nSmooth Moves may not be the biggest moving company, but there’s no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colorful customizable characters, and save your town from furniture peril Ragnarock VR\nEnjoy the story mode solo as an independent contractor or team up with some friends. Up to four players can cozy up on the couch to argue over the best way to move a couch. Test your skills AND your friendship\nAre pesky doors and windows standing in your furniture’s way? Just blast through them with physics! Lift, toss and smash your way to the fastest times\nLearn the ropes in a series of increasingly precarious and fantastical moving jobs. How a bed gets from point A to point B is never a straight line, so throw out the training manual and get creative\nEvery moving company starts small, but as your reputation ranks up, so do your destinations. Move through sleepy suburbs, frenzied farms, haunted houses, virtual reality and lands beyond",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/moving-out-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/moving-out-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 (64-bit) or Windows 10 (64-bit)",
        "Processor": "Intel Core2 Duo E8400 or AMD Phenom II X2 550",
        "Memory": "4 GB RAM",
        "Graphics": "Intel UHD 630 or Radeon Vega 8",
        "DirectX": "Version 12",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation",
        "Developer": "SMG Studio, Devm Games",
        "Platform": "PC",
        "Game Size": "565 MB",
        "Released By": "CODEX",
        "Version": "v1.3.4856.169 | full version (Latest) + 2 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/totaujsvvlj0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/moving-out-preinstalled-steamrip.jpg"
}