{
    "page_url": "https://steamrip.com/mr-president-free-download-1i/",
    "title": "Mr.President! Directly Download",
    "description": "Mr.President! Can you take a bullet for the soon to be President of the United States of America?! You play as Dick “Rock-Hard” Johnson a bulletproof man, the best bodyguard money can buy. He is sworn to protect the most hated presidential candidate of all time Ronald Rump. Liberal media has rigged the election and tarnished his glowing public image, now they are trying to end his life. You need to leap, flip, fling, roll, and many other verbs to get in between Rump and certain death. If Rump dies, Who is going to pay for your Netflix sub?\nHow are you going to pay for your lifetime of student loans or over inflated medical bills? Where will you get the money for another dumb physics game? YOU BETTER SAVE THE MAN OR YOU DON’T GET THE MONEY ! It is your American duty to protect, serve, and live by the mighty dollar, because money is the only true sign of someone’s worth. Rock hard body destruction – Not only can you bounce bullets off of your body but you can destroy structures with just flinging yourself into them Over 50 Assassination Attempts! – You need to overcome 50 challenging assassination attempts from a unworldly threat. Hot Pursuit",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/mr-president-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/mr-president-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "1 Ghz or faster processor",
        "Memory": "512 MB RAM",
        "Graphics": "1GB VRAM",
        "DirectX": "Version 9.0",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Game Developer X",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "HI2U/RLD",
        "Version": "Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pva2suyff2xp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/mr-president-preinstalled-steamrip.jpg"
}