{
    "page_url": "https://steamrip.com/mr-suns-hatbox-free-download-u1/",
    "title": "Mr. Sun’s Hatbox Directly Download",
    "description": "The dastardly Mr Moon and his troublemakers have stolen Mr Sun’s hatbox delivery from a humble courier company. With the fate of an aspiring apparel business at stake, it’s up to you to build a team, stage a series of heists, and get it back. Starting out as a solo delivery squad , you’ll need to build up an organization of reformed hat thieves and work together as a team or against each other to beat the odds. Whether you’re sending your unit out on covert or chaotic missions, you’ll make use of a closetful of stylish headgear and an assortment of weapons to track down and return the stolen package to its rightful owner.\nCapture or Frag Eliminate or extricate Mr Moon’s minions . Have them pay the price for their thieving crimes or recruit them for your next mission. Prep for the Heist Take on a series of specialist missions from wave-based action to espionage before attempting a tricky Hat Heist, collecting crowns to unlock perks for your crew and moving onto the next phase of your operation. The more hands, the safer the delivery Play solo or work together cooperatively to take on each mission in Couch Co-op (Controllers Required) or Steam Remote Play Together\nStand and deliver in head to head battles Bring your swords , machine guns, and stale baguettes to the battlefield in 1v1 or Last Hat Standing PVP. (Controllers required for local play) A hat for all seasons Dynamite Head Bands, Cardboard Boxes, Noise Cancelling Earphones and Jet Packs! There’s a style to suit every situation. Rooms to suit a certain mood Build up a base of operations with a Brig to brainwash captives, a Lab to experiment on your staff, and a Black Market to purchase illicit contraband. Beyond the Long Night\nCurious Quirks Every character is different, making them individually suited (or unsuitable) for your mission, from a Butter Fingers with near-sightedness to an Animal Trainer with quick reflexes. Make sure you’re allocating your resources appropriately. Retro style with known quality A distinct and vibrant pixel art style from Mr Kenny Sun, creator of Circa Infinity and Yankai’s Peak.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/mr-suns-hatbox-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/mr-suns-hatbox-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "1 GHz",
        "Memory": "1024 MB RAM",
        "Graphics": "256MB",
        "DirectX": "Version 12",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Kenny Sun",
        "Platform": "PC",
        "Game Size": "212 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v2gnqemvozs1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/mr-suns-hatbox-preinstalled-steamrip.jpg"
}