{
    "page_url": "https://steamrip.com/mutilate-a-doll-2-free-download-1o/",
    "title": "Mutilate-a-Doll 2",
    "description": "MaD2 is a highly customizable virtual stressball and physics sandbox about mutilating ragdolls in various ways using an overwhelming amount of weapons and tools. Use hundreds of weapons to mutilate disposable ragdolls designed for weapons testing. Alaskan Road Truckers\nDestroy Swing sharp melee weapons, shoot firearms, or detonate explosives to dynamically destroy items, and of course dolls.\nBuild\nHello, I wanted to give everyone a fair heads up on some of the technical details for the game for transparency . The game itself is pretty great in my biased opinion, and has provided some dedicated players hundreds of hours of gameplay, but there are some technical things I for one would want to know when buying a game MaD2 is an established web game being released here packaged with Adobe AIR due to web Flash end-of-life. The resolution is a bit weird 1066×600 (16:9) due to being developed on the web. It can be upscaled and fullscreened at the cost of performance. The game is locked to 60fps. It should be reachable with a decent system in a reasonable ragdoll-mutilating scenario, but since it is a sandbox game it is very possible to tank the fps by doing crazy sandbox stuff.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/mutilate-a-doll-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/mutilate-a-doll-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2GHz",
        "Memory": "1 GB RAM",
        "Graphics": "Yes",
        "Storage": "40 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Rava Games",
        "Platform": "PC",
        "Game Size": "60 MB",
        "Released By": "cs.rin.ru",
        "Version": "Build 11589912 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jm6gc66o37v9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/mutilate-a-doll-2-preinstalled-steamrip.jpg"
}