{
    "page_url": "https://steamrip.com/mx-bikes-free-download-2s/",
    "title": "MX Bikes Download Direct Link",
    "description": "MX Bikes- a realistic game in the genre of motocross simulator , which is based on a physics engine, which means that you will become a full-fledged part of the world. Here you will saddle your iron horse and try to become a true professional of what you love. Due to the engine worked out from scratch, you will have the opportunity to ride a motorcycle that completely repeats the movements of the real one, also changing the parameters in the settings as you like.\nYou will have the opportunity to take part in insane, dynamic and exciting resistances, where real players from all over the world will become your opponents. Develop your talents and unique abilities, leaving behind everyone who dares to become an obstacle on the way to victory. The danger will be not only another player, but also the conditions on the tracks, as well as the weather, which is as changeable and unpredictable as possible. Also, the player has the opportunity to modify his bike, changing the color and complementing it with all sorts of useful details. The world of the game is realistic and you can conquer it by becoming a real professional racer.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/mx-bikes-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/mx-bikes-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "Operating system": "Windows 7, 8, 10 (64bit)",
        "Processor": "2 Ghz",
        "RAM": "4GB",
        "Video card": "512MB video",
        "memory Hard Disk Memory": "2GB"
    },
    "game_info": {
        "Genre": "Racing, Simulation, Sports games, Early access",
        "Developer": "PiBoSo",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "Goldberg emu",
        "Version": "Build 16359763 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2btcm48jjdmf",
        "https://buzzheavier.com/uuop0hkj03yx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/mx-bikes-free-download-torrent-steamrip.jpg"
}