{
    "page_url": "https://steamrip.com/my-dream-setup-free-download-1p/",
    "title": "My Dream Setup",
    "description": "Do you want to create your dream setup? In My Dream Setup, you can create any setup you want. Any color combination, any budget and any purpose. You are free to create whatever you want. My Dream Setup is a simulation game about building the room you’ve always dreamed of.\nA huge selection of furniture, computers and their accessories, posters, pictures, plants, and other interior details await you. Try all of them and create your dream setup. Arrange the furniture the way you want.\nNo placing by the grid complete freedom of action. If you don’t like where you put a piece of furniture , just move it at any time. No limits on the amount of furniture in the room. Make a small neat office or a huge studio with a bunch of computers , monitors and other things it’s all up to you. Change the color of the furniture. All colors of the RGB palette are available to you.\nEach piece of furniture is customizable separately. This allows you to create all kinds of color combinations. You can paint almost anything: doors, windows, furniture and background color. Try combining different colors and shades to get the best looking room. Knights of Braveland",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/my-dream-setup-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/my-dream-setup-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8,10 or 11",
        "Processor": "Dual Core 2.5 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 560 Ti",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Campfire Studio",
        "Platform": "PC",
        "Game Size": "956 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 18776378 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/M0XLkJ",
        "https://megadb.net/8lzmklsvvv15"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/my-dream-setup-preinstalled-steamrip.jpg"
}