{
    "page_url": "https://steamrip.com/my-friendly-neighborhood-free-download-1x/",
    "title": "My Friendly Neighborhood Directly Download",
    "description": "Something is amiss with everyone’s favorite Saturday morning puppet show For years, the colorful cast of The Friendly Neighborhood delighted audiences across the globe with their cooky capers and educational adventures. However, as time went on and interest waned, the production studio found themselves out of money and closed their doors for good. Ember Knights\nToy sales would dwindle , and birthday balloons and cakes would find new mascots. In time, the once household names would fade into increasingly niche fandoms. Until one night years later, the studio unexpectedly clicks back to life and starts broadcasting The Friendly Neighborhood . TV sets across the globe flicker for a moment before the familiar puppets return for a surprise encore! But this isn’t your typical family-friendly holiday special are those puppets eating each other\nThinking the antenna on top of the main building has started broadcasting old episodes, the city sends Handyman Gordon to straighten things out. It doesn’t take Gordon long to find that the typically friendly neighborhood has become a lot less welcoming. Stepping into his work boots, you’ll have to fend off ferocious friends, solve a plethora of playtime puzzles turned perilous, and hopefully uncover the dastardly truth at the heart of this terrifying tale.\nIf you’re tired of games that rely on gore more than solid scares, then come on over to the streets of MFN Featuring a mix of action and adventure, MFN is the perfect game for horror fans looking for something a bit different. Sure, there might not be any dismemberment or decapitations . But that just means the puppets don’t stay down for good",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/my-friendly-neighborhood-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/my-friendly-neighborhood-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit or later",
        "Processor": "Quad Core 2.5 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 470 / AMD Radeon 6870 HD",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "John Szymanski, Evan Szymanski",
        "Platform": "PC",
        "Game Size": "7.1 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/m718ua2fc867",
        "https://megadb.net/revfz329p0s0",
        "https://datanodes.to/l22tb5086c7k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/my-friendly-neighborhood-preinstalled-steamrip.jpg"
}