{
    "page_url": "https://steamrip.com/my-hero-ones-justice-2-free-download-1/",
    "title": "MY HERO ONE’S JUSTICE 2",
    "description": "Get MY HERO ONE’S JUSTICE 2 PC game for free instantly and play pre-installed on SteamRiP\nMy Hero One’s Justice 2 is the sequel to the series, a 3D fighting game based on the story of a famous anime. New and old heroes, even more special effects and spectacular battles, and much, much more are waiting for you Special customization item set for Izuku Midoriya The special customization item set for Izuku Midoriya bonus may be released at a later date. To receive the bonus for purchasing the previous game, you must have save data from MY HERO ONE’S JUSTICE. BLACK CLOVER: QUARTET KNIGHTS\nMY HERO ONE’S JUSTICE 2, the over-the-top follow-up to the smash hit 3D arena fighter MY HERO ONE’S JUSTICE, makes its heroic debut! Make full use of characters’ Quirks as you clash head-to-head in epic battles across huge arenas . Plus, My Hero One’s Justice 2 has several game modes, each with a unique playthrough. So, there is a single-player story campaign in which you will have the opportunity to learn more about the characters in the game, see a huge number of screensavers with dialogues, and more. And there is a classic arcade mode in which you will learn new attacks, unlock new items, and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/my-hero-ones-justice-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/my-hero-ones-justice-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "WINDOWS 7, 64 bit",
        "Processor": "Intel Core i5-750 / AMD Phenom II X4 940",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 460 / AMD Radeon HD 6870",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "BYKING",
        "Platform": "PC",
        "Game Size": "10.6 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 8579560 | Full version + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6zas4i77e1ee"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/my-hero-ones-justice-2-free-download-preinstalled-steamrip.jpg"
}