{
    "page_url": "https://steamrip.com/my-little-blacksmith-shop-free-download-1h/",
    "title": "My Little Blacksmith Shop Download Direct Link",
    "description": "My Little Blacksmith Shop is a sandbox blacksmith simulation game where you are tasked with creating weapons for your customers. Mine for ore and refine the ore into ingots. Fashion these ingots into Blades, Blunts, Axes or shield components like hand enarmes, shields bosses, rims and combine them with a variation of grips, guards and shield boards to complete your creations.\nLevel up your character and spend skill points to increase your efficiency . Finally, take a break and visit the local cave or explore the nearby town . We usually meet blacksmiths only in role-playing projects, and even then, they are represented only by ordinary weapons sellers. But haven’t you ever wanted to try yourself in the role of such a salesman and understand where all those sharp swords, heavy two-handed sledgehammers , axes and spears really come from? In My Little Blacksmith Shop you will become a real blacksmith.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/my-little-blacksmith-shop-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/my-little-blacksmith-shop-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 10",
        "Processor": "Quad Core Intel or AMD , 2.5ghz or higher",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia Geforce 470 GTX or AMD Radeon 6870 HD Series or higher",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Dasius, Noble Games Studio",
        "Platform": "PC",
        "Game Size": "546 MB",
        "Repack By": "GOG",
        "Version": "v0.1.2.035 – Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ky9gltv07qz2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/my-little-blacksmith-shop-free-download-preinstalled-steamrip.jpg"
}