{
    "page_url": "https://steamrip.com/my-little-pony-a-maretime-bay-adventure-free-download-n1/",
    "title": "MLP A Maretime Bay Adventure Directly Download",
    "description": "Bring magic back to Equestria and play with the new generation of MY LITTLE PONY characters, in an adventure full of fun, fashion and good friends Earth Pony Sunny wants to make the world a better place by hosting Maretime Bay Day, a forgotten celebration of friendship and magic. Kao the Kangaroo\nBut some pony is out to spoil the celebration and they’re stealing cakes, letting bunnies loose, and even spoiling Pipp’s paintings Only you can help Sunny throw the most magical celebration Equestria has ever seen.\nUse your magic to put on fashion shows, find the cutest animals, fly with the Pegasi and more. Customize your ponies by unlocking new skills and accessories , including new hats and jewelry, rollerblades, and fashion magic. Your friends Hitch, Izzy, Zipp and Pipp are here to lend a helping hoof every step of the way.\nAnd you can invite another player for multiplayer minigames The ponies need you to make Maretime Bay Day unforgettable – can you find the mysterious party pooper and bring back the magic?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/my-little-pony-a-maretime-bay-adventure-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/my-little-pony-a-maretime-bay-adventure-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5 4460",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 770",
        "DirectX": "Version 10",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Melbot Studios",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "FLT",
        "Version": "v1.0.1_003 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4hsno8gulcre"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/my-little-pony-a-maretime-bay-adventure-preinstalled-steamrip.jpg"
}