{
    "page_url": "https://steamrip.com/my-time-at-sandrock-free-download-j1/",
    "title": "My Time at Sandrock Download Direct Link",
    "description": "My Time at Sandrock-Just like My Time at Portia, takes place in a wholesome post-apocalyptic world around 300 years after the Day of Calamity . You’ll take a job offer in the city-state of Sandrock, assume the role of a fledgling Builder being sent to a wild and rugged townscape. It’s up to you and your trusty toolset to gather resources, build machines, and fix up your workshop into a well-oiled production machine, and save the town from the jaws of economic ruin, as well as a few other unexpected complications .\nYou’ll have an intricate set of machines that all work together to produce parts of huge structures for the town that you assemble piece by piece, or head to your worktable to craft hundreds of unique items that can help out individual townspeople or be placed throughout your own homestead. You’ll explore the vast deserts surrounding Sandrock, diving into ruins to find ancient relics from the Old World, facing the dangers of dungeons and their denizens, then return to your homestead with encumbering bags of treasure in tow.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/my-time-at-sandrock-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/my-time-at-sandrock-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10",
        "Processor": "Intel Core i3-2100 | AMD FX-6300",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX760 | AMD Radeon 7950",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG, Simulation",
        "Developer": "Pathea Games",
        "Platform": "PC",
        "Game Size": "13.6 GB",
        "Released By": "RUNE",
        "Version": "v4.1.0.102997 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/m9C9Nq",
        "https://megadb.net/8ao8v971s3f4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/my-time-at-sandrock-free-download-preinstalled-steamrip.jpg"
}