{
    "page_url": "https://steamrip.com/myriad-death-free-download/",
    "title": "MYRIAD DEATH",
    "description": "Dive into the pixelated, high-difficulty action of Raspberry Mash, a fan-made roguelike where you embody Mori Calliope from Hololive English -Myth-. Embark on a quest with Death-sensei to reclaim the stolen underworld, battling waves of enemies with randomly acquired weapons. Explore treacherous dungeons, adapting your combat style to the loot you find. Choose between aggressive melee attacks or strategic long-range engagements, tailoring your approach to the challenges ahead. Master the dodge roll, conquer formidable bosses, and strive to unlock the game’s true ending. This game is developed by CCMC Inc. and is a participant in the “holo Indie” game brand. Spilled!\nRaspberry Mash is a product of collaboration, created under the “holo Indie” initiative, which supports Hololive Production fan-made games. CCMC Corp., under the guidance of Cover Corp., handles the game’s publishing and distribution, ensuring compliance with derivative work guidelines. This project is a testament to the passionate Hololive community, providing a platform for creators to express their love for the characters. Please remember that the monetization of Hololive content outside of the “holo Indie” program is not allowed. Immerse yourself in this unique roguelike adventure, built by fans, for fans.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/myriad-death-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/myriad-death-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Dual Core 3.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "1GB VRAM",
        "DirectX": "Version 11",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "IGNITION M",
        "Platform": "PC",
        "Game Size": "217 MB",
        "Released By": "Mr_Goldberg",
        "Version": "v1.0.2 (Build 17862486)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h51z8r1x5kic"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/myriad-death-preinstalled-steamrip.jpg"
}