{
    "page_url": "https://steamrip.com/nadir-a-grimdark-deckbuilder-free-download-h1/",
    "title": "Nadir: A Grimdark Deckbuilder",
    "description": "Nadir is a dark deck building rogue-like adventure , with its artwork burning of infernal fire and many extraordinary inspirations, the deepest of them coming straight from Dante’s Divine Comedy. The illegitimate child of Slay the Spire and Darkest Dungeon awaits you Command an avatar of one of the Deadly Sins in 1v1 fights against powerful demons .\nEngage in card battles where each of your cards can be played in two ways, depending on its color: blue or red. Balance between them to your advantage, but be careful, as your every action charges the abilities of the enemy.\nCollect red and blue abilities on your journey and combine them into unique double cards, shaping the deck in your own way to prepare for upcoming challenges and survive as long as possible. Gather resources during expeditions to expand the city of Nadir and unlock new characters, cards, and vendors. Develop your underworld kingdom and increase your chances in future fights until you can beat the boss and unlock new Sins.\nEach of the Sins brings their own set of enemies that greatly alter your gamestyle. Learning it and developing a strategy to beat it is the key to building a powerful deck and surviving each fight. Watch your back as you descend to the depths of Hell. It might feel familiar from the wonders of the Divine Comedy, to the desaturated aesthetics of Sin City, and the unforgettable design of Hellboy – yet always twisted.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/nadir-a-grimdark-deckbuilder-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/nadir-a-grimdark-deckbuilder-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8, 10 Sp. 64-bit",
        "Processor": "Intel Core i3-3210, AMD Athlon X4 640",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 530 / Radeon HD 4850",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Black Eye Games, Team Nadir",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE emu",
        "Version": "v5901 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ofmkjq2b2qmh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/nadir-a-grimdark-deckbuilder-preinstalled-steamrip.jpg"
}