{
    "page_url": "https://steamrip.com/naruto-x-boruto-ultimate-ninja-storm-connections-free-download-l3/",
    "title": "NARUTO X BORUTO Ultimate Ninja STORM CONNECTIONS Download",
    "description": "Legendary ninjas reunite in the next exciting entry of the STORM series! NARUTO X BORUTO Ultimate Ninja STORM CONNECTIONS is an action/ fighting game with fast-paced ninja battles and two different story modes.\nSelect from more than 130 playable characters to fight in powerful ninja battles In addition to an improved network battle experience, the new Simple mode option allows players to more easily perform various ninjutsu combos. Whether players are beginners or experts , everyone can enjoy heated battles with their favorite ninjas.\nCombining original scenes from the Naruto anime with the high-quality battle experience expected of the STORM series development team, this game contains highlights from the beginning of Naruto’s story up to the final battle of the series. Relive the paths of two legendary ninjas Anvil Saga\nPlay a new, original story where Boruto Uzumaki, the son of 7th Hokage and ninja of the new era, is drawn into a great battle involving the entire ninja world after meeting a girl in a popular online game.\nDuring their adventure, players can acquire cosmetic customization items as battle rewards that make the NARUTO X BORUTO Ultimate Ninja STORM CONNECTIONS experience their own.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/naruto-x-boruto-ultimate-ninja-storm-connections-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/naruto-x-boruto-ultimate-ninja-storm-connections-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-8700 / AMD Ryzen 7 2700X",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660 Ti / Radeon R9 270X / Intel Arc A380",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "30.36 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "CyberConnect2 Co., Ltd.",
        "Platform": "PC",
        "Game Size": "28 GB",
        "Released By": "RUNE emu",
        "Version": "v1.50 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/5F8337E3EF",
        "https://1fichier.com/?go6qhpjppslqst3gsfwl",
        "https://buzzheavier.com/sdclm8hksul2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/naruto-x-boruto-ultimate-ninja-storm-connections-preinstalled-steamrip.jpg"
}