{
    "page_url": "https://steamrip.com/nba-2k23-free-download-k2/",
    "title": "NBA 2K23",
    "description": "Rise to the occasion and realize your full potential in NBA 2K23. Prove yourself against the best players in the world and showcase your talent in MyCAREER. Pair today’s All-Stars with timeless legends in MyTEAM. Build a dynasty of your own in MyGM or take the NBA in a new direction with MyLEAGUE. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay . How will you Answer the Call? Feel refined gameplay in the palm of your hands on both sides of the ball in NBA 2K23.\nAttack the basket with a new arsenal of offensive skill-based moves, while you unleash your potential as a lockdown defender with new 1-on-1 mechanics to stifle opposing players at every turn. Embark on a swashbuckling basketball journey aboard a spacious cruiseliner equipped with pristine courts, scenic views, and a boatload of rewards for you and your MyPLAYER to enjoy.\nPlus, there’s even more to explore during shore excursions . Step back in time with era-specific visuals that captured Michael Jordan’s ascent from collegiate sensation to global icon with immersive Jordan Challenges chronicling his career-defining dominance. Lace up his shoes to recreate his otherworldly stat lines and iconic last shots, while listening to first-hand accounts from those who witnessed his maturation from budding star to basketball legend.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/nba-2k23-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/nba-2k23-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit, Windows 8.1 64-bit or Windows 10 64-bit",
        "Processor": "Intel® Core™ i3-2100 @ 3.10 GHz/ AMD FX-4100 @ 3.60 GHz or better",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GT 450 1GB/ ATI® Radeon™ HD 7770 1 GB or better",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "110 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Sports",
        "Developer": "Visual Concepts",
        "Platform": "PC",
        "Game Size": "110 GB",
        "Released By": "Mr_GOLDBERG/Elamigos",
        "Version": "Build 10159500 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/873A3DC13B",
        "https://buzzheavier.com/u87xysolly06",
        "https://1fichier.com/?h2e4fijjgccm8rc7e64d"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/nba-2k23-preinstalled-steamrip.jpg"
}