{
    "page_url": "https://steamrip.com/necesse-free-download-1q/",
    "title": "Necesse Directly Download",
    "description": "Begin your adventure and explore the infinite procedurally generated world of Necesse. Mine, fight, craft, and gear up to conquer powerful enemies that drop unique items. Establish a settlement, travel to other islands with unique biomes, monsters, loot, and recruit settlers on your way. GRUNND\nYou can play solo or fight monsters and bosses together with friends from the beginning until the end. Choose your weapon and gear to fight, change it up at any time, or mix and match to find the best setup for the situation.\nRecruit settlers, care for them and have them work on your farms, animals, and workstations. Trade with them and defend their homes from raiders. Make a storage system, cooking stations, and alchemy table to supply your next adventure and encounter.\nGo into the unique cave systems, mine valuable ores, and find treasure to craft better armor, weapons, and trinkets. Grow your farm with different crops and animals , build your settlements to support you, and watch your town grow.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/necesse-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/necesse-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP or newer",
        "Processor": "2.5 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "512MB Video memory, capable of OpenGL 2.0 or above and framebuffer extension",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Early Access",
        "Developer": "Mads Skovgaard",
        "Platform": "PC",
        "Game Size": "374 MB",
        "Released By": "N/A",
        "Version": "v0.32.0 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5qylvuemykb7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/necesse-preinstalled-steamrip.jpg"
}