{
    "page_url": "https://steamrip.com/necrobouncer-free-download-1h/",
    "title": "NecroBouncer",
    "description": "Grab your magic staff and step into the shoes of a necromancer working as a bouncer at a nightclub. Selflessly crawl the dungeon club and face scores of inebriated monstrosities ready to welcome you back after your holiday break. It’s time to get to work Rip through the crowd and bust up some bosses. Consume powers hidden in gemstones to improve and upgrade your bouncing skills. Stir them together in various ways and discover powerful new mixes to demolish the drunks of the dungeon. Choo-Choo Charles\nCustomize each NecroBouncer run with Twitch integration. Vote for artifacts, additional mana and health potion spawns, or even appear in the game as one of its wasted enemies. Choose a side and keep the good vibes alive Return stronger, angrier, and more heavily armed after each defeat . Experiment with outfits (each with its own unique perks) devise clever strategies, upgrade powers and swirl them all together with hundreds of artifacts. Concoct the perfect cocktail of success",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/necrobouncer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/necrobouncer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7",
        "Processor": "2.8 GHz Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 650, Radeon R7 370 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Alchemy Sheep",
        "Platform": "PC",
        "Game Size": "134 MB",
        "Released By": "GOG",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4s0bz5nkss0q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/necrobouncer-preinstalled-steamrip.jpg"
}