{
    "page_url": "https://steamrip.com/need-for-speed-underground-2-free-download-a2/",
    "title": "Need for Speed Underground 2 Free Download",
    "description": "Need for Speed: Underground 2 (NFSU2) is a cross-platform racing video game published and developed by Electronic Arts . Released in 2004, it is the direct sequel to Need for Speed: Underground, and is part of the Like its predecessor, it was also commercially successful, and sold nine million copies worldwide. The game is based around tuning cars for street races, resuming the Need for Speed: Underground storyline. VR\nNeed for Speed: Underground 2 provides several new features, such as a broader customization , Need for Speed Underground 2 Download Free PC Games Repack-Games.com Underground 2 also introduces several SUVs, which could be customized as extensively as other Underground 2 vehicles and used to race against other SUV racers . Brooke Burke is the voice of Rachel Teller, the person who guides the player through the story. Explore a massive city divided into five distinct, interconnected neighborhoods, ranging from serpentine suburban hills to an intense downtown grid. A complex series of drivable freeways connect the neighborhoods together.",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows XP",
        "Processor": "2.0+ GHz",
        "Memory": "512 MB RAM",
        "Graphics": "OpenGL 2.0 support",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Racing, Sports",
        "Developer": "EA Blackbox",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Repack By": "DODI Repacks",
        "Version": "v1.2 | Full  + Widescreen Fix + Winter Mod",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6doau88zb1yg",
        "https://buzzheavier.com/lim65xby4dqu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/need-for-speed-underground-2-free-download-preinstalled-steamrip.jpg"
}