{
    "page_url": "https://steamrip.com/need-for-speed-porsche-unleashed-free-download-1x/",
    "title": "NFS Porsche Unleashed 2000",
    "description": "NFS Porsche Unleashed appeared in March 2000. It was the most unusual game in the series completely dedicated to the brainchild of Ferdinand Porsche. The legendary brand of cars has just thundered its 50th anniversary. And for the Need For Speed ​​series, it was the fifth game in a row. In the Evolution mode, players were asked to ride dozens of models from different eras. Need for Speed: Shift\nFrom the first 356s to the latest Porsche sports cars. Cars had to be bought, upgraded and repaired. Passing from one era to another. The game introduced the Factory Driver mode, where the player was given the role of a factory driver. Short timed races in special areas, testing the latest models in critical modes and racing with your colleagues through busy streets.\nThe tracks are no longer purely circular , and the graphics caused a storm of applause. Musical compositions remained within the techno style. The authors also made several video clips about the history of Porsche. Speaking about the video, one cannot but recall those PR campaigns that Electronic Arts launched in Europe together with the distributors of the new blockbuster “Gone in 60 Seconds” with Nicolas Cage and Angelina Jolie in the lead roles. A special promo trailer for the film was released containing footage from the game and prizes to be won by Porsches.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/need-for-speed-porsche-unleashed-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/need-for-speed-porsche-unleashed-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "Processor": "Intel Pentium 233 MHz",
        "RAM": "64 MB",
        "Video card": "8 MB DirectX 7 compatible",
        "Sound card": "DirectX compatible",
        "Hard disk": "500 MB free space"
    },
    "game_info": {
        "Genre": "Racing, Sports",
        "Developer": "EA Canada",
        "Platform": "PC",
        "Game Size": "467 MB",
        "Repack By": "RA1n",
        "Version": "v3.5",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/oask1xvmqyhg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/need-for-speed-porsche-unleashed-preinstalled-steamrip.jpg"
}