{
    "page_url": "https://steamrip.com/neon-echo-free-download-v1/",
    "title": "Neon Echo",
    "description": "The world has been tainted by a corrupting force of “noise”. Those who are exposed to it might become manic, restless, and even transform into monsters. At the same time, people have discovered that electronic music can resist this transformation and restore people’s sanity. Now, a group of exceptional teenagers will embark on a journey to vanquish the noise and restore peace by utilizing the power of electronic music. The Early Access version contains three careers Tachi Warrior , Gunner, and Boxer. Mr. Sun’s Hatbox\nEach of them has different talents and skills and possesses both “Common” and “Neon” forms, creating different combat experience. Apart from the 7 factions of Builds in the game, we have “ Rhapsody ” for attack and skill form transformation, a more flexible in-game Build system called “Rhythm Launchpad”, and a challenging gameplay mode named “ Schrodinger’s Noise” that involves both attribute boosts and debuffs. By mixing these various Build systems, players can enjoy exciting linking reactions and expeirence unique battles .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/neon-echo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/neon-echo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 x64",
        "Processor": "Intel Core i3-6100",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750ti",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Early Access",
        "Developer": "Xinyuan Studio",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11061401 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hzxp54lqv6qp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/neon-echo-preintalled-steamrip.jpg"
}