{
    "page_url": "https://steamrip.com/neon-abyss-2-free-download/",
    "title": "Neon Abyss 2",
    "description": "Dive deeper into the chaotic , beautifully pixelated Abyss with Neon Abyss 2 The action is faster, the stakes are higher, and the possibilities are endless in this cybermyth roguelike. With explosive run ‘n’ gun gameplay, diverse combat styles, and unlimited item synergies, Neon Abyss 2 delivers a dramatic , thrill-packed experience every time you enter. Ratten Reich\nNeon Abyss 2 introduces exhilarating online 4-player co-op, allowing you and up to three friends to dive into the roguelike chaos together. Band together to multiply each of your unique synergies and combos, creating powerful forces of destruction. Coordinate your builds and conquer the Abyss as a team, even exploring different rooms within the same map to maximize efficiency and uncover hidden secrets and treasures.\nWhat’s your combat style? Smash enemies up close with a bat or saber, unleash attacks with deadly plants, or command fierce dragon-like creatures to fight for you—the choice is yours! With limitless options and imaginative weapons, every run lets you experiment with unique, wild ways to conquer the Abyss.\nRandom item drops in the Abyss grant you powers that combine in surprising and powerful ways. Stack as many as you can to create wild, unstoppable synergies that make every run feel unique. Show the Abyss who’s really in charge—there’s no limit to how many items you can wield!\nYour favourite Abyss companions, now in even brighter colours! Hatch and collect these cute creatures, then evolve them into powerful and unique allies to spice up your runs. With a variety of Hatchmon to discover, each run brings new possibilities!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/07/neon-abyss-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/07/neon-abyss-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 950, Radeon R7 360, or Intel HD  630",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Early Access",
        "Developer": "Veewo Games",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "RUNE emu",
        "Version": "Build 19242302 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/1JeSov",
        "https://megadb.net/yupci4387alk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/neon-abyss-2-preinstalled-steamrip.jpg"
}