{
    "page_url": "https://steamrip.com/neptunia-x-senran-kagura-ninja-wars-free-download-1u/",
    "title": "Neptunia x SENRAN KAGURA Ninja Wars",
    "description": "Neptunia and SENRAN KAGURA join forces in this hack ‘n slash RPG Pair up 10 playable characters to slice through enemy hordes, channel the elements, and perform special character attacks. Then find your center with the Peaches & Cream Meditation minigame before taking on the post-game challenges of Yomi-Training The two warring nations from the Neptunia and SENRAN KAGURA series have now joined forces in one action-packed RPG Assassin’s Creed Syndicate\nChoose from 10 possible characters, including two new characters: Yuuki and Goh, and pick two characters to set forth on your adventure. Swiftly switch between your two chosen characters in battle This version also includes a new difficulty setting option Each character possess a unique set of skills, known as Ninja Art Skills. Chain your Ninja Art Skills to leave your enemies in the dust.\nNinjas and shinobi are also equipped with projectiles that can inflict physical damage or temporary status ailments to slow down foes. Collect Spirit Gems for helpful stat boost Legend says arranging them in certain combinations can add even bigger boosts. Find your center with the Peaches & Cream Meditation mini-game to get extra stat boosts in battle. Plus, test your might with the post-game content, Yomi-Training! Expert ninjas and shinobi can play through 8 different trials, each set with difficult restrictions",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/neptunia-x-senran-kagura-ninja-wars-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/neptunia-x-senran-kagura-ninja-wars-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 (64-bit)",
        "Processor": "Intel i5 2.3GHz or AMD A9 2.9GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Dedicated GPU with 2GB of VRAM",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "Idea Factory, Compile Heart, Tamsoft",
        "Platform": "PC",
        "Game Size": "5.8 GB",
        "Released By": "DARKSiDERS",
        "Version": "v1.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/85gjdkkqt595"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/neptunia-x-senran-kagura-ninja-wars-preinstalled-steamrip.jpg"
}