{
    "page_url": "https://steamrip.com/nerf-legends-free-download-1t/",
    "title": "Nerf Legends",
    "description": "Get Nerf Legends PC game for free instantly and play pre-installed on SteamRiP\nNERF Legends thrusts you into a futuristic, sci-fi world where you’ll come face-to-face with legions of robot enemies and ultimate boss masters. Armed with a wide array of NERF blasters based on their iconic, real-world counterparts, you’ll thwart formidable enemies while being challenged to pull off the most impressive high-flying trick shots across a series of unique and immersive environments.\nAre your NERF skills up to the challenge to become the ultimate NERF Legend? Set in out-of-this-world locations such as Fortress Siege, Jungle Trouble, Ragnarok Showdown, and Spaceport Blastoff 15 Authentic NERF basters across the Mega, Ultra and Elite lines Plus upgradable perks & skins to customize your blaster Collect dart powerups such as magnetic push, magnetic pull, seeker darts, and slow to change the tide of battles Enter the gauntlet and go face-to-face against a wide variety of blaster-wielding robots and Nerf Masters",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/nerf-legends-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/nerf-legends-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows",
        "Processor": "Core i5 3 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy, Early Access",
        "Developer": "FUN labs Romania S.R.L.",
        "Platform": "PC",
        "Game Size": "7.18 GB",
        "Repack By": "FLT",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/my03y1lprqav"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/nerf-legends-free-download-preinstalled-steamrip.jpg"
}