{
    "page_url": "https://steamrip.com/new-cycle-free-download-n1/",
    "title": "New Cycle",
    "description": "New Cycle is a city building game with focus on survival . After an apocalyptic series of solar flares, human society has been thrown into disarray. Establish a settlement and develop it all the way from humble beginnings to industrial metropolis. The Universim\nBuild and expand your settlement using free form or grid-based design. Seek, gather and produce new resources to advance your civilization. As you develop it further, you will re-discover the more advanced and complex ways of the past to produce goods on a large scale.\nThis hostile world will challenge you with sand storms, shortages , wildfires and other natural disasters. Be prepared and always ready to act quickly. But nature isn’t the only thing to worry about: Refugee crises, unrest, disease outbreaks – the list of challenges is long. You will have to make crucial decisions, many of them painful, to avert the downfall of your civilization .\nTake care of your people’s basic needs. Distribute food, water, tools and clothes and regulate their daily work schedule. Enrich their life with entertainment, prevent diseases and improve your people’s health by providing medical facilities. With every new member of your community you get closer to re-discovering the forgotten technologies of the old world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/new-cycle-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/new-cycle-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit",
        "Processor": "Intel Core i5-4590 @ 3.3 GHz | AMD FX 8320 @ 3.5 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 960 (3GB VRAM) | AMD Radeon R9 280 (3GB VRAM) or equivalent",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Core Engage",
        "Platform": "PC",
        "Game Size": "4.8 GB",
        "Released By": "Goldberg Emu",
        "Version": "Alpha 24-140.05 (Build 15033761)| Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/F51E74BDB1",
        "https://buzzheavier.com/ydy9ecrj9537",
        "https://datanodes.to/y1kdgrqugx3t/New-Cycle-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/new-cycle-preinstalled-steamrip.jpg"
}