{
    "page_url": "https://steamrip.com/new-star-gp-free-download/",
    "title": "New Star GP",
    "description": "NEW STAR GP is the arcade racing game where every decision counts – on and off the track! You take control of your own motorsport team, guide your team’s technological development, plan your race strategy, take the wheel, and drive to victory! With a simple but deep gameplay experience and appealing retro visuals, NEW STAR GP puts you in the driving seat for every twist and turn as you manage and race your team through decades of racing , from the 1980s all the way to the present day STORY OF SEASONS: Friends of Mineral Town\nCHOOSE YOUR RACE STRATEGY A pick-up-and-play arcade driving experience that has more depth than you think. While anyone can take the wheel and have success, those who want to truly master the game will want to make use of tyre choice and wear, component reliability, slipstreaming opponents, fuel load, and even pit strategy. Anything can happen in races, from catastrophic component failures and dynamic weather changes, to tyre blowouts and multi-car pileups.\nSTART YOUR CAREER IN THE 80s Compete in GPs, Elimination Races, Time Trials, Checkpoint Races, and one-on-one Rival Races. In between events, choose how to upgrade your car, or which staff perks to equip: from sponsored car components to faster pit stops. When you’ve won a season, progress to the next decade of racing and face a new set of opponents and challenges in a brand new car\nRACE ICONIC LOCATIONS AROUND THE WORLD! Race a myriad of events across the decades at some of the most iconic racing locations around the world. Earn rewards for setting personal bests",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/new-star-gp-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/new-star-gp-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5 Quad-Core, 2.7 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 660 / RX 460",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Racing, Sports",
        "Developer": "New Star Games Ltd.",
        "Platform": "PC",
        "Game Size": "590 MB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3cfgup3mhmbt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/new-star-gp-preinstalled-steamrip.jpg"
}