{
    "page_url": "https://steamrip.com/news-tower-free-download/",
    "title": "News Tower",
    "description": "Live the life of an aspiring influential publisher in New York City during the 1930s. Define your editorial line and search the globe for the newsworthy stories of the decade. The Prohibition, the Great Depression, or a lost cat… Not all articles are deserving of a Pulitzer But watch out! The mafia, mayor, and other factions will be more than happy to use your influence in New York City to print their own “truth”. Hazy Mind\nIn News Tower, you will follow some of the key moments of the 1930s, but it will be up to you whether to cover and even influence them. It’s up to your reporters to beat the deadline to get the news while it’s hot. Time is money in News Tower\nUse your reporter’s favorite topics to send them searching for the right news to get it faster, or it might already be old news by the time they return. The more they cover a topic, the more experienced they get, allowing you to sharpen your editorial line. Will you decide to publish gossip to satisfy your readers’ thirst for sensational press, or will you always seek hard stories for the truth?\nA lot of news offers different avenues of investigation , unveiling diverse versions of the story. Send your reporter down a path, but be mindful of the risk and rewards of each: poking your nose around the mafia may lead to “offers” that you can’t refuse\nBuild and optimize your tower to ensure the well-being of your employees while meeting your printing deadlines on Sunday Recruit and manage every profession necessary to ensure your success: reporters, photographers , janitors, without forgetting the essential ads salesperson and lawyers.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/news-tower-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/news-tower-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 64-bit",
        "Processor": "Intel Core i3 6100 or AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "Discrete GPU 1GB VRAM",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Sparrow Night",
        "Platform": "PC",
        "Game Size": "436 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.18.574 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/perx9mhp69ml"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/news-tower-preinstalled-steamrip.jpg"
}