{
    "page_url": "https://steamrip.com/nidhogg-free-download-1p/",
    "title": "Nidhogg",
    "description": "Get Nidhogg for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nNidhogg is the epic award- winning fencing tug-of-war, full of graceful acrobatics and clumsy stabs. IRL yelling and excitement may occur, in this ultimate two-player showdown of fast-paced fencing and melee attacks. Beware, advantages in Nidhogg are often fleeting, as new opponents continually spawn in your way. Use a variety of fencing maneuvers while armed lunges, parries, and even dirty tricks like throwing your sword. If swordless, press forward with punches, sweep kicks, dive kicks , rolls, and wall jumps. HoloBall VR\nThe combat arena stretches in both directions, although besting an opponent only gains you ground. Matches aren’t won or lost with a single kill, but with a series of kills granting you right-of-way to run/fight/flee to your own goal-zone. Each arena holds different strategic formations and chokepoints to use to your advantage. Until you reach your goal-zone, anything is possible. Only one thing is certain in Nidhogg… the only way to win is to outwit your opponent. En Garde",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/nidhogg-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/nidhogg-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows® XP / Vista / 7",
        "Processor": "1.2GHz processor",
        "Memory": "512 MB RAM",
        "Graphics": "DirectX 8-compatible graphics card with at least 32MB of video memory",
        "DirectX": "Version 9.0c",
        "Network": "Broadband Internet connection",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Sports",
        "Developer": "Messhof",
        "Platform": "PC",
        "Game Size": "102 MB",
        "Repack By": "GOG",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pd1qqqipgg2m"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/nidhogg-free-download-preinstalled-steamrip.jpg"
}