{
    "page_url": "https://steamrip.com/night-slashers-remake-free-download/",
    "title": "Night Slashers: Remake",
    "description": "Night Slashers is a pulse-pounding, horror-themed beat ’em up game, in a nightmarish world filled with bloodthirsty creatures and unspeakable horrors. Prepare to step into the shoes of the unlikely heroes, as they battle hordes of supernatural foes and terrifying monsters. Tiny Pasture\nIn Night Slashers, you’re not just fighting for survival : you’re battling to save the world from a supernatural apocalypse. Join the fight, experience the adrenaline, and embrace the horror. Your darkest nightmares await\nNight Slashers, a classic arcade game originally developed by DATA EAST in 1993, still stands as one of the best titles in the beat ’em up genre to this day! Gameplay consists of seven distinct stages, each subdivided into multiple sections. You can advance by navigating from left to right within each stage, combating waves of enemies to progress.\nAttempting to proceed further without eliminating foes halts the screen’s scroll until all the threats are dealt with. Upon reaching the end of each level, a climactic showdown with a formidable boss awaits. Achieve victory over the boss to advance.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/night-slashers-remake-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/night-slashers-remake-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "2.3 GHz dual-core",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 660",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Storm Trident S.A.",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "I_KnoW",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5ex72no2k7z9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/night-slashers-remake-preinstalled-steamrip.jpg"
}