{
    "page_url": "https://steamrip.com/nightingale-free-download-n1/",
    "title": "Nightingale",
    "description": "Nightingale is a PVE open-world survival crafting game played solo or cooperatively with friends. Build, craft, fight and explore as you venture through mystical portals into a variety of amazing and fantastical realms.\nYou are stranded beyond our world, cut off by the collapse of the arcane portal network. This catastrophe has left you fighting to survive in a labyrinth of beautiful and dangerous Fae realms.\nYour goal: become a skilled Realmwalker, and navigate the web of transdimensional portals. Only then can you discover your way to the magical city of Nightingale, the last known bastion of humanity.\nPrepare to make your way through Faewild forests, harrowing swamps, and shimmering deserts as you unlock the portals leading deeper into the lands of Fae. Cook meals, build shelter and muster the spirit to persevere in the face of adversity. Penny’s Big Breakaway\nCraft tools to harvest trees, ore, and plants, along with rarer resources found deep in the realms. Discover new schematics and assemble the equipment and weapons you need to survive. Using specialized ingredients and arcane technologies, you can enhance your gear with magical properties.\nDesign and construct an impressive estate from a variety of styles and tilesets. Upgrade and customize your structures, and form communities to safely live off the land. You can even recruit NPC workers to help harvest resources as you work to expand your property .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/nightingale-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/nightingale-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-Bit (see additional notes)",
        "Processor": "Intel Core i5-4430",
        "Memory": "16 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1060, Radeon RX 580 or Intel Arc A580",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Early Access",
        "Developer": "Inflexion Games",
        "Platform": "PC",
        "Game Size": "46.7 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "Build 21022024 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/pf5yusl93lwr",
        "https://gofile.io/d/bdzAT5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/nightingale-preinstalled-steamrip.jpg"
}