{
    "page_url": "https://steamrip.com/ninja-gaiden-ragebound-free-download/",
    "title": "NINJA GAIDEN: Ragebound",
    "description": "Our story begins when Ryu Hayabusa journeys to America to honor his father’s will. While he is away, the barrier between the human and the demon worlds suddenly shatters, unleashing a terrifying army upon the Hayabusa Village, which now faces an unprecedented threat in Ryu’s absence. Primal Planet\nTo stand against this new threat, Kenji Mozu, a young ninja from the Hayabusa Village, rises to the challenge! Trained by Ryu, he fights fiercely but soon finds himself in desperate straits. Forced to tap into forbidden power, Kenji sets aside centuries of animosity and forms an alliance with the sinister Black Spider Clan, convinced that combining their souls and skills is the only way to protect the world out of the Demon Lord’s grasp!\nCombining old-school feeling with modern precision, NINJA GAIDEN: Ragebound retains the pick-up-and-play action of the classic titles, while introducing new layers of depth.\nAlongside the new protagonist , Kenji Mozu, is the skilled assassin Kumori. Take control of these two powerful ninjas simultaneously and unravel their interconnected stories.\nUse the Ninja Fusion to unleash devastating abilities and obliterate your enemies. NINJA GAIDEN: Ragebound features impeccable mechanics that are easy to learn but hard to truly master, challenging the skills of even the most seasoned fans of the NINJA GAIDEN series!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/07/ninja-gaiden-ragebound-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/07/ninja-gaiden-ragebound-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core Duo E8300 or AMD Phenom II X2 550",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GT 220, 1 GB or AMD Radeon HD 4550, 1GB",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "The Game Kitchen",
        "Platform": "PC",
        "Game Size": "688 MB",
        "Released By": "RUNE emu",
        "Version": "vcs36158 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/I4Ba85",
        "https://megadb.net/0yfwbb3c2rex"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/ninja-gaiden-ragebound-preinstalled-steamrip.jpg"
}