{
    "page_url": "https://steamrip.com/nioh-2-the-complete-edition-free-download-r1/",
    "title": "Nioh 2 – The Complete Edition",
    "description": "Experience the thrill of taking on hordes of fearsome yokai in a battle to the death in this brutal masocore Action RPG. Create your own original protagonist and embark on an adventure that will take you through devastated locales across Japan during the Sengoku period. Much like the previous title which garnered much praise from fans and critics alike, Nioh 2 contains an original profound story surrounding military commanders from the Sengoku period. Mad Tracks\nHowever, Nioh 2 goes above and beyond its predecessor by including the new Yokai Shift ability which allows the protagonist to utilize new powerful forms to defeat even the most formidable yokai in battle. New to Nioh 2, your enemies can now create a Dark Realm which raises the stakes of battle and creates new challenges for your protagonist to overcome. We hope you enjoy conquering fearsome monsters as you unleash your darkness in the world of Nioh 2.\nNioh 2: Complete Edition includes all of the content from Nioh 2 along with all 3 DLC expansions, The Tengu’s Disciple, Darkness in the Capital, and The First Samurai. The Tengu’s Disciple takes the protagonist to the end of the Heian period, where the Genji and Heike clans were competing ruthlessly with one another. Experience the battle that acts as a prologue which reveals how the story of Nioh 2 came to be. Darkness in the Capital takes place during the middle of the Heian period, a point in history where evil spirits and yokai ran rampant throughout Japan. The protagonist is brought back to this period and ventures to the capital where they will uncover the connections between an even more distant past and the present time period from which they came. The First Samurai brings the protagonist to the Suzuka Pass during the beginning of the Heian period. In the climactic 3rd expansion of the Nioh 2 saga, the protagonist will once again confront their arch-nemesis, Otakemaru.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/nioh-2-the-complete-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/nioh-2-the-complete-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit, Windows 8.1 64bit",
        "Processor": "Intel Core i5 4460 or over",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 or over, VRAM 4GB or over",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "85 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "58.3 GB",
        "Released By": "CODEX",
        "Version": "v1.28.06 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/l62v0as1wij8",
        "https://1fichier.com/?k3q0nskl9m8fnqi746qx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/nioh-2-the-complete-edition-preinstalled-steamrip.jpg"
}