{
    "page_url": "https://steamrip.com/no-rest-for-the-wicked-free-download/",
    "title": "No Rest for the Wicked",
    "description": "From Moon Studios, the award-winning developers of Ori and the Blind Forest and Ori and the Will of the Wisps comes No Rest for the Wicked, a visceral, precision Action RPG set to reinvent the genre. The year is 841 – King Harol is dead. As word of his death echoes throughout the kingdom, the crown passes to his arrogant, yet untested son Magnus. SILENT BREATH\nEven worse, the Pestilence, an unholy plague not seen for a thousand years, has returned. It sweeps across the land, corrupting everything and everyone it touches. Madrigal Seline, a ruthlessly ambitious figure in the church, sees the Pestilence as a chance to prove herself in the eyes of her god.\nYou are a Cerim – a member of a group of mystical holy warriors imbued with remarkable powers and sworn to defeat the Pestilence at any cost. But the task will prove increasingly challenging as you become entangled in the people’s plight and the vast political struggle of this downtrodden land. Chaos will pull you in every direction as you seek to cleanse the land of wickedness and shape the kingdom’s fate.\nHone combat skills with a system that challenges you to be deliberate and strategic . Battle against gruesome creatures, enemy soldiers, and punishing bosses in tense, visceral combat. Feel the weight and speed of each weapon through their own move sets. Enchant armaments with runes, craft rare armor, and create bespoke character builds that fit your playstyle.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/no-rest-for-the-wicked-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/no-rest-for-the-wicked-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-8400 / AMD Ryzen 5 2600",
        "Memory": "16 GB RAM",
        "Graphics": "Nvidia GeForce GTX 970 / AMD Radeon RX Vega 56",
        "Storage": "35 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG, Early Access",
        "Developer": "Moon Studios GmbH",
        "Platform": "PC",
        "Game Size": "18.5 GB",
        "Released By": "RUNE emu",
        "Version": "v22472 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/ngarmmo48n1p/No-Rest-for-the-W-SteamRIP.com.rar",
        "https://gofile.io/d/Zb1Aak",
        "https://buzzheavier.com/ftlhuqczy9d4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/no-rest-for-the-wicked-preinstalled-steamrip.jpg"
}