{
    "page_url": "https://steamrip.com/nobody-the-turnaround-free-download-q1/",
    "title": "Nobody – The Turnaround",
    "description": "There is only one heroism in the world: to see the world as it is, and to love it. Romain Rolland\nNobody The Turnaround takes place in a parallel world similar to our current reality. The story unfolds in a modern metropolis, but not the concrete jungle as you know it. It’s more about the undergrowth, the much less glamorous neighborhoods where actual life happens. “You” are one of the ordinary “Nobodies” in this world. You do not have a distinguished family background , elite education, or once-in-a-lifetime business opportunities. However, through hard work and determination, you might eventually get rid of your troubles and make your way in this realistic society .\nWith systematic reconstructions of your possible physical status, such as Health and Emotions, Nobody – The Turnaround aims to accurately represent a person’s working and living situations. You may suffer injuries, get sick or feel down due to various unexpected random events in life. It’s important for you to balance everything and strive. From the initial basic jobs to skilled labor that requires specific training, you can experience all kinds of professions here in Nobody – The Turnaround. You can start by bricklaying , distributing leaflets, or mail delivery. All you need to do is work hard, create your career path, and eventually secure your dream job. Frozen Flame",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/nobody-the-turnaround-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/nobody-the-turnaround-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7",
        "Processor": "i3-530 2.93GHZ 2 Core",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GPU GeForce GTX 750 Ti 2GB",
        "DirectX": "Version 11",
        "Storage": "13 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "U.Ground Game Studio",
        "Platform": "PC",
        "Game Size": "8.1 GB",
        "Released By": "CODEX emu",
        "Version": "Build 9980167 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8s9zy8redld4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/nobody-the-turnaround-preinstalled-steamrip.jpg"
}