{
    "page_url": "https://steamrip.com/nobody-wants-to-die-free-download/",
    "title": "Nobody Wants to Die",
    "description": "Lose yourself in the world of New York, 2329, where immortality comes at a price that someone has to pay. Following a near-death experience, Detective James Karra takes an off-the-books case from his chief with only the help of a young police liaison, Sara Kai, to assist him. Time reveals all as they risk everything in pursuit of a killer, uncovering the dark secrets of the city’s elite. Silent Rain\nExperience a noir adventure in an alternate future of New York City in 2329; technology has advanced to offer humans eternal life, allowing consciousness to be stored in memory banks or transferred from one body to another. That is, if you can afford the subscription.\nSee through the eyes of Mortality Department Detective James Karra on his hunt for a serial killer who targets the city’s elite citizens. Investigate crime scenes using his time manipulation augmentation and advanced technology to reconstruct events leading up to each murder and uncover clues that lead to the horrifying truth behind the murders.\nLose yourself in a dystopian future through this meaningful and original interactive detective story, that explores the dangers of transhumanism and immortality. In a world of eternal life and vanishing morality, you, a hardened detective, must navigate the lines of right and wrong in a society where death is a distant memory.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/nobody-wants-to-die-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/nobody-wants-to-die-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel Core I3-8100 or AMD Ryzen 5 2600X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1660 Super or AMD Radeon RX VEGA 56 or Intel Arc A750",
        "DirectX": "Version 12",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Critical Hit Games",
        "Platform": "PC",
        "Game Size": "24.4 GB",
        "Released By": "RUNE",
        "Version": "v1.0.1.0.46.065 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/MWZ2F5",
        "https://buzzheavier.com/9klhiefgbazi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/nobody-wants-to-die-preinstalled-steamrip.jpg"
}