{
    "page_url": "https://steamrip.com/nomad-survival-free-download-n1/",
    "title": "Nomad Survival",
    "description": "Nomad Survival is an auto-attacking, wave clearing, time-based Roguelite , where you can expect to become stronger as you play through each run as you upgrade your stats. The gameplay involves waves of enemies from all angles coming to defeat you, with each minute changing what types of enemies may be coming and how they behave in a predictable fashion.\nYou control the movement of your Character, automatically using abilities available to you to defeat your foes, acquiring new abilities (or leveling up old ones) whenever you acquire enough experience to level up. You can have as many abilities as you want, with each non-passive ability granting bonus effects at levels 5 and 10 (10 being the max level an ability can be). Each Character boasts a different style of play through Weapon Skills, which is the special innate ability each Character starts with that is exclusive to them and improves over time naturally. Eiyuden Chronicle: Rising\nCharacters can then be given a Heritage , which further changes how the game is played. The Nomad Heritage, for example, offers the player an additional reroll on level up, whereas the Poxbringer Heritage converts all of your damage into damage-over-time instead. While there are only two Maps to be played, each Map is wildly different in more than just the difficulty and density of enemies. Each Map also boasts unique events that complicate the run and keep you on your toes, as well as 4 unique Boss encounters which will require you to adapt your strategy to overcome.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/nomad-survival-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/nomad-survival-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8, Windows 10",
        "Memory": "2 GB RAM",
        "Graphics": "2GB VRAM Graphics Cards",
        "DirectX": "Version 11",
        "Storage": "60 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Early Access",
        "Developer": "The Fox Knocks",
        "Platform": "PC",
        "Game Size": "132 MB",
        "Released By": "N/A",
        "Version": "v1.0b | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mmvquxyfm0i4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/nomad-survival-preinstalled-steamrip.jpg"
}