{
    "page_url": "https://steamrip.com/none-shall-intrude-free-download/",
    "title": "None Shall Intrude",
    "description": "None Shall Intrude invites you to embrace the unparalleled power of a Raid Boss in a unique and immersive gaming experience. Prepare to traverse vibrant realms, engage in intense battles, and conquer all who dare to challenge your dominance. As the embodiment of chaos, your reign will be defined by strategic prowess, unique tile interactions with elemental flavor, boss mechanics you learn as you play.\nCHAOS INCARNATE As the unkillable embodiment of chaos, death means nothing to you as your soul is permanently tied to this land of mortals! With each new life, you gain more power, and each cycle opens up new possibilities to grow stronger.\nCONQUER THE WORLD Forge your journey by selecting different routes from nodes on the map, ultimately conquering full regions.Along the way, you’ll explore a variety of vibrant and imaginative landscapes, each filled with unique obstacles and creatures. Whether it’s dense woodlands, majestic snowy mountains, or boundless desert sands. The world of Herelon is full of diverse location for you to explore and conquer Cyber Manhunt 2: New World\nELEMENTAL COMBOS Navigate the battlefield using a tile-based system, employing various primordial elements and combine them into potent interactions. Discover all 18 possible tile interactions and tailor your build to your preferred style of play, destroying your enemies with style\nTALENTS Level up your boss to unlock many new cards and relics. Accumulate talent points to invest in a talent tree, which can be customized before each run, enabling you to adapt your boss’s play style to suit your preferences.\nBOSS MECHANICS As the Chaos Incarnate, you possess 3 Phases. The road to power means unlocking your latent “Boss Mechanics”. These mechanics work across distinct phases , with 24 unique powers attainable through in-game achievements. Combine up to 4 “Boss Mechanics” to craft your personalized Raid Boss .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/none-shall-intrude-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/none-shall-intrude-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 (SP1+), Windows 10 and Windows 11",
        "Processor": "2.0 Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "1Gb Video Memory",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Aeterna Ludi",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0011 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0e1cm6zyti3w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/none-shall-intrude-preinstalled-steamrip.jpg"
}