{
    "page_url": "https://steamrip.com/norland-free-download/",
    "title": "Norland",
    "description": "The Empire has fallen, leaving in its place multiple successor kingdoms . The lords and ladies of these petty kingdoms squabble for control and influence – whether with cloak and dagger or sword and shield, families feud amongst themselves and against each other as greater threats cast a shadow across the land. SCHiM\nFamines wreak havoc on the lives of the peasantry, warfare and disunity threaten the social order, noble families fall to decadence and hedonism, and beyond the borders of the old Empire, great armies of pillage and destruction form under the banners of invader-kings. In these uncertain times, you must lead your small kingdom to greatness – and the members of your noble family to survival – in this medieval colony sim focussed on generating stories of great valor and vile treachery.\nYour family rules from on high, working together – or against one another – to take charge of your city, your kingdom, and your political ploys. Each family member has their own strengths, weaknesses, and ambitions that drive them as they build complex relationships amongst themselves and with foreign rulers. Witness blooming friendships, drunken escapades, and brutal assassinations as your nobles dole out orders to your peasants, lead armies into battle, and study ancient texts brimming with knowledge.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/norland-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/norland-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy, Early Access",
        "Developer": "Long Jaunt",
        "Platform": "PC",
        "Game Size": "794 MB",
        "Released By": "RUNE",
        "Version": "v0.4509.6988.0 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v3dh6sxhe2ay"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/norland-preinstalled-steamrip.jpg"
}