{
    "page_url": "https://steamrip.com/northgard-free-download-2a/",
    "title": "Northgard Download Direct Link",
    "description": "After years of tireless explorations, brave Vikings have discovered a new land filled with mystery, danger and riches: NORTHGARD. The boldest Northmen have set sail to explore and conquer these new shores, bring fame to their Clan and write history through conquest, trading, or devotion to the Gods. That is, if they can survive the dire Wolves and Undead Warriors roaming the land, befriend or defeat the giants , and survive the harshest winters ever witnessed in the North.\nThe Viking High King is murdered and his Regal Horn is stolen by a man named Hagen. This event kickstarts a saga that will take Rig, his son and heir accompanied by his right-hand man Brand through the new continent of Northgard. The continent where he will make new friends and foes and discover a much greater threat than Hagen, and the reasons behind his father’s assassination. In order to complete the 11 campaign chapters, the player will have to master the specificities of the 6 first clans and tame the unforgiving wilderness of Northgard. Since the beginning of Northgard’s colonization, 6 new clans have joined the battle, introducing new ways of playing and battling.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/northgard-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/northgard-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista or better",
        "Processor": "Intel 2.0ghz Core 2 Duo or equivalent",
        "Memory": "1 GB RAM",
        "Graphics": "Nvidia 450 GTS / Radeon HD 5750 or better",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Shiro Games",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "RUNE emu",
        "Version": "v3.7.29.42209 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9n6psloa1j2n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/northgard-free-download-preinstalled-steamrip.jpg"
}