{
    "page_url": "https://steamrip.com/nova-lands-free-download-p1/",
    "title": "Nova Lands",
    "description": "If you were to mix Factorio, Forager, and Satisfactory , Nova Lands would be just that. Explore, build, and automate your base in this awesome, open-world 2D game New planet, new home. Build your new base with all sorts of resources available to you, from basic rocks and wood to rare and unknown materials .\nUnlock new possibilities with every new building , maximize efficiency, and push deeper to other islands. As you progress through the game, you will be able to automate more and more things, freeing up more time to explore\nYour little helper bots will be instrumental in helping you do that. The bots are the tipping point where your ingenuity will begin to shine. These little self-sufficient machines can form entire production chains and sustain your industry all on its own. They’re easy to set up and manage. She and the Light Bearer\nJust like you’re not the only person to land on this planet, your started island is one of many Kickstart your industry to get all the tech you need and comfortably explore other islands. You’ll come across various biomes, creatures, landmarks, caves , and some really important people",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/nova-lands-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/nova-lands-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 7 or later",
        "Processor": "Intel Core 2 Duo E6320 (2*1866) or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 7600 GS (512 MB) or equivalent",
        "Storage": "850 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "BEHEMUTT",
        "Platform": "PC",
        "Game Size": "725 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.1.10 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ov1j9tksd8c7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/nova-lands-preinstalled-steamrip.jpg"
}