{
    "page_url": "https://steamrip.com/nuclear-nightmare-free-download/",
    "title": "Nuclear Nightmare",
    "description": "Join your fellow players in assembling an elite extraction team for a thrilling mission to recover classified materials hidden in the harsh Arctic landscape. Gather the necessary supplies to call in an evacuation chopper and make your escape back to civilization. Will you succeed ?\nExplore a vast open world with a variety of vehicles and trusty huskies to help you navigate the expansive terrain. Earn points to unlock powerful perks at soda machines, discover new suits, and even unlock dance moves! But beware—time is running out. With a devastating nuclear strike looming from the US government to contain the black goo virus, your mission is clear: salvage critical information about the vaccine before it’s too late. Can you beat the clock and complete your mission? Skydance’s BEHEMOTH VR\nBeware the lurking threat of the black goo virus. In this perilous mission, you must test for infections and stay vigilant—anyone, even your loyal husky companions, could turn at any moment. Manage your resources wisely; each vaccine can cure an infection only once, and your inventory is limited to just five slots.\nScavenge for flamethrowers, shotguns , flare guns, and more to defend yourself against the relentless dangers. Will you make the right choices to survive, or will the virus claim you?\nAre you ready to face the “Nuclear Nightmare”?\nPrepare to confront your worst nightmares in “Nuclear Nightmare.” The fate of humanity hangs in the balance, and only you can prevent the impending apocalypse. Will you rise to the challenge, or will you become just another victim of this “Nuclear Nightmare”?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/nuclear-nightmare-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/nuclear-nightmare-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core i5-7500 or AMD Ryzen 3 3300X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce 1060 GTX or AMD Radeon RX 5700",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Early Access",
        "Developer": "BG Productions",
        "Platform": "PC",
        "Game Size": "7.8 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.4.4 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/9JGjob",
        "https://megadb.net/aq9w0vcav406"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/nuclear-nightmare-preinstalled-steamrip.jpg"
}