{
    "page_url": "https://steamrip.com/oceanhorn-2-knights-of-the-lost-realm-free-download-1h/",
    "title": "Oceanhorn 2 Knights of the Lost Realm Directly Download",
    "description": "Oceanhorn 2: Knights of the Lost Realm, set a thousand years before the events of the first chapter , takes you on a magical journey across the vast world of Gaia, brimming with mythology and lore. A young Knight faces an impossible challenge, as Warlock Mesmeroth has returned with a formidable Dark Army. Will our hero be able to unite the Owrus, Gillfolk and Arcadians in a fight for the fate of the world?\nYou will not be taking this journey alone. Trin, the granddaughter of Arcadia’s leader Archimedes, and Gen, a mysterious robot wielding an old samurai weapon, will join forces with you, and fight at your side against Mesmeroth’s Dark Army. Contextual commands will allow you to direct these allies into battle, or have them help you with the solution of the game’s most clever puzzles Only Climb: Better Together\nBigger, better, and packed with new features – Oceanhorn 2 is not only one of the best-looking adventure games out there, but it also builds a unique experience on the shoulder of classic video games. Collect powerful items, wield the Caster Gun, solve the mysterious puzzles of the ancients, and discover all that Arcadia and its neighboring kingdoms have to offer Accept the challenge and become a true hero.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/oceanhorn-2-knights-of-the-lost-realm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/oceanhorn-2-knights-of-the-lost-realm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel CPU Core i3 and similar",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 960 (4GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Cornfox & Brothers Ltd.",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "RUNE",
        "Version": "Build 11623275 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p72a9m2ngu9e",
        "https://pixeldrain.com/u/92a7Lohb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/oceanhorn-2-knights-of-the-lost-realm-preinstalled-steamrip.jpg"
}