{
    "page_url": "https://steamrip.com/octodad-dadliest-catch-free-download-1v/",
    "title": "Octodad Dadliest Catch Directly Download",
    "description": "Octodad: Dadliest Catch is a game about destruction , deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad’s existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentacles while simultaneously keeping his cephalopodan nature a secret from his human family. VTOL VR\nIn this sequel to the splash hit Octodad, our cephaloprotagonist has gotten himself in a bind between his wife’s mounting mistrust, and a disastrous trip to the local aquarium. Are you dad enough to control the titular octopus father as he strives to hide his nautical nature from his family while keeping his tangled tentacles intact? In Octo-ber 2010, a group of university students released the original Octodad into the world. Despite everyone being convinced that the game was about a normal human dad, the game was a cult hit, gained critical acclaim, and was an Independent Games Festival Student Finalist in 2011.\nOctodad received enough attention that the team decided to run a Kickstarter , form the game studio Young Horses, and create a bigger, better, more polished game about Octodad. Two and a half years after beginning production, Octodad: Dadliest Catch is ready to flop awkwardly into your arms.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/octodad-dadliest-catch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/octodad-dadliest-catch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP SP3",
        "Processor": "Intel Core 2 Duo 2.0Ghz or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "Intel Core HD  3000/4000, NVIDIA 8800 GT, ATI Radeon HD 4850 or better",
        "DirectX": "Version 9.0",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Young Horses",
        "Platform": "PC",
        "Game Size": "944 MB",
        "Released By": "GOG",
        "Version": "v1.2.19351 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5e6s6pxnd5v3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/octodad-dadliest-catch-preinstalled-steamrip.jpg"
}