{
    "page_url": "https://steamrip.com/ohsir-the-insult-simulator-free-download-r1/",
    "title": "Oh…Sir!! The Insult Simulator",
    "description": "Oh…Sir!! The Insult Simulator Download PC Game In Direct Link for free on SteamRIP\nThe parrot is back from the dead bringing countless new insults for your disposal, Sir! Remember that silly game that parted lovers, destroyed families and turned friends into enemies? Here’s its successor that does even more, certainly with more style and more variety. And I have proof! This time you can spread affront to everyone in the world that has Internet access or if you’re not the most sociable you can sit alone and play with yourself.\nNudge nudge. So don’t let the parrot die for nothing and tell that grumpy old lady that her husband donated organs for a strange woman lying in a pond and that her sister poses nude for some dog. Then meet a retired hipster who admires pictures of a grunting sow, and a fake Russian who borrowed a dead body to put his teacup and crumpets on. It’s also the only game that lets you learn what’s The Meaning of Life, and that’s scientifically proven",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/oh-sir-the-insult-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/oh-sir-the-insult-simulator-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP or Later",
        "Processor": "Intel from 1.2 GHz or equivilent AMD family",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX 9 compatible graphics card",
        "DirectX": "Version 9.0",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Vile Monarch",
        "Platform": "PC",
        "Game Size": "294 MB",
        "Repack By": "GOG",
        "Version": "v1.11 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/4b"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/oh-sir-the-insult-simulator-free-download-preinstalled-steamrip.jpg"
}