{
    "page_url": "https://steamrip.com/olliolli-world-free-download-1y/",
    "title": "OlliOlli World Download",
    "description": "OlliOlli World game for free instantly and play pre-installed on SteamRIP\nOlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.\nTraverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression .\nChallenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World. Tough Law\nOlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio. Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored.\nFind your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb.\nThink you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in Leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/olliolli-world-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/olliolli-world-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or better",
        "Processor": "Intel i3 5th gen or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Sports",
        "Developer": "Roll7",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "CODEX",
        "Greetings": "Masquerade",
        "Version": "Build 8273920 | Update v1.0.2 + 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g786en3wfuou"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/olliolli-world-preinstalled-steamrip.jpg"
}