{
    "page_url": "https://steamrip.com/one-more-island-free-download-1s/",
    "title": "One More Island",
    "description": "The Queen of the Old World calls upon you As Her Majesty’s domain expands, we require a capable administrator to guide Her latest colonies to prosperity. We will provide you with ships, colonists , and other tools necessary to tame these wild, virgin lands, and turn them into a prosperous colonial enterprise, all under the Queen’s watchful eye. Naturally, the Crown will expect you to share the bounty of these new lands, pay your taxes on time, and continue expanding the boundaries of Her Majesty’s colonial possessions.\nObedience may earn you rewards, but refusing to pay your dues or worse, declaring independence, will have dire consequences. As governor, you’re in charge. Plan out the colony, take care of your residents, and turn a small outpost into an overseas metropolis bustling with commerce Construct the buildings you want. The freeform building designer allows fine-tuning workshop placement and colonist’s paths to optimize the holy colony plan.\nLook after the colonists’ needs. Happy colonists work harder and faster, growing your, err, Her Majesty’s colonial empire. Harness this legendary colony and these dedicated colonists to create production chains, producing necessary goods on the spot and growing the community. There’s always One More Island to conquer. Explore the world, find new spots to establish more colonies, then tie them together into a self-sufficient network: An empire of your own making. Furi Onnamusha\nBuild a new fleet to explore the archipelago , claim new islands for your domain, then link them together with overseas trade routes. Optimize your production chains and increase their complexity to create entire industries independent of the Old World. Research new ways to develop your fledgling colony into a New World superpower. Each civilization tier brings with it new challenges, new requirements – and new opportunities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/one-more-island-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/one-more-island-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Intel i5 or AMD-FX+",
        "Memory": "4 GB RAM",
        "Graphics": "Integrated GPU might work, Nvidia Geforce GTX 550+ or AMD Radeon HD 5000",
        "DirectX": "Version 11",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Berg Games",
        "Platform": "PC",
        "Game Size": "160 MB",
        "Released By": "GOG",
        "Version": "v1.7.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3jvncg1cie4h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/one-more-island-preinstalled-steamrip.jpg"
}