{
    "page_url": "https://steamrip.com/oni-road-to-be-the-mightiest-oni-free-download-1l/",
    "title": "ONI Road to be the Mightiest Oni Directly Download",
    "description": "The protagonist, Kuuta, attacks the enemy using his club. Kazemaru sucks the enemy’s spirit out of its body, and by destroying that spirit, Kuuta can then claim victory. Enjoy an all-new, unique co-op experience by playing both Kuuta and Kazemaru at the same time Kisejima , where the game takes place, is divided into three areas with a variety of challenges ranging from fighting enemies to escort missions. The player can also level up by running away from pursuing monsters, like a game of tag, and collecting mushrooms that grow in clusters to purchase upgraded clubs. Tiny Troopers: Joint Ops XL\nThe story takes place on Kisejima , a small island in the middle of the ocean. Here, it is said that the power that lies dormant within the local demon spirits can be drawn out by challenging them to trials, where ancient demons who were once defeated by Momotaro are summoned to battle. However, few have ever returned from Kisejima alive. Kuuta, the protagonist, is the only survivor of the Demon King’s army that faced Momotaro in battle. He and Kazemaru, a mysterious spirit that lives on Kisejima, team up to take on challenges of all shapes and sizes",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/oni-road-to-be-the-mightiest-oni-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/oni-road-to-be-the-mightiest-oni-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "KENEI DESIGN, SHUEISHA GAMES",
        "Platform": "PC",
        "Game Size": "721 MB",
        "Released By": "SKIDROW",
        "Version": "Build 10719260 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bjuoa8jzex6g"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/oni-road-to-be-the-mightiest-oni-preinstalled-steamrip.jpg"
}