{
    "page_url": "https://steamrip.com/only-up-free-download-g1/",
    "title": "Only Up! Directly Download",
    "description": "You are a young teenage Jackie from the ghetto who wants to get out of poverty and embark on a journey of learning about the world and yourself. The world has definitely gone crazy, though it has never been normal, but maybe now is the chance for you. Crisis is a time for action and decisive steps except it’s scary , because every step can set you back far. Delta Force – Complete Collection\nSometimes it is difficult to choose the right path, but do not be afraid, you can always repeat , we learn from mistakes. Jackie is to learn that to get to a new place you must first make a jump and get off the ground, not knowing what will happen in the future\nA samurai has no goal, only a way, stoicism , patience and cunning will help you to reach the very top, but what awaits there – you never know. Only Up!” is inspired by the fairytale “Jack and the Beanstalk” and reminds some of a platformer. You’ll follow the same mythological path as Jack to achieve something more than just climbing to the very top. Among the features of the game are the ability to slow down time and change the speed of your character to be as collected as possible when making an important step or jump . The game also contains hundreds of Easter eggs and various references.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/only-up-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/only-up-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8/10/11 (64-Bit)",
        "Processor": "Intel Core i5-6600@ 3.1 GHz or AMD R5 1600X @ 3.5 GHz or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 or equivalent",
        "DirectX": "Version 12",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation",
        "Developer": "SCKR Games",
        "Platform": "PC",
        "Game Size": "4.8 GB",
        "Released By": "Mr_GOLDBERG emu | Ty Kirigiri’s (csrin)",
        "Version": "Build 11651418 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0r10nxrs7lla",
        "https://gofile.io/d/s1bwYb",
        "https://pixeldrain.com/u/6wE7q3qz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/only-up-preinstalled-steamrip.jpg"
}