{
    "page_url": "https://steamrip.com/operation-polygon-storm-free-download/",
    "title": "Operation: Polygon Storm",
    "description": "Become a master general. Strategically assemble your army from a selection of unique units and abilities to deploy into fast-paced battles. Watch your master plan play out, and adapt as the battle progresses, all with minimal micromanagement. Crime Scene Cleaner\nMix and match units from a selection of infantry and armor alongside artillery and air support to push into the enemy’s base and fight off any counterattacks. Tap into multiple upgrade trees for each unit and unlock additional abilities to fine-tune your army .\nNo base building or resource harvesting required. Focus on the battle as your army can advance, attack and take cover all on their own. Take command when needed to adapt and control the overall situation as your units either follow your masterplan or your direct orders\nBalance your resources to pick an army composition suited for each mission . A deep and complex battle system means you’ll need to react quickly, choose the right mix of soldiers and Killstreak rewards, and utilise complementary unit synergies to gain any advantage.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/operation-polygon-storm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/operation-polygon-storm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/8.1/10/11",
        "Processor": "Intel core i3",
        "Memory": "4 GB RAM",
        "Graphics": "1GB Video RAM",
        "DirectX": "Version 9.0",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Toxic Studio",
        "Platform": "PC",
        "Game Size": "822 MB",
        "Released By": "GOG",
        "Version": "v1.3.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/aboy0v4sbmer"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/operation-polygon-storm-preinstalled-steamrip.jpg"
}