{
    "page_url": "https://steamrip.com/orbital-bullet-the-360-rogue-lite-free-download-1r/",
    "title": "Orbital Bullet The 360 Rogue-lite Directly Download",
    "description": "The Save the World Edition includes Orbital Bullet and the game’s official booming soundtrack. In addition, Assemble Entertainment donates 10% of the revenues of this edition to the non-profit organization Ocean Cleanup which develops advanced technologies to rid the oceans of plastic.\nThis is the best option for all those who would like to support the work of the developer of Orbital Bullet even more and do something good at the same time. Orbital Bullet is a fast paced 360° action-platformer with rogue-lite elements, where all actions take place in a circular pattern. Warbox\nFight your way through a variety of procedural planets and use body modifications, crafting, upgrades and heavy weaponry. 360° hard-boiled gunplay: Projectiles traverse in a 360°-degree pattern allowing for a new unrivaled gunplay feeling. Just one-more-run”: Procedurally generated planets, mean enemies, bad-ass bosses, a diverse weaponry and game changing upgrades guarantee addictive gameplay.\nMake the most satisfying long-range curved snipes you have ever done or blast and shred enemies with a load of your hyper shotgun. Or are you more of a rocket launcher fella? Fast paced unrelenting pixel style-action: each death is permanent, but let’s be honest, dying is part of the fun.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/orbital-bullet-the-360-rogue-lite-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/orbital-bullet-the-360-rogue-lite-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Intel Core 2 Duo E6320 (2*1866) or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce 7600 GS (512 MB) or equivalent",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "SmokeStab",
        "Platform": "PC",
        "Game Size": "509 MB",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6u1hm74s407z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/orbital-bullet-the-360-rogue-lite-preinstalled-steamrip.jpg"
}