{
    "page_url": "https://steamrip.com/orcs-must-die-deathtrap-free-download/",
    "title": "Orcs Must Die! Deathtrap",
    "description": "Step into the role of a powerful War Mage, defend the rift from the grotesque mob, and embrace the chaos of orc annihilation. The castle doors are thrown wide open to exciting new features, including:\nEnjoy the game solo or in co-op teams of up to four players – each option provides unique challenges and rewards. The game is designed to adjust to the number of players, ensuring a balanced and exciting contest in any combination. Space Engineers 2\nFind your role among new War Mages , each with unique weapons, abilities, traps, and personality. Each hero is tailored to different play styles and can operate independently or work together with complementing heroes, ensuring versatile and mighty orc- smashing .\nFace intensifying waves of orcs and other hideous beasts with randomized buffs and debuffs that impact your hero, traps, weapons, stats, and the levels themselves. Environmental factors like weather and time of day further influence enemies and your defensive options. As these buffs and debuffs stack, choose to push forward against the growing hordes or return to your castle hub to power up your hero, weapons, and traps before facing a formidable Orc General in a brutal boss fight.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/orcs-must-die-deathtrap-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/orcs-must-die-deathtrap-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5 6th Gen",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 1080 / AMD Radeon RX 570 8 GB",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Strategy",
        "Developer": "Robot Entertainment",
        "Platform": "PC",
        "Game Size": "9.9 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.1.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/EiC3Ak",
        "https://buzzheavier.com/ulq2z8vxbp1t",
        "https://megadb.net/ju1t3seq9wkb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/orcs-must-die-deathtrap-preinstalled-steamrip.jpg"
}