{
    "page_url": "https://steamrip.com/orcs-must-die-3-free-download-1i/",
    "title": "Orcs Must Die! 3 Download Directly",
    "description": "Get Orcs Must Die! 3 PC game for free instantly and play pre-installed on SteamRiP\nOrcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. Solo or with a friend by your side, arm yourself with a massive arsenal of traps and weapons. Slice, burn, toss and zap hordes of repugnant orcs in this long-awaited successor to the award-winning series. New to the series, War Scenarios pit players against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate the abominable intruders .\nMore of Everything – Orcs Must Die ! 3 is everything fans loved about the first two games and more. More orcs, more traps, more weapons, more upgrades and even better looking. It’s cranked up to at least eleven. New Story Play through a brand new story set more than 20 years after Orcs Must Die! 2, where the War Mage and Sorceress have rebuilt the order and trained new young apprentices. War Scenarios – All new War Scenarios deliver on the promise of massive scale first set out in Orcs Must Die! Confront overwhelming armies of orcs outside on the battlefields surrounding the castles. Thin out waves of orcs hundreds strong before they breach the walls and crash your rift.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/orcs-must-die-3-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/orcs-must-die-3-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-2300 | AMD Ryzen 3 1200",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660, 2 GB | AMD Radeon HD 7870, 2 GB",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy",
        "Developer": "Robot Entertainment",
        "Platform": "PC",
        "Game Size": "10.8 GB",
        "Released By": "FLT",
        "Version": "v1.2.0.0 | Full version + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ef9sbxxn3gt4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/orcs-must-die-3-free-download-torrent-steamrip.jpg"
}