{
    "page_url": "https://steamrip.com/ori-and-the-will-of-the-wisps-free-download-k1/",
    "title": "Get Free Steam Ori and the Will of the Wisps Preinstalled",
    "description": "Get Ori and the Will of the Wisps for free instantly and play pre-installed on SteamRiP\nThe little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork.\nSet to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling. According to the plot, terrible things began to happen again in the Nibel forest. A whole tribe of birds was killed, and along the way, Ori’s favorite trees were also destroyed. Naturally, he could not stand aside and immediately went on a new dangerous adventure, during which he would have to find out how everything happened, find the antagonist, and save the forest from imminent death. Hellish Quart",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/ori-and-the-will-of-the-wisps-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/ori-and-the-will-of-the-wisps-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 Version 18362.0 or higher",
        "Processor": "AMD Athlon X4 | Intel Core i5 4460",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 950 | AMD R7 370",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Moon Studios GmbH",
        "Platform": "PC",
        "Game Size": "4.16 GB",
        "Repack By": "CODEX",
        "Version": "v3.1 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3ar704jhcubu",
        "https://buzzheavier.com/mjhryfddbm7t",
        "https://datanodes.to/9z8i9z76jdtx/Ori-and-the-Will-of-the-Wisps-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/ori-and-the-will-of-the-wisps-free-download-preinstalled-steamrip.jpg"
}