{
    "page_url": "https://steamrip.com/osiris-new-dawn-free-download-x1/",
    "title": "Osiris: New Dawn Directly Download",
    "description": "Inspired by the edgier side of sci fi, Osiris: New Dawn is lovingly hand- crafted by a small team of veteran AAA developers, now in its final stages of Early Access. Included now are all our large updates and expansions: Dawn of Aziel, Proteus 2 Unearthed, Architect Update, Into the Fray, Rise of Zer, Explorer, Survival, Frozen Worlds, Rise of the Machines, Discovery, Fires of Industry, Dark Horizons , User Interface Update, and Voyager, along with hundreds of smaller updates – all driven by your feedback. Also includes our Experimental Build, which we use for public testing and feedback on the latest and greatest. Estencel\nHot off the presses from our hands to yours. Your Mission For Mankind You are on a resupply mission in the far reaches of space in hopes of finding and colonizing habitable planets to replace our dying Earth. Space is dangerous. Anything can, and likely will, go wrong. All of mankind is counting on your success. Explore and build by day and brace yourself for the night. Bunker down or stage weaponized attacks. Survival is not guaranteed, and you will be tested to your limits.\nGather resources and materials to survive, build modular structures to grow food and create manufacturing bays, research new technologies to upgrade gear and build new vehicles, and explore new worlds to discover the unknown in this harsh alien solar system. Discover strange and terrifying alien creatures, each unique to its ecosystem and planet. Dynamic and dangerous weather patterns can help or harm your survival efforts. Strange foliage populates unique biomes across the solar system.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/osiris-new-dawn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/osiris-new-dawn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 | 64-bit",
        "Processor": "Intel i5 | 3.2GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 970",
        "DirectX": "Version 10",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Fenix Fire Entertainment",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "TENOKE",
        "Version": "v0.5.616 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p4lu63y465md"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/osiris-new-dawn-preinstalled-steamrip.jpg"
}