{
    "page_url": "https://steamrip.com/outer-wilds-free-download-o1/",
    "title": "Outer Wilds",
    "description": "Get Outer Wilds PC game for free instantly and play pre-installed on SteamRiP\nWinner of Best Game at the 2020 BAFTA Games Awards and named Game of the Year 2019 by Giant Bomb, Polygon, Eurogamer, and The Guardian, Outer Wilds is a critically-acclaimed and award-winning open world mystery about a solar system trapped in an endless time loop. You’re the newest recruit of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system.\nWhat lurks in the heart of the ominous Dark Bramble? Who built the alien ruins on the Moon? Can the endless time loop be stopped? Answers await you in the most dangerous reaches of space. The planets of Outer Wilds are packed with hidden locations that change with the passage of time. Stormworks: Build and Rescue\nVisit an underground city of before it’s swallowed by sand, or explore the surface of a planet as it crumbles beneath your feet. Every secret is guarded by hazardous environments and natural catastrophes.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/outer-wilds-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/outer-wilds-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-2300 | AMD FX-4350",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 560 | AMD Radeon HD 6870",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Mobius Digital",
        "Platform": "PC",
        "Game Size": "4 GB",
        "Released By": "CODEX emu",
        "Version": "v1.1.16 | Full  + DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7ebmca8wmlxp",
        "https://buzzheavier.com/z6s8iivvuogm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/outer-wilds-free-download-preinstalled-steamrip.jpg"
}