{
    "page_url": "https://steamrip.com/outerverse-free-download-y1/",
    "title": "Outerverse Directly Download",
    "description": "Outerverse game for free instantly and play pre-installed on SteamRIP\nOuterverse is a quest-driven, crafting automation adventure game. Build automated machines and weapons, then use them to travel across the universe, beat massive titans, and advance your technology while experiencing cosmic events. Includes a manual scenario for crafting instead of machines for those not a fan of logic/automation Defeat 6 massive Titans, each one unique and with a special mechanic to defeat. Not Tonight 2\nShoot fireballs at the Tree Titan, launch rockets into the Rock Titan, build lasers to obliterate the Negative Titan, all that and more Automate unique machines and farms using logic, transportation, and spawning systems inspired by Redstone & Minecraft Automation . Design your own custom machines, or use pre-made schematics for simplicity! Alternatively, choose the manual crafting scenario for the same experience but with crafting instead of machines – without machines, farms, logic or wires .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/outerverse-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/outerverse-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or higher",
        "Processor": "Intel Core i5 3550 @ 3.3 GHz or AMD FX-6300",
        "Memory": "6 GB RAM",
        "Graphics": "AMD Radeon R7 370 or NVIDIA GeForce GTX 660/570",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG, Simulation, Strategy, Early Access",
        "Developer": "Tbjbu2",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "N/A",
        "Version": "v03.02.2022 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/68k6czab0ko7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/outerverse-preinstalled-steamrip.jpg"
}