{
    "page_url": "https://steamrip.com/outlast-2-free-download-1k/",
    "title": "Outlast 2  Link",
    "description": "Get Outlast 2 steam PC game for free instantly and play pre-installed on SteamRiP\nOutlast 2 is that the sequel to the good known survival horror game of the original Outlast . Set within the same universe because of the first game (outlast), but with different characters and a special different setting, Outlast 2 could even be a twisted and interesting new journey that leads into the depths of the human mind and its darkest secrets.\nOutlast 2 introduces you to Sullivan Knoth and his followers, who have left our wicked world behind to provide birth to the Temple Gate . It is a town, deep within the wilderness and hidden from all the civilization. Knoth and his flock are preparing for the tribulations of the magnificent times and you’re right within the thick of all of it. You are Blake Langermann , a cameraman that is working in conjunction with his wife, Lynn . The 2 of you’re investigative journalists who are willing to wish risks and dig deep into anything to uncover the stories nobody else will dare to touch.\nThe game takes place within the same universe as Outlast, after the events of the Mount Massive Asylum Slaughter. Murkoff is additionally scheduled to form their appearance. consistent with the developers, the most setting takes place during a secluded village, located somewhere within the canyons of Arizona. Blake Langermann, a cameraman, together with his wife Lynn, visit southern Arizona to research the murder of a Jane Doe .\nYou’re following a trail that is full of clues that started with the seemingly impossible murder of a pregnant woman who is known only as Jane Doe . The investigation has already lead you miles into the dark Arizona desert. It is full of darkness so deep that no one could shed to strike it, and a corruption so profound that going mad could even be the sole sane thing to undertake. Later, Blake realizes that he’s been stranded during a village with cult members that believe the top of times are upon them. His main goal is to seek out Lynn and escape alive from the hostile villagers.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/outlast-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/outlast-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista / 7 / 8 / 10, 64-bits",
        "Processor": "Intel Core i3-530",
        "Memory": "4 GB RAM",
        "Graphics": "1GB VRAM, NVIDIA Geforce GTX 260 / ATI Radeon HD 4870",
        "DirectX": "Version 10",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Red Barrels",
        "Platform": "PC",
        "Game Size": "21.69 GB",
        "Repack By": "CODEX",
        "Version": "v1.0.17518.0 – Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/F6011B640E",
        "https://buzzheavier.com/qc7kjtp6swrn",
        "https://1fichier.com/?spkeqotsp3sttxe9yxfq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/outlast-2-free-download-preinstalled-steamrip.jpg"
}