{
    "page_url": "https://steamrip.com/overloop-free-download-1r/",
    "title": "Overloop Directly Download",
    "description": "Step into an ethically compromised future where cloning technology has wreaked havoc on humanity – and it’s sort of all YOUR fault! As an employee of nefarious megacorp, Infinity Inc., and the inventor of its Quantic Matter Replication Device (aka the QMRD , aka the cause of the world going to hell in a handbasket), it’s up to you to sort out the mess you helped create. Grab your cloning gun and hot-foot it through a world descending into clone-induced chaos. Create clones of yourself and use them to solve puzzles and save humanity.\nGet to it genius Create clones Make endless copies of yourself with the cloning gun and use your perfectly formed doppelgangers – up to four at once – to overcome obstacles and solve puzzles Sacrifice clones Dystopias are very dangerous places, and many clones will suffer hilariously gruesome deaths along the way.\nFried Crushed Mangled Minced RIP clones. Explore a world of weirdness! From suspiciously friendly AI and cultish crackpots, to modified corn and cloned panda bears. This freaky future has (almost) everything. Think about ethics! Is it better that a clone should die, rather than the real you? Consider the morality of human cloning as you condemn countless versions of yourself to death. LEGO Brawls",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/overloop-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/overloop-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Charge Games",
        "Platform": "PC",
        "Game Size": "271 MB",
        "Released By": "N/A",
        "Version": "v1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6x30o3e1kwog"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/overloop-preinstalled-steamrip.jpg"
}