{
    "page_url": "https://steamrip.com/overdrift-festival-free-download-1j/",
    "title": "OverDrift Festival Directly Download",
    "description": "Welcome to OverDrift festival – a grand celebration of car culture and sports Become a participant in drift racing competitions . Explore large territories and find iconic tracks and configs. Single and multiplayer challenges, tasks and events. Train with your friends online, compete with rivals from all over the world. Build your rating among drivers, earn fan likes. Japanese, American, German and Russian cars – gather a unique collection. Upgrade, tune and customize the cars. Be creative and self-actualize in creating exclusive liveries for your cars using the advanced styling system. Experience the emotions of a real driver from participating in races: spectators and fans on the tracks will appreciate your driving. Mari and Bayu – The Road Home\nShare your successes with friends and like-minded people. Intrigue and competition , joy and tears, drama and celebration at OverDrift festival Join the community on Steam and subscribe to our publics on social networks for the latest information, screenshots and more before anyone else Dozens of kilometers of picturesque roads and tracks: public roads, mountain “toge” serpentines and suburban highways, hypermarket parking and industrial zones, sports tracks and drift parks.\nTraffic on public roads . Iconic track configurations recognized by real professional drifters are integrated into the overall game world. The atmosphere of the sports tracks is created with the highest detail. Roads are perceived as real due to the environment and the terrain. Lots of events and tasks, drift races at the motorsports and styling festival.\nMake friends who are close in spirit to your car preferences. Host meetings and competitions in an open online lobby in a shared gaming world with a large number of participants from all over the world. Win the popularity of fans and spectators on the tracks, earn money for new cars and tuning, customize your car to accumulate likes. Create your own team and club, compete and advance to the top ranking of the festival drivers",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/overdrift-festival-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/overdrift-festival-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "10, 11",
        "Processor": "2.0 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "nVidia GeForce GTX 950 with 2GB of VRAM",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Massively Multiplayer, Racing, Simulation, Sports, Early Access",
        "Developer": "OverDrift Crew",
        "Platform": "PC",
        "Game Size: 4.2": "GB",
        "Multiplayer By": "ONLINE-FIX.me",
        "Version": "Build 21072022 | Full  + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8ks9a4ghu6pu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/overdrift-festival-preinstalled-steamrip.jpg"
}