{
    "page_url": "https://steamrip.com/overcooked-2-free-download-1e/",
    "title": "Overcooked! 2 Download Direct Link",
    "description": "Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons it’s time to save the world (again!) You’ve saved the world from the Ever Peckish. Now a new threat has arisen and it’s time to get back in the kitchen to stave off the hunger of The Unbread You’ll knead to work together (or against each other) to get the highest score in chaotic local and online multiplayer .\nJourney across a brand new overworld map by land, sea and air. Get cooking in new themes ranging from sushi restaurants, magic schools, mines and even alien planets Travel the land cooking up a range of new recipes that are sure to cater to any tastes, including sushi, cakes, burgers and pizzas. Travel through teleporters, across moving platforms and save time by throwing ingredients across dynamic kitchens that shift and evolve. Some kitchens even whisk your chefs away to new locations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/overcooked-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/overcooked-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "WIN7-64 bit",
        "Processor": "Intel i3-2100 / AMD A8-5600k",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 630 / Radeon HD 6570",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "Ghost Town Games Ltd., Team17",
        "Platform": "PC",
        "Game Size": "6.3 GB",
        "Multiplayer By": "Online-fix.me",
        "Version": "Build 9022791 | Full  + all DLCs + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ita23cu7y0q9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/overcooked-2-free-download-torrent-steamrip.jpg"
}