{
    "page_url": "https://steamrip.com/oxenfree-ii-lost-signals-free-download-1m/",
    "title": "OXENFREE II Lost Signals Directly Download",
    "description": "TVs turn on and off. Planes lose radar. Radio stations can’t broadcast through the static. In the small coastal town of Camena, unnaturally occurring electromagnetic waves are suddenly causing interference with electrical and radio equipment. Reluctantly, Riley Poverly returns to her hometown to investigate the mystery , but what she finds is more than she bargained for. Serious Fun Football\nOXENFREE II: Lost Signals is the mind-bending follow-up to the critically-acclaimed narrative adventure game OXENFREE from Night School Studio. Play it as a standalone story or dive deeper by playing the original – it’s up to you. As you play, you’ll shape every step of the story through your choices. How you choose to deal with the supernatural events at hand will forever alter the future .\nShape everything through your conversations and dialogue choices. Forge a deep friendship with an old acquaintance from high school or opt to ignore a lost fisherman in need. Your choices impact who Riley becomes, your relationships, and the story options available to you at every turn. Use an all-new walkie talkie conversation system to chat with contacts and uncover useful insights about the mysteries of Camena . Ask for info, check in with the locals, or completely ignore them.\nIt’s your call to make. And, it has consequences. Five years ago on nearby Edwards Island, a few teenagers unwittingly opened a portal, creating a rift between realities and timelines. Now, members of a mysterious cult-like group called Parentage are deliberately trying to open a new portal to pull something out. Who are they? What do they want? Are they trying to contact ghosts ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/oxenfree-ii-lost-signals-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/oxenfree-ii-lost-signals-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit  required)",
        "Processor": "Intel Core i5-4570T or AMD",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 650 1GB or Radeon HD 7750 1GB",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Night School Studio",
        "Platform": "PC",
        "Game Size": "3.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.2.14 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bahs3omseeyu",
        "https://pixeldrain.com/u/2NpVcSFD"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/oxenfree-ii-lost-signals-preinstalled-steamrip.jpg"
}