{
    "page_url": "https://steamrip.com/pacify-free-download-1e/",
    "title": "Pacify Free Download Direct Link (Woods Update)",
    "description": "Pacify now has 3 separate missions to capture three unique monsters . Each mission includes a unique environment, story, gameplay , and monster. Have fun with your friends trying to complete each eerie paranormal mission, and help PAH Inc. capture the supernatural entities. You just signed on with PAH Inc. Paranormal Activity Helpers Incorporated, yeah sounds corny, but the pay is great. They said you won’t ever be in any real danger, and they have tons of work right now.\nYour first job is at some old haunted house. There is a broker wanting to put the house for sale, but with everyone in the town spreading rumors of evil living inside the house, he needs some proof that it is safe. He actually seems creeped out himself. Anyway, he hired PAH Inc. to check the place out. You can go check it out alone if you’d like, but I would take at least 3 more friends with me. Check the place out, and if there is anything supernatural going on, try to bring evidence back to PAH Inc.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/pacify-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/pacify-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 – 64 bit",
        "Processor": "Intel i5 or AMD equivalent (AMD FX 8500+ Series)",
        "Memory": "4 GB RAM",
        "Graphics": "1 GB Video RAM",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Strategy",
        "Developer": "Shawn Hitchcock",
        "Platform": "PC",
        "Game Size": "3.80 GB",
        "Repack By": "PLAZA",
        "Version": "v4.24 from 06/12/2021 (Pacify Woods update) | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q8urss3v9fbt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/pacify-free-download-torrent-steamrip.jpg"
}