{
    "page_url": "https://steamrip.com/painter-simulator-free-download-1j/",
    "title": "Painter Simulator",
    "description": "PAINTER SIMULATOR is a new-generation game in which the emphasis is placed on the player’s imagination and perceptiveness. Create the world in the colors you want to see with a brush. The use of individual colors will make certain objects, vehicles or characters start to move, thus, going through the next stages of the game, you will discover the story and become its participant. It will be up to you how the game unfolds. Become a leader and decide where the action of the scenario maps will take. Be an artist Showgunners\nUnlock game modes where you can decide for yourself whether the leaves will be blue or the grass will be purple. Be creative and create your own image. The color palette is waiting for the first play. Paint – Make friends with colors, give them a new meaning. Fill the scene with color in many ways. Don’t waste time on a regular crayon, try rain from spilled paint.\nPaint the walls with a brush and you will see what the effect will be. Scenarios and Adventures Bring painted elements to life, giving them a new meaning. Be a spectator and watch what happens next. Make a beautiful lady fall in love with you or experience a safari adventure. Here you have everything at your fingertips. Upgrade your skills Don’t give up on a loss just because something went wrong. You decide which painting mode you want to choose. As the game progresses, you will gain Skills and set a goal you want to achieve. You decide what surface you want to use in colors . Use your possibilities without forgetting about diversity. It is up to you whether you paint individual elements or the entire environment. Imagine, act",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/painter-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/painter-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 750",
        "Sound Card": "DirectX compatible",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Simulation, Early Access",
        "Developer": "Solverto, FreeMind S.A.",
        "Platform": "PC",
        "Game Size": "393 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10955618 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gm7v6a9cla6k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/painter-simulator-preinstalled-steamrip.jpg"
}