{
    "page_url": "https://steamrip.com/pandemic-train-free-download-1r/",
    "title": "Pandemic Train Download",
    "description": "In Pandemic Train you are in charge of the crew aboard a train roaming the postapocalyptic wasteland, ravaged by both war and a deadly plague. Your goal is to survive long enough to discover the cure or die trying. Humanity’s fate is in your hands! Start your journey now Desynced\nYou are in charge Pandemic Train is a survival game with roguelike and strategy elements in which you command the crew and passengers aboard an old train powered by a steam engine. The plot takes place in an alternative timeline of the 20th century when a catastrophic virus epidemic decimates the world’s population. A mysterious plague kills infected people within 24 hours, leading to widespread panic, riots, and war. The world is in ruins and you are the only hope for its survival. Explore the wastelands, collect resources, fight bandits , and find a cure for a deadly disease\nSurvive In Pandemic Train the world has become a very inhospitable place. People will die along the way, and you have to minimize the damage. The resources are scarce, so you have to distribute them very carefully. And worst of all there are lots of hungry wolves around. And by ‘hungry wolves’ we mean desperate people who will do anything to defeat you and stop your search for the cure. To defeat your opponents, take care of the resources you acquire and produce. They are limited, so use them carefully. Unfortunately, this is not the end of bad news.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/pandemic-train-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/pandemic-train-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i3 3.1 GHz or AMD Phenom II X3 2.8 GHz",
        "Graphics": "GeForce GTX 560 1GB (720p Low), GeForce GTX 750 Ti 2GB (1080p Low) or AMD equivalents",
        "DirectX": "Version 10",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Simulation, Strategy",
        "Developer": "Trigger Labs",
        "Platform": "PC",
        "Game Size": "5.6 GB",
        "Released By": "GOG",
        "Version": "v1.2.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vmcuumltdl3r"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/pandemic-train-preinstalled-steamrip.jpg"
}