{
    "page_url": "https://steamrip.com/panicore-free-download/",
    "title": "PANICORE",
    "description": "In PANICORE, players take on the role of urban explorers drawn to dangerously abandoned places. For these people, it is exciting to discover lost arts, lost treasures and abandoned buildings , schools and other abandoned places.\nBut when they discover a spooky place – one that even the authorities advise against visiting – their adventures take a terrifying turn. The explorers are determined to learn the dark secrets of the abandoned place, so they ignore the warnings and follow their curiosity into its depths. Astor: Blade of the Monolith\nBut an unforeseen turn of events quickly puts a stop to their exploration . They unexpectedly find themselves trapped in the abandoned building, with unknown forces blocking their way out. The explorers must work together to endure the horrors within and find a way out before it is too late, as fear sets in and they realize they are not alone.\nPlayers must use all their bravery to solve puzzles , navigate the dangerous corridors and outwit the monster that wants to trap them in its evil clutches while time is of the essence.\nDynamic Co-op Gameplay: Team up with friends in intense cooperative gameplay. Try to escape alone or together. Immersive Hide-and-Seek: Utilize your surroundings for survival . Hide in cabinets, under tables, and in the shadows to outsmart the lurking terror. Every decision could mean the difference between life and a gruesome demise. Find Items and Escape : To escape you have to find the right items that are distributed around the location and use them at the right place. Can you make it before it gets you?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/panicore-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/panicore-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 Bit)",
        "Processor": "AMD Ryzen 3 1200 ／ Intel Core i5-7500",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 470 with 4GB VRAM ／ NVIDIA GeForce GTX 960 with 4GB VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "13 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "ZTEK Studio",
        "Platform": "PC",
        "Game Size": "11.3 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LTseck",
        "https://1fichier.com/?uuzyuivuvn2v8d20ewa7",
        "https://megadb.net/qv9v1dlwtvxt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/panicore-preinstalled-steamrip.jpg"
}