{
    "page_url": "https://steamrip.com/panta-rhei-guardian-of-time-free-download/",
    "title": "Panta Rhei – Guardian of Time Direct  Download",
    "description": "Panta Rhei is an adventure rogue-lite where time is your weapon. You take on the role of Phi, a Guardian of Time exiled in the Garden of Past since the Great Cataclysm . Phi spent eons tending to the garden, hiding from the outside world and neglecting their duties as a guardian.\nNow a chaotic force threatens to tear the flow of time apart, forcing Phi to leave their sanctuary and embark on a journey through the Realm of Time. A journey that requires Phi to face their shadows of the past and embrace their origin as a Guardian of Time to save their home.\nTIME IS YOUR WEAPON\nPhi’s abilities to bend time allow you to manipulate the environment to clear paths or solve clockwork puzzles while exploring. They also allow Phi to revert their own last moves to double their effectiveness in combat or recover from lethal mistakes. Bus Flipper: Renovator Simulator\nAN EVER-CHANGING REALM\nThe Realm of Time holds many secrets for you to uncover. Each location has its own challenges, gradually revealing more of the world as Phi solves side quests and cleanses the world. Gather and combine items in the world to craft unique strategies. Tend to the Garden of Past to maximise your chances for future runs.\nCHASING TIME\nPanta Rhei explores time as our most valuable resource. For Phi, time is quite literally tied to their life and purpose. But they also experience it as something non- linear , an aspect of their life that they can control and shape to their will.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/panta-rhei-guardian-of-time-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/panta-rhei-guardian-of-time-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-2600 or AMD FX-8350",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 950, 2 GB or AMD Radeon R9 380, 4 GB",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "reignite games, Sappalot Studio, Omme Animation, Nordic Scoring",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "CHRONOS emu",
        "Version": "Build 19450175 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/y42o7wvg9fyx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/panta-rhei-guardian-of-time-preinstalled-steamrip.jpg"
}