{
    "page_url": "https://steamrip.com/papas-freezeria-deluxe-free-download-w1/",
    "title": "Papa’s Freezeria Deluxe",
    "description": "After starting a relaxing job at the oceanfront ice cream shop on Calypso Island, things get hectic when all of Papa Louie’s crazy customers arrive on the island Now it’s up to you to single-handedly craft and serve tasty sundae treats throughout the year. You’ll whip up delicious Freezer sundaes by pouring ice cream, adding mixables and syrups, blending sundaes, and finally adding whipped cream and toppings for that perfect summertime treat. You’ll need to multitask between each area of the restaurant, where each station is a unique hands-on experience. Smalland: Survive the Wilds\nThere’s more to see and do on Calypso Island than ever before! In this deluxe reimagining of Papa’s Freezeria, you’ll unlock new ingredients, new customers, and new seasonal holiday flavors as you play. Even more customers have arrived on the S.S. Louie cruise ship, so you’ll see some new faces along with your Freezeria regulars. There’s also a variety of new features for the ice cream shop, including Daily Specials, unlockable customer outfits, helpful Score Details, a Freezeria Food Truck, and more!\nCalypso Island is the perfect location for more than just a summertime getaway : Papa’s Freezeria is now open year-round! Celebrate the holidays on the island with new seasonal sundaes, including a variety of brand-new syrups, mixables, and toppings for each holiday of the year. You can also buy holiday clothing and decorate the lobby with seasonal decorations to get in the holiday spirit\nAfter you hire a Driver, you can send them out in the brand-new Freezeria Food Truck between days to serve whatever you like! Use your imagination to create your own unique sundaes, then serve them from the Food Truck and see who shows up to try them. You can even mix and match ingredients from different holidays in the Food Truck for creative combinations",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/papas-freezeria-deluxe-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/papas-freezeria-deluxe-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer",
        "Processor": "1.8 GHz",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX 9.0c Compatible Video Card",
        "DirectX": "Version 9.0c",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation, Strategy",
        "Developer": "Flipline Studios",
        "Platform": "PC",
        "Game Size": "90.5 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vk5soe685ogu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/papas-freezeria-deluxe-preinstalled-steamrip.jpg"
}