{
    "page_url": "https://steamrip.com/paper-cut-mansion-free-download-1g/",
    "title": "Paper Cut Mansion Directly Download",
    "description": "Paper Cut Mansion is a roguelite horror set in a papercraft world. Play as Toby, a police detective arriving at a mysterious old mansion. Explore the mansion floor by floor as you seek to unravel the story behind this bizarre place, with each run giving you the opportunity to collect another piece of evidence to be added onto your Evidence Board. The Mansion also hosts a mysterious cast of characters who may help or hinder your progress on each run Nitro Kid\nRun by run, Paper Cut Mansion will offer you the opportunity of defining your playstyle as you unlock new abilities and discover new equipment that will give you a better chance of overcoming the challenges each procedurally generated run throws at you. Each new item offers further customisation to your ultimate build, allowing for truly unique set ups. Do you want to get in close as a melee fighter or take shots from afar as a ranged marksman?\nSet yourself up with a drone who can do the fighting for you or create an engineering build who can lay down traps and turrets as you back enemies into them. Completing quests will also grant you temporary perks, making each run feel fresh as you may not get the same perks to choose from next time The possibilities are endless and there is no correct way to overcome the ever-shifting procedural rooms of the mansion.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/paper-cut-mansion-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/paper-cut-mansion-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Space Lizard Studio",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4jy90jslzztx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/paper-cut-mansion-preinstalled-steamrip.jpg"
}