{
    "page_url": "https://steamrip.com/paperman-adventure-delivered-free-download-1o/",
    "title": "Paperman Adventure Delivered",
    "description": "Paperman’s post office has managed to make 1 million deliveries. To celebrate this special achievement , the post office has decided to send out special golden letters to their most loyal customers. On a night when the dragon is watching television, he sees the news about the golden letters. Greedy as he is, the dragon uses his ancient magic to attack the post office and steal all the mail including the golden letters to add to the massive mountain of gold he already possesses. Paperman and his team will do everything in their power to retrieve the mail and get it delivered Overgrowth\nPlay as each of the four unique mail carriers and swap characters to unlock their unique abilities. Paperman, our titular hero, throws letters as projectiles and can teleport short distances. Express is the fastest character and takes care of the most urgent deliveries. Scrolly glides smoothly through the air with his trusty feather and can reach the highest platforms. The final member of the team is Carl, the strongest box of the bunch, he delivers the heaviest parcels with great care",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/paperman-adventure-delivered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/paperman-adventure-delivered-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 780",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Secret Item Games",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "TENOKE",
        "Version": "Build 12226289 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a9shuu8gogg9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/paperman-adventure-delivered-preinstalled-steamrip.jpg"
}