{
    "page_url": "https://steamrip.com/paranormasight-the-seven-mysteries-of-honjo-free-download-1z/",
    "title": "PARANORMASIGHT The Seven Mysteries of Honjo",
    "description": "This unsettling tale takes place in the Sumida Ward of Tokyo, Japan, in the late 20th century.Unravel the hopes, dreams and fears of these unique characters who find themselves in the grip of deadly curses, as their motivations intertwine in a story that twists and turns. Shogo Okiie, an ordinary office worker, visits Kinshibori Park in the dead of night with his friend, Yoko Fukunaga , to investigate a well-known local ghost story: The Seven Mysteries of Honjo. Spin Rhythm XD\nShogo doesn’t quite believe Yoko when she talks about how the Mysteries are connected to the Rite of Resurrection and doesn’t pay it much mind – that is, until strange events begin to unfold before his very eyes. Meanwhile, several others are making their own investigations into The Seven Mysteries Detectives investigating a series of strange deaths , a high-school girl seeking the truth behind her classmate’s suicide, and a mother who has sworn revenge for her lost son. Their desires and motives intertwine and interplay, with the Seven Mysteries of Honjo at the core, leading the story towards a battle of wits and curses .\nConduct investigations in Showa Japan; depicted through immersive, ambient 360 backgrounds. With the full support and cooperation of Sumida City Tourism Division, the local museum, the tourist association, and the local community, real-life scenery from Sumida has been photographed with a 360° camera and recreated as photo spheres that cover the entire sky and surroundings.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/paranormal-sight-the-seven-mysteries-of-honjo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/paranormal-sight-the-seven-mysteries-of-honjo-screenshots-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 / 11 64-bit",
        "Processor": "AMD A8-7600 / Intel® Core™ i3-3210",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ RX 460 / NVIDIA® GeForce® GTX 750 / Intel® HD  530",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Simulation",
        "Developer": "Square Enix",
        "Platform": "PC",
        "Game Size": "625 MB",
        "Released By": "ALI213 emu",
        "Version": "Build 10212663 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lcic2lbujp9n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/paranormal-sight-the-seven-mysteries-of-honjo-preinstalled-steamrip.jpg"
}