{
    "page_url": "https://steamrip.com/parquet-free-download-m1/",
    "title": "PARQUET",
    "description": "Get PARQUET PC game for free instantly and play pre-installed on SteamRiP\nIn the near future, a technology called Brain-Machine Interface connects the brain and machines. This technology brings about a new paradigm and opens the gates to the digitization of human memory itself. From these new discoveries, “he” is born. An illegal experiment mixes thousands of memories into a single vessel, creating a wholly new being. Having only the memories of others, doubts about who he truly is start arising in his mind, until he gathers the courage to go out into the world in search of his true self. Last Light\nAs he steps into the real world, he meets two girls, Kido Tsubasa and Ibaraki Rino. Both kind souls whose lives have been touched by unscrupulous BMI experiments, just like him. Likes: Drinking (She enjoys the good company more than the drinks themselves) This loner might seem distant and cold at first, but below the bravado lies a compassionate, gentle soul that yearns for what she never had.\nA special man born from myriad memories. Born under abnormal circumstances , this man searches for meaning in a world with no answers . Will he find the answer to his questions? Can the puppet become human?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/parquet-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/parquet-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer",
        "Processor": "1.7 GHz or above",
        "Memory": "1 GB RAM",
        "Graphics": "1GB VRAM"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "YUZUSOFTSOUR",
        "Platform": "PC",
        "Game Size": "2.48 GB",
        "Repack By": "CODEX",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ktx5cqh0hqkh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/parquet-free-download-preinstalled-steamrip.jpg"
}