{
    "page_url": "https://steamrip.com/passpartout-2-the-lost-artist-free-download-1k/",
    "title": "Passpartout 2 The Lost Artist",
    "description": "Draw and sell art on the go using your handy foldable easel . Explore the endearing puppet town, get to know the residents and what makes them tick. Help them out with commissions, like drawing a new ad for Steve’s restaurant Or why not buy a studio so you can work from home, just like the good old days?\nUse your hard-earned cash to treat yourself in the art supplies store. Maybe one of the many new tools will tickle your fancy? The crayon they just got in stock looks pretty sweet Or perhaps that heart-shaped canvas? You as an artist needs every edge you can get to stand out! The residents of Phénix may also carry some cool items they could give you, if you help them out of course. Turbo Golf Racing\nRevive your art career and take on the challenge of the Museum of the Masters in the art-starved town of Phénix You are Passpartout, once a renowned artist whose glory was lost after a mysterious disappearance. But now, with your landlord putting you on the street, it’s time to pick up your brush and show the world your true talent.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/passpartout-2-the-lost-artist-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/passpartout-2-the-lost-artist-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Intel Core i3 or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce GTX 460 or Radeon HD 6850",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Flamebait Games",
        "Platform": "PC",
        "Game Size": "4.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kmobsk7x33me"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/passpartout-2-the-lost-artist-preinstalled-steamrip.jpg"
}