{
    "page_url": "https://steamrip.com/patch-quest-free-download-1w/",
    "title": "Patch Quest",
    "description": "Deep within a forgotten jungle labyrinth, a Lasso is all that stands between you and vicious monsters Taking inspiration from roguelikes, metroidvanias and monster taming games – Patch Quest is a deceptively difficult genre-defying whirlwind that will lasso you in with its fast-paced gameplay and keep you coming back to expand your monster collection. Garten of Banban 2\nDo you have the skills to carve a path through this island’s shuffling, patchwork maze? Patchlantis, once an ancient civilisation has now been fully reclaimed by nature. Fierce monsters, rugged terrain and booby-trapped ruins are all a fact of life, here. Even the island’s patchwork terrain will get shuffled each night by a powerful storm\nWhen defeated on a run, you’re sent right back to base camp . And while there’s many shortcuts to unlock and countless powerups to earn, there’s still no escaping the facts – you’ll have to get good This island is crawling with dangerous monsters.\nThey might look friendly, but behind those adorable googly eyes you’ll find the soul of a vicious predator! Fortunately, you came prepared with your monster-taming Lasso . You can mount every monster in the game to claim their skills as your own. There’s more than 50 monster species and all of them have a unique set of skills Some of them can fly, or swim, or leap across hazardous terrain. And all of them can pack a serious punch in combat",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/patch-quest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/patch-quest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i5 7200",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GTX 750",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Lychee Game Labs",
        "Platform": "PC",
        "Game Size": "549 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0 (Build 10645359) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lft9s9nuh82f"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/patch-quest-preinstalled-steamrip.jpg"
}