{
    "page_url": "https://steamrip.com/path-of-the-midnight-sun-free-download-h1/",
    "title": "Path of the Midnight Sun",
    "description": "Meet an endearing cast of characters, find self-acceptance and take on a Demon King as one of three playable protagonists in this heroic JRPG-inspired adventure. Communication and relationships are the key to success in this sprawling world, as your standing with them directly affects your companions’ ability to battle. Put your skills to the ultimate test in Hardcore Mode, or immerse yourself in the world of Path of the Midnight Sun without any stress in Story Mode. ONE PIECE ODYSSEY\nPlan your moves in turn-based combat and delve into the game’s rich narrative. Every choice you make may affect your allies’ mental state, which reflects in combat . Explore the locales with a point-and-click system and manage your time carefully in the Tactical Maps Everything you see in Path of the Midnight Sun is hand-drawn and animated with the Live2D technology We don’t use 3D models as we want to fully preserve the artist’s touch More than 50 characters have been voiced by professional voice actors who have big roles in the gaming & anime industry",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/path-of-the-midnight-sun-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/path-of-the-midnight-sun-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7 (64bit)",
        "Processor": "Intel N4100 (or similar) or better",
        "Memory": "6 GB RAM",
        "Graphics": "DirectX 9/OpenGL 4.1 capable GPU",
        "DirectX": "Version 9.0",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "Studio Daimon",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 10290769 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/10sk2soyp16e"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/path-of-the-midnight-sun-preinstalled-steamrip.jpg"
}