{
    "page_url": "https://steamrip.com/pathogen-x-free-download/",
    "title": "PATHOGEN X",
    "description": "“Pathogen X” is an atmospheric first-person survival horror game in which you have to take on the role of a BRCI special agent named Aiden Clark. He goes on a deadly mission to an underground laboratory to prevent a biological threat and retrieve a sample of Pathogen X.\nBiological Threat: you will encounter various terrifying mutations caused by Pathogen X, and must fight for survival in a literally murderous environment where attacking mutants pose a constant threat to you.\nCooperation and guidance: During the mission, you will be assisted by Special Agent Maya Ackerman , who will be in touch with you via satellite channel to bring you up to speed and assist you in solving complex problems.\nHorror atmosphere: the enveloping atmosphere and scenery emphasize the terrifying environment of the underground laboratory, where every step can be your last.\nWeapons : Find and utilize all the weapons that the underground laboratory complex has to offer in your battle against the terrifying mutants. NINJA SLAYER NEO-SAITAMA IN FLAMES\nDeadly and terrible enemies: in the game you will meet different types of enemies with unique features and abilities, from the simplest and stupid, to insanely strong and smart. Find the right approach to defeat them all.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/pathogen-x-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/pathogen-x-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-7400",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia geforce 1060 6gb",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "BraveCat’Studios",
        "Platform": "PC",
        "Game Size": "14.2 GB",
        "Released By": "RUNE",
        "Version": "Build 17170573 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/E301FBCB42",
        "https://buzzheavier.com/vvkjympkmlrd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/pathogen-x-preinstalled-steamrip.jpg"
}