{
    "page_url": "https://steamrip.com/pathfinder-wrath-of-the-righteous-free-download/",
    "title": "Pathfinder: Wrath of the Righteous Durectly Download",
    "description": "Your path will lead you to the Worldwound, where the opening of a rift to the Abyss has unleashed all-consuming terror across the land. For over a century, the neighboring nations have fought fearlessly, trying to drive the enemy back — but to little avail . Menace from the Deep\nNow, you have the chance to put an end to this conflict, but the path to salvation is far from clear-cut. Will you become a shining angel, backed by noble paladins? Or a powerful necromancer with hordes of immortal undead in your thrall? Or something else entirely? Lead your army and challenge mighty demon lords. Your crusade will set in motion a chain of events that will leave you — and the world itself — forever changed.\nPLAY YOUR HERO, YOUR WAY Create any character imaginable with the flexibility, richness , and depth of the Pathfinder First Edition ruleset. Choose from 25 classes, 12 character races, and more than a thousand spells, feats, and abilities to suit your personal playstyle .\nFOR EVERY CHOICE, A CONSEQUENCE Your decisions have more weight than ever before. Your goal is clear, but you must forge your own path to it. Who will die, and who will live? Who will stay, and who will go? Make your choices, and watch the world around you change.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/pathfinder-wrath-of-the-righteous-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/pathfinder-wrath-of-the-righteous-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel(R) Core(TM) i3-2310M CPU @ 2.10GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce 940M",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Strategy",
        "Developer": "Owlcat Games",
        "Platform": "PC",
        "Game Size": "40.6 GB",
        "Released By": "RUNE emu",
        "Version": "v2.6.0n | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Sh47UQ",
        "https://buzzheavier.com/nqde6ufsr90t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/pathfinder-wrath-of-the-righteous-preinstalled-steamrip.jpg"
}