{
    "page_url": "https://steamrip.com/paw-patrol-grand-prix-free-download-1g/",
    "title": "PAW Patrol: Grand Prix Directly Download",
    "description": "Race around Adventure Bay with all your favorite PAW Patrol pups and up to 4 players at once – but look out for the obstacles left by mischievous Mayor Humdinger The PAW Patrol are on their fastest mission yet – To win the Pup Cup\nDrive around iconic locations including Adventure Bay, Jake’s Snowboarding Resort and The Jungle to find out who will be crowned the winner. Play with friends in this multiplayer championship , where you can pick any of your favorite pups including Chase, Skye or Marshall.\nBut watch out, because sneaky Mayor Humdinger could be just around the corner to turn your race into a crazy catastrophe Give your pup power ups including water balloons and snowballs. Plus, unlock special character skills such as Chase’s siren to slow down the racers around you. Paws and Soul\nThis kart racer includes an easy control option for little ones with auto-acceleration to guide them around the track, as well as a hard mode for experienced track stars. So, buckle up for a PAWsome race around 11 tracks with your best pup pals",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/paw-patrol-grand-prix-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/paw-patrol-grand-prix-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-Bit",
        "Processor": "AMD Ryzen 3 1200 /Intel Core i3-7100",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 550 4GB / Nvidia GTX 750",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Racing",
        "Developer": "3DClouds",
        "Platform": "PC",
        "Game Size rar": "1.7 GB",
        "Released By": "Goldberg emu",
        "Version": "Build 9485238 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cu0mwdn35y7k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/paw-patrol-grand-prix-preinstalled-steamrip.jpg"
}