{
    "page_url": "https://steamrip.com/pc-building-simulator-2-free-download-1n/",
    "title": "PC Building Simulator 2 Directly Download",
    "description": "Start your own PC business in Career Mode, and learn to build and repair PCs. Upgrade your workshop and unlock new tools and equipment as you level up. Turn a profit while going the extra mile for your customers, and watch the positive reviews roll in. Unleash your creativity in Free Build Mode. Select from 1200+ components to plan and execute a powerhouse PC Building Simulator\nInstall upgraded water cooling, overclock your CPU & GPU, and tweak RAM timings to turbocharge performance. Use 3DMark and Cinebench benchmarks to test and optimize your design. Add sequenced RGB lighting, spray paint and stickers to create the ultimate custom rig.\nCustomize your workshop with new walls, floors, posters and furniture, and make your PC building space your own. Go deeper into your builds with realistic hardware and software simulation. Optimize cooling with the Fan Control app and thermal camera, track power consumption with Power Monitor , and add custom water blocks to GPUs, CPUs, RAM and Motherboards.\n18 original tracks that span the genres from French Touch, UK Garage and Grime to Indie Rock, soulful Dub and Synth Pop ballads. Gavin employs original vintage synths and studio equipment throughout the record, elevating the production beyond the purely digital, and creating an album with warmth, character and retro charm .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/pc-building-simulator-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/pc-building-simulator-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-3570 or AMD FX-8350",
        "RAM": "8 GB",
        "Video Card": "NVIDIA GeForce GTX 1050 Ti (4 GB) or AMD Radeon R9 380X (4 GB)",
        "Free hard disk space": "25.1 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Spiral House Ltd",
        "Platform": "PC",
        "Game Size": "9.8 GB",
        "Released By": "Mr_GOLDBERG epic emu",
        "Version": "v1.12.13 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/x2ns5ierdsve",
        "https://megadb.net/ant0hz6m7ut1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/pc-building-simulator-2-preinstalled-steamrip.jpg"
}