{
    "page_url": "https://steamrip.com/peace-death-2-free-download-1q/",
    "title": "Peace, Death! 2 Free",
    "description": "Get Peace, Death! 2 pc game for free instantly and play pre-installed on SteamRiP\nIn a place beyond time and space, the Reapers formed an independent Union so they wouldn’t have to answer to the Horsemen of the Apocalypse anymore. With no acceptable candidate for the position of Union leader, the atmosphere at the Union has descended into blissful anarchy, which is not great for productivity . Fortunately, a new Reaper gets hired as a Sorter one day – you.\nRules\nSend clients to Heaven , Hell, or Purgatory based on the various signs they have. There are tricky clients who interact with each other, interfere with the Reaper’s work, or ignore the basic rules, which means you’ll have to be extra careful when you’re deciding where to send almost everyone.\nClients\nMany clients are unique individuals . Some of them are even a little famous – but any resemblance to actual people is totally, entirely coincidental. Squid Game PC They’re not just unique faces, though – they also have unique abilities. For example, Jailers won’t let you send prisoners anywhere, Bureaucrats will surprise you with inspections, and the Musketeers are one for all and all for one\nThe Reapers Union\nThis is where the Reaper goes after every work day just to go to work again! But first you can accept contracts, view jobs from the Horsemen of the Apocalypse, how to play Squid Game free online roblox get the latest news from this world, and do super important favors for other Union members. After all, every candidate needs faithful friends when there’s an upcoming election.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/peace-death-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/peace-death-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8.1, 10",
        "Processor": "Intel Core2 Duo E4500 (2 * 2200) or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce 7300 GT (512 MB), Radeon X1300 Pro (256 MB)",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Squid Game, Indie",
        "Developer": "AZAMATIKA",
        "Platform": "PC",
        "Game Size": "67.2 MB",
        "Repack By": "SEWN",
        "Version": "v20.11.2021 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uhp8s2vu5ovh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/peace-death-2-free-download-preinstalled-steamrip.jpg"
}