{
    "page_url": "https://steamrip.com/pekoe-free-download-1h/",
    "title": "Pekoe Directly Download",
    "description": "As the newest resident and teahouse owner in town, you’ll learn everything there is to tea. Learn new rituals and tea-making styles to make an endless combination of recipes. Build relationships with the townsfolk , and visit their teahouses to purchase exclusive teaware and ingredients. Noob – The Factionless\nThere are over 10 unique characters in town for you to get to know, with 7 distinct teahouses to visit, and endless tea combinations to try! Make tea in a number of different styles and teaware, and choose what to serve the townsfolk and customers (but don’t forget, they all have their own likes and dislikes!).\nStarting a new life in an old teahouse can come with its own challenges, but it’s nothing a bit of fresh paint, hard work, and a few cups of tea can’t fix Upgrade and customize your teahouse with your own choice of decor, and unlock new items from the townsfolk to help in your tea-making endeavors .\nHaving tea together is more than just a drink, it’s a chance to get to spend time together you’ll learn what tea means to others through various rituals, ceremonies , and one-on-one conversations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/pekoe-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/pekoe-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or greater",
        "Processor": "1.6 GHz (Intel Core i3 or equivalent)",
        "Memory": "4 GB RAM",
        "Graphics": "OpenGL 2.0 Compatible  Card",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Early Access",
        "Developer": "Kitten Cup Studio",
        "Platform": "PC",
        "Game Size": "230 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.1.08 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0fhx83ao6bkk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/pekoe-preinstalled-steamrip.jpg"
}