{
    "page_url": "https://steamrip.com/pentiment-free-download-s1/",
    "title": "Pentiment Directly Download",
    "description": "From Obsidian, this game is a historical narrative-driven game focusing on character development, heavily stylized art, and choice-driven storytelling in early 16th century Bavaria . Players will play as Andreas Maler, a clever illustrator caught up in a series of murders in Tassing and Kiersau Abbey over the course of twenty five years. Players will be responsible for conducting their own investigation to decide the fate of the community, but each decision will have lasting consequences and inexorably draws Andreas closer to the center of an underlying conspiracy. Experience 16th century Europe as the master artists of the time saw them. Organs Please\nArt inspired by great illuminated manuscripts and the earliest printed books becomes a living, breathing world in Pentiment . Choose different academic and social backgrounds and meet a colorful cast of characters as you discover the stories and secrets that lie within the small Bavarian town of Tassing and nearby Keirsau Abbey. In an era of great religious and political change, each decision you make can have a profound impact on the community’s future. Find your own way through this turbulent time and see the consequences of your choices play out over generations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/pentiment-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/pentiment-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "Obsidian Entertainment",
        "Platform": "PC",
        "Game Size": "5.9 GB",
        "Released By": "CODEX emu",
        "Version": "v1.3.1842 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/8yw4g37ibzvy",
        "https://megadb.net/dqumb27440qw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/pentiment-preinstalled-steamrip.jpg"
}