{
    "page_url": "https://steamrip.com/pico-park-free-download-1m/",
    "title": "PICO PARK Free Download",
    "description": "Get PICO PARK for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nThe rule is quite simple: “Get all the keys and get to the goal and clear”, but all 48 levels have special gimmicks designed specifically for multiplayer. At most levels, different gimmicks will appear as you move forward, and you will need to consult with your peers and think about new ways to cooperate . This version is essentially a port of the one we released on the Nintendo Switch in 2019. However, it’s not just a port, it now supports online play.\n[Flexible Level] Each level of PICO PARK can be cleared when players get the key, unlock the door and all players reach it. But, every level requires cooperation to complete. Hoa Indie\n[Battle Mode] Co-op play is the main work of this game, but let’s compete with friends in BATTLE MODE once co-op play is completed.\n[Endless Mode] Even if you complete all 48 stages, you can play ENDLESS mode to aim at high score by collaborating with friends. By collaborating with friends, your score will grow faster.\n[Online Play Mode] You can play together online with people who are far away from you. However, this is a game where communication is very important, so we recommend using Discord or Zoom to play while talking.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/pico-park-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/pico-park-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later 64bit",
        "Memory": "4 GB RAM",
        "Graphics": "2nd Generation Intel Core HD Graphics (2000/3000), 512MB",
        "DirectX": "Version 9.0c",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "TECOPARK",
        "Platform": "PC",
        "Game Size": "181 MB",
        "Repack By": "SEWN",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6gk75nefa28j"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/pico-park-free-download-preinstalled-steamrip.jpg"
}