{
    "page_url": "https://steamrip.com/pixel-noir-free-download-p1/",
    "title": "Pixel Noir",
    "description": "There was something rotten in that old hospital. You were just following your instincts that night. But, it was your pride that killed those people, including your partner on the force. With nothing to exonerate you, on a temporary insanity defense, they threw the book at you.\nFor ten years, you were haunted by unanswered questions , frightened by what you saw, and what you did. Now you’re scraping by as a private eye, operating out of a crummy apartment. One day, a strange case comes along, giving you an opportunity to clear your name once and for all. With your sanity at stake and rent to pay, how can you refuse?\nSolve a wide variety of mysteries as Pinnacle City’s cheapest Private Eye From missing pets to murder investigations, your detective skills will either earn you fortune or face punches.\nHome to a wretched hive of scum and villainy, Pinnacle City is littered with black market trade, grafters, and players of all kinds. From the shadowy alleys of The Sprawl to the sleek skyscrapers of Uptown, each district holds its own charm and mysteries to uncover WitchHand\nEach member of your entourage has their own distinctive personality and skill set. Some will follow you into battle. Others will try and undermine you. Who will you choose for your lineup and will they be with you until the bitter end?\nBad guys can jump out at you from anywhere and each gang in Pinnacle City has its own devastating attacks! But you can beat ’em back in turn-based combat using timed hits and blocks to increase or reduce damage. You can also partner with your entourage members to unleash devastating combo attacks!\nManuscripts teach entourage members a wide variety of skills. Learned skills can then be upgraded by skill points you get from solving major cases. With each upgrade, skills become more powerful, and your entourage can take on even more powerful enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/pixel-noir-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/pixel-noir-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "SSE2 instruction",
        "Graphics": "card with DX10",
        "Storage": "943 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG",
        "Developer": "SWDTech Games",
        "Platform": "PC",
        "Game Size": "968 MB",
        "Released By": "TENOKE",
        "Version": "Build 13402862 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g80gogpsc71d"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/pixel-noir-preinstalled-steamrip.jpg"
}