{
    "page_url": "https://steamrip.com/planes-bullets-and-vodka-free-download-1v/",
    "title": "Planes, Bullets and Vodka",
    "description": "Planes, Bullets and Vodka is an infinite bullet hell game. Grab your manche with your right hand, your vodka with your left hand, and try to beat your own score or to get to the top of the online leaderboards . Perfect to play when you are in a queue for another game or when you want to get your name on the top of a leaderboards.\nThis is a small, re-playable game, the objectives included are to beat your best score, to get on the leaderboards and get achievements. Based on oldschool SHMUP and bullet hells games, like River Raid, 1940, Space Invaders, Truxton, Galaga, etc. Survive as long as possible avoiding walls and enemies, on a increasingly difficult game. Get biggers scores by not missing enemies, for every 10 kill your multiplier increases, if 1 enemy pass, the multiplies return to 0. Invector: Rhythm Galaxy\nHello, my name is Paulo and I’m the solo developer of Planes, Bullets and Vodka and the person behind NukGames. My objective is to bring small and re-playable games, with oldschool mechanics and improved gameplay to STEAM.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/planes-bullets-and-vodka-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/planes-bullets-and-vodka-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® XP or later",
        "Processor": "Dual Core 2.0 GHZ or Better",
        "Memory": "512 MB RAM MB RAM",
        "Graphics": "Compatible with DirectX 9",
        "DirectX": "Version 9.0",
        "Storage": "100 MB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "NukGames",
        "Platform": "PC",
        "Game Size": "77 MB",
        "Released By": "ALI213 emu",
        "Version": "v1.07 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/retbewx7qonv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/planes-bullets-and-vodka-preinstalled-steamrip.jpg"
}