{
    "page_url": "https://steamrip.com/platypus-adventures-free-download-g1/",
    "title": "Platypus Adventures",
    "description": "Platypus Adventures is a family friendly, 3rd person action-adventure game based in an expansive, natural world featuring Australian animals and landscapes. Showcasing an epic story campaign, inspired by classic 3D-platformers such as Croc: Legend of the Gobbos, Banjo-Kazooie and Crash Bandicoot. Follow the journey of Platy as they explore lush environments, uncover a deep mystery and fight evil.\nSwim, climb, swing and slide throughout the adventure, as Platy confronts dangerous situations and thrilling encounters. Unwind in welcoming villages, and encounter a wide variety of wildlife. Discover a vast Australian landscape, as you overcome natural obstacles and face dangerous enemies. Journey through dark caves, mountain peaks and flowing river systems along the way. Uncover hidden treasures, obtain powerful equipment or collect bush tucker to assist and sustain the epic adventure.\nThe environment is packed full of sights and secrets waiting to be discovered. David Richards, solo developer operating Figtree Digital, began work on Platypus Adventures, as a hobby project in 2016 after learning Unreal Engine 4. The game has been developed as a passion-project for years, as an exploration into game development. Platypus Adventures is the debut game for Figtree Digital, seeking to capture David’s local natural world and bring attention to the iconic native species of the area.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/platypus-adventures-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/platypus-adventures-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit or Mac  X 10.9.2 or later",
        "Processor": "Quad-core Intel or AMD processor, 2.5 GHz or faster.",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 series card or higher",
        "Storage": "2400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG",
        "Developer": "Figtree Digital",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "DARKSiDERS",
        "Version": "Build 9094429 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cb5qsszh5ihp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/platypus-adventures-preinstalled-steamrip.jpg"
}