{
    "page_url": "https://steamrip.com/pokemon-legends-arceus/",
    "title": "Pokemon Legends Arceus",
    "description": "Pokémon Legends: Arceus game for free instantly and play pre-installed on SteamRIP\nAction meets RPG as the Pokémon series reaches a new frontier. Get ready for a new kind of grand, Pokémon adventure in Pokémon Legends: Arceus, a brand-new game from Game Freak that blends action and exploration with the RPG roots of the Pokémon series. Embark on survey missions in the ancient Hisui region. Explore natural expanses to catch wild Pokémon by learning their behavior, sneaking up, and throwing a well-aimed Poké Ball. You can also toss the Poké Ball containing your ally Pokémon near a wild Pokémon to seamlessly enter battle.\nYour adventure takes place in the expansive natural majesty of the Hisui region, where you are tasked with studying Pokémon to complete the region’s first Pokédex . Mount Coronet rises from the center, surrounded on all sides by areas with distinct environments. In this era long before the events of the Pokémon Brilliant Diamond and Pokémon Shining Pearl games you can find newly discovered Pokémon like Wyrdeer, an evolution of Stantler, and new regional forms like Hisuian Growlithe, Hisuian Zorua, and Hisuian Zoroark Along the way, uncover the mystery surrounding the Mythical Pokémon known as Arceus. Aragami 2",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/pokemon-legends-arceus-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/pokemon-legends-arceus-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP with service pack 3, Windows Vista, or 7.",
        "CPU": "Intel Core 2 Duo 1.8GHz Or equivalent AMD Athlon 64 x2.",
        "Memory": "2 GB.",
        "Graphics": "DirectX 9.0c compliant card 128MB RAM",
        "HDD": "2 GB of free drive space."
    },
    "game_info": {
        "Genre": "Action, Role-Playing ,RPG",
        "Developer": "Game Freak",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Release by": "Switch release",
        "Version": "v1.1.1 | Full  (Latest) + Yuzu/Ryujinx Nintendo Switch Emulated Release",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/8b8itn55csl2",
        "https://datanodes.to/t7d9k10bx17p/Pokemon-Legends-Arceus-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/pokemon-legends-arceus-preinstalled-steamrip.jpg"
}