{
    "page_url": "https://steamrip.com/police-shootout-free-download-1l/",
    "title": "Police Shootout",
    "description": "Police Shootout is a turn-based FPS game. Start your policeman’s career, solve cases, gain experience, and begin your adventure in San Adrino now Your name is Scott Price and you just started your first shift as police officer in a small city of San Adrino. You moved here from a bigger place where street gang fights are everyday life. Why did a policeman like you – the one who was doing well in a big city suddenly wants to take a chance in a place like this? What are you looking for here? What is your reason? Or maybe What is your secret ?\nStart your adventure with “Police: Shootout ” and meet not only the main character (Scott Price), but also everyone who is important to his story. As a good policeman, you will answer even the most difficult calls. A shop robbery, or even a hostage situation – you have to be prepared for anything But remember – it’s only up to you how you approach a specific situation . There are many possibilities to do this right – sometimes the use of a gun is necessary, and sometimes a well-chosen argument is the best possible weapon. Card Shark",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/police-shootout-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/police-shootout-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 Bit / Windows 8 64 Bit / Windows 10 64 Bit",
        "Processor": "Intel Core i3 3.0 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "1050 Ti",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Games Incubator",
        "Platform": "PC",
        "Game Size": "7.7 GB",
        "Released By": "FLT",
        "Version": "Build 8835415 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nzrwgl22woho"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/police-shootout-preinstalled-steamrip.jpg"
}