{
    "page_url": "https://steamrip.com/poly-bridge-free-download-1k/",
    "title": "Poly Bridge",
    "description": "Get Poly Bridge PC game for free instantly and play pre-installed on SteamRiP\nUnleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles. Enjoy hours of physics-based puzzle solving in the Campaign and then jump in the Sandbox to create your own bridge designs and puzzles. Challenge friends and the rest of the Steam Workshop community to solve your puzzles and download more levels submitted by other players. Teardown\nEnjoy hours of bridge- building fun with loads of levels to solve, ranging from simple light car bridges to multi-deck draw-bridges and jumps, just to name a few Levels get increasingly challenging from the engineering aspect and restrictions are also imposed on the resources you can use to build your bridge. What would an awesome bridge-builder game be without an equally awesome Sandbox ? Go wild and create the most complex bridge the world has ever seen, or just an absurd creation that pushes the mechanics of the game in a new direction, and if you’re feeling like it publish your design online as a puzzle level on the Workshop for everyone to try and solve",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/poly-bridge-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/poly-bridge-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "1GHz",
        "Memory": "2 GB RAM",
        "Graphics": "512Mb",
        "DirectX": "Version 9.0",
        "Storage": "150 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Dry Cactus",
        "Platform": "PC",
        "Game Size": "157 MB",
        "Repack By": "Pirates",
        "Version": "v1.0.7 Hotfix 3 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/4Y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/poly-bridge-free-download-preinstalled-steamrip.jpg"
}