{
    "page_url": "https://steamrip.com/popslinger-free-download-1g/",
    "title": "PopSlinger",
    "description": "PopSlinger is a vibrant, narrative -focused musical shooter inspired by ‘80s and ‘90s New Retro culture. Join Ria Carbon, a funky heroine on a stylish quest to save the world from sinister invaders from another dimension using soda-powered guns. Backing Ria up is former PopSlinger heroine, Gin! Experience the whimsical story of Ria and Gin as they fight against the “Corazones”, STRIDE VR people whose hearts have been corrupted by the dark forces from the other dimension, all while grooving to a fully dynamic soundtrack that reacts to your in-game performance in real-time.\nImmerse into an epic adventure with a dreamy aesthetics inspired by 90’s Japanese animation, brought to life with a marker art style and VHS-infused 2D sprites, with fully-voiced dialogue cutscenes employing vibrantly animated hand-drawn portraits Unleash a soft drink-powered magical arsenal Groove to a dynamic soundtrack inspired by an eclectic mix of music genres (Future Funk, New Jack Swing and more!) Enjoy a narrative inspired by 90’s magical girl shows and classic Japanese films and television, loaded with special effects",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/popslinger-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/popslinger-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core2 Duo E8400, 3.0GHz or AMD Athlon 64 X2 6000+, 3.0GHz or higher",
        "Memory": "4 GB RAM",
        "Graphics": "Geforce 9600 GT or AMD HD 3870 512MB or higher",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Funky Can Creative",
        "Platform": "PC",
        "Game Size": "682 MB",
        "Released By": "TiNYiSO/ALI213",
        "Version": "Build 8470271 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8ojsp6ac5s92"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/popslinger-preinstalled-steamrip.jpg"
}