{
    "page_url": "https://steamrip.com/popucom-free-download/",
    "title": "POPUCOM",
    "description": "POPUCOM is a multiplayer co-op platform adventure game. As an adventurer, you are summoned to an unknown planet to embark on an exoplanet adventure with your friends. You will face various enemies and use engaging items and techniques to eliminate threats and restore the world to its former glory. Work together with your friends to take on a variety of challenges. Effective cooperation and strong teamwork are the only ways forward. Whether it’s facing powerful enemies or tackling complex puzzles, you’ll need to work together to triumph!\nColor plays a crucial role in this fantastical world. It is key to everything from puzzle solving to combat. You’ll need to switch colors to activate mechanisms and solve puzzles, and shoot Pomu gel in different colors to change the surroundings and impact enemies. Master the techniques of color switching and match-3 shooting to overcome puzzles and defeat enemies! During the journey, you will acquire items known as super artifacts. Examples of these wondrous artifacts include Rollo the Bomb, Captain Kitty, Barrier Bot, and Power Kid. Each of them grants you a unique ability that helps remove obstacles and solve puzzles in your adventure. STAR WARS: Bounty Hunter",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2543180/5bedf059e10c74b8cc21152d879fecb4161566f2/ss_5bedf059e10c74b8cc21152d879fecb4161566f2.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2543180/54caabbe1e0d086283cdd6349de1ea50be692a7e/ss_54caabbe1e0d086283cdd6349de1ea50be692a7e.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit",
        "Processor": "Intel Core i5-6400/AMD Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 Ti/AMD Radeon RX 550/Intel Arc Graphics",
        "DirectX": "Version 11",
        "Storage": "15 GB available space",
        "Additional Notes": "SSD is recommended. The above specs should enable you to play on Low quality preset at 1080p 30fps."
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Hypergryph",
        "Platform": "PC",
        "Game Size": "8.1 GB",
        "Released By": "RUNE Emu (Ty Let’sРlay csrin)",
        "Version": "v1.0.1",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/DoAW9l",
        "https://buzzheavier.com/euqs3bavq1mw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/popucom-preinstalledt-steamrip.jpg"
}