{
    "page_url": "https://steamrip.com/post-trauma-free-download/",
    "title": "Post Trauma",
    "description": "Post Trauma is a Puzzle Horror Game and Red Soul Games is a small studio made up of fans of old school survival horror. We have taken a lot of inspiration from several genre-defining classics and we hope it shows\nIn Post Trauma , players control Roman (Togo Igawa), a tormented train conductor who awakes to find himself in a surreal dimension following a terrible panic attack. Faced with horrifying architecture and nightmarish abominations, Roman can choose to defend himself with an array of weapons or try to find the path of least resistance.\nInspired by key staples of the Survival Horror genre, Post Trauma blends fixed camera angles with stunning visuals through Unreal Engine 5 to create a truly unsettling, yet familiar horror experience. But just when you think you have the answers, this hellscape changes the questions as you enter the unknown to face your greatest fears.\nTo survive this cruel world, you must piece together an ongoing mystery across several, seemingly unrelated settings. Deducing your environments to find unlikely hints and discovering precious tools in unexpected places will help you make continued progress.\nAs you find clues and solve puzzles , you’ll gradually learn more about where you are and how you can escape, using a delicate mix of patience and cunning to stay alive. And maybe a pad and paper too.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/post-trauma-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/post-trauma-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 10",
        "Processor": "Intel Core i5-7400 or equivalent",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070 or equivalent",
        "DirectX": "Version 12",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "RED SOUL GAMES",
        "Platform": "PC",
        "Game Size": "9.5 GB",
        "Released By": "RUNE emu",
        "Version": "v1.04 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/c6imah8kdtmv",
        "https://megadb.net/omnemqra68qe"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/post-trauma-preinstalled-steamrip.jpg"
}