{
    "page_url": "https://steamrip.com/potion-permit-free-download-1n/",
    "title": "Potion Permit Directly Download",
    "description": "The town of Moonbury has always been wary of the advances of the outside world, preferring to rely on their traditional methods of healing. Until one day, when the mayor’s daughter falls ill, and the local witch doctor can do nothing to help her, they are forced to look outside their small community for help.\nThe Medical Association decides to send their most accomplished chemist – you – to help cure the mayor’s daughter and convince the residents of Moonbury of the wonders of modern alchemy. Gain their trust and tend to each person when they fall ill in this open-ended sim RPG.\nTake care of residents. Moonbury has around 30 unique inhabitants who will occasionally fall ill and call for your aid. Sick residents will have their schedules interrupted while they recuperate in bed. Diagnose symptoms and find a cure! Hmm… a low heart rate and a bloated liver.\nShoulder cramps , perhaps? No, these are sure signs of burning lungs. This patient has been consuming too much gelatin! Easily remedied; you’ll just need to craft some Minty Goblet . Gather ingredients out in the world. Once you’ve decided on a potion, ointment, or salve, gather ingredients from the surrounding environment using your tools. The Outbound Ghost\nUpgrade your hammer, axe, and sickle for new swings and attacks to help with your day-to-day tasks. Watch out for changing weather conditions! You may find yourself caught out in the rain, a freezing blizzard, or even the baking heat of a desert .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/potion-permit-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/potion-permit-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-2100 or AMD Phenom II X4 965",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTS 250, 1 GB or AMD Radeon R7 240, 2 GB",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, RPG",
        "Developer": "MassHive Media",
        "Platform": "PC",
        "Game Size": "312 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.2 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m61t5wooxt21"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/potion-permit-preinstalled-steamrip.jpg"
}