{
    "page_url": "https://steamrip.com/power-revolution-2021-edition-free-download-1z/",
    "title": "Power & Revolution 2021 Edition",
    "description": "In Power & Revolution 2021 Edition, play as the Head of State and extend your influence around the globe. By playing as several countries, try to change the destiny of our planet with orchestrated actions. Play as the head of the legal or illegal opposition and seize power Main new Features for 2021 administration of the EU, Covid vaccinations, Biden’s Challenge, political coalitions, diplomatic negotiations, worldwide tax and free-trade agreements.\nPower & Revolution is a simulation of our current world, recreating its features in-depth and across a number of domains: economic, political, military, social, financial, environmental, energetic, transportation All countries of the world are represented with their own features. The calculation and scenario engines include more than 100,000 data, 15,000 texts and 10 hours of recorded dialogue.\nA detailed and animated 3D world map helps to support the players, with all the borders, regions and important and strategic locations of the world The game combines management stages of economics, commerce, wargames, construction, espionage, simulation, and political influence and manipulation.\nPlayers can opt for the management of just one country or several simultaneously and design collaborative strategies to change the world’s destiny. There are game settings across multiple domains: degree of activity of terrorist organizations, probabilities of natural disasters , reactivity of populations, outbreak of wars. More than twenty contextual scenarios with current events from today’s world are integrated.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/power-revolution-2021-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/power-revolution-2021-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 8, 7",
        "Processor": "1.6 GHZ",
        "Memory": "4 GB RAM",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Eversim",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "SKIDROW",
        "Version": "Build 7675455 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h21q4xytpehs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/power-revolution-2021-edition-preinstalled-steamrip.jpg"
}