{
    "page_url": "https://steamrip.com/prison-boss-vr-free-download-s1/",
    "title": "Prison Boss VR Directly Download",
    "description": "Prison Boss VR is a crafting and trading game turning your VR space into a jail cell! Craft cigarettes , alcohol and cookies for other inmates Customize your cell as your reputation grows Earn cash until you can’t store it anymore and become the Prison Boss The crafting system in the game makes use of controllers in unique ways. Each crafting recipe consist in a series of gestures you’ll soon know how to perfect. Roll your cigarettes, fill up bottles, cook cakes, sculpt metal, create ropes out of pieces of fabric and more\nThe game features 11 different craftables items, made out of 6 different base resources. Each morning, the trader comes to see you. You can sell the products from your hard working nights or use them to complete jobs and earn some reputation along with some useful rewards. Dr. Fetus’ Mean Meat Machine\nIf you’re looking to buy stuff , prices change every day, so keep an eye out if you’re in need of specific items Create your perfect workshop by freely placing the furniture you buy where you want it Add some posters on the wall or lamps to give it some style But keep it functional, you’ll need space to hide your contraband and your money stacks from the guards",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/prison-boss-vr-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/prison-boss-vr-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "TREBUCHET",
        "Platform": "PC",
        "Game Size": "493 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 3725807 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ekkekv5fnfyd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/prison-boss-vr-preinstalled-steamrip.jpg"
}