{
    "page_url": "https://steamrip.com/pro-basketball-manager-2022-free-download-1v/",
    "title": "Pro Basketball Manager 2022 Free Download",
    "description": "Get Pro Basketball Manager 2022 for free instantly and play pre-installed on SteamRiP\nHave you ever dreamt of replaying the last possession during the playoffs’ finals? Which player should have taken that last shot? With Pro Basketball Manager 2022 you become the coach of your favorite team and will be able to change history. With more than 160 playable competitions – including 25 international competitions, 11 continental competitions, 12 female competitions, over 40 national cups – spread across 55 countries, you will never run out of new opportunities, each team will face different challenges depending on their league, budget or history\nFor the first time Pro Basketball Manager also features 2 licensed leagues with official names, logos and photos. Through your journey to the hall of fame, you must not only recruit and train your players, but also take part in live games , giving on-court instructions or scouting to find the stars of tomorrow. Ensure the stability of your team by managing the day-to-day operations such as club finances , staff management or improving your arena. Will you lead your team to glory or lead yourself to unemployment? It all depends on you with Pro Basketball Manager 2022. Get it now to enjoy the most realistic basketball management game ever made.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/pro-basketball-manager-2022-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/pro-basketball-manager-2022-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1+) and Windows 10",
        "Processor": "x64 architecture with SSE2 instruction set support.",
        "Memory": "4 GB RAM",
        "Graphics": "DX10, DX11, DX12 capable.",
        "DirectX": "Version 10",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Sports, Strategy",
        "Developer": "Umix Studios",
        "Platform": "PC",
        "Game Size": "467 MB",
        "Released By": "SKIDROW",
        "Version": "Build 7932989 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/4mmj9pa1w2e8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/pro-basketball-manager-2022-preinstalled-steamrip.jpg"
}