{
    "page_url": "https://steamrip.com/pro-soccer-online-free-download-w1/",
    "title": "Pro Soccer Online Free",
    "description": "Pro Soccer Online game for free instantly and play pre-installed on SteamRiP\nPro Soccer Online is a 1st/3rd person, highly skill based, online multiplayer soccer game. It offers a sports game experience unlike any other with smooth, physics based, input driven gameplay that is competitive and rewarding with no pay to win mechanics .\nWhat makes Pro Soccer Online so good?\n1) Input Driven Gameplay Gameplay in Pro Soccer Online is completely input driven, not animation driven like many other sports games. Your decisions and skills on the field are the only thing that matter in this game.\n2) Dedicated servers Pro Soccer Online has dedicated servers in NA East (Ohio), SA East (Sao Paulo), EU Central (Frankfurt), and AS East (Seoul) with the potential to add more regions in the future if needed.\n3) Matchmaking Pro Soccer Online offers a matchmaking system for you to find a match solo, or with a party of Steam friends. The 2 modes available for matchmaking right now are 6v6, and 3v3 with a chance of more being added in the future.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/pro-soccer-online-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/pro-soccer-online-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Quad-core Intel or AMD processor of 2.5 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card or higher",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Sports, Early Access",
        "Developer": "Skywall Studios LLC",
        "Platform": "PC",
        "Game Size": "520 MB",
        "Multiplayer By": "Online-fix.me",
        "Version": "v1.1.33 | Full  (Latest) + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0nt9q23y33fc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/pro-soccer-online-preinstalled-steamrip.jpg"
}