{
    "page_url": "https://steamrip.com/pro-basketball-manager-2023-free-download-1r/",
    "title": "Pro Basketball Manager 2023",
    "description": "Basketball is more than coaching , if you want your favorite team to succeed you will also have to oversee the recruitment of new players and manage your arena to secure new sources of funding for your team. PBM23 lets you be the coach as well as the General Manager of any professional team around the world .\nYou can choose from 82 domestic leagues , including 10 women’s leagues, from 60 different countries across Europe, America, Asia and Oceania. With more than 2000 teams and 50 000 players it is not hard to see why PBM23 is truly a global basketball management game. Moviehouse\nOverall, including national and continental cups , you’ll have access to more than 160 playable competitions. Once your reputation as a coach is established you might be offered a job as a head coach of a national team. International basketball is now more competitive than ever. Will you be up to the task of taking your national team to the top of your continent and then the world? The user interface has been redesigned, with a complete overhaul of the player page that now features updated statistics and records as well as highlighted player capabilities by profile.\nNew customisable 3D arenas are coming to PBM23 with enhanced lighting effects for a more realistic look. Pro Basketball Manager has never looked so good – make your arena bigger, more modern, more unique, make it shine and get the crowd cheering . The perfect setting for a successful season",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/pro-basketball-manager-2023-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/pro-basketball-manager-2023-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1+), Windows 10 and Windows 11",
        "Processor": "x64 architecture with SSE2 instruction set support.",
        "Memory": "8 GB RAM",
        "Graphics": "DX10, DX11, DX12 capable",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Sports, Strategy",
        "Developer": "Umix Studios",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "SKIDROW",
        "Version": "Build 10599799 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lg7gojk2e1e9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/pro-basketball-manager-2023-preinstalled-steamrip.jpg"
}