{
    "page_url": "https://steamrip.com/prodeus-free-download-1s/",
    "title": "Prodeus",
    "description": "Prodeus is a first-person shooter of old, re-imagined using modern rendering techniques and technology. Experience the quality you’d expect from a modern AAA game, designed with retro aesthetics and gameplay that invoke the tech-imposed limits of older hardware.\nThe game features a hand-crafted campaign from industry FPS veterans, co-op and competitive multiplayer play drawing on classic modes*, a fully integrated level editor, and a built-in community map browser for instantaneous action with nearly limitless levels to play. Shooters past and present collide with graphics that combine today’s high-quality 3D tech with retro visuals.\nExperience over-the-top explosions of lo-fi pixels and hi-tech particle effects as you clash against the Prodeans and forces of Chaos . Steel yourself for fast and frantic nonstop action. Blast and blaze your way through hordes of chaos-spawned creatures using an arsenal of classically over-the-top weapons. Splatter the steel walls and alien halls with the blood of your enemies. SpiderHeck\nExperience the gory thrills of the elder shooters, dialed up to 11 thanks to Prodeus’s delightfully demented dismemberment system. Unleash your inner map designer with Prodeus’s powerful but easy-to-use level editor, and keep the visceral combat fresh with a built-in browser filled with community-created maps.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/prodeus-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/prodeus-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "CPU @ 2+ GHz, 4 cores",
        "Memory": "2 GB RAM",
        "Graphics": "NVidia GTX 580 or AMD HD 7870",
        "DirectX": "Version 9.0",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Bounding Box Software Inc.",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "GOG",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/htto0hhsfkax"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/prodeus-preinstalled-steamrip.jpg"
}