{
    "page_url": "https://steamrip.com/project-wingman-free-download/",
    "title": "Project Wingman",
    "description": "Project Wingman is a combat flight action game with an emphasis on polished and refined gameplay, true-to-its-roots inspirations, and an engaging single player experience. Perfect for those who aren’t looking for a simulator experience, with the ease of pick up and play, all the way to those who want a fast-paced challenging flight action game. Billy Saves the World\nDogfight, strike, and fly through combat zones based off an alternate history of Earth. Either over the cold waters of the Bering Strait, attacking tanks in the brutal environments of Yellowstone magma fields, or diving through the Redwoods to strike targets of opportunity in the Pacific Northwest, across the oceans, above the scarred lands of the world, this war will take you from exotic battlefield to exotic battlefield, all while going up against odds way above your pay grade.\nPure Combat Flight Action Exotic weaponries such as railguns and geothermal-powered armaments will be ready to pluck you out of the sky if you’re careless. Whether you are an attack aircraft pilot, skimming the ground with a gatling gun and rocket launchers attached to your wing, or an interceptor with long range, almost sniper-like missiles at your disposal, it will be up to you to prove yourself as an Ace pilot.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/project-wingman-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/project-wingman-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/8/10 64-bit",
        "Processor": "Intel i5-2300 or AMD FX-6350 equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 660Ti / R9 270 equivalent",
        "DirectX": "Version 11",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "Sector D2",
        "Platform": "PC",
        "Game Size": "6.3 GB",
        "Released By": "TENOKE",
        "Version": "v2.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/6hNiAs",
        "https://megadb.net/76elq0c7vyi6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/project-wingman-preinstalled-steamrip.jpg"
}