{
    "page_url": "https://steamrip.com/project-downfall-free-download-n1/",
    "title": "Project Downfall",
    "description": "Project Downfall is not a boomer shooter . Check the demo to see how the action plays and flows or check the games Discord which is full of clips with insane combos and cool encounters sent in by the community. The world we have known is coming to an end. The European Union is in disarray, with a new superpower emerging on the horizon: The Novorussian Federation, which already welcomed new members such as Lithuania, Ukraine and Poland. Enter the first mega-city of Europe: Crimson Tide. Synthwave FURY\nThe free city of Crimson Tide(the representative free city of this New World Order, showing that both systems can co-exist in harmony, forging a better future for its citizens) was raised as the representative pinnacle of humanity’s achievements on the border of Germany and Poland, in agreement to respect the sovereignty of both the EU/Transatlantic States and Novorussian Federation. But, as history has taught us, this is true only in theory.\nGoverning parties are not political but rather economical, pointing to a new direction of leading nations. Gone are the days of political parties, replaced by voting with your wallet for the corporate entity which provides everyday life with the highest benefits. Leading corporate entities deal most of the cards, keeping its citizens in check with mandatory medication.\nroject Downfall (PDF for short) is a pill poppin’ first person adventure with semi-tactical in your face combat and unique perks and quirks. You start in your apartment getting ready for another routine day at the office and your adventure starts from there. The storyline will progress with completion of main missions and branch out depending on various factors (chosen path, mental state, specific choice/interaction/pickup/etc).",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/project-downfall-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/project-downfall-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or newer",
        "Processor": "Dual core from Intel or AMD at 2.8 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "nVidia GeForce 260, ATI/AMD Radeon HD2600/3600",
        "DirectX": "Version 11",
        "Storage": "5000 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "MGP Studios, Solid9 Studio",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "GOG",
        "Version": "v1.0.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m7mecwomlpjg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/project-downfall-preinstalled-steamrip.jpg"
}