{
    "page_url": "https://steamrip.com/promise-mascot-agency-free-download/",
    "title": "Promise Mascot Agency",
    "description": "From the creators of Paradise Killer comes a mind-bending open-world narrative adventure mascot management simulator where mascots are more than just symbols – they’re unpredictable forces of nature ! Step into the chaos, unravel the conspiracies, drive a tiny truck and try to keep it all together in Promise Mascot Agency!\nWelcome to the Mascot Hustle You thought mascots were just fluffy, innocent brand ambassadors? Think again. The Mascots are all living, breathing, fully formed personalities , with dreams, fears, and the occasional breakdowns of their own- just like us! Whether it’s Trororo, a charming cat who’s a little too obsessed with “adult video” or sweet, silken To-Fu, who can’t stop sobbing, your job is to befriend, mentor , and (hopefully) get these mascots to finish their jobs without causing a major catastrophe. Used Cars Simulator\nPlay Your Cards Right Sending your mascots out to work is never as easy as it sounds. One minute they’re promoting delicious food, the next they’re stuck in a doorway or starting a kitchen inferno. Need help? Good thing Kaso-Machi is full of intrepid everyday heroes ready to lend a hand (if you’ve managed to befriend them, of course). Unlock Hero Cards, featuring Kaso-Machi’s lovable local weirdos like Captain Sign , Japan’s only road-sign superhero (don’t ask questions), or Mama -San, a bar owner with a serious latex collection. These heroes will step in to provide help when your mascots inevitably lose control.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/promise-mascot-agency-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/promise-mascot-agency-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core i5-6590",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 950",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation",
        "Developer": "Kaizen Game Works",
        "Platform": "PC",
        "Game Size": "7 GB",
        "Released By": "TENOKE",
        "Version": "Build 18042744 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/tzn6jdx4ru0p",
        "https://datanodes.to/xpkbdvbkpl24/Promise-Mascot-Agency-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/promise-mascot-agency-preinstalled-steamrip.jpg"
}