{
    "page_url": "https://steamrip.com/pronty-fishy-adventure-free-download-1t/",
    "title": "Pronty: Fishy Adventure",
    "description": "Get Pronty: Fishy Adventure PC game for free instantly and play pre-installed on SteamRiP\n“Pronty: Fishy Adventure” is an underwater Metroidvania game set in a fallen underwater city “Royla” once thriving but now full of dangerous creatures combined with marine life and polluted waste. Be the weirdly cute “Pronty” and its robotic weapon /friend swordfish, players will fight with the various monsters and even some Behemoth to bring back the hope to this abandoned city and reveal the truth of Pronty’s origination. Encounter all sorts of creatures formed from a ghastly fusion of sea critters and marine debris .\nWhile some might look small and amusing , others might pose more problems. After all, there’s always a bigger fish. Swap out useful abilities and upgrades in Pronty’s “Memory Board” to put together strategies that work for every situation and play style The realistic underwater environment and best battle combat experience, made by sound design studio IMBA interactive, and 18light game previous work “Behind the Screen” composer Paul Su’s score accompanies players during their journey.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/pronty-fishy-adventure-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/pronty-fishy-adventure-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 920 | AMD R7 370",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "18Light Game Ltd FunZone Games",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Repack By": "CODEX",
        "Version": "v2.0.0 (Build 8073148) | Full  (Latest) + Neptune’s Hall DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zpcfujk0dhx4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/pronty-fishy-adventure-free-download-preinstalled-steamrip.jpg"
}