{
    "page_url": "https://steamrip.com/psychonauts-2-free-download-1o/",
    "title": "Psychonauts 2",
    "description": "Razputin “Raz” Aquato , trained acrobat and powerful young psychic, has realized his lifelong dream of joining the international psychic espionage organization known as the Psychonauts But these psychic super spies are in trouble. Their leader hasn’t been the same since he was rescued from a kidnapping, and what’s worse, there’s a mole hiding in headquarters. We Are The Caretakers\nCombining quirky missions and mysterious conspiracies , Psychonauts 2 is a platform-adventure game with cinematic style and tons of customizable psychic powers. Psychonauts 2 serves up danger, excitement and laughs in equal measure as players guide Raz on a journey through the minds of friends and foes on a quest to defeat a murderous psychic villain.\nExperience an imaginative, cinematic story that mixes humor and intrigue, brought to you by legendary game designer Tim Schafer (Grim Fandango, Brütal Legend, Broken Age). Explore unique environments using Raz’s ability to dive into people’s brains to battle their inner demons, unlock hidden memories, and resolve their emotional baggage.\nLeap acrobatically through the air, traversing tightropes and trapezes in a varied, challenging, and joyful platforming experience. Wield a powerful array of psychic powers to blast, burn and levitate things, or even slow down time itself to solve environmental puzzles and battle strange enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/psychonauts-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/psychonauts-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64 bit)",
        "Processor": "Intel Core i3-3225, AMD Phenom II X6 1100T",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1050, AMD Radeon RX 560",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Double Fine Productions",
        "Platform": "PC",
        "Game Size": "29 GB",
        "Released By": "CODEX Emu",
        "Version": "v1101213 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/zkukglv5t558",
        "https://1fichier.com/?om2hs1xyb4vn627v48oo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/psychonauts-2-preinstalled-steamrip.jpg"
}