{
    "page_url": "https://steamrip.com/pub-sim-free-download/",
    "title": "Pub Sim",
    "description": "Welcome to Pub Sim, this is where the trials and tribulations of running your very own tavern come alive. Will you spruce it up to be the hot-spot of the town? Or become a dive bar catering only to the outcasts of society.\nYour customers won’t appreciate a dirty premises , get cleaning to really bring the shine out of those dusty surfaces. Reinvest into the building to expand further, purchase furniture to increase customer retention and manage prices, each aspect will directly affect your; reputation, efficiency and overall aesthetic of your Pub.\nKeep your stocks high, you’ll need everything from the cheapest to the most premium if you’re going to satisfy your customers, or perhaps branch out into Wines and Spirits for added challenges and rewards. Carefully pour your drinks, each drop will be another cut into your margins .\nRunning a Pub can be hard work, why not kick back and have someone else do it for you? Be warned though, they can’t do everything and you’ll still be needed for top business decisions Just try not to bankrupt yourself with their wages. Sports: Renovations",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/pub-sim-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/pub-sim-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "1st impact games",
        "Platform": "PC",
        "Game Size": "7.9 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/JksShZ",
        "https://megadb.net/sl9f3cpcnjmf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/pub-sim-preinstalled-steamrip.jpg"
}