{
    "page_url": "https://steamrip.com/punk-wars-free-download-1s/",
    "title": "Punk Wars",
    "description": "Punk Wars Download PC Game In Direct Link for free on SteamRIP\nThe years go by and another cycle has come to an end. Our civilization has crumbled due to our greed and selfishness. Now we know that to avoid repeating the same mistakes, we need to stand united… and ours is the banner, under which humanity can thrive again. Our technology, philosophy and way of life are the ones that can finally bring happiness to the world… we just need to convince a few stubborn leaders. Punk Wars is a combat and tactics-oriented strategy drawing inspiration from the classic turn-based 4X titles.\nSet in a post-apocalyptic world, in which the ruins of a once powerful megacity become the arena for a deadly fight between four newly emerged corporations, trying to assert dominance for both their unique technology and philosophy of life. Become the powerful leader of the messianic steampunk, tenebrous dieselpunk , militaristic steelpunk or technocratic atompunk; explore the ruins of a bygone civilization, where resources are scarce and the dangers way too common. Develop your infrastructure and technology that will secure your triumph. Create a winning strategy and a playstyle for each faction, utilizing their distinctive skills and units.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/punk-wars-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/punk-wars-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-bit",
        "Processor": "3.2 GHz Dual Core",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 780 or equivalent with 2 GB of video RAM. A dedicated video card is required.",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Strategy Forge S.A.",
        "Platform": "PC",
        "Game Size": "5.94 GB",
        "Repack By": "CODEX",
        "Version": "v1.0.6 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yt1bmzlz0hha"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/punk-wars-free-download-preinstalled-steamrip.jpg"
}