{
    "page_url": "https://steamrip.com/quake-ii-enhanced-free-download-1u/",
    "title": "Quake II Enhanced",
    "description": "Enjoy the original, authentic version of Quake II, now with up to 4K* and widescreen resolution support, enhanced models, improved enemy animations and gore, improved and restored AI behaviors , enhanced cinematics, dynamic and colored lighting, anti-aliasing, depth of field, the original, heavy rock soundtrack by Sonic Mayhem, and more. Mankind is at war with the Strogg, a hostile alien race that attacked Earth. In response, humanity launched a strike on the Strogg homeworld it failed, but you survived. Outnumbered and outgunned , fight your way through fortified military installations and shut down the enemy’s war machine. Only then will the fate of humanity be known. Garten of Banban 4\nQuake II includes both original mission packs: “The Reckoning,” featuring 18 campaign levels and 7 deathmatch maps, and “Ground Zero,” featuring 15 campaign levels and 14 deathmatch maps. In the first official expansion pack for Quake II, you are part of an elite commando force that must infiltrate a Strogg site. Once inside, you must scour industrial landscapes, crawl through waterways and air ducts, navigate treacherous canyons teeming with vicious mutants, stow away on an alien spacecraft, and destroy the enemy’s secret moon base. In the second official expansion pack for Quake II, you, and a few marines are the lucky ones.\nYou’ve made it to the surface of Stroggos in one piece and are still able to contact the fleet. The Gravity Well, the Strogg’s newest weapon in its arsenal against mankind, is operational. With the fleet trapped around Stroggos, only 5% of ground forces surviving, and that number dwindling by the second, your orders have changed: free your comrades and destroy the Gravity Well.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/quake-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/quake-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10 64-bit version",
        "Processor": "Intel Core i5-3570 #3.4GHz or AMD Ryzen 3 1300X @ 3.5GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 TI (2GB) or AMD HD 7750 (1GB)",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "id Software, Nightdive Studios, MachineGames",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Released By": "CODEX emu",
        "Version": "v1.0.5663 | Full  + Q2 Classic + Add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/so685fnxvzak",
        "https://pixeldrain.com/u/WEcPMYdd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/quake-2-preinstalled-steamrip.jpg"
}