{
    "page_url": "https://steamrip.com/quiet-on-set-free-download/",
    "title": "Quiet on Set",
    "description": "You are filming the summer’s hottest new movie with Hollywood’s best acting talent and production crew in a historic mansion. This all comes to a screeching halt when a sudden murder occurs on set. Use your interpersonal skills and analytical prowess to investigate the murder. Who among us could have committed such an atrocity? And WHY? There is a storm of ulterior motives, egos, and agendas bubbling beneath the surface of the seemingly tight-knit movie team. Explore each room in the mansion and interview the actors and production crew members to see if you can piece together who dunnit! But be careful, rub someone the wrong way, and you may be the next victim United Penguin Kingdom\nNavigate your way through 10 separate murder mystery campaigns to figure out who dunnit and why! Each mission has its own unique set of twists and turns with the conversations that you control. Along with background stories from each character designed to either help or mislead you, you will have to figure out who is telling you the truth and who is lying\nUse your Journal to build up clues towards solving the murder. Also, be on the lookout for collectibles which are hidden throughout the mansion, collect them all for a perfect score! Make your way up through 10 ranks of Detective career promotions as you solve each murder . Interview each character in the mansion and collect all the possible clues that they are withholding to achieve a perfect score. It isn’t easy to get",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/quiet-on-set-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/quiet-on-set-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-540, 3.07 GHz or AMD FX-4350, 4.2 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce 1060 or AMD Radeon HD 6670",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Northern Dev Studio",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/srysf85sgedl",
        "https://buzzheavier.com/d6oalpblphcb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/quiet-on-set-preinstalled-steamrip.jpg"
}