{
    "page_url": "https://steamrip.com/railgrade-free-download-1w/",
    "title": "RAILGRADE",
    "description": "Construct intricate railway networks and use the power of trains to connect vital industries with the resources they require. Manage inputs and outputs to optimise production, and create efficient supply chains using multi-level tracks and a variety of unique engine types. Customise your trains using different engines and freight types, with hundreds of unique engine and cargo combinations. Create efficient supply chains by connecting industrial sources and placing dozens of busy trains on the map. Wizard with a Gun\nCombine strategic decision-making with creative construction in order to rebuild a thriving industrial colony. Succeed, and you might just impress your corporate overlords enough to be allowed back home to earth. Help restore prosperity to an industrial colony across a single player campaign with over 50 missions.\nSpend tokens awarded by each mission and use them to unlock new industries , upgrades and options. Use effortless construction tools to instantly build and manage a busy railway network packed by trains. Optimise your train set-up and place tracks strategically to navigate challenging environmental terrain and create the most effective delivery route possible. Control the flow of resource production through careful management of inputs and outputs. Watch out for bottlenecks to keep trains and their precious cargo moving.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/railgrade-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/railgrade-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Core i5 2.8 Ghz or better",
        "Memory": "4 GB RAM",
        "Graphics": "GPU 4GB VRAM",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Minakata Dynamics",
        "Platform": "PC",
        "Game Size": "3.9 GB",
        "Released By": "RUNE",
        "Version": "v7.3.63.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5ci106eju2i5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/railgrade-preinstalled-steamrip.jpg"
}