{
    "page_url": "https://steamrip.com/ratten-reich-free-download/",
    "title": "Ratten Reich",
    "description": "In a fictional world torn apart by constant warfare, societies of rats, mice, cockroaches , and lizards relentlessly pursue the interests of their nations. As these ambitions clash, one battlefield sees the end of all hope for peace. Advances in steam and diesel engines have given birth to merciless weapons of destruction, plunging the world into an era of unprecedented technological brutality .\nTheaters of War\nThis war spans three distinct continents, each offering unique and challenging combat environments, but among them all are charred corpses , bomb craters, and the scars of incessant fighting. Reviver\nThe Central Continent boasts swampy terrain and trench-ridden ground, making troop movement difficult and creating tactical challenges. The Eastern Continent is fortified with military bases, creating serious obstacles to any assault.\nThe desert continent is famous for its sandstorms and dunes, which obscure visibility and complicate combat. Most buildings are destructible, allowing for a variety of tactical approaches when assaulting enemy positions and forcing players to strategically think through cover options.\nEach faction boasts an exclusive infantry arsenal, interesting models, and elaborate designs. You will be able to play missions for the famous RR (rats), FMR (mice), ERS (lizards), and RD (monitor lizards).\nUnit cards contain important information, allowing you to accurately and effectively control them on the battlefield.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/ratten-reich-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/ratten-reich-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 8.1, Windows 10 (64-bit versions only)",
        "Processor": "Intel Core i5-2400 @ 3.1 GHz or AMD FX-6300 @ 3.5 GHz or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 or AMD R9 270 (2GB VRAM with Shader Model 5.0 or better)",
        "DirectX": "Version 9.0c",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "METALLADLERSTUDIO",
        "Platform": "PC",
        "Game Size": "6.5 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/i40W33",
        "https://buzzheavier.com/ctid53dnytdt",
        "https://megadb.net/0gnx9iqfxp5k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/ratten-reich-preinstalled-steamrip.jpg"
}