{
    "page_url": "https://steamrip.com/ravenswatch-free-download-1u/",
    "title": "Ravenswatch Directly Download",
    "description": "Ravenswatch is a top-down roguelike action game that combines intense real-time combat with deep gameplay and high replay value. After the success of Curse of the Dead Gods, Passtech returns with a new formula and game experience that can be played solo or with up to four players in co-op. Curse of the Sea Rats\nThe Nightmares are spreading within Reverie, corrupting everything in their path. You must hone your skills and find the strength to defeat the creatures of the Nightmare using unique hero abilities inspired by characters from folk tales and legends.\nTo defeat the Nightmare and reach the final chapter, you will need a strong build, focus and excellent teamwork. Increase your fighting power in battles then face the level boss when you feel ready or when you no longer have a choice. The world of Reverie is built on old folk tales and legends. From the three little pigs to Norse mythology to One Thousand and One Nights, the best-known tales are revisited in a dark- fantasy style and add their timeless appeal to the atmosphere of Ravenswatch. Run after run, play as different heroes, make the most of the upgrades and items you find, and explore a randomly generated map with new activities and new enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/ravenswatch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/ravenswatch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64 (Version 1909 or newer)",
        "Processor": "Intel Core i5-4670K (4 * 3400) / AMD FX-8350 (4 * 4000)",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 660 (2048 MB) / Radeon HD 7870 (2048 MB)",
        "DirectX": "Version 12",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Passtech Games",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "RUNE",
        "Version": "v1.02.01.00 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jo52bs63mrl8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/ravenswatch-preinstalled-steamrip.jpg"
}