{
    "page_url": "https://steamrip.com/raw-metal-free-download/",
    "title": "Raw Metal",
    "description": "Raw Metal is a sci-fi stealth-action dungeon crawler with a focus on smooth, stylish gameplay. You are a lone scavenger on the distant, barren exoplanet Charybdis. In search of gear and supplies, you infiltrate the depths of Katabase 6, a massive mining facility run by a corrupt megacorporation known as Orpheus Tech.\nSneak through the mines undetected, cleverly utilizing various gadgets and equipment to your advantage, but beware; if you’re caught, you’ll need to rely on your combat skills for a fighting chance to escape.\nUse taser darts, noisemakers, improvised concussion grenades, and more to slip past and isolate guards. The shadows are your domain; manipulate your environment and your enemies well enough and they’ll never see you coming. Fran Bow\nCombat in Raw Metal is fast and punishing. The guards stationed at Katabase 6 are stronger and more heavily armored than you, so fighting them head on will take skill, cunning, and a great degree of risk. However, mastering combos and using your environment will allow you to come out on top, and yield far greater rewards. Depending on whether it is initiated through a clever ambush or a stealth slip-up, combat can range from a calculated risk to a desperate fight for survival.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/raw-metal-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/raw-metal-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i3-10105F 3.7 GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 1030 2GB or equivalent",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Team Crucible",
        "Platform": "PC",
        "Game Size": "950 MB",
        "Released By": "TENOKE",
        "Version": "v1.1.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/aw6r85jfcpyj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/raw-metal-preinstalled-steamrip.jpg"
}