{
    "page_url": "https://steamrip.com/ready-or-not-free-download/",
    "title": "Ready or Not",
    "description": "Get Ready or Not for free instantly and play pre-installed on SteamRiP\nReady or Not is an intense, tactical, first-person shooter that depicts a modern-day world in which SWAT police units are called to defuse hostile and confronting situations. Please remember that the Beta build is still an incomplete version of the game. It will still have bugs and quirks , and will require lots of additional content before it is ready for full release. Because of our Supporters and with your help, we will continue to push Ready or Not, adding more content (new maps, missions, characters, weapons, etc.), and further refining it to get the game up to the standard that you deserve. Breakwaters\nWe ultimately want you to be able to turn the lights out, crank up the volume, and be immersed in the action – bringing order to chaos. VOID interactive has consulted with police teams globally to create rules of engagement and a scoring system that are both challenging and realistic. In order to push the bar further with realism, Ready or Not models ballistic penetration, ricochet, kevlar and plate dynamics, as well as projectile expansion and momentum.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/ready-or-not-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/ready-or-not-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7, Windows 8.1, Windows 10",
        "Processor": "Intel Core i5-4430 / AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 960 2GB / AMD Radeon R7 370 2GB",
        "DirectX": "Version 11",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "VOID Interactive",
        "Platform": "PC",
        "Game Size": "38.1 GB",
        "Version": "Build 19378689 | Full  (Latest) + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/4ZNFbT",
        "https://datanodes.to/j9lf11m0e2wb",
        "https://buzzheavier.com/4rnbhku6b8p7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/ready-or-not-preinstalled-steamrip.jpg"
}