{
    "page_url": "https://steamrip.com/rebuild-3-gangs-of-deadsville-free-download-m1/",
    "title": "Rebuild 3: Gangs of Deadsville",
    "description": "Get Rebuild 3 Gangs of Deadsville for free instantly and play pre-installed on SteamRiP\nIt’s been a few years since the zombpocalypse turned the world’s cities into graveyards and sent the few survivors into hiding. Now you must gather them up and restore civilization to a ruined city, one building at a time. Rebuild 3 is a strategy sim with a good helping of narrative and dark humor. It’ll make you fond of your survivors before you send them to their deaths for the greater good. Fun with Ragdolls: The Game\nAs you expand your fort to new buildings, you’ll decide between farms or fortifications, housing or hospitals, and make tough decisions to fend off raiders, illness, starvation, and madness. And the dead are still out there wandering the streets, hungrier than ever. In the course of the passage of the game, you will have to fight off the zombies house by house, of which there are more than enough, roaming the streets of the city, from bandits and raiders who have decided that the world belongs to them, and not only.\nIn addition, you will have to deal with the most simple, but very important things. For example, you will have to decide what to grow in the reclaimed plots, what resources to extract, and what to save for the common good, who to donate during the next outing and how the building and how to use it.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/rebuild-3-gangs-of-deadsville-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/rebuild-3-gangs-of-deadsville-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP +",
        "Processor": "1.6Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "Most cards",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Northway Games, Sarah Northway",
        "Platform": "PC",
        "Game Size": "207 MB",
        "Repack By": "SEWN",
        "Version": "v1.6.41 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j2vc8rfj8cfa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/rebuild-3-gangs-of-deadsville-free-download-preinstalled-steamrip.jpg"
}