{
    "page_url": "https://steamrip.com/redacted-free-download-r1/",
    "title": "[REDACTED]",
    "description": "Black Iron, a state-of-the-art penitentiary located on Jupiter’s icy moon Callisto, is overrun with hordes of infected inmates. As a modest prison guard your job is simple – get to the last escape pod and get out alive!\nFight through dozens of unique enemies and challenging environmental hazards as you battle your way out of the prison. But you aren’t the only survivor looking to escape. Your rivals – a deranged custodian, a violent gangster, a maniacal lunch lady, and more – can’t wait to step over your corpse and save themselves.\nOnly one of you can make it off the moon – make sure it’s you! The Last Flame\nFIGHT/DIE/ADAPT Each death is a learning experience. Starting fresh each run, build up your loadout with powerful experiments, weapon schematics, and buffs to battle through Black Iron. When you die (and you will die), use your hard-earned loot to purchase new permanent weapons, suits, and skills. Get stronger, experiment with your strategy, and get out!\nROUT YOUR RIVALS You’re not the only person to survive the initial outbreak or willing to use a bit of violence to get to the last escape pod. Some prisoners and even your correctional services colleagues are just as eager to escape and will make escaping harder by attacking you remotely or challenging you to a one-on-one duel. Race them, attack them back remotely, and fight them to the death to make it out in one piece.\nFIGHT YOUR LAST CORPSE When you die, you leave more than a coverall-clad carcass. Defeat the reanimated corpse of the last guard to succumb to the prison’s dangers to earn a powerful experiment. But beware, it’s not going to be an easy fight. The semi-alive guard has the same loadout they had when they met an untimely end and a few extra tricks up its sleeve to keep things spicy .\nDO OR DIE You’ve made the perfect build, battled through bosses , ran through rivals, killed your corpse, found all the files, and now you’re standing in front of that last escape pod. Sure, you could leave it all behind for the sweet taste of freedom or risk it all in one last hardcore do-or-die run back through the prison. Fail and you lose all your purchased gear, skills , suits, and weapons. But IF you succeed, you’ll unlock new powerful permanent gear.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/redacted-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/redacted-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10/11 (64-bit processor and operating system)",
        "Processor": "Intel Core i5 6400",
        "Memory": "8 GB RAM",
        "Graphics": "Intel Arc A380 | NVIDIA GeForce GTX 950",
        "DirectX": "Version 12",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Striking Distance Studios",
        "Platform": "PC",
        "Game Size": "9.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/468BCE9F16",
        "https://buzzheavier.com/pgg06cfvc165",
        "https://megadb.net/p2qb8nncfcyz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/redacted-preinstalled-steamrip.jpg"
}