{
    "page_url": "https://steamrip.com/reigns-free-download-collectors-edition-1j/",
    "title": "Reigns Free Download Collector’s Edition",
    "description": "Get Reigns Collector’s Edition PC game for free instantly and play pre-installed SteamRiP\nSit on the throne as a benevolent (or malevolent) medieval monarch of the modern age and swipe your royal controller either left or right to impose your will upon the kingdom. Survive the seemingly never-ending gauntlet of requests from your advisors, peasants, allies, and enemies while maintaining balance between the influential factions of your kingdom.\nBut beware; each decision you make might have implications and unfortunate consequences down the road that could put your reign and family’s dynasty at risk. An Unpredictable Kingdom: Each year of your reign brings another important – seemingly random – request from your unpredictable kingdom as you strive for balance between the church, the people, the army, and the treasury. NARUTO SHIPPUDEN: Ultimate Ninja STORM 4\nPrudent decisions and careful planning make for a long reign but unforeseen motivations, surprise events, and poor luck can take down even the most entrenched monarch. The gameplay in Reigns: Collector’s Edition should be called really unusual. But not because of this. that it offers some kind of innovative mechanics, but because it relies solely on dialogue and making multiple decisions.\nIt happens in the following way – you will always see texts with messages, dialogues in front of you, and you will have to participate in them. But this will not be an easy participation – you are a ruler, and in dialogues, for the most part, they will only turn to you for help.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/reigns-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/reigns-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8.1/10 (32-bit versions)",
        "Memory": "2 GB RAM",
        "Graphics": "Intel 4400, GeForce GT 8800, AMD Radeon HD 4650",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation",
        "Developer": "Nerial",
        "Platform": "PC",
        "Game Size": "180 MB",
        "Repack By": "GOG",
        "Version": "v1.25 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ri2rlqkagxaf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/reigns-free-download-preinstalled-steamrip.jpg"
}