{
    "page_url": "https://steamrip.com/remnant-2-free-download-q1/",
    "title": "Remnant 2",
    "description": "Remnant II is the sequel to the best-selling game Remnant : From the Ashes that pits survivors of humanity against new deadly creatures and god-like bosses across terrifying worlds. Play solo or co-op with two other friends to explore the depths of the unknown to stop an evil from destroying reality itself. To succeed, players will need to rely on their own skills and those of their team to overcome the toughest challenges and to stave off humanity’s extinction. Let’s School\nA mix of methodical and frenetic ranged/melee combat returns with cunning enemies and large scale boss battles. Choose specific gear and weapons to optimize for the different biomes and battles ahead. Bosses will bring high-level players to team up to overcome the challenge and try to obtain the biggest rewards\nPlayers can travel alone or with friends as a team through strange new worlds and beyond, overrun by mythical creatures and deadly foes while trying to stay alive. There are multiple worlds to explore with different types of creatures, weapons, and items. Utilize and upgrade discovered items to take on tougher challenges\nBranching quest lines, augments, crafting , and loot rewards will test the resolve of even the most hardened players in dynamically generated dungeons and areas. Playthroughs will feel challenging, varied, and rewarding as players succeed against unrelenting odds. Various stories are woven throughout the different worlds, encouraging exploration and multiple revisits\nExpanded Archetype system provides players with unique passive bonuses and stunning powers . Multiple Archetypes can be unlocked during play, leveled up, and equipped together for a variety of play styles",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/remnant-2-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/remnant-2-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10",
        "Processor": "Intel Core i5-7600 / AMD Ryzen 5 2600",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce GTX 1650 / AMD Radeon RX 590",
        "Storage": "80 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Gunfire Games",
        "Platform": "PC",
        "Game Size": "85.9 GB",
        "Co-op By": "0xdeadc0de/FLT",
        "Version": "v453.438 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/g6x75ckh4j1d"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/remnant-2-preinstalled-steamrip.jpg"
}