{
    "page_url": "https://steamrip.com/republic-of-pirates-free-download/",
    "title": "Republic of Pirates",
    "description": "Set sail to the heart of the Caribbean and the Golden Age of Piracy! In this era of opportunity, intrepid freebooters seek their fortune upon the high seas, black-sailed marauders prey upon Spanish treasure ships returning from the New World, and opportunistic privateers, emboldened by their ‘letters of marque’ reap the profits of war from their influential patrons.\nAt the centre of this cutthroat world lies the Republic of Pirates , a powerful league of pirate clans bound together by their shared ideology, ambitions, and code of honour. But while the early days of the confederacy were prosperous, greed and jealousy soon began to spread amongst its members culminating in a vicious mutiny and a final bloody breakup. Still Wakes the Deep\nSet out to reclaim your father’s legacy and bring justice to the traitors who wronged you. Develop a humble outpost into a sprawling settlement by investing in production buildings to create a self-sustaining economy. Utilise the black market to distribute valuable resources and grow the wealth of your pirate citizens. Recruit heroic captains and command a powerful fleet in real-time as you take to the waves in the name of conquest. Liberate islands, defeat rival factions, and navigate complex diplomatic relationships with the global superpowers of the time.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/republic-of-pirates-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/republic-of-pirates-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-6600 or AMD Ryzen 5 1600X",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650, 2 GB or AMD Radeon HD 7770, 2 GB",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Crazy Goat Games",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "TENOKE (Let’sPlay)",
        "Version": "v0.32.1.24",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bpcrazekww9j",
        "https://buzzheavier.com/ngm06fvmknyn",
        "https://1fichier.com/?wzxovrkjokt9jdz180ta"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/republic-of-pirates-preinstalled-steamrip.jpg"
}