{
    "page_url": "https://steamrip.com/retro-gadgets-free-download-1l/",
    "title": "Retro Gadgets",
    "description": "You look up from your cosy little workbench. It’s dark out, what time is it? It doesn’t matter; you’ve been in the flow and are adding the final touches to your latest retro gadget. Just one more line of code, a spray of paint here, a sticker there – it’s done. You power it on The start-up sound kicks in the needles on the gauges flutter, and the screen lights up it’s glorious.\nIt’s ready to share with the world. Now, all it needs is a name. Feel the exhilaration of building your own eye-popping real-working gadgets. Lose yourself as you build, solder, code, customise, and play with electrifying gadgets at your relaxing workbench .\nBuild video game consoles, weather machines, lightboards, radios, drum machines any gadget you can think of. What will you come up with next? Retro Gadgets gives you the power to invent Solder circuit boards, add buttons and switches, speakers and lights, connect and code CPUs, audio and video chips, flick the on button and see your gadget come to life. Hello Neighbor 2\nYou have the vision, you can build the gadgets Check out gadgets made by people all over the world . Download any gadget, play with it, take it apart, see how it works, build your own version. Is the world ready for your awesome gadget?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/retro-gadgets-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/retro-gadgets-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 8 / 8.1 / 10 (64 bit)",
        "Processor": "Intel Core2Duo 2GHz or AMD equivalent (or better)",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD series 5000 (or better) or discrete video card",
        "DirectX": "Version 9.0c",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Simulation, Early Access",
        "Developer": "Licorice ehf, Studio Evil",
        "Platform": "PC",
        "Game Size": "168 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.1.5 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g2wghj9lygoj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/retro-gadgets-preinstalled-steamrip.jpg"
}