{
    "page_url": "https://steamrip.com/retrorealms-arcade-free-download/",
    "title": "RetroRealms Arcade",
    "description": "Step into a 16-bit Pixel Art world filled with gory good fun as horror legends Michael Myers and Ash Williams! Slice and shoot your way across multiple levels of terrifying platformer action filled with familiar sights and sounds from the original “ Halloween ” film and the STARZ television series “ Ash vs Evil Dead”\nTest your skill, use your weapons, and confront twisted and fiendish versions of iconic characters in two separate games that can be connected for even more fun. (Each game sold separately.) Engage in epic, heart-pounding encounters to overcome the ultimate evil in this sprawling adventure filled with over-the-top terror!\nRetroRealms includes access to the RetroRealms Arcade that connects select RetroRealms games with other titles in the series that you own (games and DLC sold separately) to unlock new access and abilities and create the ultimate mash-up of horror legends Mindlock – The Apartment\nImmerse yourself in Pixel Art-styled 16-bit visuals and a hauntingly nostalgic horror soundtrack. RetroRealms pays homage to classic side-scrollers while delivering a fresh take on retro gameplay.\nDiscover hidden relics and collectibles. Unlock new power-ups and abilities to enhance your character’s skills, and discover all-new ways play.\nWith leaderboards for both “ Halloween ” and “Ash vs Evil Dead” you can see how you stack up against other RetroRealms players. Do you have skills to get your name on the high score list?\nIt’s the utimate arcade experience with iconic legends of horror! Cross into the RetroRealms and see if you have what it takes to make it out alive",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/retrorealms-arcade-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/retrorealms-arcade-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel(R) Core 2 Duo E7500",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 or equivalent",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "WayForward Technologies",
        "Platform": "PC",
        "Game Size": "928 MB",
        "Released By": "Ty CHRONOS",
        "Version": "Build 16184248 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yvn9h05j3mvn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/retrorealms-arcade-preinstalled-steamrip.jpg"
}