{
    "page_url": "https://steamrip.com/return-to-monkey-island-free-download-y1/",
    "title": "Return to Monkey Island Directly Download",
    "description": "Return to Monkey Island is an unexpected, thrilling return of series creator Ron Gilbert that continues the story of the legendary adventure games The Secret of Monkey Island and Monkey Island 2: LeChuck’s Revenge developed in collaboration with Lucasfilm Games. It’s been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of Monkey Island.\nHip, young pirate leaders led by Captain Madison have shuffled the old guard from power, Melee Island has taken a turn for the worse, and famed businessman Stan has been imprisoned for ‘marketing-related crimes’. Banter with old friends and new faces on familiar islands now under dangerous new leadership. Then, take to the high seas and explore the new and unknown as you work your way out of tough predicaments. Clever puzzles, bizarre situations, and devastating ripostes are all that stand between Guybrush and glory. Whateverland\nBringing classic point and click gameplay to the modern-day, intrepid pirates will solve puzzles and explore the islands with a clever evolution of classic adventure game controls. Context-sensitive interactions, reactive dialog trees, and an easy-to-use inventory system make pirating a breeze. Navigate the sometimes-friendly confines of Melee Island, a familiar place that finds itself under new management by leaders who have put the squeeze on old friends and new faces. Venture out into uncharted lands like the aptly named Terror Island and the chilling outposts of Brrr Muda to make allies and enemies alike.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/return-to-monkey-island-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/return-to-monkey-island-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD FX-4300 (4 * 3800) or equivalent / Intel Core i3-3240 (2 * 3400) or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Radeon HD 7750 (1024 VRAM) or equivalent / GeForce GT 640 (2048 VRAM) or equivalent",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "Terrible Toybox",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Released By": "CODEX emu",
        "Version": "(Build 10179092) (Windows Build 570741) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/f10we5bj49pz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/return-to-monkey-island-preinstalled-steamrip.jpg"
}