{
    "page_url": "https://steamrip.com/r3turnal-y4/",
    "title": "Returnal Directly Download",
    "description": "Break the cycle as this award-winning third-person shooter brings bullet hell action to PC. Selene’s roguelike odyssey arrives with a suite of arresting graphical and performance-based enhancements to ensure an unforgettable journey. This includes the full Returnal experience, complete with Suspend Cycle, Photo and Co-op Modes, as well as the Tower of Sisyphus included from day one.\nAfter crash-landing on this shape-shifting world, Selene must search through the barren landscape of an ancient civilization for her escape. Isolated and alone, she finds herself fighting tooth and nail for survival. Again and again, she’s defeated forced to restart her journey every time she dies. Through fast, relentless gameplay, you’ll discover that just as the planet changes with every cycle, so do the items at your disposal. Every loop offers new combinations, empowering you to push your boundaries and approach combat with a different strategy each time.\nBrought to life by stunning visual effects, the dark beauty of the decaying world around you is packed with explosive surprises. From high stakes, bullet hell-fuelled combat, to jaw-dropping twists and turns set across stark and contrasting environments. You’ll explore, discover and fight your way through an unforgiving journey , where mystery stalks your every move. Pharaoh: A New Era\nDesigned for extreme replayability, the procedural world of Returnal invites you to dust yourself off in the face of defeat and take on new, evolving challenges with every rebirth Includes support for achievements, complete with an in-game progress tracker. Five graphical pre-sets have also been included, alongside in-game performance metrics, including an FPS counter, a gauge for GPU and CPU usage and a latency tracker .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/returnal-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/returnal-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit (version 1903)",
        "Processor": "Intel Core i5-6400 (4 core 2.7GHz) AMD Ryzen 5 1500X (4 core 3.5GHz)",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 (6 GB) AMD Radeon RX 580 (8 GB)",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Housemarque, Climax Studios",
        "Platform": "PC",
        "Game Size": "54 GB",
        "Released By": "Mr_GOLDBERG/Online-fix.me",
        "Version": "(Build 11083317) | Full  + Online Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/69010FDA19",
        "https://1fichier.com/?8lvbtmpo6papt3dwtsjq",
        "https://buzzheavier.com/55tx9hxmqby5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/returnal-preinstalled-steamrip.jpg"
}