{
    "page_url": "https://steamrip.com/reus-2-free-download/",
    "title": "Reus 2",
    "description": "Become a God once again in Reus 2 by taking control of mighty giants whose command over their elements allows you to shape worlds, create an ecosystem of resources and enable human civilizations to thrive. Your choices will determine the fates of these fragile human beings, whose autonomy may lead them to great heights .\nShape worlds with Giants Utilize a roster of 6 powerful Giants , each with their own unique abilities over plants, animals and minerals that will allow you to create new biomes for humans to settle their villages. As you progress, gain inspiration to unlock more skills for your Giants, providing you with a diversity of choices .\nCreate thriving ecosystems Terraform a variety of biomes, strategically build up different combinations of flora , fauna and materials specific to those environments. By experimenting, discover which combinations create the best synergies for the inhabitants’ needs and goals , leading you into exciting new eras of their existence. Game Dev Story\nLead humanity into the future Shape the development of humanity with your choices as they evolve from early human societies to modern civilizations. Whether it’s travelling to the stars as space explorers, starting a cult or wishing to cultivate nature, they will all have their goals. No matter the outcome, remember, you can always start a new humanity.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/reus-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/reus-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD FX-4130 Quad-Core / Intel Core i3-4130",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 950 Ti / Radeon HD 7750",
        "DirectX": "Version 10",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Abbey Games",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "RUNE emu",
        "Version": "v1.8.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/09ci2pfuztw2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/reus-2-preinstalled-steamrip.jpg"
}