{
    "page_url": "https://steamrip.com/revenge-of-the-savage-planet-free-download/",
    "title": "Revenge of the Savage Planet",
    "description": "WELCOME TO THE PIONEER PROGRAM In a future knocked off its axis by corporate greed and stupidity, you have been made redundant and abandoned on the far edge of space with little gear and no safety net. You must explore every nook and cranny , collect dozens of upgrades, and turn over every mysterious alien rock if you want to get revenge on your former employer and return to Earth. Nubby’s Number Factory\nAcross multiple planets and through myriad challenges, you will be tasked with exploring and understanding these beautiful alien worlds. There are plants to scan, creatures to capture, lakes to swim, caves to spelunk, mountains to climb, upgrades to craft, and hundreds of secrets to uncover\nDYNAMIC CO-OP Play with your best friend, partner or hellspawn on or between any platform! Or better still, experience the nostalgia tinged joy of sitting on the same couch and playing on the same screen with someone you love. Like the olden days when the world was young and we were happy.\nEXCITING FRESH ABILITIES AND TOOLS Run, Jump, Shoot, Grind, Stomp, Dodge, Slide, Whip and Grapple your way through the world! Experiment with 3 different types of gameplay goo! Lasso and Capture dozens of strange creatures and store them in Pens near your Habitat",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/revenge-of-the-savage-planet-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/revenge-of-the-savage-planet-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-8400 / AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 / AMD Radeon RX 580 – 6GB VRAM",
        "DirectX": "Version 12",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Raccoon Logic Studios Inc.",
        "Platform": "PC",
        "Game Size": "12.6 GB",
        "Released By": "RUNE emu",
        "Version": "Build 18509278 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/uUvgGg",
        "https://buzzheavier.com/ecn4wgw4y0g0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/revenge-of-the-savage-planet-preinstalled-steamrip.jpg"
}