{
    "page_url": "https://steamrip.com/reventure-free-download-1v/",
    "title": "Reventure",
    "description": "Reventureis an adventure game that has managed to include about a hundred unique endings, which makes your pastime exciting and unusual. You will take on the role of a real brave hero who is sent to perform heroic deeds. Our hero also has a peculiarity: the whole point is that sometimes he can go crazy and start doing completely crazy, uncontrollable things. The game has complete freedom of action and every decision you make will lead to one of a hundred endings, so act as you see fit. Dragon Forge\nIt is worth remembering that every decision you make will affect the outcome of events. The game has a lot of secrets, which are not easy to unravel , as you have to face a lot of trials and difficulties. There is also a special difference in this adventure – it has a lot of discoveries for you, so feel free to explore the world around you. You can unlock everything, including new characters, equipment, and visual effects. The game will not do without the use of magic, which will effectively cope with the mission.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/reventure-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/reventure-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1+",
        "Processor": "SSE2 compatible instruction set",
        "Memory": "512 MB RAM",
        "Graphics": "DX10 (shader model 4.0) compatible",
        "DirectX": "Version 10",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Pixelatto",
        "Platform": "PC",
        "Game Size": "150 MB",
        "Released By": "GOG",
        "Version": "v1.9.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/02bnj5yfek87"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/reventure-preinstalled-steamrip.jpg"
}