{
    "page_url": "https://steamrip.com/reveil-free-download/",
    "title": "REVEIL",
    "description": "A unique, visually appealing, mentally challenging story. Versatile puzzles , unanswered questions, confusing clues and a disturbing psyche demand a lot from both the player and the protagonist, Walter Thompson. Can you manage to make sense of it all? Should you persevere , there is a chance to find answers to your questions. You wake up. You’re disoriented. Your head hurts. Things seem surreal, yet familiar. Your wife Martha and your daughter Dorie are not there. Why? Looking for answers, you explore your environment and fragments of memories. SuperSpec Rallycross\nOn your journey you are repeatedly confronted with riddling tasks, driven by the desire to find out what’s going on. What happened last night? Why can’t you think of any other thing aside from your days as a stage builder at the circus? As things get crazier and more bizarre, the lines between reality, memory, and imagination become more and more blurred and you realize: there is no going back. You have to do whatever it takes to bring this story to an end, no matter at what cost\nIn REVEIL, the player is immersed into a world, designed with attention to detail, where the boundaries between reality and illusion become blurred. The setting is an authentically orchestrated environment inspired by the circus of the 60s, which soon takes on surreal features. Get a glimpse into the psyche and the past of Walter Thompson: The impressions become darker, more mysterious, more enigmatic the further you advance.\nOnce caught in the maelstrom of deceptive impressions, memory fragments and mysterious visions, your only option is to dive deeper – in the hope of finding answers to your perplexing situation and condition, even if this hope is slowly fading. The only thing that keeps you from giving up is the will to find Martha and Dorie. Do not shut your eyes to the hints left by the two, but keep them wide open and try to not lose your mind.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/reveil-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/reveil-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core i7-11370H / AMD Ryzen 7 3750H",
        "Memory": "12 GB RAM",
        "Graphics": "Intel Iris Xe / AMD RX Vega 10",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Pixelsplit",
        "Platform": "PC",
        "Game Size": "13.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.1f1 | Full  + Funhouse Pack DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/3EE557EED2",
        "https://buzzheavier.com/49g0a6mm8oss",
        "https://1fichier.com/?v0dytmh15bjqs9f3rxuv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/reveil-preinstalled-steamrip.jpg"
}