{
    "page_url": "https://steamrip.com/revhead-free-download-1/",
    "title": "Revhead Directly Download",
    "description": "Revhead is a car racing simulation game, where you have to build your own race car. You have a friend Charlie, who is busy with building race cars. He would need some help from you and he invites you to Australia. You start your journey somewhere in a small town in Australia , where the only way to get recognised if you are able to build the fastest and best racing car around. Timelie\nYou have Charlie , his expertise and his garage. The rest is up to you You have to think as a real Revhead! You can buy or sell cars and components, fix and tweak your car to make it the fastest around. However, a good race car is not always about the fastest or strongest , but the one which matching with it’s driver. Set your car the way it fits for your driving skills and racing conditions.\nRevhead is about to build and race with your dream car and while all of your racing skills will be required to beat others on a track, you also have to master mechanical skills to be able to fix, maintain or re-build your car. A real car is built up from thousands of components. Each connected to each-others and they are working together as a car. In this game, every car is built up from dozens of individual components, connected to each-other the same way as in reality. Each component can be removed, replaced and swapped between other cars. This way, you can not only customise your paint work and outlook, but the handling and performance of the car as well.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/revhead-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/revhead-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8.1, Windows 10 (64-bit versions only)",
        "Processor": "2GHz dual core",
        "Memory": "4 GB RAM",
        "Graphics": "Min. 1GB ram",
        "DirectX": "Version 9.0",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Racing, Simulation, Sports, Strategy",
        "Developer": "Creative Pudding Hungary Llc.",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.9.11049 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sgkfc1gmtcwf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/revhead-preinstalled-steamrip.jpg"
}