{
    "page_url": "https://steamrip.com/richman-11-free-download-m1/",
    "title": "Richman 11 Directly Download",
    "description": "Richman 11 supports multi-controller, online and offline modes to choose. Players could create either free play or challenge play, all the parameters could be set based on players minds as well. In the game, players roll the dice and it determines the steps they could move on the map, earning money by investment on properties, buying stocks or using cards, when the game ends, the only player who are not broke or owns the most in finance wins the play. FAITH: The Unholy Trinity\nThis is the classic mode in the series, all the players have the same initial cash, deposit and cards at the beginning, and all these could be set freely, players even can set, the price increase days, play time, player number, group play, etc as much as they wish. This is a new play mode.\nPlayers are facing the challenges from the landlords. There are 3 difficulties: easy, normal and hard to choose for each landlord . Players need to win them in different levels in the circumstance with short of talents, initial cash and properties to get their special achievements. The franchise was known to the public in 1989, classic maps take the torch from its predecessors, using tiles to link small and large properties, banks, lotto’s, shops, news and magic house. Investing small properties is the main way to gain the profits .\nOther than this, players needs to keep and eye on other players and NPCs like gods’ movements. Using large properties, cards, banks and magic house to increase their income and face the emergent affairs or sabotage opponent’s plans.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/richman-11-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/richman-11-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7+ (8,10,11)",
        "Processor": "Intel i3-6100 / AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 950 / AMD Radeon RX 550",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Strategy",
        "Developer": "CMGE",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 9751000 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/themcb8eqkj3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/richman-11-preinstalled-steamrip.jpg"
}