{
    "page_url": "https://steamrip.com/rimworld-free-download-2j/",
    "title": "RimWorld Free Download Direct Link",
    "description": "Get RimWorld PC game for free instantly and play pre-installed on SteamRiP.\nRimWorld is a story generator. It’s designed to co-author tragic, twisted, and triumphant stories about imprisoned pirates, desperate colonists, starvation and survival. It works by controlling the “random” events that the world throws at you. However, Every thunderstorm, pirate raid, and traveling salesman is a card dealt into your story by the AI Storyteller. There are several storytellers to choose from.\nRandy Random does crazy stuff, Cassandra Classic goes for rising tension, and Phoebe Chillax likes to relax. Your colonists are not professional settlers – they’re crash-landed survivors from a passenger liner destroyed in orbit. You can end up with a nobleman, an accountant, and a housewife. Automation The Car Company Tycoon\nYou’ll acquire more colonists by capturing them in combat and turning them to your side, buying them from slave traders, or taking in refugees. So your colony will always be a motley crew. Each person’s background is tracked and affects how they play. Furthermore A nobleman will be great at social skills (recruiting prisoners, negotiating trade prices), but refuse to do physical work. A farm oaf knows how to grow food by long experience, but cannot do research. A nerdy scientist is great at research, but cannot do social tasks at all.\nA genetically engineered assassin can do nothing but kill – but he does that very well. Colonists develop – and destroy – relationships. Each has an opinion of the others, which determines whether they’ll become lovers, marry, cheat, or fight. Perhaps your two best colonists are happily married – until one of them falls for the dashing surgeon who saved her from a gunshot wound.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/rimworld-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/rimworld-free-download-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Core 2 Duo",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD  4000 or other shader model 4.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Ludeon Studios",
        "Platform": "PC",
        "Game Size": "957 MB",
        "Released By": "RUNE | Ty AR-81",
        "Version": "v1.6.4518 | Build 19187931 + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/yxuQT4",
        "https://buzzheavier.com/lmmjqyp7bke2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/rimworld-free-download-preinstalled-steamrip.jpg"
}