{
    "page_url": "https://steamrip.com/rise-of-industry-2-free-download/",
    "title": "Rise of Industry 2",
    "description": "80’s USA… a time and place of rapid innovation , globalization and unprecedented profits. To dominate this competitive industrial landscape, you’ll need to build a cutting -edge manufacturing powerhouse and cultivate a rolodex full of jet-setting business contacts. Welcome to the land of opportunity!\nIn pursuit of unprecedented profits, you’ll need to seize every opportunity to innovate and grow each business you’re tasked with managing. Ever dream of running a hub of automotive production? A world-class winery with sweeping vineyard vistas? A sprawling mining operation extracting and refining valuable minerals? Or an aviation enterprise that assembles airplanes that will soar through the skies of an increasingly interconnected world? Life is Strange: Double Exposure\nYou’ll need to optimize your production chains, import and export goods within the global market, keep up to date with the latest and greatest technologies, maintain strong relations with the local government and expand your business network to stay on top. Make all the right decisions along the way and you just might be able fulfill your American dream.\nConquer 15 unique and exciting scenarios in campaign mode, each with a different challenge. Alternatively, define your own path to success in sandbox mode.\nSet up specialized complexes containing factories , power plants, industrial furnaces and farms! Establish utility networks to power your industries, making use of the natural resources around you. Provide the media industry with televisions, cameras, vinyl records, cassettes, computers, and video game consoles. Get distilleries and breweries up and running to create drinks such as vodka , whiskey and beer . Churn out candy, toys, dyes, batteries and so much more\nCapitalize on the emerging global market by signing contracts with executives around the world. Import goods and resources to accelerate your production chains and export your products to make the big bucks!\nBuild labs and set research strategies to help you acquire new technologies that will broaden your horizons and improve your production chains .\nYour social connections are vital – to stay on top you’ll need to know the right people and stay on their good side. Network with CEOs of other companies to trade in materials and finished products, and get introductions to their powerful friends in the industry .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/rise-of-industry-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/rise-of-industry-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 10 64-bit",
        "Processor": "Intel i5 or AMD Ryzen 5",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia 1060 or AMD Radeon RX 580",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "SomaSim",
        "Platform": "PC",
        "Game Size": "6.1 GB",
        "Released By": "Mr_GOLDBERG | Ty Titeuf csrin",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/lxootcaoqqp6",
        "https://megadb.net/b0z7f7mbvdzm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/rise-of-industry-2-preinstalled-steamrip.jpg"
}