{
    "page_url": "https://steamrip.com/rising-star-2-free-download/",
    "title": "Rising Star 2",
    "description": "In Rising Star 2, you start as a rookie musician who’s seeking stardom . Create your band, join other musicians, write songs, and craft your setlists. You’ll have to get familiar with the local club scene, perform your first gig and work towards larger venues . The goal? To secure managers, producers, record deals, product endorsements, and much more. It’s a long way to the top if you wanna rock ‘n’ roll. Nobody Wants to Die\nCustomize your band with tons of clothing and hair styles , as well as hundreds of different kinds of equipment. You can even get a custom paint job on your band van, photoshoots with your band mates, and buy art to decorate your homes.\nRecruit compatible musicians , balance relationships, earn a reputation and become popular amongst the local scene. Making valuable use of concert guides, choosing the right gig, writing the perfect song, and securing close ties to other bands is all part of the journey to stardom.\nChoose your starting city in the continental United States, and conquer as many cities as you can while on tour. You can even buy a home in each city, to make visits more convenient than staying in a hotel or motel. Of course, trashing hotels is half the fun of touring , but you’ll have to pick up the tab.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/rising-star-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/rising-star-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "10",
        "Processor": "Year 2013 or newer",
        "Memory": "8 GB RAM",
        "Graphics": "2 GB",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "Gilligames",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "TENOKE emu",
        "Version": "v2.98.354 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1qkcud3uh0he",
        "https://buzzheavier.com/c2ksdr1k8q4u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/rising-star-2-preinstalled-steamrip.jpg"
}