{
    "page_url": "https://steamrip.com/risk-of-rain-returns-free-download-1t/",
    "title": "Risk of Rain Returns Download",
    "description": "Carefully designed, beautifully remastered, and loaded with new ways to play—Risk of Rain is back and better than ever! Dive into the iconic roguelike full of unique loot combinations, entirely new Survivors, overhauled multiplayer, and more Lemon Cake\nHone your skills and abilities, discover new Survivors , and dive into progressively stronger runs! Discover secrets of ancient design lying dormant beneath the surface of Petrichor V. Search under every log, stone, and Gup to find new ways to play\nMany Survivors fled the mysterious attack on your ship. Slice, dice, and serve justice cold with the return of Chef, hold the front line and shield your team as Enforcer , or lay down a path of toxic sludge as everybody’s favorite purple monster: Acrid! Forge new paths to explore with 15 unique Survivors , each with new abilities to master. Two entirely new Survivors are making their debut in Risk of Rain Returns.\nAlso introducing The Drifter This resourceful brawler gathers scrap from conquered foes and can spawn items that temporarily empower teammates. She can also take them for herself and unleash an unbridled blaze of area-wide destruction. The Drifter is the perfect addition to any group of Survivors . Her ability to support the team while laying down her own brand of hurt will prove she’s more than just a stowaway.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/risk-of-rain-returns-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/risk-of-rain-returns-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-2400 or AMD FX-8350",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GT 710, 1 GB or AMD Radeon R7 240, 1 GB",
        "Storage": "350 MB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Hopoo Games",
        "Platform": "PC",
        "Game Size": "438 MB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0.4 | Full  + co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zuk9omdbgq0n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/risk-of-rain-returns-preinstalled-steamrip.jpg"
}