{
    "page_url": "https://steamrip.com/rivals-of-aether-ii-free-download/",
    "title": "Rivals of Aether II",
    "description": "Rivals of Aether II is the next generation of platform fighters and multiplayer brawlers . This sequel to the hit indie fighting game Rivals of Aether is expanded and upgraded with 3D visuals, new mechanics, improved online support , and more!\nThe Aether Universe is a world where warring civilizations summon the power of Fire, Water, Air, and Earth – and powerful Rivals harness those powers to clobber each other! Rivals of Aether II continues the franchise’s iconic focus on competitive depth, accessible gameplay, and unforgettable characters.\nWhether you’re a competitive master of the genre or a newcomer looking to have fun, Rivals of Aether II delivers a fast-paced and flashy brawler experience that you won’t forget. DON’T SCREAM\nRivals of Aether II features an exciting base roster of new and returning characters – with post-launch plans to add additional playable characters to the game for free! Each of these playable Rivals have an expansive moveset featuring new mechanics and special moves that are not only an upgrade over the original game, but new to the platform fighter genre as a whole.\nShields, ledges , grabs and throws add new layers to the frenetic flow of combat in Rivals of Aether II. On top of that, the Pummel Special, Ledge Special, and Getup Special provide unique combat options that push the genre forward in exciting new ways.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/rivals-of-aether-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/rivals-of-aether-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Window 10+ 64 Bit",
        "Processor": "3.0 GHz Dual core",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060, AMD Radeon RX 470, or better",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Aether Studios",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "0xdeadc0de",
        "Version": "Build 29102024 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wy3wwulv5th4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/rivals-of-aether-2-preinstalled-steamrip.jpg"
}