{
    "page_url": "https://steamrip.com/river-town-factory-free-download-r1/",
    "title": "River Town Factory",
    "description": "Create automated production assembly lines, from wooden planks to circuit boards, design every step of your production line. Unlock future technologies gradually, from silicon purification to photovoltaic power generation, and build your futuristic workshop. Use inter-district teleportation stations to receive products at various levels, expanding your factory’s territory to the entire continent. From brewing and oil pressing to manufacturing ovens, even producing watches and antibiotics, astound ancient people with your futuristic goods\nReinforced concrete, rubber , and large-scale computers, these will be the mass-produced materials you use in the ancient times, a thousand years ago There are 12 characters that can be pursued in the game – the royal, the martial arts world, the merchant, etc. Unlock the secrets of each character and pursue the friendships and romances you desire. Choose your partner and discuss marriage, and together move into the workshop where they will provide powerful assistance. Touhou Danmaku Kagura Phantasia Lost\nMake connections with nearly 30 historical figures, each with their own changing schedules throughout the four seasons. Participate in their lives and use modern knowledge to solve their problems. In the River Town, everything happens naturally, and you have the final say on when to work, explore, and engage in romantic pursuits.\nA fast-paced combat system that is easy to pick up, combining evasion and offense to defeat your enemies through strategic maneuvers. Whether through formal training or adventures in the martial arts world, master more than 40 martial arts techniques including external skills, internal skills, light skills, and hard skills, allowing you to dominate the martial arts world.\nExplore the four major villages on the map, complete village quests, and uncover their secrets. Explore the mystical realms left behind by ancient predecessors, delve deep into them, and defeat bizarre creatures. Explore the entire continent, discover treasures, explore bat caves, and punish bandits for the people.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/river-town-factory-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/river-town-factory-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Microsoft® Windows® 7",
        "Processor": "intel CORE i3-3200",
        "Memory": "4 GB RAM",
        "Graphics": "GT730",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "iFAction Studio",
        "Platform": "PC",
        "Game Size": "658 MB",
        "Released By": "TENOKE",
        "Version": "v1.0.1.0207.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mzd24brhj8xs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/river-town-factory-preinstalled-steamrip.jpg"
}