{
    "page_url": "https://steamrip.com/roadcraft-free-download/",
    "title": "RoadCraft",
    "description": "As the leader of a company specialized in restoring sites devastated by natural disasters , use your construction machinery to restart the local industry. Clear debris and faulty equipment, rebuild roads and bridges damaged by weather, and much more Jacksmith: Weapons and Warriors\nYou run a disaster recovery company, specialized in restoring sites devastated by natural disasters. Numerous tasks await you and your heavy machinery as you work to restart the local industry: clearing debris, replacing faulty equipment, rebuilding roads and bridges damaged by bad weather, deploying resource convoys to produce new reconstruction materials, and much more\nExperience a new generation of simulation with the brand new engine developed by Saber Interactive, the creators of MudRunner and SnowRunner . Handle each object with realistic physics, accounting for their mass and size. Interact with elements like sand, wood, and asphalt. Reshape the terrain and ease the movement of your vehicles thanks to your newly-built roads.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/roadcraft-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/roadcraft-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (18362 min)/11 64-bit",
        "Processor": "AMD Ryzen 5 1500X / Intel Core i5-8400",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 590 / Nvidia GeForce GTX 1060 / Intel ARC A580",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Simulation",
        "Developer": "Saber Interactive",
        "Platform": "PC",
        "Game Size": "59 GB",
        "Released By": "RUNE emu",
        "Version": "v3.0.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/7ul5N0",
        "https://datanodes.to/37tsxc7w15lz",
        "https://buzzheavier.com/ceegy13fkpeg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/roadcraft-preinstalled-steamrip.jpg"
}