{
    "page_url": "https://steamrip.com/road-96-mile-0-free-download-1m/",
    "title": "Road 96 Mile 0",
    "description": "Road 96: Mile 0 is a Narrative-Adventure game with a musical component created by DigixArt, the French studio behind the successful Road 96, 11-11 Memories Retold and 5 Pegases Awards winner. Published by Ravenscourt, players will alternate between the roles of Zoe and Kaito, two teenagers with different backgrounds and beliefs. They live and explore White Sands, a luxurious condominium where Petria´s elite reside and where Kaito´s parents work. Road 96\nZoe is one of the characters of Road 96. She comes from the rich side of the city and her father works for the government. Kaito, a character from Lost in Harmony, lives in the less privileged area. They’re good friends, but that could all change quite soon. Their journey in Road 96: Mile 0 will challenge their friendship and everything they believe in. They say money doesn’t buy happiness, nor friendship. These teens are dreamers and they are going to learn where they belong. Will they remain friends?\nUnderstand the previous event of Road 96 and what made Zoe flee from her home. Play as Zoe and Kaito to shape the evolution of their fate. Besides this, you will run into many of the colorful characters from Road 96. Get to experience another side of the troubled country of Petria. This is a story about conflict and difference of opinion between two friends.\nZoe and Kaito come from two different worlds, but they are unified by a powerful friendship. They will face many challenges, can they overcome them? The musical segments of the game are a real emotional experience that put you into inner worlds of Zoe and Kaito. You will have to make choices and ride and dodge to find your way through these beautiful psychedelic trips.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/road-96-mile-0-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/road-96-mile-0-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 – 6th Gen/ AMD Ryzen 5 3600 6 Core 3.6GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 3GB/ AMD Radeon RX 570 4GB",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Digixart",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Released By": "GOG",
        "Version": "v1.2.04 + Stronger Together Bundle",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/bj8ld2t12iv2",
        "https://megadb.net/ouhnirsslcar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/road-96-mile-0-preinstalled-steamrip.jpg"
}