{
    "page_url": "https://steamrip.com/robobeat-free-download/",
    "title": "ROBOBEAT",
    "description": "You’re Ace – a famous bounty hunter after your latest target, the eccentric robot-showman Frazzer. To find your way through his twisted techno-playground, you’ll have to master the art of shooting, wall-running, sliding, and bunny hopping, all in sync with the beat! Get ready to dance till you’re dead and then suit up for the remix in rogue-like rhythm shooter MULLET MADJACK\nShoot to the Beat Shoot to your own beat with the custom music feature. Simply upload & trim your track or leave it as it is in our in-game editor to auto generate beats that suit your play style. Change custom songs effortlessly in-game anytime anywhere without interruption. The feature will support .wav, .mp3, and .ogg files. Maximise your damage and shorten your cooldown time by shooting in sync. Master the art of charged shots, damage multipliers, armour piercing rounds, and more\nMove to the Music You’ll want some slick moves to go with those slick new weapons . Your enemies aren’t going to wait around for you to take a dance break, so you’ve got to keep moving if you want to survive. Wall run, slide, double jump, bunny hop, and grapple hook your way through technicolour levels to give your enemies the runaround. Keep it fluid, keep it funky, and keep it moving.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/robobeat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/robobeat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Simon Fredholm",
        "Platform": "PC",
        "Game Size": "2,8 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cxcvapqzjeh6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/robobeat-preinstalled-steamrip.jpg"
}