{
    "page_url": "https://steamrip.com/roboquest-free-download-1s/",
    "title": "Roboquest",
    "description": "Roboquest is a fast-paced FPS Roguelite , playable in solo or 2-player co-op. Jump into the steel shoes of a high-powered, hyper-mobile robot and fight like you’ve never fought before. Run through randomly generated environments on an unrecognizable Earth.\nScorched canyons and vivid cities packed with secrets, upgrades, and enemies. Destroy every laser- shooting evil bot and boss that stands in your way, choosing from an arsenal of handcrafted weapons to do so. Gather powerful technology to help you push forward. Upgrades, abilities and customization for your character and basecamp. Beyond a Steel Sky\nThey’ll stick with you after each defeat, to make the next run a little easier. The year is 2700. Humans live scattered through the desert, struggling to survive . It’s looking pretty bleak. Until a young scavenger girl named Max stumbles across something that may help. An old Guardian robot, lying abandoned in the sand. She reactivates him, knowing that with a Guardian by her side, she may be able to give mankind a fighting chance\nTogether, the two begin to explore the mysterious canyons that surround them, searching for answers and a way to survive. There’s just one problem. The canyons are crawling with evil bots, determined to stop them from advancing. But who’s controlling them? And what are they guarding within?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/roboquest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/roboquest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i3 4130",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "RyseUp Studios",
        "Platform": "PC",
        "Game Size": "6.8 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.5.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9d1jt2itjvcz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/roboquest-preinstalled-steamrip.jpg"
}