{
    "page_url": "https://steamrip.com/robonauts-free-download-n1/",
    "title": "Robonauts direct Download",
    "description": "Get Robonauts for free instantly and play pre-installed on SteamRiP all indie games with latest updates\nThe beloved game that was originally released only for the Nintendo Switch console is coming to PC gamers now! Learn the story of Robo and help him save the galaxy, alone or together with family and friends. In a nutshell, Robonauts is that arcade game which includes 12 levels. Each level will challenge you. You will explore a universe which consists nearly 50 planets, facing Bosses and creatures and meeting powerful opponents bent on universal destruction. Robo is a little robot whose curiosity got the better of him and led to his sudden exit from the confines of his safe environment .\nNow little Robo is far from home, fighting for his life against a constant barrage of enemies. When developing Robonauts, we chose to give Robo human traits based on our own emotional experience. Robo acts like you and I, and we sense his emotions when has to choose between sides in a battle, trying to figure out who the good guys are. Once you get to know him, it’s hard not to love Robo. Dead by Daylight",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/robonauts-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/robonauts-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10 64-bit",
        "Processor": "Intel i5-3570 @ 3.4Ghz",
        "Graphics": "NVIDIA GeForce GTX 550Ti",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "QubicGames S.A.",
        "Platform": "PC",
        "Game Size": "391 MB",
        "Repack By": "SEWN",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xcxo2co2qcqq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/robonauts-free-download-preinstalled-steamrip.jpg"
}