{
    "page_url": "https://steamrip.com/rogue-tower-free-download-1y/",
    "title": "Rogue Tower",
    "description": "Rogue Tower game for free instantly and play pre-installed on SteamRIP\nRogue Tower is a tower defense game with roguelike elements and a continuously expanding path which you can influence. Unlock new towers and buildings, build up your defenses, upgrade your towers through card draws and cash , expand the path tactically to control how enemies move and defend your tower.\nWhere you build your towers is the most important aspect to any tower defense game. In rogue tower, the path the enemies must travel continuously extends and grows to much greater lengths than your average tower defense game making tower placement even more important in this game.\nNot only do you need to carefully consider what kind of coverage they will have, but towers also get a bonus to damage based on their elevation. This means that there are spots which are better than others, but they are limited; which towers do you place on these spots? do you save them for a tower you haven’t unlocked yet? or do you put everything you have there now? are the good spots even in a good location or are they too far off the path? These are all strategical questions you will have to answer every game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/rogue-tower-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/rogue-tower-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel i5",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon Vega 8",
        "Storage": "145 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Strategy",
        "Developer": "Die of Death Games",
        "Platform": "PC",
        "Game Size": "114 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.3.1.5 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8b7lmqebquc0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/rogue-tower-preinstalled-steamrip.jpg"
}