{
    "page_url": "https://steamrip.com/rogue-lords-free-download-1p/",
    "title": "Rogue Lords direct Download",
    "description": "Get Rogue Lords PC game for free instantly and play pre-installed on SteamRiP\nThe first roguelike in which you play as the devil, which means you can change some of the game’s rules to your advantage! Run after run, manage your team of famous evil geniuses as they encounter unforeseen events and turn-based combat. Unlock new skills, create powerful synergies and use your powers to turn the situation in your favour at critical moments. Only by collecting ancient artefacts can you finally take your revenge on the Demon Hunters Weakened from defeat to the forces of good, you fled the world and sought refuge in hell to survive. MADNESS: Project Nexus\nDecades later, you have returned with your most faithful Disciples to exact revenge on those wretched Demon Hunters. But the world has changed in your absence. Your enemies have become all-powerful, and a new religion – the Sanctua Lumen – has become very influential. It mercilessly hunts down all those who serve you. To reinstate your hold over the world of humans, you must first regain the strength you previously wielded by taking possession of artefacts with legendary power.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/rogue-lords-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/rogue-lords-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo E6750 | AMD Phenom II X2 550",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 650, 1GB | AMD Radeon HD 7770, 1GB",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Leikir Studio, Cyanide Studio",
        "Platform": "PC",
        "Game Size": "3 GB",
        "Repack By": "CODEX Emu + Steamless",
        "Version": "v1.1.04.10 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lw4jbvw5hgv0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/rogue-lords-free-download-preinstalled-steamrip.jpg"
}