{
    "page_url": "https://steamrip.com/rolling-line-free-download-w1/",
    "title": "Rolling Line",
    "description": "Rolling Line VR game for free instantly and play pre-installed on SteamRiP\nRolling Line is a sandbox constructor in which you will create a model railway to your liking. Create your own route and ride it in this game, At your disposal is a huge and understandable toolkit, thanks to which you can use in construction not only the models and locations prepared by the developers, but also create your own. You can change the world around you as you want, up to changing colors and much more. Lay out the rails and the route along which you will normally move, choose the appropriate train and carriages from several types, get into the cab and hit the road – you yourself will control the train and will be able to admire your creation in the first person.\nAnd for maximum immersion, there is VR support to make you feel like a train driver. In addition, you can explore the area on foot at any time and view your buildings up close. Layouts in Rolling Line are designed to look, feel and operate like a real hobbyists model railroad, with switch boards to control the tracks, portable hand-held controllers to drive trains, and complete control over the rooms lighting. Freely push wagons around on the rails with your hands to build trains and take control of them using DCC -style hand-held controllers",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/rolling-line-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/rolling-line-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10",
        "Processor": "Intel i5 range or similar",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 980 or similar (VR) Any low-end graphics card (PC)",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Gaugepunk Games",
        "Platform": "PC",
        "Game Size": "554 MB",
        "Released By": "PLAZA",
        "Version": "v3.40.3 (Santa Fe Remaster) | Full  (Latest) + VR",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7yf7vgtrekg0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/rolling-line-preinstalled-steamrip.jpg"
}