{
    "page_url": "https://steamrip.com/roots-of-pacha-free-download-1k/",
    "title": "Roots of Pacha",
    "description": "Discover, gather, and farm vegetables and herbs. Explore the surrounding wilderness to find animals to befriend and domesticate; fish the shallow and deep waters to see what lies in their depths; and mine the darkest caves filled with mysteries and secret powers. Shadows of Doubt\nJourney of discovery as you develop the tools and ideas that reshaped the primitive world. Learn to process and preserve food (meat, vegetarian , and vegan options), begin metalworking, create beautiful pottery and art, unlock your clan’s spirituality, and invent new buildings to expand your village any way you want.\nA tight-knit community of people will ensure your village’s survival, each with their own fears and dreams. Develop friendships and overcome hardships together. Grow your village by inviting people from other clans to live with you. Participate in primitive festivals and rituals to Pacha, mother nature, and her elements. And when the time come.\nCustomize your character’s appearance with the best cosmetics the stone age has to offer. When you’re done working on your face, work on creating the most amazing farm around. Don’t stop there Design, place, and decorate your own unique home to return to after a hard day’s work.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/roots-of-pacha-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/roots-of-pacha-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or greater",
        "Processor": "2 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "2 gb dedicated video card, shader model 3.0+",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "Soda Den",
        "Platform": "PC",
        "Game Size": "600 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.12 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fx9wokda8u5g"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/roots-of-pacha-preinstalled-steamrip.jpg"
}