{
    "page_url": "https://steamrip.com/rpg-maker-mz-free-download-l2/",
    "title": "RPG Maker MZ",
    "description": "Get RPG Maker MZ PC game for free instantly and play pre-installed on SteamRiP\nRPG Maker MZ is a software development program designed for creating role-playing video games with augmented features developed by Kadokawa that was published by Degica. It is a successor to RPG Maker MV and is currently the most recent program in the RPG Maker series for personal computer platforms. It has received polarized reviews, partially praise for its augmented mechanics; the fact that it carried significant parts and features of RPG Maker MV was criticized.\nWith new features and enhancements to older features, this RPG Maker is set to become the best RPG Maker to date! With RPG Maker’s map editor, you can create maps easier than you can draw a picture. Pick the tiles you want to use, and “paint” them on to your maps. With powerful enhancements from the previous RPG Maker’s map editor, and a large collection of new tiles, you can build countless towns and dungeons for your players to explore!.\nNot only can you use the included characters or import your own made completely from scratch, you can also create your own original characters using component pieces using the built in Character Generator! Combine hairs, eyes, clothes, accessories, and more. Recolor them to match your vision.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/rpg-maker-mz-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/rpg-maker-mz-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows® 8.1/10 (64bit)",
        "Processor": "Intel Core i3-4340 or better",
        "Memory": "8 GB RAM",
        "Graphics": "Compatible OpenGL / VRAM 1GB or better",
        "Storage": "4 GB available space",
        "Additional Notes": "1280×768 or better Display"
    },
    "game_info": {
        "Genre": "RPG, Design & Illustration, Web Publishing",
        "Developer": "Gotcha Gotcha Games, KADOKAWA, Yoji Ojima",
        "Platform": "PC",
        "Game Size": "1.01 GB",
        "Repack By": "CODEX",
        "Version": "v1.1.1 | Updated  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://pixeldrain.com/u/TrMvqiXE",
        "https://megadb.net/ha0qk121kdpi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/rpg-maker-mz-free-download-preinstalled-steamrip.jpeg"
}