{
    "page_url": "https://steamrip.com/rumble-vr-free-download-1z/",
    "title": "RUMBLE VR Directly Download",
    "description": "RUMBLE is a fighting game you play with your body. By moving in specific ways, you can control and manipulate the rock around you. Some movements may pull a rock up from the ground, while other movements can be used to hurl that rock forward. The Gym , your base of operations, is packed with ways for you to learn how to RUMBLE. Explore it fully, and you will find the knowledge you need to become the best of the best. Study the movements, their effects, then learn to combine them to attack your opponents, and defend yourself.\nWhen you feel like putting your knowledge, skill, and creativity to the test, you can use the Matchmaker to set up a duel in the RUMBLE Arena. Here you are pitted against another fighter, and you get to duke it out until one can fight no longer. By winning fights, you slowly increase your rank. With each rank you gain, you unlock more moves for you to study and incorporate into your fighting style. Windfolk: Sky is just the Beginning\nTest your might by dueling other fighters in the RUMBLE Arena. Win, and you climb the ranks, which rewards you with more moves to master. For a different experience, you can head to the Park. Contrary to the Arena, up to 6 different fighters can play together simultaneously. You can invite several of your friends to come join you in your own private session, or you could open your Park to anyone that’d like to get in. Train together, play minigames , or host tournaments, what you do in the Park is entirely up to you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/rumble-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/rumble-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel® Core™ i5-4590/AMD FX™ 8350 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 970, AMD Radeon™ R9 290 or equivalent",
        "Network": "Broadband Internet connection",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Sports, Early Access",
        "Developer": "Buckethead Entertainment",
        "Platform": "PC",
        "Game Size": "532 MB",
        "Multiplayer By": "Online-fix.me",
        "Version": "v0.1.2 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0f4usm9jlb39"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/rumble-preinstalled-steamrip.jpg"
}