{
    "page_url": "https://steamrip.com/rune-factory-guardians-of-azuma/",
    "title": "Rune Factory: Guardians of Azuma",
    "description": "The Celestial Collapse—a calamity caused by a colossal object crashing into the eastern lands known as Azuma. The devastating impact sent fragments of terrain to the skies above and the seas below. With the earth shattered, the power provided by the runes ceased to flow. The gods of nature vanished soon after. Mountains crumbled and fields withered, leaving the people with nothing…not even hope. Deltarune\nYou awaken, startled by a dream of dueling dragons. You don’t remember how or why, but a voice resonates within you.\n“Accept the power of an Earth Dancer. Use this power to save the land.”\nExperience Rune Factory reimagined! Guardians of Azuma is an all-new adventure that takes place in the never-before-seen eastern country of Azuma. Embrace your Earth Dancer powers and fight against the corruption spreading throughout Azuma to bring hope back to this once-prosperous land.\nAs an Earth Dancer, use the power of dance, sacred treasures, and fresh weapons like the Bow and Talisman to purify the land, your farms, and undo the Blight’s damage. Don’t just mind the farm—rebuild entire villages! Construct and place buildings, enticing people to return to the villages and contribute. Revive the gods to bring vitality and valuable resources back to the plagued lands. Experience beautiful Japanese-inspired character designs and aesthetics—from festivals, events, and monsters. Explore Azuma’s natural landscapes and its seasonal-themed locales steeped in tradition. Choose between male and female protagonists, then befriend or romance any of the eligible candidates in fully voiced scenarios. Recruit these new friends to aid you in battle, too!",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2864560/ss_a8e8d230ef88bd5d695bd85e3fbcdd2eadcfb924.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/2864560/ss_1cf4c82800e2c198159d6d986dd46414c743d5dd.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 and 11",
        "Processor": "Intel Core i5-10400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 SUPER",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Marvelous Inc.",
        "Platform": "PC",
        "Game Size": "12 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.3",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/6pvimO",
        "https://buzzheavier.com/7ihh5ih274k3",
        "https://1fichier.com/?brcxfsz0lvd6au8jfe3f"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/rune-factory-guardians-of-azuma-preinstalled-steamrip.jpg"
}