{
    "page_url": "https://steamrip.com/rustys-retirement-free-download/",
    "title": "Rusty’s Retirement",
    "description": "Rusty’s Retirement is an idle-farming simulator designed to sit at the bottom of your screen allowing you to work on other tasks while caring for your farm The Game of Sisyphus\nGrow crops: Plant crops and watch Rusty get to work as he waters, nurtures, and harvests. Unlock new crops as you progress, from crispy carrots to ripe tomatoes.\nProduce biofuel: Use crops to produce clean and energy-efficient biofuel, a vital robot power source. Sell biofuel to other machine inhabitants and reinvest the money into expanding your farm.\nAutomate with robots: Deploy a team of cute little robots to assist with planting, watering, and harvesting . Customize and upgrade your helper bots to increase efficiency.\nMultitasking: Rusty’s Retirement is built to sit comfortably at the bottom of your screen allowing you to do other tasks while caring for your farm. Zoom in or out for a less distracting view, or alternatively turn on ‘Focus Mode’ which slows down crop production.\nVertical mode: You can also create a new vertical farm that sits comfortably at the side of your screen.\nTwitch Integration available: Streamers and viewers can build a farm together. Viewers can control what task their robot should focus on through chat commands like !plant !water ! harvest .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/rustys-retirement-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/rustys-retirement-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel® Core™ i3 @ 3.2 GHZ",
        "Memory": "4 GB RAM",
        "Graphics": "card with DX9",
        "DirectX": "Version 9.0",
        "Storage": "256 MB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Mister Morris Games",
        "Platform": "PC",
        "Game Size": "121 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 16751689 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v4tg06kztt1l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/rustys-retirement-preinstalled-steamrip.jpg"
}