{
    "page_url": "https://steamrip.com/ryse-son-of-rome-free-download/",
    "title": "Ryse: Son of Rome",
    "description": "Fight as a soldier. Lead as a general. Rise as a legend.\n“Ryse: Son of Rome” tells the story of Marius Titus, a young Roman soldier who witnesses the murder of his family at the hands of barbarian bandits, then travels with the Roman army to Britannia to seek revenge. Quickly rising through the ranks, Marius must become a leader of men and defender of the Empire on his quest to exact vengeance – a destiny he soon discovers can only be fulfilled much closer to home\nJourney to the heart of the Roman Empire and experience the brutality of battle like never before as “Ryse: Son of Rome” comes to PC with support for glorious 4K resolution. Continuing Crytek’s legacy for groundbreaking games, Ryse pushes PC hardware to its limits whilst drawing players deep into the bloody drama of ancient Rome.\n“Ryse: Son of Rome ” is an immersive action-adventure story of struggle, brutality and heroism. It follows a fearless Roman soldier named Marius Titus who joins the army to avenge the slaying of his family and emerges as a hero who must fight to save the Roman Empire. Tainted Grail: The Fall of Avalon\n“Ryse: Son of Rome” presents a cinematic re-creation of the Roman Empire, its people, conflicts and landscapes in breathtaking detail and brings the brutality and intensity of Roman warfare to life in visceral detail.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/ryse-son-of-rome-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/ryse-son-of-rome-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows® Vista 64-bit / Windows® 7 64-bit / Windows® 8 64-bit",
        "Processor": "Dual core with HyperThreading technology or quad core CPU (4+ logical processors)",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 graphics card with 1 GB video RAM",
        "DirectX": "Version 11",
        "Storage": "26 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Crytek",
        "Platform": "PC",
        "Game Size": "24.6 GB",
        "Released By": "CODEX emu",
        "Version": "Build 415865 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/vm6bk8ni1g54/Ryse-Son-of-Rome-SteamRIP.com.rar",
        "https://buzzheavier.com/zmss0379w3v5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/ryse-son-of-rome-preinstalled-steamrip.jpg"
}