{
    "page_url": "https://steamrip.com/stalker-clear-sky-free-download-1w/",
    "title": "S.T.A.L.K.E.R.: Clear Sky",
    "description": "S.T.A.L.K.E.R.: Clear Sky game for free instantly and play pre-installed on SteamRiP\nS.T.A.L.K.E.R.: Clear Sky is set in 2011, one year prior to the events of the original S.T.A.L.K.E.R. game. A group of stalkers, for the first time, reaches the very heart of the Zone-the Chernobyl Nuclear Power Plant-and triggers a cataclysm on the brink of a catastrophe .\nAn immense blast of anomalous energy transforms the Zone: the once reliable and relatively safe roads are no longer so, the landscape is wiped clean by outbursts of anomalies , and previously unknown areas appear on the Zone map. Stalkers and expeditions perish or end up isolated within the lost territories. With the anomalous activity at its maximum, the unstable Zone continues to tremor with outbursts. Heaven Dust 2\nThe transformation of the Zone map destabilizes the fragile balance of forces in the Zone. Hostilities for the new territories, artifact fields and spheres of influence flare up among groups. There are no more old enemies or friends now, everyone watches out only for themselves. The Factions War has begun.\nThe protagonist is a mercenary who appeared at the edge of the opposition between stalker factions, Strelok and even the Zone itself. The main character experiences the key role in the events that led to the creation of the Zone right up to the point from which the original S.T.A.L.K.E.R. game begins.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/s.t.a.l.k.e.r-clear-sky-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/s.t.a.l.k.e.r-clear-sky-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows XP(Service Pack 2)",
        "Processor": "Intel Pentium 4 2.0 Ghz / AMD XP 2200+",
        "Graphics": "128 MB DirectX 8.0 compatible card / nVIDIA GeForce 5700 / ATI Radeon 9600",
        "Memory": "512 MB RAM",
        "Sound": "DirectX 9.0 compatible sound card",
        "HDD": "6 GB free hard disc space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "GSC Game World",
        "Platform": "PC",
        "Game Size": "3.9 GB",
        "Released By": "GOLDBERG",
        "Version": "Build 4643851 | full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/592pwrhcer8h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/s.t.a.l.k.e.r-clear-sky-preinstalled-steamrip.jpg"
}