{
    "page_url": "https://steamrip.com/sailing-era-free-download-m1/",
    "title": "Sailing Era",
    "description": "The story takes place during the era of great geographical discovery in the 15th to 17th century. The world is linked by nautical routes, leading to an upsurge in ocean exploration. Every young navigator of this era dreams of their own ship to sail freely through the ocean .\nSome seek to change their destiny , others hope to make history. A real-world scale map, and highly detailed recreation of the ocean, land, monsoon currents, and weather changes form a huge maritime world.\nFace sudden changes in weather, unpredictable winds, sunken treasure, pirate attacks, and luring danger. And experience a novel and thrilling voyage through the ocean. Almost 200 unique ports full of exotic local culture to experience. You can resupply, trade, accept commissions, recruit sailors, invest, and engage in many other activities in the ports. Nordic Ashes\nYou can even form a land expedition team to explore inland Prices fluctuate with the situation at the ports, ultimately translating to higher profits. Promote port development through trade and commissions to increase the variety of goods, items, and premium ships available.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/sailing-era-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/sailing-era-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7(64-Bit)",
        "Processor": "i5-2320 3GHZ 4 Core",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 750 2GB",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Simulation, Strategy",
        "Developer": "GY Games",
        "Platform": "PC",
        "Game Size": "6.5 GB",
        "Released By": "TENOKE/Mr_GOLDBERG emu used",
        "Version": "v1.2.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/42yz8vrg1yq2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/sailing-era-preinstalled-steamrip.jpg"
}