{
    "page_url": "https://steamrip.com/sailwind-free-download-v1/",
    "title": "Sailwind",
    "description": "Get Sailwind for free instantly and play pre-installed on SteamRiP\nSet sail towards adventure in the world of Sailwind This sailing simulator with survival elements features realistic sailing physics and a vast open world to explore. Embark on cargo delivery missions, customize your boat with furniture and decorations, or enjoy some fishing. Take it easy and go for a calm, relaxing trip around the local islands, or, when you’re ready for some adventure, buy a big boat and go on a dangerous voyage across the ocean to distant lands. Use navigation instruments, the sun and the stars to stay on course, battle storms and high winds, and don’t forget to stock enough food and water for the long journey .\nFull realistic sailing physics – in order to sail successfully, you’ll have to tack, reef the sails in heavy weather, keep track of the direction of the wind to find the perfect angle. Watch out for the ever changing weather and waves Six boats of different sizes and sail plans to choose from, each with its own unique sailing characteristics and performance. There are many reasons to set sail – cargo delivery, fishing, exploration , or simply for pleasure. Looking for some relaxation? Enjoy the sunny beaches and crystal clear waters around the tropical archipelagos. Ready for an adventure? Buy a big boat, stock up on supplies , plot your route and set sail for an epic ocean voyage, where you will battle high waves, heavy winds, and where running out of food or water is a real danger.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/sailwind-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/sailwind-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64bit",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Early Access",
        "Developer": "Raw Lion Workshop",
        "Platform": "PC",
        "Game Size": "550 MB",
        "Released By": "SEWN",
        "Version": "v0.15.2 – full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tph379z9g9ks"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/sailwind-preinstalled-steamrip.jpg"
}