{
    "page_url": "https://steamrip.com/saints-row-iv-re-elected-free-download-1j/",
    "title": "Saints Row IV: Re-Elected Directly Download",
    "description": "The Boss of the Saints has been elected to the Presidency of the United States but the Saints are just getting started. After a catastrophic alien invasion of Earth, the Saints have been transported to a bizarro-Steelport simulation. With homies new and old, and an arsenal of superpowers and strange weapons, they must fight to free humanity from alien overlord Zinyak and his alien empire, saving the world in the wildest open world game ever. Altero\nThe American Dream – Play as the President of the United States in a wild story that spans countries, time, and space. It’s up to you to free the world. Super Hero-in-Chief – Leap over buildings. Kill people with your mind. Run through tanks.\nThose are just some of the powers on offer that you can wield in your quest. Alien Toys of Destruction – Wield an impressive array of alien vehicles and weapons – the Inflato-Ray, the Polarizer, the Disintegrator, and many more. Custom Weapons, Custom Mayhem – You’ve customized your character. You’ve customized your clothes. Now you also have a powerful weapon customization system.\nFully Re-Elected – Saints Row IV Re-Elected contains an impressive 25 DLC Packs, including the Dubstep Gun (Remix) Pack, the Presidential Pack, the Commander -In-Chief Pack, and two celebrated episodic story expansions: Enter The Dominatrix and How The Saints Save Christmas.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/saints-row-iv-re-elected-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/saints-row-iv-re-elected-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista (x86 or x64)",
        "Processor": "Intel Core 2 Quad Q6600 | AMD Athlon II x3",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 260 | AMD Radeon HD 5800 series",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Deep Silver Volition",
        "Platform": "PC",
        "Game Size": "10.6 GB",
        "Released By": "CODEX",
        "Version": "Build 10105076 | Full  + (Crossplay Update) + 26 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8ben92npd4hl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/saints-row-iv-re-elected-preinstalled-steamrip.jpg"
}