{
    "page_url": "https://steamrip.com/saint-kotar-free-download-t1/",
    "title": "Saint Kotar",
    "description": "Get Saint Kotar PC game for free instantly and play pre-installed on SteamRiP\nIn this story-and-choice driven psychological horror detective game, you play as Benedek and Nikolay – two troubled godly men in search for their missing relative in an ancient God- devoted town called Sveti Kotar. Here, an unknown presence preys upon the weak and sways on devil worship and witchcraft. Evidence points to your missing relative being involved in the grisly murders and the occult, but what is the truth? Are you also to blame for what happened?\nWill you put the pieces together and unravel the truth behind the town’s centuries-old horrid presence? Or is madness going to be your fate? Solve the mystery behind your relative’s involvement with the town’s bizarre and morbid rituals vSwitch between two realities to get to the bottom of the town’s horrifying secrets Take caution as your choices will affect both story and gameplay Discover hidden locations and complete side tasks to uncover the whole story",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/saint-kotar-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/saint-kotar-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or Newer",
        "Processor": "2.5+ GHz Quad core",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 660 or better, ATI 7950 or better",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Red Martyr Entertainment",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Repack By": "GOG",
        "Version": "v1.26 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7nd01hfc2w33"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/saint-kotar-free-download-preinstalled-steamrip.jpg"
}