{
    "page_url": "https://steamrip.com/saints-row-free-download-x1/",
    "title": "Saints Row (2022)",
    "description": "Experience everything on offer from the new Saints Row in Santo Ileso, then base jump into the nostalgic blockbuster that sees the 3rd Street Saints at the height of their irreverent power – reworked and remastered.  gives you control of the Saints at the height of their power, and you live the life to show for it. This is your City. These are your rules. Saints Row: The Third Remastered with enhanced graphics, Steelport the original city of sin, has never looked so good as it drowns in sex, drugs and guns. Welcome to Santo Ileso, a vibrant fictional city in the heart of the American SouthWest. In a world rife with crime, where lawless factions fight for power, a group of young friends embark on their own criminal venture, as they rise to the top in their bid to become Self Made.\nAs the future Boss, with Neenah , Kevin, and Eli by your side, you’ll form The Saints – and take on Los Panteros, The Idols, and Marshall as you build your empire across the streets of Santo Ileso and battle for control of the city. Ultimately Saints Row is the story of a start-up company, it’s just that the business The Saints are in happens to be crime. Experience the biggest and best Saints Row playground ever created; the unique sprawling world of Santo Ileso is the backdrop for a wild, larger than life sandbox of thrilling side hustles, criminal ventures and blockbuster missions, as you shoot, drive, and wingsuit your way to the top. Dicey Dungeons",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/saints-row-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/saints-row-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3240 or AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 970 or AMD Radeon RX 480",
        "DirectX": "Version 11/12",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Deep Silver Volition",
        "Platform": "PC",
        "Game Size": "39.3 GB",
        "Relesed By": "RUNE",
        "Version": "v1.4.0.4686185 | Full   + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/YnMg0v",
        "https://buzzheavier.com/t8drej0lzcs1",
        "https://1fichier.com/?wgr40kxiue9shm5rgab2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/saints-row-preinstalled-steamrip.jpg"
}