{
    "page_url": "https://steamrip.com/sally-face-free-download-k1/",
    "title": "Sally Face",
    "description": "Get Sally Face PC game for free instantly and play pre-installed on SteamRiP\nDelve into an unsettling adventure following the boy with a prosthetic face and a tragic past. In the first episode, Strange Neighbors, Sally Face and his father move into an apartment filled with odd tenants and an unfortunate crime scene. Little did they know what misfortune still awaits Unravel the sinister mysteries of Sally’s world to find the truth that lies hidden beneath the shadows . The game is composed of five episodes in total. The first episode offers a short introduction to Sally Face, which the subsequent episodes greatly expand upon. Iron Harvest\nSal was an adventurous teenage boy. He seemed to be resourceful and had the ability to keep his cool during stressful situations, as seen through his interactions with ghosts . He came off as friendly and polite regardless of rude or frightened responses he may get from people who are reacting to his prosthetic and was openly affectionate of his friends. Sal frequently offered a listening ear or kind word to others, even to those who have been unfriendly to him, as evidenced in “The Bologna Incident” when he comforted a crying Travis in the boy’s bathroom. His compassion and willingness to help people regardless of their appearance or standoffish behavior was demonstrated time and again. Though he was a kind person, Sal was capable of snapping back at those who try to hurt him through the use of sarcasm.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/sally-face-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/sally-face-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 7",
        "Processor": "2GHz",
        "Memory": "4 GB RAM",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Portable Moose",
        "Platform": "PC",
        "Game Size": "600 MB",
        "Repack By": "GOG",
        "Version": "v1.5.31-5 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/52vs57lzn33d"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/sally-face-free-download-preinstalled-steamrip.jpg"
}