{
    "page_url": "https://steamrip.com/sand-land-free-download/",
    "title": "SAND LAND",
    "description": "Dive into a desert world where both humans and demons suffer from an extreme water shortage SAND LAND. Meet the Fiend Prince Beelzebub, his chaperone Thief, and the fearless Sheriff Rao, and follow the team on an extraordinary adventure in search of the Legendary Spring hidden in the desert. The end is only the beginning, as beyond this arid ground lies a new realm to explore. Rusty’s Retirement\nIn this action-RPG, players will find a nostalgic and heartwarming world created by Akira Toriyama, where you will become the main character Beelzebub. Learn how to control his powers and lead your company of heroic misfits exploring the legendary world of SAND LAND. Beware of the many dangers that populate it: between bandits, fierce wildlife, and the Royal Army, reaching the spring won’t be easy Use your tact and imagination to develop tanks and other vehicles that will help you navigate this vast land, using a wide array of part combinations.\nDesign and operate a large variety of vehicles including Battle Tanks with powerful cannons , Motorbikes that speed through deserts, and Jump-bots that bounce over rivers to explore every corner of the continent. Develop your basecamp in the city of Spino, as you build relationships with its inhabitants . As you bring the exiled people of the desert to Spino, watch the town and its capabilities grow.\nListen to their requests and wishes, and unlock useful materials and city features. Dive into a desert world where both humans and demons suffer from an extreme water shortage SAND LAND. Meet the Fiend Prince Beelzebub, his chaperone Thief , and the fearless Sheriff Rao, and follow the team on an extraordinary adventure in search of the Legendary Spring hidden in the desert. The end is only the beginning, as beyond this arid ground lies a new realm to explore.\nIn this action-RPG, players will find a nostalgic and heartwarming world created by Akira Toriyama, where you will become the main character Beelzebub. Learn how to control his powers and lead your company of heroic misfits exploring the legendary world of SAND LAND. Beware of the many dangers that populate it between bandits, fierce wildlife , and the Royal Army, reaching the spring won’t be easy Use your tact and imagination to develop tanks and other vehicles that will help you navigate this vast land, using a wide array of part combinations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/sand-land-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/sand-land-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "Processor": "AMD Ryzen 5 2400G / Intel Core i5-9400F",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon RX 590 / Nvidia GeForce GTX 1060",
        "DirectX": "Version 12",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "ILCA, Inc.",
        "Platform": "PC",
        "Game Size": "14.7 GB",
        "Released By": "FLT",
        "Version": "v1.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/FD57EF1F6B",
        "https://buzzheavier.com/35vegoqgnc6v",
        "https://datanodes.to/obpw4xvs3113/SANDLAND-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/sand-land-preinstalled-steamrip.jpg"
}