{
    "page_url": "https://steamrip.com/sands-of-salzaar-free-download-u1/",
    "title": "Sands of Salzaar Free",
    "description": "Get Sands of Salzaar for free instantly and play pre-installed on SteamRiP\nWe will host a variety of activities and gift giveaways there during launch weeks Sands of Salzaar is an open-world strategy-action RPG set across a sprawling desert. Build up and manage your forces from a single unit to a mighty army, then lead them into massive battles against your foes. How you progress is up to you: customize your hero with a wide variety of skills and talents, choose which factions to side with, and plan your strategies carefully to establish yourself as whoever you aspire to be a lone wolf, a wealthy trader , a city lord, or a war schemer. Beacon\nCustomize your abilities to become a martial arts master, powerful archmage , and more. Recruit and train your force with new features like command skills and a fresh system to upgrade units. Lead them into waves of real-time sieges and skirmishes to win. Roam across a giant map to encounter various characters, take on quests, enter deadly dungeons for boss fights and loot, amass gold from trading and build up your own cities Every playthrough makes you stronger and offers new adventures that reflect the decisions you make.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/sands-of-salzaar-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/sands-of-salzaar-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 / Windows 10 64 bit",
        "Processor": "2.50GHz",
        "Memory": "4 GB RAM",
        "Graphics": "HD4400",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "汉家松鼠Han-Squirrel Studio",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Version": "v1.0.42 | Full  (Latest) All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/j4h1pxgzqr5t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/sands-of-salzaar-preinstalled-steamrip.jpg"
}