{
    "page_url": "https://steamrip.com/sapiens-free-download-1r/",
    "title": "Sapiens",
    "description": "Sapiens is the debut PC title from solo developer Dave Frampton, known for Blockheads, Chopper, and Chopper In Sapiens you create your own prehistoric civilization. Lead your tribe from the ground, immersed in the world while you shape it. Build towns and industry with complete freedom and control, from placing the tiniest pebble to constructing monumental structures. Start with nothing and advance through thousands of years of technological breakthroughs in this intimate yet expansive colony sim. ADACA\nPick from thousands of procedurally generated lands across a map larger than Earth itself. Choose wisely, as each area has different climates, resources, and challenges. Finding the right place to begin your home is key to growing your civilisation.  Walk the paths beside your people as you lead them through this uncharted world. Instruct individual sapiens to focus on specific tasks, such as planting crops, gathering materials, building, hunting, cooking, and more. Watch as they learn new skills, making them more valuable to your tribe. Manage their moods, health, and support their growing families.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/sapiens-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/sapiens-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 – 64 Bit",
        "Processor": "Multi core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 970 or better",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Majic Jungle",
        "Platform": "PC",
        "Game Size": "369 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.3.7 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7p6ncenjij93"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/sapiens-preinstalled-steamrip.jpg"
}