{
    "page_url": "https://steamrip.com/savara-free-download/",
    "title": "Savara",
    "description": "In this dynamic and colorful action roguelite, delve into a fascinating universe where each decision matters and where strategy is rewarded. You’ve been invited to take part in grandiose festivities organized for the pleasure of Iop the warrior god. These aren’t your typical celebrations – they were designed to put the most valiant fighters in the dimension to the test. Captain Blood\nGet ready for a major challenge by arming yourself with your best weapons and selecting your equipment with care. Each weapon has its own characteristics and advantages, and choosing your arsenal wisely will be vital for your survival and success.\nEach victory brings you closer to even more fearsome challenges, and each defeat is a lesson that will make you stronger. Use the resources you obtain during your fights to bolster your weapons, improve your equipment at the blacksmith’s , and make offerings to the divine statue to garner additional favors.\nSeek out glory by showing your bravery and skill in this festival of fighting. Each skirmish is an opportunity to prove that you are worthy of the god Iop’s attention and blessing. Immerse yourself in this vibrant world teeming with danger and emerge victorious, celebrated as one of the greatest warriors in this unique dimension.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/savara-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/savara-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i5-4690 or Ryzen 3 2300U",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 970 or Radeon R9 290X",
        "DirectX": "Version 11",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Doryah Games",
        "Platform": "PC",
        "Game Size": "5.3 GB",
        "Released By": "TENOKE",
        "Version": "Build 18348825 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/l73p0nbwbgxi/Savara-SteamRIP.com.rar",
        "https://buzzheavier.com/q75pzw2kofpe",
        "https://megadb.net/jo8gwebi69x8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/savara-preinstalled-steamrip.jpg"
}