{
    "page_url": "https://steamrip.com/scars-above-free-download-1p/",
    "title": "Scars Above Directly Download",
    "description": "Scars Above is a challenging sci-fi third-person action adventure shooter combining the rewarding feel of overcoming difficulty with a compelling and intricate story, set in a mysterious alien world to explore.A colossal and enigmatic alien structure appears in Earth’s orbit and stuns the entire world; humanity names it ‘The Metahedron ’.\nThe Sentient Contact Assessment and Response team (SCAR) consisting of scientists and engineers – is sent to investigate. Things don’t go as planned and the Metahedron hauls the team across space onto a mysterious extrasolar planet. Phantom Brigade\nPlaying the role of Dr Kate Ward a SCAR member who wakes up dazed, alone in a strange, hostile environment. Determined to survive, you set out to find your crew and unravel the mystery behind what’s happened. Kate is an astronaut and a scientist not a soldier – but she’s resourceful and determined to do anything to survive.\nUse a combination of ranged weapons, devices , consumables and melee attacks, you need to manage stamina as you run, dodge, exploit weak points and discover effective tactics to defeat your foes Combine different elemental attacks to beat the odds and break through otherwise impassable obstacles. Craft different items and gadgets to aid you against the countless threats in this exoplanet.\nImmerse yourself in a carefully crafted adventure, inspired by the sci-fi classics.Explore an alien world filled with countless threats, gorgeous landscapes and ruins hinting of an ancient yet advanced civilisation that somehow disappeared. Journey through different biomes, such as marshlands, freezing wastelands, underground caverns and alien facilities – all with their own set of challenges, enemies, secrets and environmental hazards .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/scars-above-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/scars-above-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4440 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 670 / GeForce GTX 1050 / AMD Radeon HD 7870",
        "DirectX": "Version 11",
        "Storage": "18 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Mad Head Games",
        "Platform": "PC",
        "Game Size": "15.2 GB",
        "Released By": "CODEX emu",
        "Version": "v1.0.1.129298 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tqmuvrp9bep1",
        "https://buzzheavier.com/dda04dcxuxhz",
        "https://1fichier.com/?kp6z7xj16ngj47hhrcd0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/scars-above-preinstalled-steamrip.jpg"
}