{
    "page_url": "https://steamrip.com/scrap-mechanic-free-download-1l/",
    "title": "Scrap Mechanic Download",
    "description": "Get Scrap Mechanic PC game for free instantly and play pre-installed on SteamRiP\nPLEASE NOTE: We’re still hard at work on Scrap Mechanic! New content is being added and optimizations being made regularly. Get started right away in Survival Mode , Creative Mode and Challenge Mode Please watch the latest Scrap Mechanic trailers to see the game’s latest state.\nTool up and enter the creative paradise of Scrap Mechanic! Build fantastic machines, go on adventures with your friends and defend against evil Farmerbots in this imaginative multiplayer survival sandbox. With Scrap Mechanic’s powerful creation tools you can engineer your own adventures ‘Be a robot mechanic’, they said.\nEasy money’, they said. We’re pretty sure the job description didn’t mention crash landing on a far away planet, with thousands of crazed worker robots out for blood! You’re stranded on a faraway agriculture planet where the Farmbots working the fields have gone haywire. Forts\nWith your tool belt tightly fastened, there’s only one way to survive: using your quick thinking, creativity and a wily knack of turning your surroundings to your advantage In Survival Mode mechanics explore a dynamically generated open-world environment filled with enemies, treasure and dangerous robots Team up with friends and build bases to protect yourself and your valuables. The most creative will survive",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/scrap-mechanic-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/scrap-mechanic-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7 or later",
        "Processor": "2.6 GHz Dual Core",
        "Memory": "8 GB RAM",
        "Graphics": "Intel HD  520 or a dedicated graphics card with 2 GB memory and DirectX feature level 10.1",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Axolot Games",
        "Platform": "PC",
        "Game Size": "4.4 GB",
        "Released By": "Mr_GOLDBERG+ColdClientLoader",
        "Version": "v0.7.3 (Build 16694362) | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xrqzwpyyx28x",
        "https://buzzheavier.com/yokd86t1z2i6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/scrap-mechanic-free-download-preinstalled-steamrip.jpg"
}