{
    "page_url": "https://steamrip.com/sea-of-thieves-free-download/",
    "title": "Sea of Thieves",
    "description": "Sea of Thieves offers the essential pirate experience, from sailing and fighting to exploring and looting – everything you need to live the pirate life and become a legend in your own right. With no set roles, you have complete freedom to approach the world, and other players, however you choose.\nWhether you’re voyaging as a group or sailing solo, you’re bound to encounter other crews in this shared world adventure – but will they be friends or foes, and how will you respond?\nA Vast Open World\nExplore a vast open world filled with unspoiled islands and underwater kingdoms. Take on quests to hunt for lost loot, forge a reputation with the Trading Companies and battle foes from Phantoms and Ocean Crawlers to Megalodons and the mighty Kraken. Try your hand at fishing, make maps to your own buried treasure or choose from hundreds of other optional goals and side-quests!\nA Game That’s Always Growing\nWith each Season bringing in new game features every three months alongside regular in-game Events, Sea of Thieves is a service-based game that’s still growing and evolving. Check back regularly to see what free content has been newly added, and see how far you can climb through each Season’s 100 levels of Renown to earn special rewards.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/sea-of-thieves-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/sea-of-thieves-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Q9450 @ 2.6GHz – AMD Phenom II X6 @ 3.3 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 650 – AMD Radeon 7750 – Intel A310",
        "DirectX": "Version 11",
        "Storage": "100 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Rare Ltd",
        "Platform": "PC",
        "Game Size": "117 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v2.135.8227.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Un6Fyf",
        "https://buzzheavier.com/1ganqcr8iohx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/sea-of-thieves-preinstalled-steamrip.jpg"
}