{
    "page_url": "https://steamrip.com/sea-of-stars-free-download-1r/",
    "title": "Sea of Stars Directly Download",
    "description": "Promising the Sabotage touch in every system, Sea of Stars aims to modernize the classic RPG in terms of turn-based combat, storytelling, exploration and interactions with the environment, while still offering a hearty slice of nostalgia and good old, simple fun.\nPressing the action button in sync with the animations increases damage output while reducing incoming damage. Along with timed hits, combat features multi-character combo attacks, boosting, and a strategic “locks” system offering options to play with different damage types in order to hinder enemies while they are channeling powerful attacks or spells, all in an immersive take on the genre; no random encounters , no transitions to separate battlefields, and no grinding.\nSwim, climb, vault, jump off or hoist up ledges as you traverse seamlessly through the world with a navigation system based on platformer expertise that breaks free from the classic bound-to-the-grid tileset movement. Our custom-made render pipeline allows the creation of a breathtaking world coming to life by pushing the limits of 2D pixel-art games. Ages of Conflict: World War Simulator\nDozens of original characters and story arcs will take you on a captivating journey . Sometimes epic, sometimes silly, and other times emotional, Sea of Stars does its RPG duty of exploring classic themes of adventure and friendship, while also being chock-full of the unexpected twists and events you’d expect from a Sabotage production .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/sea-of-stars-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/sea-of-stars-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 10",
        "Processor": "Intel Core 2 Duo E8600 or AMD Phenom II X4 945",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon R5 230 or Nvidia GeForce GT 520",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Sabotage Studio",
        "Platform": "PC",
        "Game Size": "14 GB",
        "Released By": "CODEX Emu",
        "Version": "v2.0.58728 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/wltvdshmphh7",
        "https://datanodes.to/hz8mqgcuznrw/Sea-of-Stars-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/sea-of-stars-preinstalled-steamrip.jpg"
}