{
    "page_url": "https://steamrip.com/sengoku-dynasty-free-download/",
    "title": "Sengoku Dynasty Free Download",
    "description": "Build a life, cultivate your community and start a dynasty in a region once devastated by famine and war. Play solo or in co-op multiplayer and explore a beautiful open world. Gather resources, craft, hunt and build, then automate your village production to survive and grow.\nBecome a great leader either through combat or by building your economy. Experience the beauty of nature and take part in ancient rituals to uncover the mysteries of the divine. Sengoku Dynasty offers an immersive insight to life in medieval Japan: Choose your path as a Leader, Craftsman, Warrior, or Monk and embark on an epic journey.\nOPEN WORLD VILLAGE BUILDER Take full advantage of the vast world. Begin with a single house, build workshops, forges, taverns and then expand your settlements into multiple flourishing communities throughout the valley.\nBECOME A TRUE DAIMYO Unify the war-torn land of Nata Valley. Rogue Samurai and bandit clans have filled the power vacuum and threaten the existence of your peaceful villagers. Liberate new territories and repair infrastructure to explore areas rich in vital resources and open the door to even greater challenges.\nFROM HANDCRAFTING TO AUTOMATION Craft tools, weapons, meals or medicine, and cultivate the land. Then learn how to give jobs and tools to your villagers and see your economy and choices grow exponentially.\nMASTER AN INTRICATE COMBAT SYSTEM Skill or grind – it’s up to you: Choose your favorite weapon from sticks and spears to masterfully crafted Katanas (swords) and Yumi (bows). By mastering combos, dashes, blocks and parries you can conquer the world.\nDYNASTY MANAGEMENT Create a prosperous dynasty for generations to come. Oversee the growth and development of your villages. Get married and ensure your legacy continues through your successor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/sengoku-dynasty-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/sengoku-dynasty-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (x64)",
        "Processor": "Intel Core i5-8400, AMD Ryzen 5 2600",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650, 4 GB or AMD Radeon RX 570, 4 GB or Intel Arc A750, 8 GB",
        "DirectX": "Version 12",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Simulation",
        "Developer": "Superkami",
        "Platform": "PC",
        "Game Size": "10.5 GB",
        "Released By": "RUNE",
        "Version": "1.0.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/3KkuVK",
        "https://megadb.net/h39d6fl4olfb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/sengoku-dynasty-preinstalled-steamrip.jpg"
}