{
    "page_url": "https://steamrip.com/serious-fun-football-free-download-1l/",
    "title": "Serious Fun Football",
    "description": "Serious Fun Football is one of the few indie games where you can experience real physics and unique freedom of movement from a controlled character. Serious Fun Football is a game on the one hand created seriously, where realism is almost as high as in the world-famous football titles and on the other hand a casual game, where it’s all about pure fun. What does the gameplay look like? It’s fast-paced 3vs3 play, which you probably know from your own experience while playing with your friends outdoors .\nThere are no corners, no penalties, and no throw-ins. There’s a focus on shooting, passing, and cooperation. Keep in mind that here there are not a lot of mechanisms that will assist you in controlling the footballer . You run, shoot, pass, aim and receive the ball using only your skill. Choose from the online game against other players or vs AI. If you prefer to play alone or have a party game with friends on your PC you can always do that in offline play. Wild Dogs\nCareer mode is for those who would like to create a footballer and make a true “goat” out of him. All games are 3vs3 but you can decide if you want to control just one player or the whole team. Friendly match – just click and play. If someone has high attributes he will pass, shoot better, and run faster. Every single attribute matters. You can choose from many predefined footballers or create your own in career mode. As you play and win matches you’re going to earn in-game currency, which you can spend on a variety of things like unlocking new stadiums or customizing your player.\nThere are so many possible options that it is hardly possible that someone will create exactly the same footballer as you In Serious Fun Football you are going to play matches 3vs3. There are no corners, no penalties, and no throw-ins. You decide if you control one player and focus mostly on ball anticipation, tackles, positioning, running, shooting , or controlling a full team of 3 where passing and tactics come into play. In SFF you can choose from two difficulties serious or fun. Each match can be played from 3 different camera angles horizontal, vertical, and TPP.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/serious-fun-football-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/serious-fun-football-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "AMD Phenom II X4 955, Intel Core i5-750 or equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GPU GeForce GTX 660 / AMD GPU Radeon HD 7870",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation, Sports, Early Access",
        "Developer": "KW-SFF",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v0.981 | Early Access + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/up52jxnxyzkx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/serious-fun-football-preinstalled-steamrip.jpg"
}