{
    "page_url": "https://steamrip.com/settlement-survival-free-download-1q/",
    "title": "Settlement Survival Free",
    "description": "Get Settlement Survival pc game for free instantly and play pre-installed on SteamRiP\nLead your people to their new settlement in this survival city-builder. You will need to provide their shelter, guarantee the food supply, protect against threats of nature, and pay attention to well-being, happiness, education, and employment . Do all of this well, and you might even attract residents from foreign cities Build housing, recruit Mayors to determine the morality of your settlement, control crime and ensure your baby-booms don’t negatively impact your resources. Squid like game\nExperience all seasons and heed the early warning signs of disasters. Bunker down and protect your citizens from the elements as well as environmental disasters, or risk losing all that you’ve built. Offering powerful effects, unique themes and styles, rare blueprints are an opportunity to customize your settlement even further when you’ve mastered the art of trading. Determine which development routes you will choose, with options that range from trading, education, mining, construction, agriculture , processing, logistics, and liveability.\nEach route unlocks new buildings and abilities to boost development. and there is no set pattern to the route selection, so you can choose freely and play to your strengths. Experience a unique game mode designed to challenge even the most experienced player. From the bubonic plague in Europe , to the Easter Island disaster, are you able to overcome its challenges?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/settlement-survival-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/settlement-survival-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7(64-Bit)",
        "Processor": "I3-2100-3GHZ 2 Core",
        "Memory": "4 GB RAM",
        "Graphics": "NVDIA Geforce GTX-650 1GB",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Gleamer Studio",
        "Platform": "PC",
        "Game Size": "966 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.98.65 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q6f7y0hcelpa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/settlement-survival-free-download-preinstalled-steamrip.jpg"
}