{
    "page_url": "https://steamrip.com/severed-steel-free-download-1o/",
    "title": "Severed Steel direct Download",
    "description": "Get Severed Steel PC game for free instantly and play pre-installed on SteamRiP\nSevered Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments , loads of bullet time, and a unique one-armed protagonist. It’s you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives, flips, and slides to take every last enemy down. Play as Steel, a nimble, one-armed sharpshooter on a mission. OMORI\nThere is no reloading – pick your shots well and be ready to pry a loaded weapon from your enemies’ cold dead hands. Dodge bullets, leap off walls, slide kick, throw weapons – do whatever it takes to come out on top in intense and frenzied firefights . Pepper through plaster with sharp 4.7 mm rounds, punch through thick concrete with .50 cal slugs, or make big holes in things with your arm cannon .\nNo two battles are the same thanks to dynamic, unscripted , squad-based AIChase high scores and fast times for leaderboard acclaim in this arcade-styled mode. Not Tonight Features 30 levels, each with their own sub-challenges, and over 20 unlockable, game modifying ‘ Mutators ‘.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/severed-steel-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/severed-steel-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Dual Core",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA 750 or equivalent",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Greylock Studio",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "RUNE",
        "Version": "v5.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qzi373pg7hvl"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/severed-steel-free-download-preinstalled-steamrip.jpg"
}