{
    "page_url": "https://steamrip.com/shadows-of-doubt-free-download-1j/",
    "title": "Shadows of Doubt",
    "description": "Shadows of Doubt is set in an alternate reality in the hyper- industrialized 1980s. Think like a detective and use a variety of gadgets as a private intelligence investigator, gathering evidence and making money by solving cases, finding and selling information and more. Play your own way in a fully simulated world with hundreds of citizens . Discover, meet and tail individual citizens, each with their own name, job, apartment and daily routine, in unique, procedurally-generated cities. Dice Kingdoms\nEach case has different culprits , clues and experiences for you to test your investigative skills. Explore anywhere in the city! Every nook of every trashy bar, every place of work, every seedy hotel room This dystopia is your oyster. Break into apartments, rifle through secret documents or hack security systems even a discarded receipt can be the key to cracking a case.\nTrace the receipt back to an individual location , scour CCTV footage and match the time up to the receipt to find out who it belonged to The entire world is fully simulated . Each citizen has an apartment, job, daily routine, favorite things to do, places to go, and people to interact with. They live out their lives independently, in a world that moves on with or without you uncover this knowledge and use it to your advantage .\nBecome a private investigator in a truly unique detective experience. Think like a detective to solve the cases around you: check call histories, find passwords, read private emails, speak to persons of interest, watch CCTV footage and more to retrieve evidence and build your case. Store information on your investigation board and link evidence together as you piece together the full picture .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/shadows-of-doubt-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/shadows-of-doubt-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or newer",
        "Processor": "Intel 6th Gen i5 or AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 1060 or Radeon 5500XT",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "ColePowered Games",
        "Platform": "PC",
        "Game Size": "752 MB",
        "Released By": "GOG",
        "Version": "v40.02.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h12p5qm5bgi5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/shadows-of-doubt-preinstalled-steamrip.jpg"
}