{
    "page_url": "https://steamrip.com/shady-knight-free-download/",
    "title": "Shady Knight",
    "description": "Shady Knight is a pure skill- based experience. There are no locked abilities to hold you back, the only thing that matters is how well you can master the power you’ve been given. Prove yourself worthy and break the cursed path of trials or lose yourself to the abyss of obsession .\nUnique Melee Action that mixes Parkour and Combat Your weapons react to your state, charging a strike from a slide or in the air leads to different moves . Even more interesting combinations appear once you discover that you can jump off enemies’ heads or wall-kick to trigger more powerful abilities. Even a simplest thing such as a barrel can be used for both parkour and combat.\nThe Kick and The Chained Dagger These two are always at your side making you deadly as hell even when unarmed , and nothing stops you from combining many of their abilities with other weapons for even crazier combos.\nFluid Platforming Learning your movement allows you to become truly intangible in combat. Master slide jumping and learn the trickiest wall- kicking techniques to reach your goal with the flow. Backyard Baseball ’97\nStyle Ranking that reflects Your Mastery There are always multiple things you can do at each given moment: switch weapons, combine different moves, discover all contextual abilities and use the environment to reach the highest ranks. The style system isn’t there to tell you how to play, it’s a reflection of your skills and knowledge.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/shady-knight-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/shady-knight-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "2.5 GHz",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce GTX 1050",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Alexey ‘cptnsigh’",
        "Platform": "PC",
        "Game Size": "264 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 15996601 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2m94iwf53g7v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/shady-knight-preinstalled-steamrip.jpg"
}