{
    "page_url": "https://steamrip.com/shadowveil-legend-of-the-five-rings-free-download/",
    "title": "Shadowveil: Legend of The Five Rings Directly Download",
    "description": "You are the commander . Your role is to focus on the big picture, make the big decisions, and let your forces handle the execution of them. Make impactful decisions on how to guide the expedition’s journey through the Shadowlands, who to bring, what cards to equip, what new paths to unlock and build your strategy to achieve your long-term goals. Split Fiction\nGather and equip both ability and item cards to your samurai , making them even stronger as you progress. Building powerful synergies /combinations between your party members will be crucial in determining the outcome of each battle.\nRecruit new samurai, unlock new classes, level up and improve along different paths to grow your party stronger for each run. As your party grows in ability and size, you will be better equipped to face the dangers that lie deeper in the Shadowlands.\nDeploy your scouts wisely to reveal the secrets of each path and determine the best route through the treacherous Shadowlands. Each path presents unique opportunities and challenges, offering greater rewards or more formidable adversaries. As you delve deeper, the surroundings become increasingly twisted, corrupt, and intricate.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/shadowveil-legend-of-the-five-rings-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/shadowveil-legend-of-the-five-rings-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 2500 / AMD FX-4350 or equivalent",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070 / AMD RX 580 with 6GB of VRAM or equivalent",
        "DirectX": "Version 12",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "Palindrome Interactive",
        "Platform": "PC",
        "Game Size": "7.9 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0.17846 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/PGDR5O",
        "https://megadb.net/adc71iy4f51a"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/shadowveil-legend-of-the-five-rings-preinstalled-steamrip.jpg"
}