{
    "page_url": "https://steamrip.com/shadow-warrior-3-free-download-1s/",
    "title": "Shadow Warrior 3",
    "description": "Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets , Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon’s egg, a touch of magic, and enough firepower to hold off the impending cataclysm .\nConduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes. Flow between nimble movement techniques including air dashes , wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle. Execute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/shadow-warrior-3-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/shadow-warrior-3-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "AMD Phenom II X4 965 (4 * 3400)",
        "Memory": "8 GB RAM",
        "Graphics": "Radeon R7 260X (2048 VRAM) or equivalent.",
        "Storage": "31 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Flying Wild Hog",
        "Platform": "PC",
        "Game Size": "22.6 GB",
        "Released By": "CODEX emu",
        "Version": "v1.06 | Full  (Latest) + Deluxe Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/a80nn1ujwd5e",
        "https://datanodes.to/g1zxesp0u83z/Shadow-Warrior-3-DE-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/shadow-warrior-3-preinstalled-steamrip.jpg"
}