{
    "page_url": "https://steamrip.com/shadow-gambit-the-cursed-crew-free-download-s1/",
    "title": "Shadow Gambit The Cursed Crew",
    "description": "This is Shadow Gambit: The Cursed Crew, an all-new stealth strategy game set during an alternate history of the Golden Age of Piracy. Party Party Time\nThe Curse of Lost Souls haunts the mysterious island chain known as the Lost Caribbean, which is under the control of the terrible forces of the Inquisition . They despise all that is supernatural and use soul devouring fire to hunt cursed pirates like you\nPull-off an epic heist and salvage a mysterious treasure of otherworldly power to defy the army of the Inquisition. Infiltrate their fortresses. Sneak behind enemy lines. Cleverly combine the magical skills of your crew to take out a variety of enemies with carefully considered tactics. Feel like a brilliant mastermind when your plan clicks perfectly into place\nEmbark on a journey with cursed pirate Afia and seek the legendary Black Pearls to revive a cursed crew of your own. Each of your eight shipmates is a playable character with an individual personality and armed with unique supernatural powers. Launch friend or foe with Gaëlle’s magical cannon, use Mr. Mercury’s soul anchor to open a magic portal or dash across spacetime for split second stealth attacks with Afia’s mythical sword.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/shadow-gambit-the-cursed-crew-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/shadow-gambit-the-cursed-crew-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "3.0GHz Four Core CPU (Intel i5-7400, AMD Ryzen 3 1200)",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 750 Ti, Nvidia GTX 1050 Ti, AMD Radeon HD 7870, AMD Radeon RX 570, 2GB VRam",
        "DirectX": "Version 11",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "Mimimi Games",
        "Platform": "PC",
        "Game Size": "17.5 GB",
        "Released By": "RUNE",
        "Version": "v1.2.130 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CtIwIh",
        "https://megadb.net/la26mjs6x3ja"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/shadow-gambit-the-cursed-crew-preinstalled-steamrip.jpg"
}