{
    "page_url": "https://steamrip.com/shadow-of-the-tomb-raider-definitive-edition-free-download-q1/",
    "title": "Shadow of the Tomb Raider Definitive Edition Download",
    "description": "Shadow of the Tomb Raider: Definitive Edition Download PC Game In Direct Link for free on SteamRIP\nIn Shadow of the Tomb Raider Definitive Edition experience the final chapter of Lara’s origin as she is forged into the Tomb Raider she is destined to be. Combining the base game, all seven DLC challenge tombs, as well as all downloadable weapons, outfits, and skills, Shadow of the Tomb Raider Definitive Edition is the ultimate way to experience Lara’s defining moment. Survive and Thrive In the Deadliest Place on Earth: Master an unforgiving jungle setting in order to survive.\nExplore underwater environments filled with crevasses and deep tunnel systems. Become One With the Jungle: Outgunned and outnumbered, Lara must use the jungle to her advantage. Strike suddenly and disappear like a jaguar, use mud as camouflage, and instill fear in enemies to sow chaos. Discover Dark and Brutal Tombs: Tombs are more terrifying than ever before, requiring advanced traversal techniques to reach them, and once inside they are filled with deadly puzzles. Uncover Living History: Discover a hidden city and explore the biggest hub space ever found in a Tomb Raider game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/shadow-of-the-tomb-raider-definitive-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/shadow-of-the-tomb-raider-definitive-edition-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 bit",
        "Processor": "i3-3220 INTEL or AMD Equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 660/GTX 1050 or AMD Radeon HD 7770",
        "DirectX": "Version 11",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Eidos-Montréal, Crystal Dynamics, Nixxes, Feral Interactive (Mac), Feral interactive (Linux)",
        "Platform": "PC",
        "Game Size": "45 GB",
        "Repack By": "CODEX",
        "Version": "v1.0.453.0 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/9oi54d06m9ca",
        "https://1fichier.com/?3b470jbzt322bi52g1v6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/shadow-of-the-tomb-raider-definitive-edition-free-download-preinstalled-steamrip.jpg"
}