{
    "page_url": "https://steamrip.com/shadow-of-the-ninja-reborn-free-download/",
    "title": "Shadow of the Ninja – Reborn",
    "description": "It’s 2029. A vicious dystopian future. And it’s up to two warriors of the night to save the nation After 34 years in the shadows, prepare to see this legendary action adventure in a new light   Looking and playing better than ever before, Shadow of the Ninja – Reborn is Tengo Project’s remake of a cult classic, that the fans have been waiting for.\nAn arsenal of deadly weapons:\nIn this thrilling action-adventure, you will use your striking katana along with a wide variety of weaponry that has greatly expanded from the NES original, as well as the acrobatic finesse of a ninja to face the onslaught of powerful enemies. Although, the challenge does not end here Afterlove EP\nJungle of concrete and steel:\n6 complex, expansive, and masterfully designed stages test your skills through devious traps and challenging platform puzzles.\nTwo ninjas are better than one:\nCritically acclaimed as one of the best 2-player co-ops of its time, Shadow of the Ninja—Reborn lets you play together locally as the legendary ninjas Hayate and Kaede.\nA Star-Studded, Rockin’ Soundtrack:\nIn addition to the contributions of Tengo Project, this remake also features Iku Mizutani, the star composer who helped create the iconic Natsume sound and renowned tracks for various NES games. Fans of Mr. Mizutani and retro gamers across the world will find delight in his renowned guitar riffs and fast-paced retro melodies !",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/shadow-of-the-ninja-reborn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/shadow-of-the-ninja-reborn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7, 8.1, 10 x64",
        "Processor": "AMD FX-4350 / Intel® Core™ i3-3210",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon™ R7 260X (2GB VRAM) / NVIDIA® GeForce® GTX 750(2GB VRAM)",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "NatsumeAtari",
        "Platform": "PC",
        "Game Size": "868 MB",
        "Released By": "TENOKE",
        "Version": "Build 15220761 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rb55qy0tj4v3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/shadow-of-the-ninja-reborn-preinstalled-steamrip.jpg"
}