{
    "page_url": "https://steamrip.com/shapehero-factory-free-download/",
    "title": "ShapeHero Factory",
    "description": "On a blank scroll spread out on top of a desk in an old house in a quiet alley, a teeny tiny battle is about to begin Create heroes with the help of your Minions, and enter the Book of Magic!\nShapeHero Factory fuses aspects of factory builders, roguelites , and tower defense games. The Great Calamity sealed within the Book of Magic is awakening. To defeat and re-seal it, you will need to use the power of adorable Minions to create tiny heroes from the magic scroll.\nThis is a wave-based tower defense game. Build a factory to mass-produce heroes and prevent your gates from being demolished. You will not be able to command your heroes directly. The only thing you can do is build your factory. Nothing more. Each wave of enemies will be stronger than the last. Use the unique artifacts (facilities) that you earn as rewards to reinforce your factory and stand your ground. You must survive every grueling battle and defeat The Great Calamity that awaits you at the end. Sea of Thieves\nTransport basic shapes from the scroll to assemble your heroes with different combinations. Circles with triangles will make soldiers, while circles and squares make sprites. Add squares to soldiers to give them shields. Perhaps you could create stronger heroes by combining soldiers together\nThe Great Calamity lies deep within the Book of Magic . To bar your heroes from invading, his forces will come to demolish your gates. Maintain the defense while you forge ever deeper into the book. The servants of The Great Calamity each has its own method of attack, so you must choose the right hero for the job .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/shapehero-factory-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/shapehero-factory-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel(R) Core(TM) i5-8400 CPU",
        "Memory": "8 MB RAM",
        "Graphics": "Intel UHD  630",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Early Access",
        "Developer": "Asobism.Co.,Ltd",
        "Platform": "PC",
        "Game Size": "374 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.8.6.2 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wmry1d9i7slw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/shapehero-factory-preinstalled-steamrip.jpg"
}