{
    "page_url": "https://steamrip.com/shapez-2-free-download/",
    "title": "shapez 2",
    "description": "Shapez 2 is a top-down factory-building game where you extract and process geometric shapes. Each shape is its own set of building-blocks that your factories can take apart, stack, paint and put back together in unique ways. Build and automate to produce distinct shapes and solve the production challenge of each goal.\nAutomate the processing of abstract geometric shapes into more complex ones by cutting, rotating , stacking, painting and more. Deliver distinct shapes to unlock new technologies and expand your factory’s capabilities. Learn, improve, rebuild and solve logistical challenges to design the most efficient shape production lines.\nBuild in multiple interconnected layers, allowing you to compact and optimize your factories in a whole new dimension. Improve your designs to get the most benefit out of every space platform built and massively increase your production throughput. Intravenous 2\nShapez 2 is the purest factory building game imaginable – all buildings are free, resources never run out and there are no enemies or time limits. Prepare for a 100% factory- building experience: effortlessly delete, redesign and rebuild as much as you want, with no penalties, at your own pace.\nYou’re always in complete control – whether the messy spaghetti belts you built 4 hours ago could use some improvements or a whole circle factory needs to go, Shapez 2 gives you the tools to do it without limitations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/shapez-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/shapez-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "Intel(R) Core(TM) i5-4440 CPU",
        "Memory": "4 GB RAM",
        "Graphics": "Intel(R) UHD  630, 1GB VRAM",
        "Storage": "2000 MB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy, Early Access",
        "Developer": "tobspr Games",
        "Platform": "PC",
        "Game Size": "1.61 GB",
        "Released By": "GOLDBERG + gorre9090 CSF, cs.rin.ru",
        "Version": "v0.1.0-pre8-rc1 | Build 18656921",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/brm5i32b37xr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/shapez-2-preinstalled-steamrip.jpg"
}