{
    "page_url": "https://steamrip.com/shashingo-learn-japanese-with-photography-free-download-s1/",
    "title": "Shashingo: Learn Japanese with Photography Download",
    "description": "Explore bright, fictional Japanese streets filled with details and interesting objects to capture with your camera. Each photograph you take will translate the name of the content into Japanese and English so you can learn with your surroundings. The Many Pieces of Mr. Coo\nCreate Stunning Photography Based Flashcards Every photo flash-card you take will be unique to you. The idea behind this is to strengthen the relationship between a word and how you see its physical appearance. In the real world, you can then see such objects and make connections to the Japanese words you’ve already learned while playing Shashingo .\nTrack Your Progress in the Photo Album Your photo album is where you keep your collection of Photo Flash-Cards. If you remember them well in Find Mode, they’ll be separated into the ‘mastered’ tab and shown with a gold star sticker. However, if you’re struggling to remember a word in Find Mode, they’ll be marked with a purple exclamation mark sticker, so you know which words you need to practice more. You can also mark your favourite words & images with a cute little heart sticker to add them to your favourites page.\nAt the back of your in-game photo album, there are numerous pages of Japanese lessons designed for beginners that will teach you how to speak Japanese and use the vocabulary that you learn in Shashingo . Also included are some key words and important phrases that can help you in your future conversations.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/shashingo-learn-japanese-with-photography-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/shashingo-learn-japanese-with-photography-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 / 8 / 10 / 11",
        "Processor": "Intel i5-2500 3.3GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 7x series / Radeon HD 6570",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Autumn Pioneer",
        "Platform": "PC",
        "Game Size": "641 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 13616892 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ct7zrqo6pwcn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/shashingo-learn-japanese-with-photography-preinstalled-steamrip.jpg"
}