{
    "page_url": "https://steamrip.com/sheba-a-new-dawn-free-download/",
    "title": "Sheba: A New Dawn",
    "description": "Sheba: A New Dawn an Action-RPG Metroidvania that will take you on a journey like no other. Explore a vast world full of mysteries, challenges, and captivating storyline filled with twists and turns.\nEnar, a humble shepherd, finds his world turned upside down when the jinn prisoner named Mirah escapes, and the tides of fate begin to shift. It is her escape that sets off a chain of events that will lead Enar on a dangerous journey to regain control and unravel the mysteries of his world. As he embarks on this epic adventure, Enar will discover his true destiny as the hero of a new dawn. POSTAL 2\nWith action, danger, and uncertainty lurking at every turn, Enar battles to restore balance and save his world from certain doom, with Mirah playing a pivotal role in his quest. Get ready for an unforgettable journey as Enar and Mirah work together to change the fate of their world .\nLong before the maps of today were drawn, humanity bordered upon lands strange and bright, filled with wondrous creatures and peoples beyond imagining. In the ancient realm of Sheba , the line between myth and reality blurs, as humans and jinn clash in a never-ending struggle for dominance. With the fate of the kingdom hanging in the balance, prepare for a journey into the unknown, where danger and adventure lurk around every corner. Discover the secrets of this mystical land, as you explore its ancient ruins, battle fearsome foes, and unravel the mysteries of a world where anything is possible.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/sheba-a-new-dawn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/sheba-a-new-dawn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD FX-4350 / Intel Core i5-4460",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon R9 280X / GeForce GTX 760",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Kashkool Games",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.6.3 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3mme7pdih9ti"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/sheba-a-new-dawn-preinstalled-steamrip.jpg"
}