{
    "page_url": "https://steamrip.com/ship-of-fools-free-download-v1/",
    "title": "Ship of Fools Directly Download",
    "description": "Ship of Fools is a seafaring roguelite co-op game where you play the Fools, the only creatures fool enough to brave the sea. The Great Lighthouse that once protected the Archipelago is broken and a storm of malice and corruption is coming. Together, you and your ship mate will jump aboard The Stormstrider and make your voyage across the sea. Man the cannons , ready your sails and protect your ship from sea monsters over multiple runs. It’s up to you to defend your home from the almighty Evil West .\nIn a clamshell , Ship of Fools is a game about blasting away your seaborne foes with mighty cannons as you defend your ship. Inspired by modern classic roguelites and built for co-op, you’ll want to bring your first mate on deck and enjoy oarsome combat as you unlock new trinkets and artifacts to help you save the world from catastrophe. Designed for co-op play, frantic combat encounters with the horrifying creatures of the storm will test your teamwork. Work together to defend and repair the ship, combine item effects in powerful combos and make sure you have your shipmate’s back if you don’t want to become fish food .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/ship-of-fools-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/ship-of-fools-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "Intel Core i5-2300, 2.8 GHzor AMD FX-4350, 4.2 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce 8800 GT, 512 MBor AMD Radeon HD 6570, 1 GB",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Fika Productions",
        "Platform": "PC",
        "Game Size": "882 MB",
        "Co-op By": "Online-fix.me",
        "Version": "v1.0.1_5234608a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/iiyew8no6uef"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/ship-of-fools-preinstalled-steamrip.jpg"
}