{
    "page_url": "https://steamrip.com/ship-graveyard-simulator-2-free-download-3k/",
    "title": "Ship Graveyard Simulator 2",
    "description": "Ship Graveyard Simulator 2 is a continuation of the warmly received first part of the game, in which the player will take care of destroying and recovering materials from shipwrecks. Moving Out 2 In the game, you can expect new bigger ships, new gameplay mechanics , features and improvements, but also well-known mechanics from the first game that have been significantly improved.\nShip Graveyard Simulator is back bigger than before and it doesn’t matter if you’re a veteran in the game or for the first time you will have a hammer and a torch in your hands there are a dozen of kilometers of wreckage on the coast, and thousands of tons of steel – you will get into this business.\nLarge ship parts? Oh yes! You will need a special crane and a large container for it. Ship Graveyard Simulator 2 will have large fragments, modules and wreck components available for demolition, including engines , pumps, control panels, and much more.\nOrder new ships waiting for demolition via the computer in your home, and with the new ship, you will receive a new task! Collect all the necessary steel, aluminum, or copper parts, even a small part has its own value. There will be several types of ships available in the game, which will be divided into individual categories – some of them are real colossi.\nYour main task in the game is to dismantle ships into small parts. Some of them will be small, but a huge challenge awaits you, which will be the disassembly of real giants, and hiring workers who will be able to help you. Use the available tools – hammer, saw, torch, etc. to disassemble individual pieces of the ship into smaller pieces, collect as many of them as possible and develop your business",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/08/ship-graveyard-simulator-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/08/ship-graveyard-simulator-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 Bit",
        "Processor": "Intel Core i5-6600",
        "Memory": "12 GB RAM",
        "Graphics": "Nvidia GeForce GTX 960",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Simulation",
        "Developer": "Games Incubator",
        "Platform": "PC",
        "Game Size": "11.3 GB",
        "Released By": "RUNE emu",
        "Version": "v13486 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/dn8Ghd",
        "https://datanodes.to/vxfe77v8vfmz",
        "https://buzzheavier.com/s35lmkubfh0n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/08/ship-graveyard-simulator-2-preinstalled-steamrip.jpg"
}