{
    "page_url": "https://steamrip.com/ships-at-sea-free-download/",
    "title": "Ships At Sea",
    "description": "Misc Games, the developers behind the highly popular single-player commercial fishing franchises Fishing: Barents Sea and Fishing: North Atlantic, return with a brand-new title, Ships At Sea. This title features the multiplayer mode that fans have been eagerly awaiting. Isles of Sea and Sky\nShips At Sea, the next generation of ship simulation , introduces service and cargo vessels, the most desired feature requested by our passionate fan base. Head out into the untamable Norwegian Sea with your friends and connect with players worldwide as you build your service, cargo and commercial fishing careers.\nIn addition to the highly detailed fishing, service and cargo ships with new gameplay features, we are proud to introduce a new water shader WaveWorks , in cooperation with Nvidia. This technology provides a cinematic-quality ocean simulation. Moreover, we´ve overhauled the buoyancy system entirely and replaced it with a physically-based one, ensuring vessels of all sizes float realistically. Furthermore, a dynamic weather system enhances the immersion by simulating weather conditions such as rain, fog, lightning and storms.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/ships-at-sea-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/ships-at-sea-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "AMD Ryzen 3 1300X / Intel Core i5 9400",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1070 / Radeon RX 5500 XT 6GB VRAM",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Early Access",
        "Developer": "Misc Games",
        "Platform": "PC",
        "Game Size": "24.4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 14468506 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ivraw1iwjmdo",
        "https://gofile.io/d/iZsZCt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/ships-at-sea-preinstalled-steamrip.jpg"
}