{
    "page_url": "https://steamrip.com/shotgun-farmers-free-download-1t/",
    "title": "Shotgun Farmers",
    "description": "Shotgun Farmers is an online multiplayer shooter where missed shots grow guns. Fire your bullets into the ground to plant your ammo. Reloading isn’t an option, so grab one of the deadly crops planted by the bullets of you and your enemies. Shot at by a sniper? Well they just planted you your very own sniper gun to fire back with! Harvest weapon plants quickly for more ammo or let them grow for a larger clip. Battle enemy farmers in different game modes that change the way you play.\nChase a chicken around the map in Chicken Run, steal the enemy’s prized pig in Capture The Pig, defend the scarecrow in King of the Crow, and more Level up your farmer and complete challenges to unlock hats, shovel skins, costumes, and emotes Battle zombies in Horde Mode where you take on waves of infected farmers and animals. Can you survive to the end and take on the final boss?  Play online with up to 10 players per match, in public lobbies and private rooms. Take on AI bots in Practice Mode to sharpen your farming skills offline or squad up with your friends and take on other players online .\n\nMegaDB DOWNLOAD HERE",
    "screenshots": [],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Core 2 Duo 2.4 GHz or Althon X2 2.7 GHz",
        "Memory": "2 GB RAM",
        "Graphics": "ATI or Nvidia graphics card with 512MB video ram or better",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, FPS, Indie, Shooter",
        "Developer": "Megastorm Games",
        "Platform": "PC",
        "Game Size": "3.16 GB",
        "Released By": "N/A",
        "Version": "v1.6.10.2",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tc7xhc1eus6h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/05/Shotgun-Farmers-Free-Download-Pre-Installed-Steamrip.jpg"
}