{
    "page_url": "https://steamrip.com/showgunners-free-download-1i/",
    "title": "Showgunners",
    "description": "Each stage in Showgunners has been hand-crafted to create a curated, turn-based tactical gameplay experience, heightened with the inclusion of a diabolical show director that can hinder Scarlett or help her opponents depending on your performance .\nThis dynamic level design ensures that no two levels play the same way and keep players thinking tactically. Showgunners has been built to challenge and delight players, whether they’re a turn-based tactical game initiate or a long-time fan of the genre Scarlett won’t be fighting alone. As the story progresses, players will recruit new partners that can turn the tide of battle in all kinds of exciting ways. Age of Wonders 4\nUpgrade your characters by spending talent points in their unique skill trees and outfitting them with weapons bought at a shop or earned during battle. Hidden challenges within each chapter can unlock more allies, legendary weapons, and helpful items, so be sure to keep an eye out Players will need to navigate an obstacle course of deadly traps and lethal puzzles in real-time, but be prepared for an ambush at any corner. Psychopathic enemies like the Ogre and the Ronin aren’t the only deadly elements you’ll need to overcome.\nCombat scenarios are peppered with unique environmental hazards, from ticking time bombs to runaway trains. There is never a dull moment in Showgunners Gain fame by avoiding death, surviving rounds, and eliminating your enemies with gruesome panache . The more you succeed, the more fans you earn; your growing fame will yield increasingly beneficial sponsorship deals.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/showgunners-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/showgunners-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-7400 / AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 960 4 GB / Radeon RX 570 4 GB",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Artificer",
        "Platform": "PC",
        "Game Size": "8.9 GB",
        "Released By": "CODEX emu",
        "Version": "v1.1.0.53480 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/finwiug2x2b8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/showgunners-preinstalled-steamrip.jpg"
}