{
    "page_url": "https://steamrip.com/sid-meiers-civilization-six-2x/",
    "title": "Sid Meier’s Civilization VI Free DDL",
    "description": "Get Sid Meier’s Civilization 6 for free instantly and play pre-installed on SteamRiP\nOriginally created by legendary game designer Sid Meier, Civilization is a turn-based strategy game in which you attempt to build an empire to stand the test of time. Become Ruler of the World by establishing and leading a civilization from the Stone Age to the Information Age. Wage war, conduct diplomacy, advance your culture, and go head-to-head with history’s greatest leaders as you attempt to build the greatest civilization the world has ever known.\nCivilization VI offers new ways to engage with your world: cities now physically expand across the map, active research in technology and culture unlocks new potential, and competing leaders will pursue their own agendas based on their historical traits as you race for one of five ways to achieve victory in the game. Gaokao.Love.100Days\nThere are currently nineteen civilizations included in the base game. This includes the Aztec civilization, which was officially added ninety days after launch. The Nintendo Switch version contains these nineteen, as well as all civilizations from the initial four DLC packs. Each civilization has three unique components: a unit, a piece of infrastructure (be it a building, a district or a tile improvement) and an ability. Furthermore, each leader has a distinct ability of their own, as well as a unique agenda which shapes his or her play style and diplomatic personality when controlled by the AI. Abilities can be multi-faceted, and some leader abilities include a further unique unit, giving the civilization a total of two.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/sid-meiers-civilization-vi-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/sid-meiers-civilization-vi-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7×64 / Windows 8.1×64 / Windows 10×64",
        "Processor": "Intel Core i3 2.5 Ghz or AMD Phenom II 2.6 Ghz or greater",
        "Memory": "4 GB RAM",
        "Graphics": "1 GB & AMD 5570 or nVidia 450 or Intel Integrated  530",
        "DirectX": "Version 11",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Firaxis Games, Aspyr (Mac), Aspyr (Linux)",
        "Platform": "PC",
        "Game Size": "18.1 GB",
        "Repack By": "CODEX",
        "Version": "v1.0.12.58 | Full version + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/kzj1o6i0vvpi",
        "https://gofile.io/d/lH3G9Y",
        "https://1fichier.com/?ucjjlhkczy0afpi5zlso"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/sid-meiers-civilization-vi-free-download-preinstalled-steamrip.jpg"
}