{
    "page_url": "https://steamrip.com/sifu-free-download-2y/",
    "title": "Sifu DD Edition Download",
    "description": "Sifu game for free instantly and play pre-installed on SteamRIP\nSifu is a beat ’em up action -adventure game played from a third-person perspective. The game, which is inspired by Pak Mei kung fu, includes over 150 unique attacks. Basic attack moves can be chained together, though some combos may grant players additional tactical opportunities, such as being able to knock down enemies or stun them. The protagonist and all hostile enemy characters have a “structural gauge”.\nWhen the gauge is completely filled, the guard of these characters will break and they will become vulnerable to finishing attacks. Players can also block strikes, though this will gradually fill their gauge. Alternatively, players can also evade attacks or parry when an enemy is about to land a blow. A successful parry allows the player to stun the enemy or throw them towards a particular direction. The game allows players to take advantage of the environment and improvise new attacks or alter their strategy when facing a stronger opponent.\nFor instance, the player may kick an enemy off a ledge , or utilize various objects as makeshift weapons. The last enemy in a combat section may sometimes enter a state of uncontrolled frenzy, essentially becoming a miniboss. Occasionally, the player may be presented with dialogue options , which can enable them to potentially avoid combat altogether depending on their choice of words. When the player dies in the game, they are magically resurrected at the spot where they die and age several years. As the player character ages, their strikes will be more powerful, but they will have less health. Need for Speed: Shift\nPlayers will encounter shrines, which will be the place where they heal and unlock new skills . They can also visit the “wuguan”, a kung fu school, to practice their skills in between levels. Abilities are lost when the player character dies, though it is possible to permanently unlock upgrades so that they are available at the beginning of each run. As the player completes multiple runs, they can access the “detective board”, where the information collected across different runs will be stored, and secret areas and shortcuts may open up.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/sifu-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/sifu-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1 or later",
        "Processor": "AMD FX-4350 or Intel Core i5-3470",
        "Memory": "8 GB RAM",
        "Graphics": "Radeon R7 250 or GeForce GT 640 or equivalent",
        "DirectX": "Version 10",
        "Storage": "22 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie",
        "Developer": "Sloclap",
        "Platform": "PC",
        "Game Size": "24 GB",
        "Released By": "RUNE emu",
        "Version": "v1.28_6,720 | Full  (Latest) + All DLCs/Bonuses",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/4ZInBP",
        "https://datanodes.to/twqu2vn5z7hh/SIFU-SteamRIP.com.rar",
        "https://buzzheavier.com/fx56v77o7kqx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/sifu-preinstalled-steamrip.jpg"
}