{
    "page_url": "https://steamrip.com/simairport-free-download-1r/",
    "title": "SimAirport",
    "description": "SimAirport Download PC Game In Direct Link for free on SteamRIP\nYou control everything, from the cruise- altitude decisions to the smallest ground-level details. Challenge yourself to create an efficient & profitable international hub in Career Mode, or create an artistic masterpiece without credit rating worries in Sandbox Mode.\nConstruct your terminal , hire staff, sign airline contracts, tweak the daily flight schedule, configure standby gate availability, plan & design your infrastructure bag handling systems, roads & taxiways , fuel systems, runways, gates, hangars, service vehicles, and everything in between. Deeply simulated gameplay where each detail makes an impact down to the trash cans.\nThe starter airport helps get aircraft landing & cash flowing almost immediately. Aim for profitability by scaling up, but remember: more passengers, more problems! Getting 2,000 pax out is easy. Avoiding bottlenecks for 10k+ pax will likely require different tactics Moving walkways, multi-story structures, additional terminals, oneway taxiways, staggered schedules, and careful standby gate allocation these are but a sampling of the concepts you’ll leverage on your way to truly mastering the art of large-scale airport operations .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/simairport-free-download-steamrip-1.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/simairport-free-download-screenshots-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Intel i5/i7+ or AMD-FX+",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GT 550 or AMD Radeon HD 5000 – Integrated GPUs might not work",
        "DirectX": "Version 11"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "LVGameDev LLC",
        "Platform": "PC",
        "Game Size": "832 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 12584556 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5ozib3lamtt6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/simairport-free-download-preinstalled-steamrip.jpg"
}