{
    "page_url": "https://steamrip.com/skul-the-hero-slayer-free-download-2i/",
    "title": "Skul: The Hero Slayer Download Direct Link",
    "description": "Get Skul The Hero Slayer PC game for free instantly and play pre-installed on SteamRiP\nThe human race attacking the Demon King’s castle is nothing new and has happened countless times before. What makes this time different though, is that the Adventurers decided to join forces with the Imperial Army and the ‘Hero of Caerleon’ to lead a full onslaught in hopes of wiping out the Demons once and for all. They attacked the Demon stronghold with overwhelming numbers and succeeded in its total destruction.\nAll of the demons in the castle were taken prisoner except for one lone skeleton named ‘Skul’. Tons of skulls, tons of playable characters Skul is no ordinary skeleton. In addition to his formidable fighting skills, he can gain new and exciting abilities depending on which skull he’s wearing. Use up to 2 skulls at a time, each of which has its own unique attack range, speed and power. Choose combos that match your playing style and switch them in the heat of battle to bring your enemies to their knees . The power is in your hands.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/skul-the-hero-slayer-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/skul-the-hero-slayer-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "Dual core from Intel or AMD at 2.8 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia 450 GTS / Radeon HD 5750 or better",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "SouthPAW Games",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "CODEX emu",
        "Version": "v1.09.02 | Full version (latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/21t7wndt86m1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/skul-the-hero-slayer-free-download-preinstalled-steamrip.jpg"
}