{
    "page_url": "https://steamrip.com/slap-city-free-download-p1/",
    "title": "Slap City Directly Download",
    "description": "Slap City is a Seriously Fun platform fighter with a perfect mix of characters from the Ludosity universe. Play Locally or Online. Slap it hard in Ranked or fast and loose in Slap Ball game mode. We are the original inventors of Clutch Technology. The Tenants\nPlay with up to four players locally or online with a variety of game modes, options, and computer controlled opponents, or play for points in online 1 on 1 ranked battles . Save replays of your greatest moments Want a break from fighting? Try Slap Ball! (Note: there will be no breaks from fighting.)\nIn this team-based game mode, players slap the ball into the opponent’s basket to score. The more the ball gets juggled in the air without touching the ground, the more points it’ll be worth, allowing for some serious plays and comebacks.\nDon’t forget to rest near your goal to recover some damage, or each hit from your opponent will soon send you several laps around the court. Want to explore the city on your own? No worries We got you covered with a single-player platforming story campaign for every main character",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/slap-city-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/slap-city-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "SSE2 instruction set support",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX/OpenGL/Vulkan Compatible",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Ludosity",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "CHRONOS (cs.rin.ru)",
        "Version": "Build 9601271 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/53og5imr37vq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/slap-city-preinstalled-steamrip.jpg"
}