{
    "page_url": "https://steamrip.com/slavania-free-download/",
    "title": "Slavania",
    "description": "Travel and fight your way through Slavania with the help of a powerful artifact: the magic spear. Upgrade your spear to gain access to new mobility mechanics. Use the spear as a platform to jump on, cling to ceilings, and teleport to its location. Every upgrade unlocks new ways to explore the world.\nHit ‘em how you like Enchant your spear to make it slash, burn, freeze or pierce armor. Burn spider webs and carnivorous plants, freeze enemies in place, and destroy boulders blocking your way with a piercing spearhead. Use every ability the spear grants you. You’ve already paid for them, after all Goblin Stone\nHighly varied locations and captivating visuals Journey through a mysterious land. Visit villages , cursed forests, and the underworld. A team of talented artists and animators have created a wide variety of unique places and environments for the game’s world.\nMultiple threats Defend the citizens of Slavania from the dark and terrifying creatures of the underworld . Prepare to fight for your life against over 40 types of monsters. Strike first, before they overrun you.\nTrack down and hunt bosses Become an immortal hunter of mythical beings. Study monsters, collect notes with information about their habitats and weaknesses, then set out on a hunt.\nDon’t forget to eat Munch on gingerbread , then wash it down with Water of Life and mead. Purchase new items and upgrades to increase your chances of survival in the beautiful but dangerous world of Slavania.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/slavania-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/slavania-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core 2 Duo E5200",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 9800GTX+ (1GB)",
        "DirectX": "Version 10",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "FrostLeaf Games LLC",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bmuvmkufpdqy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/slavania-preinstalled-steamrip.jpg"
}