{
    "page_url": "https://steamrip.com/smalland-survive-the-wilds-free-download-s1/",
    "title": "Smalland Survive the Wilds",
    "description": "Before the time of the giants , we lived freely under the Sun and Moon. Centuries have passed, but those stories of the surface world have been passed down through the generations. Now the giants are gone, and you, Vanguard, must venture out into the wilds once more, on an urgent mission.\nBe brave, and do not falter. Traverse lake sized puddles , scale skyscraper sized trees, scramble through cavernous cracks in roads, as you experience a huge open world from a new perspective. Explore dense forests, hazardous swamps and strange ruins left over from the time before. ZED ZONE\nUncover lore and knowledge from hidden NPCs scattered throughout the world and learn to survive in this vast wilderness. Uncover recipes that will let you tame and ride an array of critters. Leap huge distances on the back of a Grasshopper, zoom around on a Damselfly , scurry from place-to-place on a Spider. This world and its inhabitants are yours to conquer.\nPlay alongside friends with support for up to 10 players in multiplayer . Explore together, fight together, build together and survive the wilds as a team. Scavenge or refine resources to build your encampment with multiple material tiers, from leaves and twigs to sturdy stone. Pick your favourite spot in the world and build, or scale vast trees and claim your own settlement at the top.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/smalland-survive-the-wilds-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/smalland-survive-the-wilds-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1",
        "Processor": "Intel(R) Core(TM) i5-9400 CPU @ 2.90GHz or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650 or equivalent",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Merge Games",
        "Platform": "PC",
        "Game Size": "11 GB",
        "Released By": "RUNE + Steamless",
        "Version": "v1.8_44_ee0f21bd | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/BB7zxe",
        "https://megadb.net/xc0jeg5159mx",
        "https://buzzheavier.com/438kpnfj29o2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/smalland-survive-the-wilds-preintalled-steamrip.jpg"
}