{
    "page_url": "https://steamrip.com/snezhinkasentinel-girls2-free-download/",
    "title": "Snezhinka:Sentinel Girls2",
    "description": "Play as Snezhinka, a fixed-term contract employee at a private military company, and hold the line against waves of hostile mechs in a 2.5D dystopian world. In order to survive against increasingly powerful enemies, you’ll need to use what remains of your meager salary after taxes and other expenses are deducted to purchase cards and develop your combat capabilities. FAIRY TAIL: DUNGEONS\nThis fast-paced shooting game can be enjoyed with a controller or a mouse and keyboard. The controls are simple: you’ll only need to move, aim, shoot, and use gadgets.\nIn addition to a robust story mode, this game also features two challenge mode complete with online rankings and a collection in which you can rewatch cutscenes and peruse information on the game’s characters and weapons.\nSnezhinka’s older sister is a member of the elite Molten Iron Squadron . One day, Snezhinka abruptly loses contact with her sister, prompting her to join the private military company Blue Peacock Co. and head for the front lines of the war in order to bring her sister home.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/snezhinka-sentinel-girls2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/snezhinka-sentinel-girls2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10 or Newer",
        "Processor": "Intel Core i5 or higher",
        "Memory": "4 MB RAM",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "hinyari9",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ojrx29pyu3pq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/snezhinka-sentinel-girls2-preinstalled-steamrip.jpg"
}