{
    "page_url": "https://steamrip.com/sniper-elite-4-deluxe-edition-free-download-2v/",
    "title": "Sniper Elite 4",
    "description": "Get Sniper Elite 4 for free instantly and play pre-installed on SteamRiP\nDiscover unrivalled sniping freedom in the largest and most advanced World War 2 shooter ever built. Experience tactical third-person combat, gameplay choice and epic longshots across gigantic levels as you liberate wartime Italy from the grip of Fascism .\nSet in the aftermath of its award-winning predecessor , Sniper Elite 4 transports players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to ancient forests, mountain valleys and colossal Nazi megastructures. Covert agent and elite marksman Karl Fairburne must fight alongside the brave men and women of the Italian Wild Hunt\nResistance and defeat a terrifying new threat with the potential to halt the Allied fightback in Europe before it’s even begun. Encounter hours of gripping gameplay in huge campaign levels with hundreds of enemies, vehicles and high-ranking Nazi officers to hunt. Forge your own path to your objectives, uncover new sniper nests, find secret side missions, collectibles and more\nExperience genre-defining rifle ballistics where snipers must take account of wind, gravity and heart rate to land satisfying shots over hundreds of meters. Adapt seamlessly to any combat situation with an impressive array of iconic World War 2 sniper rifles, pistols, submachine guns, heavy weapons, traps, grenades and explosives .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/sniper-elite-4-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/sniper-elite-4-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7, 64-bit Windows 8.1 or 64-bit Windows 10",
        "Processor": "Intel CPU Core i3-2100 or AMD equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon HD 7"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Rebellion",
        "Platform": "PC",
        "Game Size": "51.6 GB",
        "Released By": "STEAMPUNKS",
        "Version": "v1.5.0 | Full version (Latest) + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/D8AD99559C",
        "https://buzzheavier.com/raidloxs5qya",
        "https://1fichier.com/?flgqdlhua7kk3rnysua8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/sniper-elite-4-preinstalled-steamrip.jpg"
}