{
    "page_url": "https://steamrip.com/soda-crisis-free-download-j1/",
    "title": "Soda Crisis",
    "description": "[Soda Crisis] is a fast-paced side-scrolling shooter game. You play as a mysterious character of unknown origin, equipped with advanced high-tech gears and fierce combating skills – definitely the chosen one for this rescue mission! Bearing the mystery of origins, you will explore this futuristic world, search out the secrets behind the danger, and fight for the fate of Earth Crisis ahead! You’ll encounter the cola-thirsty desperadoes, who are armed with formidable firepower and robust defensive system, not to mention the invincible giant space battleships.\nPush yourself to the limits: sprinting , climbing, shooting, dodging, hooking and jumping, with all these smooth moves lead your character through the rain of bullets, and get rid of all enemies in the way It will be a tough battle, don’t go diving in! Before you start, pick the most handy weapons with powerful ammunition . Remember strengthen your defensive equipment, and be prepared for anything V Rising\nGet blown up? It’s okay, the battlefield will be reset for you in the next second Enjoy the thrill of fighting with fast retries! Get stronger and stronger in infinite rebirth Soda Crisis has experienced several times of overthrows and reconstructions, while we keep growing up in setback. Now, we can finally show it to you. We hope you will enjoy it, and thanks to all those who follow us",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/soda-crisis-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/soda-crisis-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5 4460",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 770",
        "DirectX": "Version 10",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Team Soda",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v10.30.2022 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mi3btoxhn7gr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/soda-crisis-preinstalled-steamrip.jpg"
}