{
    "page_url": "https://steamrip.com/song-of-nunu-a-league-of-legends-story-free-download-b1/",
    "title": "Song of Nunu: A League of Legends Story",
    "description": "Join best friends Nunu and Willump on an adventure across the frozen wilds of the Freljord. Discover the unbreakable bond between boy and yeti as you traverse a land both beautiful and treacherous, making new allies (and enemies) on a journey of family, friendship, and magic . Song of Nunu: A League of Legends Story is a single-player story adventure developed by Tequila Works. Dive headfirst into an immersive narrative set in the undiscovered reaches of the Freljord, where every snowy step brings you closer to the truth about Nunu and Willump’s past. Jusant\nPlay as Nunu, a young boy searching for his mother with the help of his best friend, Willump. United by their endless imagination and shared love of snowball fights, the two will have to work together to navigate the Freljord, saving it—and each other—from the danger that lies within.\nHike, climb, and sled your way across the Freljord, a frostbitten land full of harsh blizzards, ferocious wolves… and enchantment. Use your head to progress through the frozen landscape and uncover what secrets lie hidden beneath the ice.\nMeet the powerful League of Legends champions of the Freljord, including Braum, Ornn, Volibear, and Lissandra whose twisted magic threatens to bury the world in Dark Ice.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/song-of-nunu-a-league-of-legends-story-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/song-of-nunu-a-league-of-legends-story-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 (64-bit)",
        "Processor": "Intel Core i5-2300 / AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 960 / AMD Radeon R9 380X / Intel Arc A380",
        "DirectX": "Version 12",
        "Storage": "24 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Tequila Works",
        "Platform": "PC",
        "Game Size": "10.3 GB",
        "Released By": "FLT",
        "Version": "Build 12468890 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/myhRgo",
        "https://megadb.net/aq330108hwpn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/song-of-nunu-a-league-of-legends-story-preinstalled-steamrip.jpg"
}