{
    "page_url": "https://steamrip.com/songs-of-conquest-free-download-s1/",
    "title": "Songs of Conquest",
    "description": "Songs of Conquest is a turn-based strategy game inspired by 90s classics. Lead powerful magicians called Wielders and venture to lands unknown. Wage battle against armies that dare oppose you and hunt for powerful artifacts. The world is ripe for the taking seize it Explore a wide variety of maps with diverse enemies and valuable loot. Venture into contrasting biomes with unique enemy factions, environments and battlefields. Manage resources, research new advancements and expand your kingdom.\nPlan your towns to match your playstyle – will you utilise brute force, magic or a mix of both? There are many paths to world domination. Dive into a deep combat system utilizing troop abilities and powerful magic. Combine troops to maximize available spells and damage potential. LEGO MARVEL’s Avengers\nUse the battlefield to your advantage by claiming high ground and protecting bottlenecks. Immerse yourself in epic single player adventure or challenge your friends to an honourable duel, online or local The in-game level editor allows you to create your own adventures using the same tools the developers use to create campaign and skirmish maps.\nScript in-game events, control the soundtrack, write dialogue and share your creations with others Four factions are locked in an epic conflict. Arleon, knights of old battling each other for dominance. Rana, ancient tribes fighting for survival in the swamp . Loth, necromancers raising the dead to create a glorious future. Barya, bold mercenaries and inventors dedicated to coin, gunpowder and independence .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/songs-of-conquest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/songs-of-conquest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "i5 Dual Core or Ryzen 5",
        "Memory": "8 GB RAM",
        "Graphics": "Integrated graphics card",
        "DirectX": "Version 10",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Strategy",
        "Developer": "Lavapotion",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.6.1 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fyzco2291anz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/songs-of-conquest-preinstalled-steamrip.jpg"
}