{
    "page_url": "https://steamrip.com/song-of-syx-free-download/",
    "title": "Songs of Syx",
    "description": "Songs of Syx is a fantasy city-builder where you start off as an insignificant colony and build, scheme, and fight your way towards a metropolis and empire. The mechanics are complex and true to life, where small events can spiral into the collapse of kingdoms. Easy to learn, but impossible to master. It’s set in a low-fantasy world with graphics aimed at stimulating your imagination .\nLiving World\nFull of different races, cultures, old and new gods and strange creatures. Night turns to day, climate and weather change, and migrations of animals and people flow. Droughts and pestilence, pirates and bandits, and new discoveries will ensure kingdoms and empires come and go with or without your intervention. No game will ever be the same, as all content, background stories, and easter-eggs are generated uniquely each iteration, while still sticking to a rich background story that you will unfold piece by piece.\nBase Building on a Huge Scale\nTake your settlement further that you ever have by winning the hearts of your subjects or by whipping them into submission. Have their number swell your insignificant colony into a metropolis of tens of thousands. Be careful not to overreach, as everything you build requires upkeep and a slight disruption of your production, or a dip in your standing, could quickly spiral out of control and your people will not hesitate to depose a thoughtless king.\nGrand Strategy\nAs your capital grows, it must be sustained by the villages, towns, lumber camps, castles and ports that constitute your kingdom. But you’re not alone in. Other kingdoms and despots are eager to forge an alliance or expand their borders, so tend to your relations and try not to stand out culturally. To grow your might, you must engage in global trade, where there are no fixed prices, no currency to mint, but based on supply and demand, turning you rich one day, and your goods worthless on the next, if you’re not paying attention. DRAGON QUEST III HD-2D Remake",
    "screenshots": [
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1162750/ss_9bbb2f0f8e9efb98f449d6de483e95c98e6cb684.600x338.jpg",
        "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1162750/ss_9639a90c0098b9c94a5b650ab04c7a5054b2bfde.jpg",
        "https://buzzheavier.com/6oc3w4kc2t0h"
    ],
    "system_requirements": {
        "OS *": "Windows 10 (8u51 and above) Windows 8.x (Desktop) Windows 7 SP1 Windows Vista SP2",
        "Processor": "Pentium 2 266 MHz processor",
        "Memory": "512 MB RAM",
        "Graphics": "256MB with opengl 3.3 support",
        "Storage": "300 MB available space",
        "Sound Card": "Requires openAL support"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Gamatron AB",
        "Platform": "PC",
        "Game Size": "480 MB",
        "Released By": "DRM-Free | MuppyC CSF, cs.rin.ru",
        "Version": "v0.69.24 | Build 18955563 | Branch: ea69",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/6oc3w4kc2t0h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/Songs-of-Syx_featured_final.jpg"
}