{
    "page_url": "https://steamrip.com/sonic-mania-free-download-o1/",
    "title": "Sonic Mania Download",
    "description": "Get Sonic Mania PC game for free instantly and play pre-installed on SteamRiP\nSonic Mania is a platformer timed to coincide with the 25th anniversary of the series, in which you again have to go on a dangerous long journey with Sonic and his loyal friends The plot of the game once again revolves around Sonic and his loyal friends, Tails the fox and Knuckles the echidna. Suddenly, the heroes discovered a powerful artifact, the Ruby of Illusion, with which you can control time and space. Naturally, the friends decided to go for the artifact, but they were late – Dr. Eggman was the first to reach him and kidnap him.\nNow the heroes need to return the artifact at all costs and do everything possible to prevent what the doctor planned. During the journey, the heroes will have to visit a huge heap of locations, among which there are locations from previous games in the series, and new ones. At the same time, many of the enemies will also be very familiar to you. As for the characters, you can play as any of the three friends. At the same time, one must take into account the fact that each of the characters has their own unique abilities and skills .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/sonic-mania-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/sonic-mania-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 10",
        "Processor": "Core 2 Duo",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 9.0c compliant video card 256MB",
        "DirectX": "Version 9.0c",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual",
        "Developer": "Christian Whitehead, Headcannon, PagodaWest Games",
        "Platform": "PC",
        "Game Size": "247 MB",
        "Released By": "CPY/PLAZA Update",
        "Version": "v1.06.0503 | Full  (Latest) + Encore DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/b9yl2vh5hoti"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/sonic-mania-free-download-preinstalled-steamrip.jpg"
}