{
    "page_url": "https://steamrip.com/sons-of-the-forest-free-download-s1/",
    "title": "Sons Of The Forest Online Download",
    "description": "An entirely new experience from the makers of the ‘ The Forest ’ Sent to find a missing billionaire on a remote island, you find yourself in a cannibal -infested hellscape. Craft, build, and struggle to survive, alone or with friends, in this terrifying new open-world survival horror simulator. Experience complete freedom to tackle the world how you want. You decide what you do, where to go and how best to survive. There are no NPC’s barking orders at you or giving you missions you don’t want to do.\nYou give the orders, you choose what happens next. Enter a world where nowhere is safe and fight against a range of mutated creatures, some who are almost human like, and others who are like nothing you have ever seen before. Armed with pistols, axes, stun batons and more, protect yourself and those you care for. Feel every interaction; Break sticks to make fires. Use an axe to cut out windows and floors. Build a small cabin, or a sea-side compound, the choice is yours.\nPluck fresh salmon directly from streams in spring and summer . Collect and store meat for the cold winter months. You’re not alone on this island, so as winter rolls in and food and resources become scarce you won’t be the only one looking for a meal. Survive alone, or with friends. Share items and work together to build defenses . Bring back-up to explore above and below ground.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/sons-of-the-forest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/sons-of-the-forest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 10",
        "Processor": "INTEL CORE I5-8400 or AMD RYZEN 3 3300X",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 3GB or AMD Radeon RX 570 4GB",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Endnight Games Ltd",
        "Platform": "PC",
        "Game Size": "10.8 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "v1.0 (Build 14775638) | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/eLZLED",
        "https://datanodes.to/ii1faorzt07y/Sons-Of-The-Forest-SteamRIP.com.rar",
        "https://buzzheavier.com/s2kxq0tkw2j6",
        "https://megadb.net/i3hu3ocqy3p3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/sons-of-the-forest-preinstalled-steamrip.jpg"
}