{
    "page_url": "https://steamrip.com/soulash-free-download-1q/",
    "title": "Soulash Free Download",
    "description": "Bored of playing the protagonist that saves the world? Remember the times when it was good to be evil? In Soulash you’ll be able to unleash your Berserker rage at annoying NPC characters and butcher them for meat. You will torture mortals with fire and electricity as a powerful Warlock .\nSummon an unlimited army of zombies and skeletons and rot everything in your path as a Lich Necromancer . And if you prefer the unexpected, you can’t go wrong with a Goblin Inquisitor A forgotten god versus the whole world. What Lies in the Multiverse\nA dark being, ready to regain his might using souls ripped from hundreds of enemies. Soulash is a turn-based combat -heavy roguelike told from the villain’s point of view, where an open world exists only for the pleasure of complete destruction. From gnome villages, through dwarven keeps, into the hot deserts, with massive Capital City and the Black Pyramid – everything is to conquer, destroy and cover in blood.\nKill other gods and change the landscape of the entire world. Rivers will turn into blood, winter will come, the world will cover in darkness as the sun dies. Consume the souls of gods and change the world on a massive scale",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/soulash-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/soulash-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2 cores",
        "Memory": "500 MB RAM",
        "Graphics": "OpenGL",
        "Storage": "400 MB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG",
        "Developer": "Artur Smiarowski",
        "Platform": "PC",
        "Game Size": "239 MB",
        "Credits to": "cs.rin.ru",
        "Version": "v1.0.2 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/779yk2tn89n0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/soulash-preinstalled-steamrip.jpg"
}