{
    "page_url": "https://steamrip.com/souls-of-chronos-free-download-u1/",
    "title": "Souls of Chronos Directly Download",
    "description": "A Fateful Encounter in a World of Turmoil Fifteen years after the catastrophic event known as the “ Apocalypse “, the world is still in an era of great unrest. Even Astella , a harbour town far from the centre of the Vallois Empire, is no exception. Local gangs, slum dwellers, external forces, and secret societies all these factions are clashing together over their own agenda and interests. ENDER LILIES: Quietus of the Knights\nUnder such tension, the fragile peace here at Astella is on the verge of sliding back into all-out conflicts. In the midst of this crisis, a young boy and a young girl crossed paths. In the nick of the time, Sid, facing his impending death as a result of a series of unfortunate events, was luckily saved by a girl, Torii, who wields a special power – Chrono.\nChronus , a novel species that appeared suddenly post-Apocalypse, has the ability to manipulate time. Once bound to a “Linked” by the mysterious “Chrono Pact”, a Chronus will be able to reach its maximum power as its ties with the “Linked” grow stronger. Is the Chronus just a cold-blooded weapon-for-hire, or perhaps a partner whom you can trust with your life? The answer to this question has yet to be found. In order to investigate an unusual crime, Sid and Torii together embark on a journey heading into the greater unknown.\nIn this intricate intertwining of events, every decision made could shape the future of Astella Bringing their visions and beliefs, as well as their unique personalities and circumstances, various characters will join Sid and Torii in uncovering the long-kept mysteries of Astella. Build ties with all races and freely decide Sid’s personality via action and dialogue options, thereby impacting the fate of various factions at Astella. Choose wisely whom you want to partner up with, and then act together to weather the imminent storm hovering above Astella",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/soul-of-chronos-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/soul-of-chronos-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 11 compatible video card (integrated or dedicated with min 1024MB memory)",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "FUTU Studio",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "CHRONOS (cs.rin.ru)",
        "Version": "v1.5.226.9 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2mejk9yh06ep"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/soul-of-chronos-preinstalled-steamrip.jpg"
}