{
    "page_url": "https://steamrip.com/south-of-midnight-free-download/",
    "title": "South of Midnight",
    "description": "From the creators of Contrast and We Happy Few, South of Midnight is a spellbinding third person action-adventure game set in the American Deep South.\nAs Hazel, you will explore the mythos and encounter creatures of Southern folklore in a macabre and fantastical world. When disaster strikes her hometown, Hazel is called to become a Weaver: a magical mender of broken bonds and spirits. Imbued with these new abilities, Hazel will confront and subdue dangerous creatures, untangle the webs of her own family’s shared past and – if she’s lucky – find her way to a place that feels like home.\nA DARK MODERN FOLKTALE When a hurricane rips through Prospero , Hazel is pulled into a Southern Gothic world of memory made real and must embark on a journey to rescue her mother and safeguard her hometown. In this folktale for modern times, Hazel will need to reconcile the weight of family, history, and legacy against her own identity.\nCONFRONT MYTHICAL CREATURES Wield an ancient power to restore creatures and uncover the traumas that consume them. Cast weaving magic to fight destructive Haints, explore the diverse regions of the South, and reweave the tears in the Grand Tapestry.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/south-of-midnight-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/south-of-midnight-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "AMD Ryzen 3 1300X / Intel i3-8100",
        "Memory": "12 GB RAM",
        "Graphics": "AMD RX 580 / Nvidia GTX 1060",
        "DirectX": "Version 12",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Compulsion Games",
        "Platform": "PC",
        "Game Size": "66 GB",
        "Released By": "RUNE emu",
        "Version": "v1.1.0 185 111 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/qdkF4i",
        "https://buzzheavier.com/czberqkyicty"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/south-of-midnight-preinstalled-steamrip.jpg"
}