{
    "page_url": "https://steamrip.com/space-engineers-2-free-download/",
    "title": "Space Engineers 2",
    "description": "Space Engineers 2 is an open world sandbox game where engineering meets exploration, construction, and survival in the vastness of space. Become a pioneer in the distant Almagest system, a new uncharted world with infinite possibilities for creativity and discovery. Build everything from starships to space stations as you craft your own path in this highly anticipated next chapter of the Space Engineers series!\nCreation and destruction never felt this good Space Engineers 2 takes everything we’ve learned over the past 10 years and reimagines the space engineering experience with more depth and creative freedom than ever before. Powered by our new VRAGE3 engine, creation and destruction feel better than ever. Whether you’re a veteran or new to the game, Space Engineers 2 offers a vast, engaging sandbox where your creativity can truly shine .\nBuild with great precision Explore the next generation of construction! Build anything you can imagine with incredible precision using the new 25 cm Unified Grid System. No more large vs small grid – blocks fit seamlessly together, making it easier to create intricate builds. Mounting point visualization and grid lines make building more intuitive than ever.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/space-engineers-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/space-engineers-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 10 (latest SP) 64-bit",
        "Processor": "Intel i3 @ 3.0 GHz or higher (or AMD equivalent)",
        "Memory": "16 GB RAM",
        "Graphics": "GeForce 1660 Super / Radeon RX 5600 XT / Intel B580 or higher",
        "DirectX": "Version 12",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy, Early Access",
        "Developer": "Keen Software House",
        "Platform": "PC",
        "Game Size": "17.3 GB",
        "Released By": "RUNE emu",
        "Version": "Build 17106433 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/H52Ygu",
        "https://buzzheavier.com/ubqxzy917b8a",
        "https://datanodes.to/cjstoh9v35um/Space-Engineers-2-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/space-engineers-2-preinstalled-steamrip.jpg"
}