{
    "page_url": "https://steamrip.com/spaceflight-simulator-free-download-1o/",
    "title": "Spaceflight Simulator Free Download",
    "description": "Be in command of your own space program, from rocket design to interplanetary travel and achieve your dream of cruising through the cosmos in your custom spacecraft. In Spaceflight Simulator , you will get to engineer your rockets, plan launches and flights, attempt landings, deploy payloads and explore new worlds. With so many parts to pick from, you will learn through trial and error how to build spacecrafts best adapted to each of your missions. You will have to master navigating through the Solar system and landing your vehicle on all the planets and moons , each with their own atmospheric and terrain conditions.\nDuring the design phase, you will get to assemble your own launch vehicle from a wide variety of components and pair them with a multitude of engines, all modeled after their real-world counterparts. Each part possesses its own technical specifications (mass, aerodynamics , etc.) which will affect your rocket’s behavior. All engines accurately model thrust and fuel consumption affecting how much payload you’ll be able to carry safely. You’ll be able to create multistage vehicles, control how they separate and when secondary burn occurs in order to achieve the optimal trajectory.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/spaceflight-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/spaceflight-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or Newer",
        "Processor": "2.4 GHz Dual core",
        "Memory": "2 GB RAM",
        "Graphics": "Integrated  (512MB)",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Early Access",
        "Developer": "Stefo Mai Morojna",
        "Platform": "PC",
        "Game Size": "93 MB",
        "Released By": "cs.rin.ru (skaider)",
        "Version": "v1.5.9.8 | Early Access (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/r2nnqcnmogq0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/spaceflight-simulator-preinstalled-steamrip.jpg"
}