{
    "page_url": "https://steamrip.com/spaceengine-free-download-1x/",
    "title": "SpaceEngine Directly Download",
    "description": "SpaceEngine is a 1:1 scale science-based Universe simulator, featuring billions upon billions of galaxies, nebulae, stars, and planets, all shown at their full real-world scale. Explore Earth and our neighboring worlds in the Solar System, orbit a black hole in a galaxy billions of light-years away, or visit anything in between seamlessly, with no transitions. DC’s Justice League: Cosmic Chaos\nAll of time and space are yours to explore – cruise between the stars at a million times the speed of light, and accelerate time to watch the orbital motions of a thousand worlds play out before your eyes. Every planet you encounter in your journey will feature procedural 3D terrain with detailed textures.\nEverything you see in the sky – stars and galaxies , planets and moons, asteroids and comets, black holes and neutron stars, star clusters and nebulae – are yours to explore at the press of a button. Spacecraft with Newtonian physics and pilot-assist autopilot features (in early development but fully usable) are yours to fly anywhere in the universe in the Flight Simulator mode.\nSpaceEngine is also very friendly for creators of mods and add-ons – create your own planets, star systems, even galaxies, import your own spacecraft models, create custom GUI skins, and more, all easily sharable with others.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/space-engine-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/space-engine-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-3220T or AMD FX-4100",
        "Memory": "6 GB RAM",
        "Graphics": "GeForce GTX 1050 Ti or Radeon R9 380 (4 GB)",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Early Access",
        "Developer": "Cosmographic Software",
        "Platform": "PC",
        "Game Size": "64.7 GB",
        "Released By": "GOG",
        "Version": "v0.990.48.2034 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/65B2D497C1",
        "https://datanodes.to/c2yq64dhf9el/SpaceEngine-SteamRIP.com.rar",
        "https://buzzheavier.com/3a6jzfknld0j",
        "https://1fichier.com/?8vg07ascvsvvgapp6cx1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/space-engine-preinstalled-steamrip.jpg"
}