{
    "page_url": "https://steamrip.com/spelunky-2-free-download-1r/",
    "title": "Spelunky 2 Free",
    "description": "Spelunky 2 Download PC Game In Direct Link for free on SteamRIP\nSpelunky returns in this greatly-expanded sequel to the original roguelike platformer Meet the next generation of explorers as they find themselves on the Moon, searching for treasure and missing family. Spelunky 2 builds upon the unique, randomized challenges that made the original a classic, offering a huge adventure designed to satisfy players old and new. Spelunky 2’s world is even denser than the one in the original game, offering many more areas, characters, traps, and items, as well as new ways to interact with them (and for them to interact with each other).\nThe world has expanded in other ways, too, with branching paths and multi-layered levels adding a third dimension to the classic 2d platforming. Animals can also be tamed and ridden. And dynamic liquid physics create new challenges and make the world feel extra reactive and alive.\nBack in Base Camp , characters you unlock will mill about and relax between runs, offering encouragement and advice. As you explore, your camp will expand and develop into a thriving little community to welcome you whenever you need a break from exploring. While there, you can also access shortcuts and practice your moves in safety.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/spelunky-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/spelunky-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Quad Core 2.6 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 750",
        "DirectX": "Version 11",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Mossmouth, BlitWorks",
        "Platform": "PC",
        "Game Size": "542 MB",
        "Released By": "ALI213",
        "Version": "v1.27 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dwttan6rz3gt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/spelunky-2-free-download-preinstalled-steamrip.jpg"
}