{
    "page_url": "https://steamrip.com/spellforce-conquest-of-eo-free-download-z1/",
    "title": "SpellForce: Conquest of Eo",
    "description": "In this turn-based strategy game set in the fantastic world of SpellForce, take up the mantle of your master as the heir to his mysterious wizard’s tower. Study a multitude of spells to cast over the lands around you, summon fantastical minions and train mighty warriors to roam the world. Fight in fast-paced but tactical turn-based battles. Win over mighty heroes to go on adventures for you, find useful artefacts and ingredients or bring back riches. MONSTER HUNTER RISE: SUNBREAK\nSeek out talented apprentices to expand your domain and workers to gather a wealth of resources for you. Unearth the secrets inherited from your master and follow his quest to tap and unleash the ultimate source of magical power – the Allfire Among the other mages, there are those who would oppose your rise to power. You will have to face great armies and even greater ambitions of your rival Mages . Can you survive the struggle for domination?\nTo expand your domain, you will need to control sources of Allfire, so you can fill your grimoire with new magical spells, craft mighty artefacts, and expand and improve your tower. Become a Necromancer creating dozens of powerful undead, an Alchemist concocting potions and explosive vials for use in battle or an Artificer crafting glyphs and magical items to furnish your troops with. Bolster your might with over 60 spells and more than100 different troops from lowly goblins to majestic griffons .\nBefriend cities, harvest resources, and expand your domain. Fill your grimoire with arcane knowledge to best your rivals as you vie for sources of power. Hunt arcane artefacts and unearth the long-hidden secrets of the Shapers or take control of mythical locations to absorb their power. Improve your tower and furnish it with new rooms to grow your dominion, with upgrades ranging from a necromancer’s crypt to the mystical crystal chamber",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/spellforce-conquest-of-eo-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/spellforce-conquest-of-eo-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64bit  – Windows 10/11",
        "Processor": "AMD Ryzen 3 1300X / Intel Core i4-4690K",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050Ti / Radeon RX 570 4GB Vram",
        "DirectX": "Version 11",
        "Storage": "9 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Strategy",
        "Developer": "Owned by Gravity",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "RUNE emu",
        "Version": "v01.10.31934 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/i8ifqggz3tf0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/spellforce-conquest-of-eo-preinstalled-steamrip.jpg"
}