{
    "page_url": "https://steamrip.com/spellrogue-free-download-s1/",
    "title": "SpellRogue",
    "description": "Manipulate dice in fun and novel ways to control the fickle Mana Dice and bend their fate to your will. Reroll, duplicate, split, flip and enchant with special effects to take command of the Mana Dice’s random nature, and use them to cast your mighty spells . Lysfanga: The Time Shift Warrior\nBut beware, the foul Voidwalkers are spreading their influence on the once peaceful inhabitants of the world and has made them ravenous. Battle your way through the Deadwoods, across the Scorched Desert and hunt down the source to cleanse the land of the corruption. Engage groups of enemies and prioritize your targets carefully. Learn how each of the different opponents are capable of sabotaging your well laid plans when they interact directly with your spells and Mana Dice.\nThe contagious mushrooms may ‘infect’ your spells with spreading debuffs, while the undead can curse your Mana Dice to roll poorly. The fiery elementals can even set your spells ablaze, hurting you if they are used. Meet the band of SpellRogues, each with their own unique elemental theme and special ways of interacting with Mana Dice and mechanics .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/spellrogue-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/spellrogue-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7/10/11",
        "Processor": "3 Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 950",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy, Early Access",
        "Developer": "Guidelight Games",
        "Platform": "PC",
        "Game Size": "850 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.9.0b25 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ghx70o90t8s3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/spellrogue-preinstalled-steamrip.jpg"
}