{
    "page_url": "https://steamrip.com/spiderheck-free-download-1r/",
    "title": "SpiderHeck Directly Download",
    "description": "SpiderHeck is a fast-paced couch co-op brawler where spiders battle it out in a deadly dance of chaos. Choose to take on waves of ferocious enemies as a lone wolf (spider), or join forces with your friends, then challenge them to a duel afterwards so you can gleefully watch them do a neat trick before they launch themselves face-first into the lava. What mode are you in the mood for today?\nCut down waves of enemies or create modded duels; fight one-on-one or try to make it through the challenges—then try again, and again, and again Alternatively, you can just spend your time putting cute hats on the spiders. Sure, you can play with your friends: co-op or against each other, local or online But what if you don’t have any friends? Don’t worry, we’re here to give you a big hug and let you know that there are tons of solo modes , too. Shovel Knight Dig\nWe’ve got everyone covered. The physics system here is so much more than just swinging from webs: do a somersault, push off of your opponent, swing your sword 360°, get stuck, wiggle your way out, and deal the killing blow as you land on your enemy’s head.\nNow imagine all that but in zero gravity (yes, there’s a level like that). Each arena has its own unique features, and while some may help you, others will bring the pain. You’re welcome to come up with a strategy in the beginning and stick to it, but you don’t have to—just let inertia and random chance make your gameplay unpredictable.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/spiderheck-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/spiderheck-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i3 2125 3.30 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "nVidia GTX 750",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "1100 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Neverjam",
        "Platform": "PC",
        "Game Size": "396 MB",
        "Released By": "Mr_GOLDBERG (cs.rin.ru)",
        "Version": "Build 9562425 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/deevl0sb8igv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/spiderheck-preinstalled-steamrip.jpg"
}