{
    "page_url": "https://steamrip.com/spirit-of-the-island-free-download-o1/",
    "title": "Spirit of the Island",
    "description": "There’s an old tradition running in your homeland: to become an adult and complete the coming of age ritual, you must go on a journey of discovery. Your adventure begins on a distant island, deep in a tropical Archipelago. What was once a prosperous tourist destination is now a shade of its former glory: and it’s your job to bring it back to life! Explore the Archipelago, meet the locals, and lend them a hand to restore the tourist paradise while you try to uncover the mysteries of your past Your tropical life will be a busy one, so grab your tools and let’s get started Rollerdrome\nFirst things first: you’ll need a source of food, a place to spend the night in, and some resources to build a farm and kickstart your tropical journey. So what are you waiting for — time to explore your lands There’s plenty to do in Spirit of the Island\nNo matter how you choose to spend your time, you will gain experience and improve your skills , unlock new recipes, and become more efficient at everything you do, which will make your new life easier. Spirit of the Island features 10 unique skills , such as farming, mining, foraging, social, and even fishing, which comes as its own special mini-game. Will you become a true master of all?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/spirit-of-the-island-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/spirit-of-the-island-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel i3",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce MMX 110",
        "DirectX": "Version 10",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG, Simulation",
        "Developer": "1M Bits Horde",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.4.0.0 | Full  + 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6vtgosugsa23"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/spirit-of-the-island-preinstalled-steamrip.jpg"
}