{
    "page_url": "https://steamrip.com/spirit-mancer-free-download/",
    "title": "Spirit Mancer",
    "description": "Fight your way home using a variety of weapons, guns, and Spirit Cards . Capture and summon demons as your allies in battles to defeat the Queen of Inferno. Lost in the inferno, you are a demon hunter who accidentally got teleported to this demon’s realm. Now, you must unite with your allies and find a mystical key to open the portal back to your world. Capture demons you encounter to fight alongside you while you shoot and slash with a variety of guns and weapons that you can unlock. ATLYSS\nBreak enemies’ shields using combinations of attacks to capture their spirits into spirit cards, adding them to your deck. Turn any enemy you encounter into your own demon spirit. Build your own deck with the demon spirits you prefer before you embark on your demon-hunting mission. Choose your play style with 100+ spirit cards that you can find. Explore the Beautiful World of Inferno Embark on an adventure in a 2D pixel art world full of life and stories of the inhabitants across various locations in the inferno. From beautiful beaches to volcanic fortresses, lush forests , and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/spirit-mancer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/spirit-mancer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Window 10",
        "Processor": "Dual Core @ 2.00Ghz",
        "Memory": "3 GB RAM",
        "Graphics": "NVIDIA GTX 1050 | AMD Radeon RX 580",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Sunny Syrup Studio",
        "Platform": "PC",
        "Game Size": "5.9 GB",
        "Released By": "TENOKE",
        "Version": "Build 16512053 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/frj97i12wvz6/Spirit-Mancer-SteamRIP.com.rar",
        "https://megadb.net/9h4ckaooorfy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/spirit-mancer-preinstalled-steamrip.jpg"
}