{
    "page_url": "https://steamrip.com/sprocket-free-download-p1/",
    "title": "Sprocket Tank design",
    "description": "Design tanks in a dedicated and intuitive designer, allowing the realistic armour mechanics that make tank combat so unique. Explore tank design’s challenges through WW1, the interwar period and the early, mid and late stages of WW2. Couch Combat\nIf you don’t enjoy figuring things out or you don’t know much about tanks, it may be worth holding off until better guidance is in place. Easy to use and flexible enough to give you endless design starting points. Drag on a face or edge to move it. Bigger compartments create more internal space but have more surface to armour. Well angled shapes may bounce incoming shells off entirely, leaving only a scratch and several ringing ears.\nSet the thickness of each armour plate, allowing you to block shots from your foes. Though the weight and space used adds up Build a gun capable of piercing enemy armour . You’ll need enough space and force to rotate it. Make sure you save enough room for ammo Humans are light but large and quite essential, squeeze them in and assign them one or more roles.\nCramped and overworked crew perform poorly. Add functional and decorative parts to the exterior of your vehicle. These can define where internals are e.g. the engine is positioned where you place your exhausts and vents, then gets hit if a shell pierces your armour in that area. Place a fuel port in front of the driver and the fuel tank just might absorb a projectile , saving their life if it doesn’t ignite. Focus your tracks and suspension on trench crossing, mountain climbing, going fast or just looking cool.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/sprocket-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/sprocket-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Early Access",
        "Developer": "Hamish Dunn",
        "Platform": "PC",
        "Game Size": "706 MB",
        "Released By": "cs.rin.ru",
        "Version": "v0.2.16b | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/3hhJGV",
        "https://megadb.net/v5c30078vl47",
        "https://buzzheavier.com/47rwjw06oxfq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/sprocket-preinstalled-steamrip.jpg"
}