{
    "page_url": "https://steamrip.com/spyparty-free-download-1n/",
    "title": "SpyParty",
    "description": "Get SpyParty PC game for free instantly and play pre-installed on SteamRiP\nSpyParty is a competitive espionage game about human behavior, performance, perception, and deception. While most spy games have you machine-gunning stuff, blowing things up, and driving fast, SpyParty has you hide in plain sight, blend into a high-society cocktail party, deceive your opponent, and detect subtle behavioral tells to achieve your objectives and not get shot. Finally you can be like the suave and confident spies you find in films or books, risking it all by doing the final mission right in front of the sniper as the clock runs out! Golf Club Wasteland\nThere are plenty of games that explore being a super-powered commando with an infinite supply of ammunition and no brains; SpyParty is a new and quite different game about the more interesting, deeper, and more subtle aspects of being a spy.\nThe current main gameplay mode is 1v1 Spy versus Sniper online multiplayer, although there is limited single-player Sniper play right now, and a single player Spy and Sniper practice mode for trying out missions and whatnot.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/SpyParty-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/SpyParty-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP",
        "Processor": "Celeron",
        "Memory": "2 GB RAM",
        "Graphics": "Intel HD 3000",
        "DirectX": "Version 9.0",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy, Early Access",
        "Developer": "Chris Hecker, John Cimino",
        "Platform": "PC",
        "Game Size": "356.29 MB",
        "Repack By": "CODEX",
        "Version": "Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zmieccrsjp9x"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/SpyParty-free-download-preinstalled-steamrip.jpg"
}