{
    "page_url": "https://steamrip.com/star-trek-resurgence-free-download-z1/",
    "title": "Star Trek: Resurgence",
    "description": "Star Trek: Resurgence is a narrative adventure game featuring dialog choices, relationship building, and exploration. Alongside dialog-driven role playing and rich branching storylines, you will also engage with the Star Trek universe in a variety of other gameplay styles, including shuttle piloting, phaser fights, tricorder scanning, stealth, and micro-gameplay mechanics .\nThe two just fit; Star Trek’s best and most beloved stories are about dialogue . Not just two characters talking to each other, but about how people relate to one another and the world around them. It’s about the choices we make when faced with tough decisions, what we could be if we learned from our past mistakes, and the strength gained by uniting diverse peoples and cultures .\nAll of that can be hard to do in a video game, which are typically too busy firing phasers and torpedoes to get more than a few words in edgewise. Star Trek: Resurgence’s conversation-heavy approach doesn’t always work, but it never loses sight of what makes Star Trek, well… Star Trek. And when the developers at Dramatic Labs lock onto that signal, it nails the series’ appeal while providing an engaging story full of memorable characters. Resurgence follows the crew of the USS Resolute, picking up a few years after the end of Star Trek: Nemesis (the final Next Generation films). Warhammer 40,000: Boltgun\nThe story puts you in control of two instantly likable characters: Jara Rydeck, a humble yet accomplished Academy graduate who has been brought in to be the ship’s new first officer; and Carter Diaz, a charming and funny, adventure -hungry engineer who used his great talent to skip the Academy and enlists to get and out see the galaxy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/star-trek-resurgence-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/star-trek-resurgence-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 64-bit",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Dramatic Labs",
        "Platform": "PC",
        "Game Size": "14.7 GB",
        "Released By": "Razor1911",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/72gx7pb608cb",
        "https://store11.gofile.io/download/7b089eb5-1998-4e90-8b09-5ff63a83e0c3/Star-Trek-Resurgence-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/star-trek-resurgence-preinstalled-steamrip.jpg"
}