{
    "page_url": "https://steamrip.com/star-wars-dark-forces-remaster-free-download-s1/",
    "title": "STAR WARS: Dark Forces Remaster",
    "description": "Star Wars: Dark Forces Remaster has been brought to life by the team at Nightdive Studios, fully remastered through its proprietary KEX engine, allowing the game to run on modern gaming devices at up to 4K resolution at 120FPS. New and returning players will enjoy Star Wars : Dark Forces Remaster’s upgraded gameplay, high-resolution textures, enhanced lighting and rendering, and support for gamepads. Spiritfall\nThe original 1995 Star Wars: Dark Forces raised the bar for FPS games, offering players a significant degree of movement and interactivity , a large selection of items and power-ups, and engaging environments.\nIn the first Star Wars FPS video game, players assume the role of Kyle Katarn, a defector of the Galactic Empire turned mercenary for hire. Katarn joins the Rebel Alliance’s covert operations division tasked with infiltrating the Galactic Empire, where he discovers the secret Dark Trooper Project. The development of this powerful new series of Imperial battle droids and power-armored stormtroopers stands to strengthen the Empire’s grip on the galaxy unless Katarn and the Rebel Alliance intervene. Key Features:",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/star-wars-dark-forces-remaster-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/star-wars-dark-forces-remaster-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Nightdive Studios, LucasArts",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 13585667 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rhh6j7kppj1l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/star-wars-dark-forces-remaster-preinstalled-steamrip.jpg"
}