{
    "page_url": "https://steamrip.com/star-wars-jedi-knight-jedi-academy-1j/",
    "title": "Star Wars Jedi Knight Jedi Academy",
    "description": "Forge your weapon and follow the path of the Jedi Jedi Knight : Jedi Academy is the latest installment of the highly acclaimed Jedi Knight series. Take on the role of a new student eager to learn the ways of the Force from Jedi Master Luke Skywalker. Cultist Simulator\nInteract with famous Star Wars characters in many classic Star Wars locations as you face the ultimate choice: fight for good and freedom on the light side or follow the path of power and evil to the dark side.\nCustomize your character by defining both look and gender before entering the Academy to learn the power-and dangers- of the Force. Construct your own Lightsaber from handle to blade. As you progress, discover the power of wiedling two Lightsabers or the ultimate double-bladed Lightsaber made famous by Darth Maul. New vehicles, weapons, force powers and Star Wars locations.\nUnique level selection system allows you to choose your own missions and adventures . Six multiplayer modes including team based siege mode and two-on-one power duel. Fight in 23 multiplayer arenas",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/star-wars-jedi-knight-jedi-academy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/star-wars-jedi-knight-jedi-academy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 2000, XP or Vista",
        "Processor": "Pentium II or Athlon 450 MHz",
        "Memory": "128 MB",
        "Graphics": "32 MB OpenGL compatible",
        "DirectX": "9.0a",
        "Hard": "Drive: 1.3 GB"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Raven Software",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "GOG",
        "Version": "Build 131484 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6j575qffv99i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/star-wars-jedi-knight-jedi-academy-preinstalled-steamrip.jpg"
}