{
    "page_url": "https://steamrip.com/starship-troopers-terran-command-free-download-j1/",
    "title": "Starship Troopers: Terran Command",
    "description": "Starship Troopers: Terran Command is a thrilling real-time strategy game set in the Starship Troopers movies universe. Take command of the Mobile Infantry and do your part in the war against the Arachnid threat. Build, develop and control your armies to strike an effective balance between tactical superiority and strength in numbers. Ensure that human civilization , not insect, dominates the galaxy now and always\nThe population of the harsh desert planet Kwalasha needs our help. Their daily lives of hard work in the mining industries has been disturbed by a new danger that they cannot face alone: the Arachnid. The Mobile Infantry will swiftly move in, take back control over the planet and smash everything that has more than two legs. Take part in this exciting military campaign, meet unique characters, see amazing locations and experience the heroic war against the Bug. Oxide Room 104\nWhile the Arachnids can rely on virtually limitless numbers, the Mobile Infantry must develop effective tactics to overcome this imbalance. Deploy your units at strategic locations to cover vital choke points and gain superior firepower through tactical use of elevation levels. Be wary, however, that battle mechanics such as True Line of Sight and True Line of Fire also allow Bugs to lay ambushes around every corner, as they are well known for their use of surprise attacks and deception. An expansive range of unique units are at your disposal, each with its own strengths, weaknesses and unlockable elite abilities.\nSquads of Rifle Troopers, for example, form the mainstay of your forces and can utilize “shotgun suppression” or “boom bundles” when they reach the elite experience level. Rocket Troopers on the other hand are specialists that deliver various types of deadly ordnance, ranging from armor-piercing and high-explosive warheads to incendiary and canister payloads. As a campaign progresses, new technology buildings can be deployed to unlock the true potential of the Federation’s arsenal with E-Pulse rifles, TAC Fighter airstrikes, heavily armed Marauder bipedal vehicles, and many more developments optimized for spraying Bug ichor across the battlefield.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/starship-troopers-terran-comman-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/starship-troopers-terran-comman-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8, Windows 10 (64 bit), Windows 11",
        "Processor": "Intel Core i5 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1050/ Radeon RX 560",
        "DirectX": "Version 9.0",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "The Artistocrats",
        "Platform": "PC",
        "Game Size": "5.9 GB",
        "Released By": "GOG",
        "Version": "v2.01.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/k9t4vusbnhip"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/starship-troopers-terran-comman-preinstalled-steamrip.jpg"
}