{
    "page_url": "https://steamrip.com/star-wars-jedi-fallen-order-free-download-o3/",
    "title": "STAR WARS Jedi Fallen Order Deluxe Edition",
    "description": "Get STAR WARS Jedi Fallen Order for free instantly and play pre-installed on SteamRiP\nA galaxy-spanning adventure awaits in Star Wars Jedi: Fallen Order , a new third-person action-adventure title from Respawn Entertainment. This narratively driven, single-player game puts you in the role of a Jedi Padawan who narrowly escaped the purge of Order 66 following the events of Episode 3: Revenge of the Sith. On a quest to rebuild the Jedi Order, you must pick up the pieces of your shattered past to complete your training, develop new powerful Force abilities and master the art of the iconic lightsaber – all while staying one step ahead of the Empire and its deadly Inquisitors. Tom Clancy’s Rainbow Six Siege\nWhile mastering your abilities, players will engage in cinematically charged lightsaber and Force combat designed to deliver the kind of intense Star Wars lightsaber battles as seen in the films. Players will need to approach enemies strategically, sizing up strengths and weaknesses while cleverly utilizing your Jedi training to overcome your opponents and solve the mysteries that lay in your path.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/star-wars-jedi-fallen-order-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/star-wars-jedi-fallen-order-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7/8.1/10",
        "Processor": "AMD FX-6100/Intel i3-3220 or Equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon HD 7750, NVIDIA GeForce GTX 650 or Equivalent",
        "DirectX": "Version 11",
        "Storage": "55 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Respawn Entertainment",
        "Platform": "PC",
        "Game Size": "55.8 GB",
        "Released By": "ANADIUS/XATAB",
        "Version": "v1.0.10.0 (Deluxe Edition) | Full  (Latest) + all add-ons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/89484B638D",
        "https://buzzheavier.com/5vijs2rc1rj2",
        "https://1fichier.com/?d0yj9ffbpmqh1znpdxo6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/star-wars-jedi-fallen-order-free-download-preinstalled-steamrip.jpg"
}