{
    "page_url": "https://steamrip.com/starmancer-free-download-s2/",
    "title": "Starmancer Free  Link",
    "description": "Get Starmancer PC game for free instantly and play pre-installed on SteamRiP\nAfter a catastrophe on Earth, humanity launches the Starmancer Initiative in a desperate attempt to seek refuge among the stars. Millions of refugees upload their consciousness into your memory banks–entrusting their minds and the future of the human race to an Artificial Intelligence, a Starmancer. To you. T\nhe events of the game take place in the distant future, in which, after some catastrophe, humanity was on the verge of complete destruction. The earth turned out to be unsuitable for life, and in the end it was decided to launch the Starmanser program, which was supposed to transfer control over all mankind and the race as a whole to artificial intelligence – you. Five Nights At Freddy’s: Help Wanted\nNow the human race and its fate are in your hands, and you must do everything possible to save humanity and revive it on another suitable planet.  Stranded in a strange solar system, your task as a Starmancer is to construct and manage a space station capable of sustaining life for the countless minds trapped in your corrupted memory banks, and return to the fleet–by any means necessary.\nStarmancer offers gameplay with consequences, a living sandbox environment, crafting, and managing the daily lives of colonists. Create a utopian society where everyone is well fed, happy, and safe. Or go rogue and figure out how many times a colonist can eat wheat before they go crazy. The choice is yours",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/starmancer-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/starmancer-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 64-bit",
        "Processor": "2.0 ghz DualCore CPU",
        "Memory": "4 GB RAM",
        "Graphics": "DirectX 10 compatible GPU",
        "DirectX": "Version 10",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy, Early Access",
        "Developer": "Ominux Games",
        "Platform": "PC",
        "Game Size": "122 MB",
        "Released By": "N/A",
        "Version": "v0.2.9 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1epzs8s3edos"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/starmancer-free-download-torrent-steamrip.jpg"
}