{
    "page_url": "https://steamrip.com/starvaders-free-download/",
    "title": "StarVaders",
    "description": "The alien invasion has shattered Earth’s defenses. Pilot, the fate of humanity now rests in your hands. Take the helm of a powerful mech and fight off the invasion—one card at a time. StarVaders combines tactical grid-based combat with deckbuilding strategy , placing you in command of a formidable mech during humanity’s last stand against the invaders. Build up a deck of powerful cards, unleash devastating combos, and defend the Earth at all costs\nPilot Your Mech Into Battle! Every mech in StarVaders has its own squad of pilots . Each mech introduces unique cards and mechanics, while your pilot further enhances your strategy with their distinct, powerful abilities. Take command of the Gunner Mech to unleash an endless flurry of bullets and explosions, get up close and personal with the ninja-like Stinger Mech, or unleash the powerful spells and summons of the Keeper Mech gogh: Focus with Your Avatar\nDiscover Game-Breaking Combos! Unleash game-breaking combos , outsmart the invaders, and push your build to the limit against ever-escalating threats. With hundreds of cards, artifacts, and upgrades, no two runs are ever the same. Missed a perfect combo or found yourself cornered by the invaders? Use a Chrono Token to rewind time and rewrite your fate.\nEndless Replayability After each run, unlock powerful new cards, pilots, and deadlier enemies and bosses that raise the stakes in future battles. There’s an endless supply of builds and combos to discover every time you play.\nReady to push your limits? Take on the various Challenge Modes or dive into the Daily Run to really prove what you’re made of",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/starvaders-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/starvaders-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows XP, Vista, 7, 8/8.1, 10, 11",
        "Processor": "2.0 Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "4GB Video Memory",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Pengonauts",
        "Platform": "PC",
        "Game Size": "613 MB",
        "Released By": "TENOKE",
        "Version": "Build 18289427 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/57vnxl5y9eut"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/starvaders-preinstalled-steamrip.jpg"
}