{
    "page_url": "https://steamrip.com/star-trek-infinite-free-download-g1/",
    "title": "Star Trek: Infinite Free Download",
    "description": "With Star Trek: Infinite there is no singular way to play. Whether you wish to take the route of diplomacy, espionage, warfare, or a mix of all of these, there are multiple paths to victory. You are in the command, and the fate of the galaxy is in your hands!\nChoose between the United Federation of Planets, Klingon Empire , Romulan Star Empire, or Cardassian Union. You will take on the role of the leader in charge of all the major decisions of your faction as the game unfolds. With each faction having their own unique styles of play, your decisions determine how successful you are in reaching your goals.\nStar Trek: Infinite has been meticulously created to provide an immersive Star Trek experience while allowing you to shape the story of your playthrough according to the choices you make as the leader of your chosen faction. As you take on the role of the Federation, you’ll have the opportunity to recruit iconic captains and officers, including Picard, Janeway, Sisko, and Data to name a few. Meanwhile, other factions offer their own set of iconic characters to enlist, such as Gowron , Makbar, Garak, and many more.\nBeyond the potential cast of characters you recruit to your faction, the game grants you access to a range of starships from the Star Trek universe, tailored to each faction’s arsenal. From the Federation’s reliable Intrepid- and Defiant-class ships, the menacing Cardassian Galor-class vessels, the sleek Romulan D’deridex, or even the formidable Klingon Negh’Var battleships.\nOf course, the Enterprise-D can be developed and added to the Federation fleet through the bespoke storytelling system developed for Star Trek: Infinite.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/star-trek-infinite-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/star-trek-infinite-steamrip.jpg"
    ],
    "system_requirements": {},
    "game_info": {
        "Genre": "Adventure, Simulation, Strategy",
        "Developer": "Nimble Giant Entertainment",
        "Platform": "PC",
        "Game Size": "7.5 GB",
        "Released By": "RUNE",
        "Version": "v1.0.0.256 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/a2qtbdzu61ar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/star-trek-infinite-preinstalled-steamrip.jpg"
}