{
    "page_url": "https://steamrip.com/starcraft-remastered-free-download-1m/",
    "title": "StarCraft Remastered",
    "description": "Prepare to rediscover a classic. StarCraft: Remastered upgrades Blizzard Entertainment’s original sci-fi real-time strategy game and its acclaimed expansion, StarCraft: Brood War, from beginning to end. Experience the intergalactic battle between the terran, protoss, and zerg with improved graphics and audio…and the same classic gameplay that made StarCraft a global phenomenon. Discover the story that started it all as three races (the mechanized terrans, psi-powered protoss, and insectoid zerg) encounter each other for the first time.\nEngage in a legendary conflict that spans worlds over the course of more than 50 campaign missions. Once you’ve completed the campaign, go head-to-head or team up with other players online. Command your faction and vie for control of eight unique environments. Build your base, conscript your army, and lead one of StarCraft’s three radically different races to victory. LEGO Batman: The Videogame\nWith StarCraft: Cartooned you can experience StarCraft’s classic gameplay with all-new, lighthearted cartoon graphics! StarCraft: Cartooned reimagines every unit, structure, map, menu and story mission in the game, drawing on the lovable artistic style of Carbot Animations, with full gameplay and online. Infuse your StarCraft – Remastered experience with the lighthearted charm of Carbot Animations\nWhether you’re returning to the Koprulu Sector or visiting for the first time, StarCraft: Cartooned is an all-new way to experience the classic sci-fi real-time strategy game. The magic doesn’t end with cartoon units—all the structures, maps, and menus of StarCraft: Remastered, including all campaign missions, have been transformed! Whether you’re returning to the Koprulu Sector or visiting for the first time, StarCraft: Cartooned is an all-new way to experience the classic sci-fi real-time strategy game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/starcraft-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/starcraft-remastered-screenshots-steamrip.webp"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10",
        "Processor": "2.6 Ghz Dual Core",
        "Memory": "2 GB RAM",
        "Graphics": "1GB 3D DirectX 9 Compatible video card",
        "DirectX": "Version 9.0c",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Blizzard Entertainment",
        "Platform": "PC",
        "Game Size": "5.7 GB",
        "Released By": "TeamBlizzless offline",
        "Version": "v1.23.9.10756 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d3vq6q8ur9io"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/starcraft-remastered-preinstalled-steamrip.jpg"
}