{
    "page_url": "https://steamrip.com/state-of-decay-yose-free-download-s2/",
    "title": "State of Decay: YOSE Free Download",
    "description": "Get State of Decay: YOSE PC game for free instantly and play pre-installed on SteamRiP\nMake your stand against the collapse of society in the ultimate zombie survival-fantasy game. Explore an open world full of dangers and opportunities that respond to your every decision. Recruit a community of playable survivors, each with their own unique skills and talents. Design and fortify your base against the relentless hordes of the undead. Perform daring raids for food and ammunition, and do whatever it takes to live another day.\nState of Decay, along with major Add-Ons Breakdown and Lifeline, is now fully remastered in stunning 1080p. New missions, weapons, and extra content, along with improved lighting , textures, animations and combat mechanics, will pull you even deeper into the post-outbreak world. How will you survive the zombie apocalypse?\nMysterious supply crates start dropping into remote areas across the map, attracting massive hordes of zombies. Wipe out the infestation and you can grab some of the rarest and most powerful equipment seen in State of Decay. Fruit Ninja VR\nYour favorite characters from Lifeline can now be unlocked in Breakdown, including the previously unplayable Kelly “Sasquatch” Eldridge.\nNot only do players get a brand-new SUV, but custom vehicle skins are also distributed across all maps for greater personalization.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/state-of-decay-yose-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/state-of-decay-yose-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo E6600 / Athlon X64 3400",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 470 / Radeon HD 5850 / Intel HD 4600",
        "DirectX": "Version 11",
        "Storage": "4158 MB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Simulation",
        "Developer": "Undead Labs",
        "Platform": "PC",
        "Game Size": "2.89 GB",
        "Repack By": "CODEX",
        "Version": "v1.0 (Update 4) | Updated  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9hv9xw1ms2hd",
        "https://buzzheavier.com/pusidkl87ebk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/state-of-decay-yose-free-download-preinstalled-steamrip.jpg"
}