{
    "page_url": "https://steamrip.com/state-of-decay-2-juggernaut-edition-free-download-1t/",
    "title": "State of Decay 2 Juggernaut Edition Download",
    "description": "State of Decay 2 is an open-world survival-fantasy game set just after the zombie apocalypse . Your small community of survivors seeks to rebuild a corner of civilization, and you get to make all the decisions about how that happens.\nYou decide who to recruit to your team, where to settle your community, how to fortify and upgrade your base, and when it’s time to move to greener pastures. You select which survivor to bring along on a scavenging run for the food and ammo you need, and who you’ll use to fight off the zombies attacking your base. You choose how you’ll deal with other people who move into your town. Will you be friendly and welcoming or will you aggressively defend your territory? Party Animals\nEvery player’s experience in the sandbox is unique. Each character in your community has their own special set of skills and traits, so no two communities are ever the same. The challenges you face also vary from game to game, based on who you recruit and the decisions you make along the way.\nWith co-op multiplayer support, you can visit your friends’ communities and help them through a tough spot, bringing back rewards for your own communities later. Alternate game modes include a full 10-hour narrative campaign and a four-player zombie-slaughtering “siege defense” mode. Undead Labs is proud to present our best-ever vision of the zombie apocalypse. Keep your eyes peeled and your weapons ready. This is one apocalypse you won’t want to miss.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/state-of-decay-2-juggernaut-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/state-of-decay-2-juggernaut-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-2500 @2.7Ghz / AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 760 2GB / AMD Radeon HD 7870",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Simulation",
        "Developer": "Undead Labs",
        "Platform": "PC",
        "Game Size": "17.3 GB",
        "Released By": "RUNE",
        "Version": "Update 38 (Build 16133819) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/lDBtdh",
        "https://buzzheavier.com/gzdcobt07a10"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/state-of-decay-2-juggernaut-edition-preinstalled-steamrip.jpg"
}