{
    "page_url": "https://steamrip.com/steamworld-heist-ii-free-download/",
    "title": "SteamWorld Heist 2",
    "description": "All is not well on the waves, a crisis is brewing. A water crisis Mysteriously , this precious resource has turned deadly, corroding metal limbs and mechanical hearts.\nTake charge as Captain Leeway joined by his ragtag crew of Steambots to uncover the enigmatic menace threatening the Great Sea. Five Nights at Freddy’s: Into the Pit\nAIM In the heat of battle , precision is key. Take aim and let your shots ricochet with deadly accuracy. Every move counts as you strategise your way to victory, using your environment to your advantage and bouncing bullets off surfaces to outmaneuver your enemies.\nPLOT As Captain , you hold the fate of your crew in your hands. Equip them with different weapons, customise their abilities and equipment, and use the rich job system to overcome any challenge that comes your way. From seasoned veterans to eager recruits , your crew looks to you for guidance as you navigate the dangers of the Great Sea.\nPLUNDER Set sail and explore the vast ocean blue, where adventure, mystery, and danger await beyond each breaking wave… Engage in real-time naval combat , raid enemy bases and seize valuable loot to bolster your crew’s strength. And when the battles are won, take respite at one of the lively bars where you can relax, upgrade your gear and crew, and forge new alliances with fellow bots.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/steam-world-heist-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/steam-world-heist-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 8400",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1050",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Strategy",
        "Developer": "Thunderful Development",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "RUNE",
        "Version": "v1.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/13x6tb542vdm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/steam-world-heist-preinstalled-steamrip.jpg"
}