{
    "page_url": "https://steamrip.com/steelrising-free-download-l1/",
    "title": "Steelrising",
    "description": "The city burns and bleeds as it suffers the madness of King Louis XVI and his violent legions of automatons. Aegis, a mechanical masterpiece created by the engineer Vaucanson to be the queen’s bodyguard, must save the French Revolution in this challenging action-RPG. NBA 2K23\nUp against the king’s mechanical soldiers, deadly accuracy will be needed. String together dodges , parries, jumps and devastating attacks to fight your way through Paris. Every fight will test your nerve and requires excellent discipline, while the huge relentless machine bosses demand patience and skill Define your own style and upgrade your abilities as you progress through the game.\nYou can play as a ruthless warrior, a hard-hitting bodyguard, a deadly dancer or a virtuoso of the elemental arts. Take advantage of a wide variety of weapons and skills to approach each fight in your own unique way Using carriages, grapples , secret passages, a detailed map, and other methods and tools you find along the way, explore a city experiencing its darkest days. Your grappling hook adds a new dimension to exploration and Paris’s verticality. Combined with your dash ability, it will provide access to all the city’s secrets across multiple levels you can explore over and over again.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/steelrising-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/steelrising-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-3770 or AMD Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce RTX 2060, 6 GB",
        "DirectX": "Version 12",
        "Storage": "67 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Spiders",
        "Platform": "PC",
        "Game Size": "67 GB",
        "Released By": "CODEX emu",
        "Version": "Build 10819451 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/0C986A0D50",
        "https://buzzheavier.com/txxyvcy43vd4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/steelrising-preinstalled-steamrip.jpg"
}