{
    "page_url": "https://steamrip.com/stick-em-up-free-download-s2/",
    "title": "Stick Em Up Free  Link",
    "description": "Stick Em Up game for free instantly and play pre-installed on SteamRiP\nStick Em Up, is a game in which you will use your skills, your wits, and your arsenal of guns and explosives to pull off cunning, exciting, and sometimes messy heists. Watch as your skills take you from robbing lonely gas stations to the most massive banks. The options for pulling off your heists are nearly endless, alert the police by coming in loud, manipulate your hostages and the clerks into giving you the valuables, use your hostages to keep the police at bay, or be swift and silence all the witnesses before anyone can be called to the scene .\nObserve your targets, build your arsenal, take your hostages , and escape with a fat bag of cash. Stick Em Up features a unique combat system that allows players to adapt the game to their style of gunplay. Players can utilize different environments to take on tons of enemies, use hostages to pause fighting, and much more. The combat system also features an intense gore system, which while doesn’t overpower the scene provides an entertaining experience through dismemberment and an exaggerated physics -based combat system. GearCity",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/stick-em-up-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/stick-em-up-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 bit or Newer",
        "Processor": "Modern Multi Core Cpu",
        "Memory": "4 GB RAM",
        "Graphics": "Modern Dedicated  Card",
        "DirectX": "Version 9.0",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Strategy",
        "Developer": "Nicholas Rizzo",
        "Platform": "PC",
        "Game Size": "2.81 GB",
        "Released By": "HOODLUM",
        "Version": "Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5umm3brqdpum"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/stick-em-up-poster-steamrip.jpg"
}