{
    "page_url": "https://steamrip.com/stormworks-build-and-rescue-free-download-s2/",
    "title": "Stormworks Build and Rescue Download",
    "description": "Get Stormworks Build and Rescue for free instantly and play pre-installed on SteamRiP\nStormworks : Build and Rescue is a rich and dramatic physics playground. Take your custom-designed, block-based and programmable vehicles into fierce oceanic storms. Plan and execute thrilling rescues in a variety of challenging crisis scenarios. Export and share your meticulously designed vehicles and missions with other players via the Steam workshop .\nPlay the game how you want. Custom mode gives dozens of creative tools and options, suited for players who like to let their creativity run free and wild. In this mode, you are not limited by the survival and realism rules allowing you to create large and complex vehicles from the outset. Ideal for players who like to create scale replicas of real-world vehicles or wacky and ambitious creations of their own design. Hundred Days\nCareer mode focuses on progression and an overarching plot of starting your own search and rescue service from humble beginnings and building it up to cover the entire Stormworks world map. You will have to manage your finances, build space, and your own safety as you complete various missions to finance larger, more complex vehicles and new land bases.\nSurvival difficulty options add an extra level of difficulty to your search and rescue operation with the most in depth and advanced game features including: advanced engine and fuel mechanics, LUA based micro controllers, vehicle damage, spreadable fire, and a variety of player damage types that can result in player deaths including:",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/stormworks-build-and-rescue-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/stormworks-build-and-rescue-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 10",
        "Processor": "Intel Core i5-4440 / AMD Ryzen 3 1200",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 6000 / GeForce 550 / AMD R7 250 (AMD Radeon HD 7750)",
        "Network": "Broadband Internet connection",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Simulation",
        "Developer": "Geometa",
        "Platform": "PC",
        "Game Size": "491 MB",
        "Version": "v1.14.2 | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/zacmkcxcba1q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/stormworks-build-and-rescue-free-download-preinstalled-steamrip.jpg"
}