{
    "page_url": "https://steamrip.com/storror-parkour-pro-free-download/",
    "title": "STORROR Parkour Pro",
    "description": "STORROR Parkour Pro delivers the definitive parkour video game, capturing the essence of the sport and its vibrant culture. Players are invited to push the limits of human movement, exploring a sprawling and dynamic urban environment filled with challenges and opportunities. Choose to play as members of the renowned STORROR team or create a custom character, navigating the streets and rooftops of London’s Isle of Dogs. Engage in high-stakes escapes from security, compete in thrilling competitions, and challenge the status quo. The game empowers players to define their own style, creating unique lines and setting their own rules.\nA cutting-edge animation system lies at the heart of STORROR Parkour Pro, blending motion-captured performances from world-class parkour athletes with physics-driven movement. This innovative approach achieves a perfect balance between realism and arcade-style gameplay, elevating parkour animation and movement in video games to unprecedented heights. With hundreds of unique parkour animations at your disposal, you can seamlessly jump, climb, vault, flip, slide, swing, and stride, experiencing the most comprehensive parkour mechanics ever featured in a video game. An intuitive control system grants players complete freedom over every movement, offering a gameplay experience that is both accessible and deeply rewarding to master. The Chef’s Shift\nExplore the iconic streets and rooftops of London’s Isle of Dogs, scaling moving cranes, riding atop speeding trains, and evading pursuit from helicopters. The city is a playground of challenges and opportunities, encouraging players to express their creativity and discover London from a fresh perspective. Disrupt the establishment’s demolition plans, outrun security forces, race against the clock in time trials, and compete with friends in skill-based competitions. New challenges and missions are added regularly, ensuring that there’s always something new to experience. Parkour is a community-driven sport, and STORROR Parkour Pro embraces this spirit, allowing players to team up with friends to conquer missions or compete head-to-head to prove their parkour prowess.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/storror-parkour-pro-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/storror-parkour-pro-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10+",
        "Processor": "Intel i5-4460 / AMD Ryzen 5 1400",
        "Memory": "16 GB RAM",
        "Graphics": "Nvidia GeForce GTX 1060 or Higher",
        "DirectX": "Version 12",
        "Storage": "26 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation, Sports, Early Access",
        "Developer": "Hole in the Sleeve Game Studios",
        "Platform": "PC",
        "Game Size": "23 GB",
        "Released By": "Goldberg Emu",
        "Version": "Build 17926950",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/g78u4X",
        "https://buzzheavier.com/ktc78btsvhyi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/storror-parkour-pro-preinstalled-steamrip.jpg"
}