{
    "page_url": "https://steamrip.com/strategic-command-american-civil-war-free-download-1n/",
    "title": "Strategic Command: American Civil War",
    "description": "For the first time in the series’ history, Strategic Command will be taking you to the 19th century battlefields of the American Civil War. In this turn-based strategy game, you will control the armies, research, production and diplomatic policy of either the Union or the Confederacy during a time of great innovation and dramatic battles. Your decisions will determine whether the United States leaves this conflict as one nation or two.\nStrategic Command: American Civil War comes with a massive 66,000 hex map, covering all of North America from Canada and New Mexico to the Caribbean at a 15km/9mi scale. This is the largest hex-based map ever offered by the Strategic Command series With few professional soldiers ready to fight at the beginning of 1861, building an army will be just as important as ordering your men into battle. Thousands of volunteers are enlisting, and you will need to organise them into Brigades , Divisions and eventually Corps.\nResearch will have to be undertaken to improve their weaponry and fighting skills. Once their training is complete, you will be able to choose from a variety of famous Generals to lead them, including Lee, Jackson, Grant, McClellan, Beauregard and Sherman. With the fate of entire armies hinging on single battles, the appointment of talented Generals may well be the difference between victory and defeat.\nThe great rivers of North America, including the Mississippi , Ohio and Cumberland, can now be navigated by all-new river warships, with inland ports offering the opportunity for rapid movement, and their waters bringing the danger of amphibious attack. The war on the high seas has also been expanded, with ships now divided into rivercraft, coastal and sea-going vessels, and wooden and ironclad construction. With the most diverse roster of warships ever offered by a Strategic Command game, your admirals will have more opportunities than ever before to achieve victory at sea. StarCraft Remastered",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/strategic-command-american-civil-war-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/strategic-command-american-civil-war-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "1.5 GHZ  or Equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "8MB video memory",
        "Sound Card": "DirectX Compatible Sound Card"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Fury Software",
        "Platform": "PC",
        "Game Size": "922 MB",
        "Released By": "GOG",
        "Version": "v1.02.00 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9i9f2kf78jfk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/strategic-command-american-civil-war-preinstalled-steamrip.jpg"
}