{
    "page_url": "https://steamrip.com/street-fighter-five-ce-1r/",
    "title": "Street Fighter 5 Champion",
    "description": "Experience the intensity of head-to-head battle with Street Fighter V Choose from 16 iconic characters, each with their own personal story and unique training challenges, then battle against friends online or offline with a robust variety of match options.\nEarn Fight Money in Ranked Matches, play for fun in Casual Matches or invite friends into a Battle Lounge and see who comes out on top PlayStation 4 and Steam players can also play against each other thanks to cross-play compatibility This version of Street Fighter 5 displays the “Arcade Edition” title screen and includes Arcade Mode, Team Battle Mode and the online-enabled Extra Battle Mode, where you can earn rewards, XP and Fight Money Fight Money can be used to purchase additional characters, costumes, stages and more Jitsu Squad\nDownload the cinematic story “A Shadow Falls” today for FREE M. Bison deploys seven Black Moons into orbit, granting him unimaginable power as the earth falls into darkness . Street Fighter V: Champion Edition is the ultimate pack that includes all content (excluding Fighting Chance costumes, brand collaboration costumes and Capcom Pro Tour DLC) from both the original release and Street Fighter V: Arcade Edition. It also includes each character, stage and costume that released after Arcade Edition. That means 40 characters, 34 stages and over 200 costumes.\nRule the ring with Street Fighter V: Champion Edition, the most robust version of the acclaimed fighting game Choose from 40 diverse fighters, 34 dynamic stages and over 200 stylish costumes as you fight your way through a variety of exciting single-player and multi-player modes.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/street-fighter-v-champion-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/street-fighter-v-champion-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core i3-4160 @ 3.60GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 480, GTX 570, GTX 670, or better",
        "DirectX": "Version 11"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Capcom",
        "Platform": "PC",
        "Game Size": "52.2 GB",
        "Released By": "CODEX emu",
        "Version": "v7.010 (Build 9205136) | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/CEu6PB",
        "https://buzzheavier.com/weorut43mcla",
        "https://1fichier.com/?th34kgtsmcifz66lil3n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/street-fighter-v-champion-edition-preinstalled-steamrip.jpg"
}