{
    "page_url": "https://steamrip.com/street-lords-free-download-i1/",
    "title": "Street Lords",
    "description": "Generate as many cities as you care to battle for, whenever you want and however you want. Let the generator set the city’s name or perhaps change it to your current location for a more memorable experience. Nadir: A Grimdark Deckbuilder Gang territories will be allocated differently each time play as the underdog and overthrow the big boys in charge of town, crush other weak gangs in your dominant grip, or square off against evenly matched opponents the choice is yours. Street gangs, Mafioso bosses, tracksuit-clad, balaclava-wearing cartels fight against a near-unlimited number of procedurally-generated gangs, customise their names and colours, and take charge of your own.\nRecruit foot soldiers, businessmen, leaders and assassins deploy them, and control them on the urban battlefield. Success will not just be achieved on the battlefield strategic positioning of your faction members is key to victory. Wield a wide variety of weapons in hardcore, brutal FPS combat as you square-off against your rivals. Carefully weighted ragdolls combined with a dynamic gore system deliver a satisfying combat experience. Immerse yourself in a procedurally-generated news system that reports on current events in your city, including gang warfare – news is generated as you play the game, fight battles, take (and inflict) casualties",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/street-lords-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/street-lords-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-3770",
        "Graphics": "NVIDIA GeForce GTX 1660",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Strategy",
        "Developer": "Studio HK",
        "Platform": "PC",
        "Game Size": "373 MB",
        "Released By": "N/A (cs.rin.ru)",
        "Version": "Build 10260859 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ukjog3b2jhvv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/street-lords-preinstalled-steamrip.jpg"
}