{
    "page_url": "https://steamrip.com/streets-of-rage-4-free-download-1q/",
    "title": "Streets of Rage 4 Directly Download",
    "description": "The all-time classic Streets of Rage , known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a trilogy of beat ‘em up known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics , beautiful hand drawn visuals and a God tier soundtrack. An iconic series like Streets of Rage got its iconic characters: Axel, Blaze, Adam and other veterans reunited to clean up the streets. With some brand-new moves and kickass tracks to take a listen, our heroes are ready to dish out beatdowns to a fledgling group of ill-advised criminals in full force. Cosmoteer\nStreets of Rage 4 will be the first entry to the core series in 25 years, standing as Axel, Adam and Blaze’s glorious return to serving up side-scrolling beatdowns. With lush hand-drawn animations , new combat abilities, and fresh tracks from an amazing team of composers, Streets of Rage 4 will be a masterful tribute to and revitalization of the classic action fans adore The series is known for its electronic dance influenced music around the world.\nThe soundtrack of Streets of Rage 4 is handled by an all-star line-up of musicians like Yuzō Koshiro, Motohiro Kawashima, Yoko Shimomura , Harumi Fujita, Keiji Yamagishi and many more whom will create new amazing tracks for this new episode of the Streets of Rage series",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/streets-of-rage-4-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/streets-of-rage-4-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo E8400 | AMD Phenom II X4 965",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTS 250 | AMD Radeon HD 6670",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Dotemu, Guard Crush, Lizardcube",
        "Platform": "PC",
        "Game Size": "6 GB",
        "Released By": "GOG",
        "Version": "v08g-r18163 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s74xwq5ydi0l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/streets-of-rage-4-preinstalled-steamrip.jpg"
}