{
    "page_url": "https://steamrip.com/strike-force-heroes-free-download-o1/",
    "title": "Strike Force Heroes",
    "description": "Strike Force Heroes is an oldschool arena shooter rebuilt with modern mechanics with full co-operative and PvP online multiplayer. It melds over the top action with epic story-telling in this intense remake of the hit Flash game. Fight in lush forests, on speeding trains , and atop crashing airplanes, customizing your soldiers with different weapons, skills, and upgrades! Strike Force Heroes has been completely reimagined from the ground-up featuring an expanded campaign with full voice acting, animated cutscenes, challenges, and a brand new loot system. Level up 4 classes with exclusive weapons , outfits, and abilities, each with their own completely unique strengths, weaknesses, and playstyle. Strike Force Heroes\nOne-shot enemies with the glass cannon Assassin , or eat all the bullets as the unstoppable Tank, any playstyle you enjoy, the heroes have you covered With hundreds of weapons, abilities , and equipment, there’s something for every play style.\nGo with a safe loadout, or create a clever setup that synergizes perfectly with all your equipment for risky yet deadly results.\nWhether you like to get up close and personal with melee , take your enemies out silently with snipers, or just blow stuff up, there’s a weapon for you Experience an engaging storyline through fully animated cutscenes with wisecracking characters, explosive action sequences, and challenging boss fights. A routine mission goes awry and your squad finds themselves trapped on a mysterious island where nothing is as simple as it appears.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/strike-force-heroes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/strike-force-heroes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "intel i3-2100/AMD-5600k or better",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 600 series/ Radeon HD 7000 series or better",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Sky9 Games",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.28 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mszx00yjktmx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/strike-force-heroes-preinstalled-steamrip.jpg"
}