{
    "page_url": "https://steamrip.com/stride-free-download-w1/",
    "title": "STRIDE Free Download VR",
    "description": "STRIDE is a high-octane parkour adventure in virtual reality. Fight for your life as you hurtle through the canopy of a futuristic metropolis. Step into the shoes of a master freerunner as you vault, swing, roll, and shoot your way through this intense, action-packed adventure. Will you survive the ultimate freerun? Navigate city rooftops like a parkour pro. Lumencraft\nGrab ledges, jump from roof to roof, vault through windows, slide down cables, swing from hooks: your possibilities are limited only by your attentiveness, creativity, and reactive skill. Designed for virtual reality, you’ll feel the rush of leaping across impossibly wide gaps over dizzying heights. Don’t look down Once you’re a parkour pro, it’s time to turn up the heat.\nTurn on enemies, and the city will be crawling with snipers who want you dead. To survive, you’ll need to combine fast-paced parkour moves with strategic dodges as bullets fly your way. You’re not defenseless – equip your own weapon and experience the satisfaction of picking off a sniper mid-air, nailing your landing on the edge of a skyscraper, then flowing straight into a wall-run to line up your next target Infinite level generation provides unlimited challenging terrain.\nBuild your score by landing jumps over impossibly wide gaps, nailing insane wall-runs, sliding under barriers, and swinging between buildings. There’s no turning back or time to stop – as the world quickly falls apart behind you. Oh, and did we mention the rooftops are crawling with snipers? Pull out your 9mm mid-air and pick them off as you glide across the gap between buildings.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/stride-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/stride-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5-4590 equivalent or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R9 290 or greater",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Simulation, Sports, Early Access",
        "Developer": "Joy Way",
        "Platform": "PC",
        "Game Size": "4.7 GB",
        "Released By": "cs.rin.ru",
        "Version": "v9.0 (30.10.2021) | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/biyxvl2lvvez"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/stride-preinstalled-steamrip.jpg"
}