{
    "page_url": "https://steamrip.com/stronghold-warlords-free-download-s2/",
    "title": "Stronghold: Warlords Download",
    "description": "Stronghold Warlords game for free instantly and play pre-installed on SteamRIP\nThe latest chapter in Firefly Studios ‘ real-time strategy series, Stronghold: Warlords is the first game to recreate the castle economies of East Asia. In Warlords players take command of Mongol hordes, imperial warriors and samurai clansmen as they lay siege to Japanese castles and fortified Chinese cities. Besiege historical warlords using new gunpowder-fuelled siege weapons across 31 campaign missions, 45 skirmish trail scenarios, 28 multiplayer maps, skirmish mode and Free Build sandbox with AI invasions. OlliOlli World\nFor the first time ever Stronghold: Warlords allows you to recruit, upgrade and command AI lords across the battlefield in the form of in-game ‘Warlords’. Each warlord under your command boosts your strategic prowess with unique perks , characteristics and upgradeable abilities. Put them to work for your industry, fortifying borders, forging weapons or team up for a pincer attack Each campaign mission, skirmish game and multiplayer battle means a fresh set of warlords to command and a completely new way to play Stronghold .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/stronghold-warlords-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/stronghold-warlords-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10",
        "Processor": "Intel i5-3330 3.0Ghz or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "nVidia GeForce GTX 680 or AMD Radeon HD7970 (2 GB VRAM)",
        "DirectX": "Version 9.0c",
        "Network": "Broadband Internet connection",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "FireFly Studios",
        "Platform": "PC",
        "Game Size": "5.3 GB",
        "Released By": "GOG",
        "Version": "v1.10.23935 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jwvrp0yiq35y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/stronghold-warlords-preinstalled-steamrip.jpg"
}