{
    "page_url": "https://steamrip.com/stronghold-definitive-edition-free-download-1v/",
    "title": "Stronghold Definitive Edition",
    "description": "Relive the glory of Stronghold , the original BAFTA-nominated real-time strategy game, with this new definitive edition of the classic ‘castle sim’. Witness the game that started it all, carefully rebuilt using the source artwork, remastered music, returning voice talent and veteran developers of the first entry in this legendary series.\nWelcome to the fractured, war-torn frontier of medieval England. With the King betrayed by his treacherous lords and a realm on the brink of collapse, take control of scattered forces and reunite your kingdom against the monstrous Rat, Pig, Snake and Wolf Lethal Company\nStrike down each villainous Lord in missions ranging from breaking sieges and capturing enemy castles to building epic fortresses and repelling enemy assaults. Test the limits of your strategic mind with castle assaults and grand banquets in military and economic campaigns .\nDive into classic RTS and city builder gameplay now elevated with remade graphics, community requested features and remastered music from series maestro Robert L. Euvino. Gather resources, construct mighty castles, protect your townsfolk, manage your gold, raise armies and wage all out war",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/stronghold-definitive-edition-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/stronghold-definitive-edition-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10/11 64 Bit",
        "Processor": "Intel® Core™ i3-3220 or equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "Graphics Card with 2GB VRAM (for 1080p) or 3GB VRAM (for 1440p) or 4GB VRAM (for 4k)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "FireFly Studios",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uyw7fta2pffo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/stronghold-definitive-edition-preinstalled-steamrip.jpg"
}