{
    "page_url": "https://steamrip.com/suchart-genius-artist-simulator-free-download-s2/",
    "title": "SuchArt: Genius Artist Simulator Free Download Direct Link",
    "description": "Turn the world around you into a huge canvas and do whatever you please with it — add some red to that gloomy wall, spill paint on the floor and call it abstract expressionism , or start a collection of alphabet paintings from A to Z: this place is yours after all! Wait, how did you mess up your studio that much that fast Not satisfied with the initial look and/or functionality of your studio? That’s okay, because you can always unlock new rooms, buy some furniture and decorations, and place those however and wherever you want — make yourself at home\nWait, what do you mean you don’t have enough money? Sell your paintings at the marketplace , fulfill all your clients’ orders, and receive a generous reward, or maybe a gift Or maybe some exposure, the best of all currencies out there. Don’t forget that you can exhibit your amazing art and see what critics have to say about it Painting in SuchArt feels just like in real life, but without the downsides. The colors mix as you would naturally expect them to, so you can easily achieve the result you dreamed about. The paint has realistic texture, and each instrument alters it a bit with different strokes. There’s plenty of instruments to choose from: brushes, palette knives, stencils or even flamethrowers to create your next masterpiece.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/suchart-genius-artist-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/suchart-genius-artist-simulator-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-Bit Windows 7/8/10",
        "Processor": "Intel Core i5-2400 @ 3.1 GHz or AMD FX-6300 @ 3.5 GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "Geforce 9600 GT or AMD HD 3870 512MB or higher",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Early Access",
        "Developer": "Voolgi",
        "Platform": "PC",
        "Game Size": "934 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2.2.2.0 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/78ga4i9mpaiw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/suchart-genius-artist-simulator-free-download-preinstalled-steamrip.jpg"
}