{
    "page_url": "https://steamrip.com/suicide-squad-kill-the-justice-league-free-download/",
    "title": "Suicide Squad: Kill the Justice League",
    "description": "From Rocksteady Studios, the creators of the Batman: Arkham series, Suicide Squad: Kill the Justice League is a genre-defying third-person action shooter where the ultimate band of misfits must do the impossible to save the world: Kill the Justice League .\nJoin the newly “recruited” members of Amanda Waller’s infamous Task Force X (aka the Suicide Squad), Harley Quinn, Deadshot, Captain Boomerang and King Shark, as they set out on an impossible mission to Kill the Justice League. Drop into an expansive and dynamic open-world Metropolis ravaged by Brainiac’s invasion and terrorized by the heroes who once protected it. None Shall Intrude\nEach Squad member brings their own traversal mechanics to help them navigate a sprawling and battle-torn Metropolis, combining free-roaming exploration and combat verticality for an unforgettable experience. Players are free to experiment with a variety of different play styles to unleash maximum damage on their enemies. Whether in single player or online with up to three of your friends, players can take on this suicide mission their own way.\nPost-launch, players can expect a continuously evolving Metropolis with free new playable villains, environments, weapons, in-game events, and more, all included with purchase of the base game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/suicide-squad-kill-the-justice-league-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/suicide-squad-kill-the-justice-league-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Win 10 (64 bit)",
        "Processor": "Intel i5-8400 or AMD Ryzen 5 1600 3.20 GHz",
        "Graphics": "NVIDIA GTX 1070 or AMD Radeon RX Vega 56",
        "DirectX": "Version 12",
        "Storage": "65 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Rocksteady Studios",
        "Platform": "PC",
        "Game Size": "82 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.6.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/4cCnlo",
        "https://buzzheavier.com/k91y27sajtfc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/suicide-squad-kill-the-justice-league-preinstalled-steamrip.jpg"
}