{
    "page_url": "https://steamrip.com/sultans-game-free-download/",
    "title": "Sultan’s Game",
    "description": "Sultan’s Game is a card-based simulation and narrative game, inspired by The One Thousand and One Nights. You are one of the ministers of the mighty Sultan, a fickle , cruel king who treats his subjects like pawns in a deadly game for his own pleasure. Forced to make dreadful choices to save your own life, you will have to find a way to survive not just the Sultan’s Game, but its consequences too. South of Midnight\nThe Sultan forces you, his minister, to participate in a cruel game: draw one of four cards, and complete its challenge within seven days – or you will be executed. The Carnality Card pushes you into the pursuit of carnal pleasures. The Extravagance Card requires lavish spending to be fulfilled. The Conquer Card forces you into perilous adventures. Finally, the Bloodshed Card demands a human sacrifice.\nYou must find a way to complete these harsh trials – and weather its dire consequences. Familial betrayal, lustful madness, power struggles, and the loss of your own humanity threaten your sanity; the price of survival might end up being too high\nUse your wits and luck to uncover the secrets behind this story of love, lust, betrayal, loyalty, bravery , and kindness, and turn them to your advantage . Choose if you want to be a willing accomplice of the Sultan’s whims, or secretly plot regicide to end his tyrannical rule. Support your spouse in dire times or sneak into the queen’s bed. Embark on epic adventures to become a dragon slayer or heed the call of dark gods.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/sultans-game-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/sultans-game-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "i5-3570K",
        "Memory": "1 GB RAM",
        "Graphics": "GTX 560",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation, Strategy",
        "Developer": "Double Cross",
        "Platform": "PC",
        "Game Size": "637 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.11377 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7x8hdgjzrskf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/sultans-game-preinstalled-steamrip.jpg"
}