{
    "page_url": "https://steamrip.com/summer-memories-free-download-s1/",
    "title": "Summer Memories",
    "description": "Summer break has begun, and for the first time in years, you’re going back to the countryside to visit your family. At first, it doesn’t seem like there’s much to do so far from the city, but you’ll soon find there’s more to this quiet mountain village than meets the eye Lies of P\nWhat worries do your cousins have? Who’s the social media sensation taking the small town by storm? What kind of treasure is the mermaid at the beach searching for? And what’s up with that weirdo in the gacha mask who’s hanging outside the local store? Solve all these mysteries and more during one unforgettable summer vacation Manage your days and time during your vacation, get to know the people around town, discover the wildlife, and go fishing. Raise your stats by playing sports or by exploring the local mountain.\nDepending on who you befriend, different endings await you. And don’t worry if you can’t clear everything in a single run of the game. You can start a New Game+ playthrough while retaining all of your stats and unlocked abilities.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/summer-memories-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/summer-memories-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows® 7/8/8.1/10/11",
        "Processor": "Intel Core2 Duo or better",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 9/OpenGL 4.1 capable GPU",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG",
        "Developer": "Dojin Otome",
        "Platform": "PC",
        "Game Size": "695 MB",
        "Released By": "GOG",
        "Version": "Build 6270017 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lyb193aiyxwh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/summer-memories-preinstalled-steamrip.jpg"
}