{
    "page_url": "https://steamrip.com/sunset-overdrive-free-download-j1/",
    "title": "Sunset Overdrive Directly Download",
    "description": "Don’t miss the single-player campaign from the game that IGN awarded Best Xbox One Game of 2014, the game that Polygon rated 9 out of 10, and the game that Eurogamer calls “a breath of fresh air.” In Sunset Overdrive, the year is 2027 and Sunset City is under siege. A contaminated energy drink has transformed most of the population into toxic mutants . For many it’s the end of the world, but for you it’s a dream come true. Your old boss? Dead. Your boring job? Gone. Atelier Ryza 3 Alchemist of the End & the Secret Key\nTransform the open-world into your tactical playground by grinding, vaulting and wall-running across the city while using a devastating, unconventional arsenal. With hyper-agility, unique weapons, and customizable special abilities, Sunset Overdrive rewrites the rules of traditional shooters and delivers an explosive, irreverent, stylish, and totally unique adventure. Embrace the chaos of Sunset City through a hyper-colorful, post-apocalyptic single-player campaign and two bonus expansions, Mystery of Mooil Rig and Dawn of the Rise of the Fallen Machines. Outgun crazed mutants, homicidal robots, and villainous thugs on your journeys with the included Weapons Pack.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/sunset-overdrive-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/sunset-overdrive-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8 or higher",
        "Processor": "Intel Core i5 3470 @ 3.0hz || AMD-FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce 750 Ti || AMD Radeon R7 260X",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Insomniac Games, Blind Squirrel Games",
        "Platform": "PC",
        "Game Size": "20 GB",
        "Released By": "CODEX emu",
        "Version": "v1.0 Update 2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/gkke1xf3ex5q",
        "https://1fichier.com/?ioauv3d9p9pcdeda3o9t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/sunset-overdrive-preinstalled-steamrip.jpg"
}