{
    "page_url": "https://steamrip.com/superhot-free-download-1m/",
    "title": "SUPERHOT",
    "description": "Blurring the lines between cautious strategy and unbridled mayhem, SUPERHOT is the smash-hit FPS in which time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It’s you, alone, outnumbered and outgunned .\nSnatch weapons from fallen enemies to shoot, slice and dodge through a truly cinematic hurricane of slow-motion bullets. Do you crave meaning? Acceptance ? Decrypt a deep and multi-layered narrative. Find the answers you seek. Mind is software. Let the System set you free.\nWith its unique, stylized graphics SUPERHOT adds something new and disruptive to the FPS genre. SUPERHOT’s polished, minimalist visual language helps you focus on what’s most important – the fluid gameplay and the cinematic beauty of the fight. Thirty months in the making. Kynseed\nThousands of hours put into development and design. From its humble origins in the 7 Day FPS game jam, through a hugely successful Kickstarter campaign to a plethora of awards and nominations from industry experts, SUPERHOT is a labor of love by its independent, dedicated team and thousands of backers from all around the globe.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/superhot-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/superhot-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core2Quad Q6600 2,40 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 650 (1024 MB Ram)",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "SUPERHOT Team",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "GOG",
        "Version": "v1.0.21 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6t3b4nm9hkg5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/superhot-preinstalled-steamrip.jpg"
}