{
    "page_url": "https://steamrip.com/supernatural-free-download/",
    "title": "Supernatural Free Download",
    "description": "A SINISTER CASE FOR THE FEARLESS DETECTIVE\nOne day, a young man writes an email to a renowned detective in the world of paranormal events, recounting the mysterious disappearance of his beloved housemaid, Mrs. Susan. She took care of the house and his pregnant fiancée while he struggled to make ends meet. Super Dark Deception\nDetermined to uncover the truth, detective Wyatt ventures into the unknown, determined to solve the enigma and discover what really happened to Mrs. Susan. But as he delves deeper into the investigation, he realizes that the darkness lurking within the shadows holds secrets far more terrifying than he could have ever imagined.\nAN INTERACTIVELY SPINE-CHILLING EXPERIENCE\nExperience high-quality horror that offers a plethora of intriguing solutions. Your microphone constantly picks up sounds, making each experience unique. The louder you are, the game will prepare scarier events for you. Puzzles will test your detective and logical thinking, cameras will help you unravel the mystery of Mrs. Susan’s disappearance, and communication with a supernatural entity through the microphone, which either helps you or misleads and complicates the experience. Three endings, each dependent solely on your decisions and perceptiveness.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/supernatural-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/supernatural-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4460 | AMD Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 1060 | AMD Radeon™ RX 580",
        "DirectX": "Version 11",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Hitori De Productions",
        "Platform": "PC",
        "Game Size": "9.76 GB",
        "Released By": "FLT",
        "Version": "v1.2.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/LL99zR",
        "https://megadb.net/5q1kx6sx9h6c"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/supernatural-preinstalled-steamrip.jpg"
}