{
    "page_url": "https://steamrip.com/super-smash-bros-ultimate-s2/",
    "title": "Super Smash Bros Ultimate Free Download",
    "description": "Super Smash Bros. Ultimate game for free instantly and play pre-installed on SteamRIP\nLegendary game worlds and fighters collide in the ultimate showdown – a new entry in the Super Smash Bros. series for Nintendo Switch Yuzu Emu New fighters, including Inkling from the Splatoon series, Ridley from the Metroid series, Castlevania’s Simon Belmont and Isabelle from Animal Crossing, make their Super Smash Bros. series debut alongside every Super Smash Bros. fighter in the series EVER Have a blast trying to launch your opponents off the stage in the ultimate action game. Faster combat, new items, new attacks, new defensive options, techniques and more will keep the battle raging whether you’re at home or on the go. Multiple modes and options mean everyone can play. Sifu\nIn Smash, select your stages, set the rules and play with up to eight players total. Or, create a team of three or five fighters and take on your opponent’s squad one by one in Squad Strike. And that’s just the beginning Spirits let you simulate battles between characters from more series than ever before, so see how many you can collect Fighters can join forces with spirits to enhance their powers. While primary spirits enhance fighters’ stats, support spirits lend them additional skills. Once the primary spirit and support spirits are set, your fighter’s all powered up.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/super-smash-bro-ultimate-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/super-smash-bro-ultimate-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or better",
        "Processor": "i3 8350k @ 4.6ghz",
        "Memory": "6 GB RAM",
        "Graphics": "GTX 1050",
        "DirectX": "Version 10",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Arcade, Fighting, Side, 3D",
        "Developer": "Sora Ltd., Nintendo, BANDAI NAMCO",
        "Platform": "PC",
        "Game Size": "14.3 GB",
        "Repack By": "FITGIRL",
        "Version": "v11.0.0 | Full  (Latest) All Released DLCs + Yuzu Emu for PC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/5379CC63F8",
        "https://buzzheavier.com/o81s93f1e4ag",
        "https://megadb.net/67bitbxn5hvy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/super-smash-bro-ultimate-preinstalled-steamrip.jpg"
}