{
    "page_url": "https://steamrip.com/super-loco-world-cozy-train-automation-free-download/",
    "title": "Super Loco World – Cozy Train Automation Download",
    "description": "Welcome to Super Loco World! As the freshly-minted transport tycoon around these parts, you’ll need to build up a rail network, manage train traffic, and keep the goods flowing to meet the growing demands of an ever- evolving world Stronghold Crusader: Definitive Edition\nEmbrace automation🚦 Your trains need more than just a route from you! Control their speeds carefully, manage rail junctions, and eventually automate the process using some very handy rail signals, including:\nEffortless building 🚧 Forget about the fiddly side of crafting complex railroad systems in other train tycoon games. Instead, use your cursor like a painter’s brush and let the game automatically figure out T-junctions, bridges, or even curved rails!\nRealistic train behaviour 🚂 Build your depot to create new trains , and bring them back whenever you want to add or remove carriages. Just watch out for traffic jams along the way, as each train’s fuel supply is as precious as its cargo . Keep this in mind when designing your railway network. The greater the distance between points of interest, the higher your fuel bills!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/07/super-loco-world-cozy-train-automation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/07/super-loco-world-cozy-train-automation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3 9xxx or AMD Ryzen 3",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce 10 series or alternative",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation, Strategy",
        "Developer": "Andriy Bychkovskyi",
        "Platform": "PC",
        "Game Size": "988 MB",
        "Released By": "SKIDROW emu",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7wj0eb0dxmn2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/super-loco-world-cozy-train-automation-preinstalled-steamrip.jpg"
}