{
    "page_url": "https://steamrip.com/super-bullet-break-free-download-g1/",
    "title": "Super Bullet Break",
    "description": "Super Bullet Break is a one-of-a-kind strategy deck builder inspired by your favourite gacha games. Filled with a wild bunch of cute and colourful characters – ‘Bullets’ – each and every one of them unique in their own way. Rescue the online game world from total destruction in Super Bullet Break, where online multiplayer games have been taken over by a rogue AI\nCan you save the world, defeat enemies in strategic turn-based battles and beat Super Bullet Break? No two girls are alike Get to know the Bullets you collect along the way, all of them featuring original artwork and character designs, and build the perfect team. Gather a wide variety of items and bullets to make them work together to your advantage! From Common to Legendary, Active to Passive, each item will be useful to you in its own way.\nPlay as either Akari, Hikaru, or Sumire Each of them comes with different features and may be of advantage to you depending on your playstyle. Do you prefer a stable playstyle or defeating your enemies with technical combos? Super Bullet Break has a character for everyone. From Seasons of Love to The Aquarhythm Deep and Phoenix Gunner, each of the 7 game maps has been inspired by classic game genres, from dating sims to rhythm games and dungeon crawlers. Pulling No Punches",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/super-bullet-break-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/super-bullet-break-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1/10 (64-bit)",
        "Processor": "Core i3-3225/AMD A8-7650K",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GT 640 or Radeon HD 5770",
        "DirectX": "Version 11",
        "Storage": "8.5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Strategy",
        "Developer": "BeXide Inc.",
        "Platform": "PC",
        "Game Size": "498 MB",
        "Released By": "DARKSiDERS / Mr_GOLDBERG",
        "Version": "Build 8990180 | Full  + Controller Fix (Ty legendarywafer)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ac67b7s05z67"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/super-bullet-break-preinstalled-steamrip.jpg"
}