{
    "page_url": "https://steamrip.com/super-buff-hd-free-download-y1/",
    "title": "Super Buff HD",
    "description": "The year is 202020. It’s wild. All the buff dudes have turned on society. STOP THEM MOBILITY TO MAKE YOU FEEL SUPER POWERED: Levels are playgrounds you can jump, shred, and bounce all over. Grind between rails. Body-surf on enemies. Use water jets, trampolines, poop fountains and pretty much anything to launch yourself heavenwards for huge air. MIGHTY WEAPONS TO KEEP THE BUFF AT BAY : Choose from a modest armory of killy toys, each with dual firing modes and unique functionality. I Expect You To Die 3\nFrom a trusty hammer that always makes its way back to you no matter how far you throw it, to a revolving potato cannon with backup basketball bombs. A WORLD OF POOP AND PURE IMAGINATION : Your battle against the buff takes place across 18 stages of strangeness. Levels are variously and hilariously themed, such as mushroom, street, cowboy, moonbase , mall, and sewage (don’t fall in the brown stuff). HIGH SCORES FOR SELF-GRATIFICATION: Measure the success of your buff-battering performances by racking up ker-azy high scores. Build and keep your multiplier going for even higher scores.\nPull on your big boy pants and put some thunder in your number. TOTALLY NUTS, OVER BUFFED BOSSES: Face off against a freakshow of good and pumped boss dudes. Topple a tower block with bulging biceps. Smack down a sword-wielding trashcan titan. Make mincemeat out of a belly-flopping mushroom king.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/super-buff-hd-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/super-buff-hd-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "i5 CPU",
        "Memory": "2 GB RAM",
        "Graphics": "GTX 750 or better",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Buffcorp",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE",
        "Version": "Build 12317916 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ienzq8c8n85h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/super-buff-hd-preinstalled-steamrip.jpg"
}