{
    "page_url": "https://steamrip.com/supermarket-simulator-free-download-s1/",
    "title": "Supermarket Simulator",
    "description": "“Supermarket Simulator” is a chill first-person simulation where every detail of running a supermarket comes alive. Windowkill\nDesign your store, optimizing for efficiency and aesthetics. Determine where products are displayed, manage your aisles, and ensure a smooth shopping experience for your customers .\nOrder stock using an in-game computer . Unpack goods, organize them in your storage room and place them on shelves, fridges, and freezers.\nScan items, take cash and credit card payments, and ensure customers leave satisfied with their shopping and checkout experience.\nNavigate the complexities of a real-time market. Buy products when prices dip and determine the best-selling prices to balance customer satisfaction with profit margins.\nAs you accumulate profits, consider reinvesting. Expand your store’s physical space, upgrade interiors, and continually adapt to the evolving demands of the retail world.\nIn “Supermarket Simulator”, every decision matters. Will you rise to the occasion, transforming a modest establishment into a retail powerhouse, all while balancing customer satisfaction, and finances?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/supermarket-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/supermarket-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows (64-bit) 10",
        "Processor": "i5 3550 / RYZEN 5 2500X",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 1050 / AMD R9 270X",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Nokta Games",
        "Platform": "PC",
        "Game Size": "857 MB",
        "Released By": "RUNE emu",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/zhBUt4",
        "https://megadb.net/scfyvl95q73y",
        "https://buzzheavier.com/if0ku1a7ydb2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/supermarket-simulator-preinstalled-steamrip.jpg"
}