{
    "page_url": "https://steamrip.com/superfuse-free-download-j1/",
    "title": "Superfuse Directly Download",
    "description": "Superfuse is a hack-and-slash, Action RPG with the ability to hyper-tailor your hero based on your unique playstyle. Pick and fuse the skill sets of your choice, and demolish hordes of grotesque abominations alone or with up to 3 friends as you uncover the secrets of the Corruption and the Gods. Choose between 3 character classes as you fuse multiple superpowers from the expansive skill tree system to create your unique Enforcer that is tailored to your playstyle. Optimize your perfect hero with a blend of powerful weapons, hi-tech armor, and boosters looted off the corpses of the monsters you’ve slain.\nPlay solo offline or build a hero for online 4-player PvE drop-in/out co-op modes, mixing and matching your fused superpowers to create the perfect team. Travel across the stars as you grind your way through a stream of contracts, with brilliant rewards and deadly challenges. Experience fast-paced, heart-pounding combat as you battle through hordes of fleshless beasts, slithering ooze creatures, and superpowered spandex-clad foes. Uncover a hidden conspiracy among the echelons of humanity and an alien menace on a dark comic book adventure packed with twists and turns. Backfirewall_",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/superfuse-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/superfuse-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10+",
        "Processor": "i5-6500 / AMD Ryzen 3 3300U or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce 1060 3GB / AMD Radeon RX 5600 or equivalent",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Early Access",
        "Developer": "Stitch Heads Entertainment",
        "Platform": "PC",
        "Game Size": "9.2 GB",
        "Multiplayer By": "Online-fix.me",
        "Version": "v0.1.3 | Early Access + Multiplayer",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5uh9faw7l7k3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/superfuse-preinstalled-steamrip.jpg"
}