{
    "page_url": "https://steamrip.com/super-mombo-quest-free-download/",
    "title": "Super Mombo Quest",
    "description": "Super Mombo Quest is an action-packed precision platformer! A metroidvania with classic arcade mechanics, featuring some crazy combat, challenging combos and plenty of collectibles – all in a huge interconnected world\nGET THE PERFECT COMBO ON HUNDREDS OF LEVELS\nTravel through a giant interconnected world made up of hundreds of areas, each with multiple challenging enemies. Some will chase you, some will shoot you, some will fly around And some are extremely dangerous! Can you be fast enough to defeat them all in a perfect combo? The Callisto Protocol\nCUSTOMIZE YOUR GAMEPLAY WITH SPECIAL ABILITIES\nUnlock different Mombo forms to reach speeds never before imagined. And use them to your advantage to uncover secrets and make powerful combos\nTALK TO NPCS, BUY ITEMS AND GET UPGRADES\nIf you get tired of all the intensity, chill around and chat with the guardians of Subrosa. They will certainly offer items and upgrades so you can challenge yourself even more.\nSAVE THE LANDS OF SUBROSA\nDon’t let Subrosa be destroyed by the fearsome King of Nightmares . Prove to be the long-awaited prophesied hero. Everyone counts on you and your giant tongue Are you ready to venture out?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/super-mombo-quest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/super-mombo-quest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Microsoft® Windows® 7 SP1, 8.1, 10",
        "Processor": "1.5 GHz CPU",
        "Memory": "2 GB RAM",
        "Graphics": "Integrated  Card",
        "DirectX": "Version 10",
        "Storage": "300 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Orube Game Studio",
        "Platform": "PC",
        "Game Size": "152 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10720473 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ou5ddwxfjotx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/super-mombo-quest-preinstalled-steamrip.jpg"
}