{
    "page_url": "https://steamrip.com/superliminal-free-download-s2/",
    "title": "Superliminal",
    "description": "Get Superliminal PC game for free instantly and play pre-installed on SteamRiP\nSuperliminal is a first-person puzzle game based on forced perspective and optical illusions. Puzzles in this game give you a sense of the unexpected. Players need to change their perspective and think outside the box to wake up from the dream. As you fall asleep with the TV on at 3AM, you remember catching a glimpse of the commercial for Dr. Pierce’s Somnasculpt dream therapy program. Stoneshardy the time you open your eyes, you’re already dreaming – beginning the first stages of this experimental program.\nExplore a dream world where everything is exactly as it seems. Tread carefully as the world slowly unravels around you and subverts your expectations. What you see isn’t always precisely what you get. In this fully-voiced adventure, Dr Glenn Pierce is doing his questionable best to guide you home and out of the dreamscape. His artificial intelligence assistant, however, is having trouble understanding exactly how you’re here at all, and has other plans for you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/superliminal-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/superliminal-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2.0GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVidia GTX 750",
        "DirectX": "Version 10",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Games by Malcs",
        "Platform": "PC",
        "Game Size": "3.3 GB",
        "Released By": "GOG",
        "Version": "v1.4 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lzlcejt6vi90"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/superliminal-free-download-preinstalled-steamrip.jpg"
}