{
    "page_url": "https://steamrip.com/super-meat-boy-free-download-s2/",
    "title": "Super Meat Boy Free Download Direct link",
    "description": "Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who’s trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux. Our meaty hero will leap from walls, over seas of buzz saws, through crumbling caves and pools of old needles. Sacrificing his own well being to save his damsel in distress.\nSuper Meat Boy brings the old school difficulty of classic NES titles like Mega Man 2, Ghost and Goblins and Super Mario Bros. 2 (The Japanese one) and stream lines them down to the essential no BS straight forward twitch reflex platforming. Ramping up in difficulty from hard to soul crushing SMB will drag Meat boy though haunted hospitals, salt factories and even hell itself. And if 300+ single player levels weren’t enough SMB also throws in epic boss fights, a level editor and tons of unlock able secrets, warp zones and hidden characters.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/super-meat-boy-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/super-meat-boy-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® XP / Vista / 7 (Windows 8 is not officially supported)",
        "Processor": "1.4GHz or faster",
        "Memory": "1 GB RAM",
        "Graphics": "Card made within the last 4 years (Pixel Shader 3.0, Vertex Shader 3.0)",
        "DirectX": "® 9.0c",
        "Hard Drive": "300 MB"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Team Meat",
        "Platform": "PC",
        "Game Size": "418 MB",
        "Repack By": "GOG",
        "Version": "v1.2.5 | Updated version + all DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xry7ffjnvh8s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/super-meat-boy-free-download-preinstalled-steamrip.jpg"
}