{
    "page_url": "https://steamrip.com/super-mario-odyssey-s2/",
    "title": "Super Mario Odyssey",
    "description": "Super Mario Odyssey game for free instantly and play pre-installed on SteamRIP\nBowser has snatched Princess Peach once again, and this time he’s planning a lavish, no-expense-spared wedding The spiny groom-to-be has embarked on a trip around the world to prepare for the festivities. It’s up to Mario to catch up with him and crash the wedding, but the pesky Broodals won’t make it easy. Explore incredible places far from the Mushroom Kingdom as you join Mario and his new ally Cappy on a massive, globe-trotting 3D adventure.\nUse amazing new abilities like the power to capture and control objects, animals , and enemies to collect Power Moons so you can power up the Odyssey airship and save Princess Peach from Bowser’s wedding plans Thanks to heroic, hat-shaped Cappy, Mario’s got new moves that’ll make you rethink his traditional run-and-jump gameplay like cap jump , cap throw, and capture. GORN\nUse captured cohorts such as enemies, objects, and animals to progress through the game and uncover loads of hidden collectibles . And if you feel like playing with a friend, just pass them a Joy-Con controller Player 1 controls Mario while Player 2 controls Cappy. This sandbox-style 3D Mario adventure the first since 1996’s beloved Super Mario 64 and 2002’s Nintendo GameCube classic Super Mario Sunshine is packed with secrets and surprises, plus exciting new kingdoms to explore.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/super-mario-odyssey-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/super-mario-odyssey-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, Windows 8.1 (64-bit) or Windows 10",
        "Processor": "AMD Vishera FX-6350 3.9GHz or higher / Intel Pentium Dual-Core G4400 3.30GHz or higher",
        "Memory": "4 GB RAM",
        "Graphics": "ASUS Radeon R7 250 / NVIDIA GeForce GTX 750 or higher",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Arcade, Jump and run, 3D",
        "Developer": "Nintendo",
        "Platform": "PC",
        "Game Size": "4.3 GB",
        "Repack By": "FITGIRL",
        "Version": "v1.3.0 | Full  (Latest) + YUZU EMU FOR PC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gs4g447ybi0x",
        "https://buzzheavier.com/4q3x32rrnr4o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/super-mario-odyssey-preinstalled-steamrip.jpg"
}