{
    "page_url": "https://steamrip.com/supraland-free-download-s2/",
    "title": "Supraland",
    "description": "Supraland game for free instantly and play pre-installed on SteamRIP\nSupraland is a First-Person Metroidvania Puzzle game by David Münnich from Germany. The main sources of inspiration are Zelda, Metroid and Portal. Supraland assumes that you are intelligent and lets you play independently. RC Rush\nThe story is minimal, gives you an overarching goal to pursue, and then sets you free. Despite child friendly visuals, the game targets experienced players. You explore a large interconnected world in which most ways are at first unpassable until you find new abilities to overcome those obstacles .\nA cornerstone of Supraland’s design was to create abilities that are so versatile, they will keep on surprising you by how many different usages they have. If you combine your abilities, the possibilities become even bigger. Most of the game is about exploring the sandbox world to track down secrets. Often you will think you are about to get out of bounds and beat the level designer, but right there is a chest waiting for you with a very rewarding upgrade. Supraland respects your lifetime and doesn’t bloat the playtime with unlimited no-brainer collectibles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/supraland-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/supraland-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core2Duo 2.66GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 780",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Supra Games",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "PLAZA",
        "Version": "v1.23.7 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v072ls1dqu57"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/supraland-preinstalled-steamrip.jpg"
}