{
    "page_url": "https://steamrip.com/surgeon-simulator-2-free-download-s2/",
    "title": "Surgeon Simulator 2",
    "description": "Get Surgeon Simulator 2 PC game for free instantly and play pre-installed on SteamRiP\nBob’s life is in your hand It’s time to slip into your scrubs and grab the nearest scalpel (saw or sink plunger), and enter the Bossa Labs Medical Facility in this 1-4 player physics based operating theatre of chaos. Take on the cream of the medical establishment in riotous competitive challenges. Play frantically blood splattered coop games or go solo in Surgeon Simulator 2’s rib-tickling Campaign Mode.\nWanting to inject some creativity? Jump into the Creation Mode and build brand new game levels on your own or team up to build something amazing with multiplayer creation tools. From head transplants and leg amputations, to dancing games and relay races, at Bossa Labs, you choose your own way to play Plunge into frenzied Competitive Mode games and lock horns, or scalpels, in free-for-all arcade and arena style levels played with friends or other players online. King’s Bounty II\nGo up against up to three of the best the medical world has to offer in quick-fire challenges that will amaze, surprise and test you to the very limit. In Story Mode you can play solo or with friends and pull together as a team to perform operations, opening ribcages, choosing transplant organs, making sure Bob doesn’t bleed out – it’s a barrage of botch jobs which will test every element of your surgical skills, teamwork and creativity. As the pressure to keep the patient alive mounts, you must work like a well oiled machine, choosing to help, or hinder, the life-saving efforts in this unique and pandemonium pumped party game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/surgeon-simulator-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/surgeon-simulator-2-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 Bit",
        "Processor": "Intel Core i3-3225 3.3 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 460",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation",
        "Developer": "Bossa Studios",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Co-op Released By": "Goldberg Emu",
        "Version": "Build 15717747",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/07aklxupw6lx",
        "https://buzzheavier.com/irqiqadfem4k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/surgeon-simulator-2-free-download-torrent-steamrip.jpg"
}