{
    "page_url": "https://steamrip.com/surgeon-simulator-experience-reality-free-download-s2/",
    "title": "Surgeon Simulator: Experience Reality Free Download",
    "description": "Get Surgeon Simulator: Experience Reality for free instantly and play pre-installed on SteamRiP\nSurgeon Simulator is bringing the ER to VR The most critically acclaimed and infamous surgery simulation game as you have never seen it before! Built for Vive and featuring all of the surgeries and twisted humour of the original favorite plus a few new surprises Surgeon Simulator: Experience Reality transports you into some of the most unlikely and possibly unsanitary surgeries possible.\nBob’s life is in your hands in this darkly humorous VR game, taking you closer to bloody surgery than you possibly ever wanted to go! From the operating theatre, to the back of an ambulance, to outer space, your patient’s welfare will be in your virtual hands. In addition to the original surgeries we’ve added exclusive new features for you to play with in VR. How about brain surgery in the dark? What about a hand-held camera to admire your surgical efforts from any angle? New achievements ? It’s all in Surgeon Simulator: ER! Whatever you do, don’t press that button in space.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/surgeon-simulator-experience-reality-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/surgeon-simulator-experience-reality-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "7,8,10",
        "Processor": "Intel i5-4590 equivalent or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / ATI Radeon 290 equivalent or greater",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "Bossa Studios",
        "Platform": "PC",
        "Game Size": "547 MB",
        "Released By": "SEWN",
        "Version": "v11.08.2017 – full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lc0k150uhr9o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/surgeon-simulator-experience-reality-preinstalled-steamrip.jpg"
}