{
    "page_url": "https://steamrip.com/survival-fountain-of-youth-free-download-ss1/",
    "title": "Survival: Fountain of Youth Drectly Download",
    "description": "You are a member of Juan Ponce de Leon’s expedition in search of the Fountain of Youth, based on an actual historic event of the Age of Discovery. After a shipwreck, you must learn to survive on deserted lands: from crafting tools, building shelter to hunting prey and fighting off predators.\nExplore the many islands in search for your crewmates , figure out the fate of an extinct ancient civilization and uncover the location of the legendary Fountain of Youth.\nDangerous animals, weather, plants, diseases, injuries, hunger, thirst, exhaustion everything will test your strength and ability to survive.\nWith over 30 animal species and their own habitats and behaviors, there are plenty of creatures to cook and hunt but be careful to not become the prey Tiny Rogues\nWith the scorching Caribbean heat, the relentless storms, the malaria infested swamps and poisonous plants, the Bimini archipelago is full of hazards to overcome. Crafting, building shelter, improving your skills and exploring the islands in search of resources are key to your survival. Are you ready to take on the challenge?\nTo travel between islands, you can build a variety of sea vessels — from primitive rafts to the 16th century Spanish schooner. Find your way to open new routes to unknown lands, prepare for the expeditions, and find out what mysteries lay ahead.\nThere are hundreds of items that can be crafted and used for survival, from the simplest tools made of sticks and rocks to advanced muskets, metal armor and tools. You can also build a variety of workshops, from primitive leather dryers to pre-industrial era machines.\nEach action you perform improves your skills — strength, cooking, skinning , shooting, and more. Survive and develop new abilities to evolve from a clumsy rookie to a hardcore survivor.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/survival-fountain-of-youth-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/survival-fountain-of-youth-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-6400 CPU @ 2.70 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVidia GeForce GTX 970 4 GB Full HD resolution",
        "DirectX": "Version 11",
        "Storage": "32 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation",
        "Developer": "Odinsoft Inc.",
        "Platform": "PC",
        "Game Size": "12.1 GB",
        "Released By": "RUNE",
        "Version": "v1653 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/0iehh8axr7xv",
        "https://gofile.io/d/devJy6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/survival-fountain-of-youth-preinstalled-steamrip.jpg"
}