{
    "page_url": "https://steamrip.com/survival-nation-vr-free-download-v1/",
    "title": "Survival Nation DIRECT Download",
    "description": "To survive , you need to remember about food and water. You can get food in many ways: by fishing, hunting, gathering, or scouring abandoned houses. In a world where danger awaits you at every turn, taking care of sufficient needs is not the easiest thing to do. Drunkn Bar Fight VR\nThey say that cooperation is the key. It is no different here. Survival Nation is a game that focuses on multiplayer mode. You can join other players and participate in a joint adventure and exploration of the world. Talk to other people, exchange items and supplies, and cooperate during combat.\nDon’t worry. If you still don’t want to play with other players, you can enjoy Solo mode and have fun playing alone. Survival Nation is not lacking in RPG elements either. A whole bunch of missions and side activities are waiting for you. All this to take care of the progression of your character.\nYou have at your disposal 3 unique skill trees, which you develop with each level you gain. It’s up to you whether you want to focus on survival skills, combat, physical endurance , or a mix of all of them. In addition to the skill trees, there are quite a few weapons waiting for you to acquire, which you can upgrade.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/survival-nation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/survival-nation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5-8600k",
        "Memory": "12 GB RAM",
        "Graphics": "Nvidia GTX 1060",
        "Network": "Broadband Internet connection",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Wenkly Studio Sp. z o.o.",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10461722 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pfmmc2vbtk6i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/survival-nation-preinstalled-steamrip.jpg"
}