{
    "page_url": "https://steamrip.com/survive-the-fall-free-download/",
    "title": "Survive the Fall",
    "description": "A meteor strike has brought an end to civilization as we knew it. Humanity is on the brink of extinction. However, after years of uncertainty, sudden climate changes, extreme temperatures and other catastrophes, conditions seem to have improved to a point that it is possible to explore and re-populate this post-apocalyptic Earth.\nBuild a settlement as a safe haven and new home for your survivors . Leverage their strengths and abilities for the greater good. For only as a close-knit community will you be able to overcome these harsh new times, where rivaling factions fight for supremacy and can rebuild society against seemingly overwhelming odds.\nDiscover an open world full of dangers, secrets and valuable artifacts. But don’t get fooled by the sometimes tranquil environment and the beautiful scenery. Get distracted and both human enemies as well as wildlife or even nature itself will make sure that this is the last thing you’ll ever see. And be warned : The meteor left more than just a crater when it hit Earth. Are you brave enough to unearth the truth? Deliver At All Costs\nYou are not alone. Manage your followers, optimize their equipment and make sure that they stay healthy and in top condition. Take them on expeditions, fight and loot together as an unstoppable team of three or give them jobs in your base. The choice is yours. But remember: Who fights alone, dies alone!\nThere is more than one way to survive. Try to sneak your way out of dangerous situations, disarm traps, attempt to set up stealthy ambushes or choose head on combat, where you can issue commands to your team anytime. Keep in mind, however, that ammo is as limited as medicine and every companion returning to the camp is another step closer to surviving. Pick your strategy wisely.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/survive-the-fall-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/survive-the-fall-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (x64)",
        "Processor": "Intel Core i5 6600, AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GT 1030, AMD Radeon RX 550",
        "DirectX": "Version 11",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Strategy",
        "Developer": "Angry Bulls Studio",
        "Platform": "PC",
        "Game Size": "17.2 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.1.2364 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/24lul3",
        "https://buzzheavier.com/hyvhp2gqd4bu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/survive-the-fall-preinstalled-steamrip.jpg"
}