{
    "page_url": "https://steamrip.com/sweet-transit-free-download/",
    "title": "Sweet Transit",
    "description": "Sweet Transit is a unique city builder where the railway is king and trains are the best means of expansion and transportation. Create intricate production lines and grow humble villages into thriving metropolises while moving through prime eras such as the introduction of steam power and the invention of the combustion engine. Become a pioneer of industry and work to keep your citizens happy through the interconnected world of the railway. Teenage Mutant Ninja Turtles Arcade\nFrom a single warehouse, build a thriving interconnected world of villages and cities as you expand your rail network and evolve your society. Connect your settlements to ensure a painless transit for workers and civilians using platforms, stations and intricate routes complete with signals to expand and link together your network.\nPlan your settlements to fit both the landscape and needs of your citizens . Create basic and advanced production lines to ensure the most economical movement of resources. Take advantage of the mighty railway to automate production and meet ever-growing needs of your settlements. Your citizens have needs and get tired as they work. It’s important that you maintain their happiness and requirements by ensuring they have accommodation, water, food and more as you scale up your cities. Unhappy or tired workers are less productive and will be detrimental to your production lines.\nSweet Transit features full mod support from day one, allowing you to create custom content for the game as you please. Steam Workshop support is fully integrated with the title allowing for ease of access to the modding community.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/sweet-transit-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/sweet-transit-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 Bit",
        "Processor": "Intel Core i3-540, 3.07 GHz or AMD FX-4350, 4.2 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "NVIDIA GeForce 8800 GT, 512 MB or AMD Radeon HD 6670, 1 GB",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Ernestas Norvaišas",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "SKIDROW",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hj68moe4eqf6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/sweet-transit-preinstalled-steamrip.jpg"
}