{
    "page_url": "https://steamrip.com/sweet-surrender-vr-free-download-s2/",
    "title": "Sweet Surrender VR Free Download",
    "description": "Get Sweet Surrender VR for free instantly and play pre-installed on SteamRiP\nSweet Surrender is a roguelike shooter set in a dystopian megatower where you must adapt to a ruthless, fast-paced action-packed environment. Use explosives, melee weapons, guns and upgrades to take down the machines hunting you as you fight your way to the summit through procedurally-generated levels. There are not many humans left, so make your effort count.  Agile Combat – Use an array of weapons, tools and explosives to dispatch enemy forces. NEOGEO\nBlast through walls to uncover secrets, aim for weak points and adapt to the behaviour of your enemy. Zipline across lava, grapple hook through corridors as you gun down machine security forces. Upgrades and Enhancements – Discover upgrade chips that can heighten your abilities. Gain EMP effects on your weapons, increase your strength and speed, siphon energy from your enemies. Use your Grapplegun to reach previously hidden areas. Become a ruthless machine-human hybrid as you progress onwards and upwards .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/sweet-surrender-vr-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/sweet-surrender-vr-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5-4590 equivalent or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R290 or greater",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "ACE Team",
        "Platform": "PC",
        "Game Size": "564 MB",
        "Repack By": "SEWN",
        "Version": "Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/4y"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/sweet-surrender-vr-free-download-preinstalled-steamrip.jpg"
}