{
    "page_url": "https://steamrip.com/symphonia-free-download/",
    "title": "Symphonia",
    "description": "In the realm of Symphonia , music acts as a source of life and energy. But since the founders and their orchestra vanished the inhabitants are divided, and the world slowly falls into silence. What if there was a way to gather a new orchestra? That’s the question Philemon, the mysterious musician in Symphonia, will have to answer.\nEmbody a mysterious violinist, brought back to life in a declining world. Your violin and bow are both your instrument and a means of transport. Catapult yourself through the world, and complete levels by solving exciting platforming challenges while re-activating the machinery that brings life and energy back to this world.\nDiscover a musical world, based on the symphonic orchestra, and filled with colourful characters. Each area in Symphonia has its own distinct feel and characters, and each room is hand-crafted. Meet prodigious musicians and try to convince them to join the orchestra. Diesel Legacy: The Brazen Age\nA unique soundtrack, based on the romantic musical period, crafted by composer Olivier Esman. Enjoy the performance of the Scoring Orchestra Paris, recorded specifically for Symphonia and written by composer Olivier Esman and his partners Alexandre Bucas-Français and Lou Corroyer. Play engrossing concerts, each centred around one of the families of instruments – Strings, Brass and Woodwinds .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/symphonia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/symphonia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 660",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Sunny Peak",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "GOG",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8gjg7xpfkybt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/symphonia-preinstalled-steamrip.jpg"
}