{
    "page_url": "https://steamrip.com/system-of-souls-free-download-1r/",
    "title": "System of Souls Directly Download",
    "description": "Year 2155, life on the face of the earth has become unsustainable : the environmental state is deplorable. In order to survive, humans must transfer their souls into a robotic body developed by the large neurotechnological company ION. Bleak Sword DX\nAfter an accident, the protagonist L-064N wakes up in one of the robotic bodies with absolutely no memory of anything, with the only information being that ION rescued him in a pitiful state. Now his mind and soul are in an droid without the ability to communicate, but with other functions technologically far superior to those of his human body.\nTo recover your memory, you will have to pass a series of trials designed by Aura (a super-developed AI) from ION’s facilities, you will be able to explore different aspects of your memories, such as ideas, personality or feelings. Likewise, L-064N will acquire or improve different skills, which will allow him to explore and solve the different tests simulated and implemented in his psyche by Aura.\nDiscover the story of L-064N!, learn the immense wisdom of Aura through the trials, discover characters with diverse histories, strive to overcome the challenges that ION faces to recover your memory, and find clues that will help you understand the enigmatic world of System of Souls while solving complex puzzles that will not leave you indifferent.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/system-of-souls-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/system-of-souls-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64bit, Windows 8.1 64bit Windows 10 64bit",
        "Processor": "Intel Core i3-2100 / AMD® FX-6300",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA® GeForce GTX 750 Ti / ATI Radeon HD 7950",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Chaotic Lab",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11387097 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kngoo97ve1ed"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/system-of-souls-preinstalled-steamrip.jpg"
}