{
    "page_url": "https://steamrip.com/tabletop-simulator-free-download-a2/",
    "title": "Tabletop Simulator Free Download Direct Link (v13.1.1)",
    "description": "Create your own original games, import custom assets, automate games with scripting, set up complete RPG dungeons, manipulate the physics, create hinges & joints, and of course flip the table when you are losing the game. All with an easy to use system integrated with Steam Workshop . You can do anything you want in Tabletop Simulator. The possibilities are endless Tabletop Simulator has it all. The base game includes 15 classics like Chess, Poker, Jigsaw Puzzles, Dominoes, and Mahjong. Additionally, there are thousands of community created content on the Workshop.\nIf you’re the tabletop gaming type, we include an RPG Kit which has tilesets & furniture, as well as animated figurines that you can set up and battle with your friends, with even more options in the Chest. There’s even an option for Game Masters so they can control the table If you’re into creativity and prototyping, you can easily create your own games by importing images onto custom boards & tables, create custom decks, import 3D models, create scripts, and much more. You can choose to upload your creations on the Steam Workshop or share them privately with your friends. Everyone can play Tabletop Simulator Play a classic board game with grandma, have poker night with the guys, or start your epic RPG adventure with your crew. Play almost any tabletop game you can think of! Being a multiplayer -focused game, up to 10 players can play at any given time",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/tabletop-simulator-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/tabletop-simulator-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1+",
        "Processor": "SSE2 instruction set support.",
        "Memory": "4 GB RAM",
        "Graphics": "card with DX10 (shader model 4.0) capabilities.",
        "DirectX": "Version 10",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, RPG, Simulation, Strategy",
        "Developer": "Berserk Games",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Repack By": "N/A",
        "Version": "v13.1.1 | Full  + all DLC and Tortuga 1667",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fr4jftpty4i0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/tabletop-simulator-free-download-preinstalled-steamrip.jpg"
}