{
    "page_url": "https://steamrip.com/tactics-ogre-reborn-free-download-1y/",
    "title": "Tactics Ogre Reborn",
    "description": "Tactics Ogre, crown jewel of the tactical role-playing genre, is reborn. Based on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots.\nTactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they’ve ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before. The Valerian Isles, jewels of the Obero Sea. Shadows Over Loathing\nLong a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores. Yet upon the king’s death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria’s nobility; the Galgastani, whose people made up the majority of the isles’ population; and the Walister , who numbered but few.\nThe isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last. Your choices affect how the story unfolds, and even how it ends, with a game system that allows for multiple paths through the game and multiple endings. The story takes place through the eyes of a young man named Denam. The decisions he makes will alter the fate of those around him, and shift the course of Valeria’s history.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/tactics-ogre-reborn-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/tactics-ogre-reborn-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 64-bit (21H1 and above) / 11 64-bit (21H2 and above)",
        "Processor": "AMD A8-7600 / Intel® Core™ i3-3210",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon™ R7 240X / NVIDIA® GeForce® GTX 730 / Intel® UHD  630",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation",
        "Developer": "Square Enix",
        "Platform": "PC",
        "Game Size": "9.1 GB",
        "Released By": "FLT",
        "Version": "Build 9414523 | Full  + Bonus Soundtracks + Windows 7 Fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q8q6p2kbgr07"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/tactics-ogre-reborn-preinstalled-steamrip.jpg"
}