{
    "page_url": "https://steamrip.com/tails-the-backbone-preludes-free-download-r1/",
    "title": "Tails: The Backbone Preludes",
    "description": "Taking place years before the events of Backbone, Tails: The Backbone Preludes is a narrative game following four characters through formative moments of change, circumstance, and consequences in life and told through a series of interactive vignettes . Your choices are what’s most important – what traits are you bringing with you in your story, and what is the impact you make on the characters around you? Immerse yourself in a deep and meaningful narrative again and again. Industries of Titan\nCharacter traits, branching dialogues, and randomized events open up new paths every time the stories are relived. Keep track of all of your choices in the new branching tree, and explore all the different scenarios . With twice the wordcount as Backbone, Tails: The Backbone Preludes dives deep into the different ways conversations play out. While the world may be strange and the circumstances different, the stories in Tails are ones that everyone can relate to. Step into the shoes of four characters whose stories will reflect on different formative moments in life",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/tails-the-backbone-preludes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/tails-the-backbone-preludes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Multi-core 1.8GHz or faster",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 760 or equivalent",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Eggnut",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "Build 10445209 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8mj9qw1upowx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/tails-the-backbone-preludes-preinstalled-steamrip.jpg"
}