{
    "page_url": "https://steamrip.com/tails-of-iron-2-whiskers-of-winter-free-download/",
    "title": "Tails of Iron 2: Whiskers of Winter",
    "description": "Just as the Rats of the South start to piece their lives together, following the great war between Rodent and Frog, an old and unspeakable evil stirs in the North; wings black as death; fangs sharp as steel; and a thirst for blood rivalled only by their insatiable hunger for vengeance .\nAs Arlo, young heir to the Warden of the Wastes, journey through the vast, snow-ravaged lands of the North in an epic quest to overcome the Dark Wings once and for all. Hunt down giant beasts. Unite disparate clans. Upgrade your settlement. And discover a terrible secret of blood and crown\nThe time for heroes is over. For the Kingdom needs a warrior; forged of the North and as cold as the snow that shrouds these lands. A rat carved from iron. Steel Division 2\nExplore a Vast, Wintry Kingdom Fully narrated by RPG-legend, Doug Cockle, prepare to embark on an epic adventure across the northern realms of the Ratdom; an expansive, frost-bitten land on the brink of all-out war.\nHunt down Giant Beasts Track down and defeat the legendary monsters of this realm, and be rewarded with rare resources with which to craft devastating equipment. But be warned , these colossal creatures won’t go down without a fight and then some.\nMaster Brutal Combat The lands of the North are a perilous place, so you’ll need to master the fast, challenging combat for any chance of survival. Evade attacks with a dodge roll, nail split-second parry bashes, and unleash an array of gruesome executions.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/tails-of-iron-2-whiskers-of-winter-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/tails-of-iron-2-whiskers-of-winter-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "2.8 GHz Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Odd Bug Studio",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "RUNE emu",
        "Version": "v1.14327 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p8vl3d6qiawi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/tails-of-iron-2-whiskers-of-winter-preinstalled-steamrip.jpg"
}