{
    "page_url": "https://steamrip.com/tails-of-iron-free-download-a1/",
    "title": "Tails of Iron Free direct Download",
    "description": "Get Tails of Iron PC game for free instantly and play pre-installed on SteamRiP\nSet in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart . As you explore the deceivingly charming world, you’ll encounter a cast of unique companions, ready to aid you in your adventure.\nAnd you’ll need all the help you can get, whether that’s new meal recipes , blueprints to forge deadly weapons and armour, or even a land-chugging, armour-plated mole mobile From frog zombies to gargantuan grubs – and everything in-between – the Kingdom is awash with danger. SpyParty\nThe main character is the true heir to the rat kingdom, but the problem is that the warlike clan of Frogs has taken over! A dangerous journey awaits you in a fairy-tale world inhabited by a wide variety of creatures. At any time, you can stumble upon the leader-boss! And it is at this moment that it is important to have good weapons and suitable equipment. Intravenous\nTo overcome each perilous encounter , you’ll need to study your opponent’s attacks and react accordingly Thankfully, there’s a range of deadly abilities at your disposal, including parry bashes and fatal executions, not to mention ranged attacks with your nifty bow and arrow .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/tails-of-iron-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/tails-of-iron-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "2.8 GHz Dual Core CPU",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 660 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Odd Bug Studio",
        "Platform": "PC",
        "Game Size": "1.4 GB",
        "Repack By": "RUNE",
        "Version": "v1.51 | Full version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/omyp4pnsi92u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/tails-of-iron-free-download-preinstalled-steamrip.jpg"
}