{
    "page_url": "https://steamrip.com/tales-of-graces-f-remastered-free-download-t1/",
    "title": "Tales of Graces f Remastered",
    "description": "Tales of Graces f is back with a beautiful and easier-to-play version The game also includes Lineage and Legacies , an after-story to the main scenario!\nTales of Graces f is an action RPG all about adventure in fantasy worlds and overcoming obstacles through friendship and determination. Assetto Corsa EVO\nA child’s promise is the world’s last hope On a lush green planet called Ephinea, three young children make a promise to each other that could save the future. Asbel, heir to a local lord, Richard, prince of the Windor kingdom, and Sophie, a strange girl with no known past, all swear a special friendship oath after helping each other survive a dangerous attempt on Richard’s life in the land of Lhant. Years later, the world has changed. Asbel and his friends must face grave danger when Lhant becomes the battleground for a power grab among the three great nations of Ephinea. It is at this moment when an even greater threat is revealed and the bonds between the young heroes are put to the test with everything at stake.\nExhilarating continuous action with two styles to choose from! The Style Shift Linear Motion Battle System allows players to switch between two very different battle styles, Artes and Burst. You can choose the strength and range of the party’s attacks, the size of the attack, and how close or far away you need to be to the enemy for maximum effectiveness .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/tales-of-graces-f-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/tales-of-graces-f-remastered-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / Windows 11",
        "Processor": "Intel Core i3-8100 / AMD Ryzen 3 3100 / AMD Ryzen 3 2300X",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon HD 7770 / Nvidia GeForce GTX 550 Ti",
        "DirectX": "Version 11",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "TOSE CO., LTD.",
        "Platform": "PC",
        "Game Size": "9.5 GB",
        "Released By": "RUNE emu",
        "Version": "Build 16975809 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/1459D10F9B",
        "https://datanodes.to/zd23ceik4k5t/Tales-of-Graces-f-Remastered-SteamRIP.com.rar",
        "https://buzzheavier.com/bg0iz0ka0sr0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/tales-of-graces-f-remastered-preinstalled-steamrip.jpg"
}