{
    "page_url": "https://steamrip.com/tank-mechanic-simulator-free-download-b12/",
    "title": "Tank Mechanic Simulator",
    "description": "Tank Mechanic Simulator game for free instantly and play pre-installed on SteamRIP\nUse tools and take each tank apart. You can disassemble tank exterior parts, from the bottom (wheels and tracks) up to the turret (gun, barrel , gun cradle etc). Additionally, the interior of the tank is also available to be renovated, the crew space, tank engine and tank drive system.\nTake a seat inside the tank , as any of its crew. From here you can have better and easier access to the interior parts of the tank. Repair hatches, viewers, ammo holders , drive control components and gearbox parts. To start the tank, you need to repair its engine, gearbox and fuel system.\nTake the engine out and move it to a special engine stand, to be able to interact with it. Make sure the fuel, coolant and oil systems are assembled and the fluids are filled, so the tank engine can be put to test. Our tanks and vehicles are based on construction documents, expert opinions and insights from top II World War museums. Our goal is to give a fun and realistic simulation experience of building and repairing these legendary machines. One of the ways to obtain a tank is to get it during the extraction mission.\nAfter finding the spot where the tank is underground, call for the excavation team. Prepare the tank for extraction, by pumping the mud out of the tank and then cleaning the tank from whatever’s left. Finally, order the lifting of the tank onto the truck trailer, to finish the mission, and move the tank into the workshop .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/tank-mechanic-simulator-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/tank-mechanic-simulator-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-bit) or newer",
        "Processor": "Intel Core i3 2100 / AMD Phenom II X4 955 BE",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 570 / Radeon HD 6970",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Simulation",
        "Developer": "DeGenerals S.A.",
        "Platform": "PC",
        "Game Size": "8.4 GB",
        "Released By": "CODEX emu",
        "Version": "v1.4.0 | Full  (Build 11396639) + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1l888mxyz0l2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/tank-mechanic-simulator-preinstalled-steamrip.jpg"
}