{
    "page_url": "https://steamrip.com/tape-to-tape-free-download-1k/",
    "title": "Tape to Tape",
    "description": "Explore a gorgeous roguelite hockey world where every choice matters on your journey to restore hockey to its former glory. Hire unique players, manage your benchwarmers, discover synergies between them, choose new abilities, bribe the referees, visit the Blademaster for upgrades and a lot more.\nTake charge of a ragtag group of hockey players in a roguelite journey across a mysterious land. As the newly appointed captain, every choice matters on your path to discover the secret of hockey’s last bastion. Hire superstars, utilize the synergy found between players, and harness ruthless abilities, all in favor of crafting an unbeatable team. Painter Simulator\nEasier said than done, as the ultimate dream team doesn’t appear out of thin air. Use losses as an opportunity to visit the mighty Blademaster in between runs and permanently upgrade your hero for the battles ahead. When the Center is still flubbing every single face-off, there’s no shame in lining the ref’s pockets with some sweet “maple syrup.”\nCombining modern precision with fast-paced 90s-inspired action, Tape to Tape offers a unique experience in the form of a simcade hockey experience. Bone-crushing body checks and stellar saves will keep players shaking in their skates, but mastering the dynamic puck physics system will secure the victory. Players and goalies will react to the puck bouncing off sticks and ricocheting off faces creating organic and emergent battles on the ice. Thankfully, there is no penalty when a tooth is lost.\nThe Tape to Tape can be played online with a total of up to 4 players using Steam remote play or locally. The fast-paced gameplay and tight controls makes for memorable matchups . We also invite you to join our Discord server to play with the dev team or to find other player amongst our wonderful community. The Roguelite campaign is also playable cooperatively with some friends for a truly unique experience.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/tape-to-tape-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/tape-to-tape-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "2.6 GHz Intel Quad Core",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce GT 750M, 2 GB Memory",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Sports, Early Access",
        "Developer": "Excellent Rectangle",
        "Platform": "PC",
        "Game Size": "806 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.1.3 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5v0ohfqvoiff"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/tape-to-tape-preinstalled-steamrip.jpg"
}