{
    "page_url": "https://steamrip.com/tavern-talk-free-download/",
    "title": "Tavern Talk",
    "description": "You Walk into A Tavern and get to work! You are the owner of the Wayfarer’s Inn, a popular watering hole in the fantasy land of Asteria. But you’re no ordinary barkeep. Be it a potion of seething fury or prancing swords, the drinks you serve can change your customer’s destiny forever. You can also turn the rumours you hear at work into intrepid quests for your patrons\nBefriend a colourful cast of adventurers as they brag about their latest triumph – or commiserate an utter failure. Whether it’s relaxation or a fresh thrill, you’re on hand to give each patron what they need. Beyond the walls of this cosy tavern, a world- threatening danger is brewing. Every quest, rumour and conversation is intertwined with the ultimate fate of the land. Logic World\nFind Your Family\nThe Wayfarer’s Inn is a safe haven to a colourful cast of characters inspired by TTRPGs. Get to know their unique personalities, and help them find a place that feels like home.\nBrew Up A Storm\nServe an ever-growing menu of magical drinks to your patrons , but choose carefully, as your choice will alter their fates.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/01/tavern-talk-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/01/tavern-talk-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2.4 GHz or faster processor",
        "Memory": "2 GB RAM",
        "Graphics": "2GB display memory",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Gentle Troll Entertainment",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "TENOKE",
        "Version": "Build 16658962 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/v9lojin54gns"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/01/tavern-talk-preinstalled-steamrip.jpg"
}