{
    "page_url": "https://steamrip.com/tchia-free-download-y1/",
    "title": "Tchia Directly Download",
    "description": "Join Tchia on her tropical open-world adventure as she sets off to rescue her father from the cruel tyrant, Meavora, ruler of the archipelago. Climb , glide, swim, and sail your boat around beautiful islands as you explore a physics-driven sandbox. Face the fabric soldiers created by Meavora in open encounters where your creativity gives you the edge. Take control of any animal or object you can find, make new friends and jam on your fully playable Ukulele. International Space Banana\nTchia’s special gift lets you take control of any animal or object you can find. With over 30 animals and hundreds of objects to choose from, fly around as a bird, explore the ocean as a fish or dig for treasures as a dog! Use your unique soul-jumping abilities to explore solve puzzles, and uncover secrets .\nJump and glide your way across a vast archipelago and use the Tricks system to perform cool stunts and dives. The free climbing mechanic lets you ascend anything in the world without restriction including any physics-driven tree. Take to the ocean waves, and sail your customizable boat across turquoise lagoons and dive around coral reefs and shipwrecks .\nJust jamming by yourself or playing alongside other inhabitants of the archipelago, your fully playable ukulele will be a trusty companion throughout the game. Use it at key story moments during rhythm sections, or play unlockable melodies at any point in the open world to trigger special events such as attracting animals, triggering rainfall\nTake Tchia on a heartfelt adventure and meet a diverse cast of characters inspired by New Caledonian cultures. Fully animated cutscenes voiced in traditional language will punctuate your journey while an original orchestral score infused with local sounds creates a unique and immersive world .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/tchia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/tchia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core i5-7600 / AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060 6GB / AMD Radeon RX 580",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Awaceb",
        "Platform": "PC",
        "Game Size": "2.9 GB",
        "Released By": "TENOKE",
        "Version": "Build 13814412 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ap0viw5iesu5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/tchia-preinstalled-steamrip.jpg"
}