{
    "page_url": "https://steamrip.com/technicity-free-download-w1/",
    "title": "Technicity Directly Download",
    "description": "Technicity is a first-person city building game where you can also design your own construction blocks and items to create really unique buildings. Use cranes to speed up construction , terraform the open world, build roads and use vehicles to travel to different cities that you or your friends create in solo or coop mode. Use a crane or a cement mixer to quickly build houses, shops, factories and any other building you can think of. Mythos\nThe design is yours: with a large variety of building blocks of different shapes and materials, you can really create whatever you want. You can then save a schematic from any building you made and start construction of the same building somewhere else. Share your schematics in the Steam Workshop and use other players’ creations. The open world is huge and can be filled with many big cities. An existing road network with thousands of km’s lets you reach every part of the 384 km2 map. Build your own roads and they’ll be integrated into the navigation system. Terraform the world with steamrollers and bulldozers you can even create or remove entire mountains",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/technicity-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/technicity-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8/10",
        "Processor": "3 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "OpenGL 3 compatible card with 2 GB of memory, nVidia® 7XX+/AMD® 7XXX+",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Osaris Games",
        "Platform": "PC",
        "Game Size": "608 MB",
        "Released By": "Goldberg + SSE emu",
        "Version": "v1.4c | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3mtk5axx12qz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/technicity-preinstalled-steamrip.jpg"
}