{
    "page_url": "https://steamrip.com/teenage-mutant-ninja-turtles-shredders-revenge-free-download-1y/",
    "title": "TMNT Shredders Revenge",
    "description": "Teenage Mutant Ninja Turtles: Shredder’s Revenge features groundbreaking gameplay rooted in timeless classic brawling mechanics, brought to you by the beat ’em up experts at Dotemu (Streets of Rage 4) and Tribute Games. Bash your way through gorgeous pixel art environments and slay tons of hellacious enemies with your favorite Turtle, each with his own skills and moves making each run unique Choose a fighter, use radical combos to defeat your opponents and experience intense combats loaded with breathtaking action and outrageous ninja abilities. Neon White\nStay sharp as you face off against Shredder and his faithful Foot Clan alone, or grab your best buds and play with up to 6 players simultaneously With Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder’s latest twisted plan, Teenage Mutant Ninja Turtles: Shredder’s Revenge sees the Turtles battling across a righteous range of timeless TMNT locations.\nFrom Manhattan and Coney Island, to city rooftops and dank sewers, help the fearsome foursome trounce Foot Soldiers, Triceraton Warriors, and Rock Troops all the way to Dimension X Enjoy stunning full-color pixel art graphics and a vintage TMNT vibe that will rock you straight back to the awesome 80s.\nEvery character, vehicle, weapon, item, and background is directly inspired by the 1987 TV show, making you feel like you hopped into the television with a dope mix of killer humor and action-packed adventures",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/tmnt-shredders-revenge-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/tmnt-shredders-revenge-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 64-bit",
        "Processor": "Intel Core i3-2100 or AMD FX-4300",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 320, 1 GB or AMD Radeon HD 5570, 1 GB or Intel HD 4600",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Con Man Games, SmashGames",
        "Platform": "PC",
        "Game Size": "985 MB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0.349 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0e1072djqzvn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/tmnt-shredders-revenge-preinstalled-steamrip.jpg"
}