{
    "page_url": "https://steamrip.com/teenage-mutant-ninja-turtles-splintered-fate-free-download/",
    "title": "TMNT Splintered Fate",
    "description": "Grab your friends, pick your favorite Turtle and jump into a roguelike adventure to save Master Splinter from the foot clan! Master ninja skills, unite in bodacious online and local co-op gameplay, and conquer iconic NYC locales. The Matchless Kungfu\nIn In TMNT Splintered Fate, brace yourself for fast-paced, roguelike action where no two runs are the same. With randomized power-ups, room layouts, and boss modifiers, the excitement never ends. Take control of all four Turtles, each wielding unique powers, and team up with friends for bodacious co-op gameplay. Explore iconic NYC locations, upgrade your Turtle powers, and prepare to face off against formidable enemies.\nMaster the powers of water and fire, utrom and ooze, light and darkness , and -most importantly- Ninja to create unique and bodacious builds for your Turtles . Every run brings new challenges and opportunities – explore and perfect your favorite builds, and combine them with allies to conquer your enemies.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/teenage-mutant-ninja-turtles-splintered-fate-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/teenage-mutant-ninja-turtles-splintered-fate-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 950, Radeon R7 360, or Intel HD  630",
        "DirectX": "Version 12",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Super Evil Megacorp",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.8.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/x7e1ufem7iqs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/teenage-mutant-ninja-turtles-splintered-fate-preinstalled-steamrip.jpg"
}