{
    "page_url": "https://steamrip.com/tell-me-your-story-free-download/",
    "title": "Tell Me Your Story",
    "description": "Tell Me Your Story is a story-driven cozy puzzle game, which might remind you of the warm times spent with your grandparents or loved ones on getting to know the many, sometimes unexpected stories from their lives.\nMeet Amelia, a schoolgirl with a vivid imagination, who’s going on her summer vacation to her grandma Rose’s cottage – her loyal best friend, Peanut , in tow. This is where Rose had settled to find inner peace in her old age after the life she’s had Athenian Rhapsody\nRose is not an ordinary grandmother – she has a home full of wondrous items and stories to tell. All her life she was a globetrotter, an adventurer – but without dangerous artifacts to deal with.\nDiscover Asia, Europe, and the Amazon rainforest and feel like a child again, while listening to grandmother’s colorful stories alongside Amelia and the adorable corgi doggie .\nWhile helping unpack Rose’s things together with Amelia , you will find plenty of interesting artifacts that she took from her escapades around the world. They will help you get a better picture of the memories she wants to share with you and let you traverse through the images of her past.\nGoing through the adventure, you will have many puzzles to solve, which will help you discover the wonders Rose has hidden. Help out Amelia with writing everything down in the diary, and make all these stories even better with her imagination.\nFollowing Rose’s footsteps will lead you to historical sites all over the world. First will be the journey through the Amazon rainforest in search of Aztec legends, then through the Yunnan region in China – where the masters of brewing tea lay. Last but not least, you will find yourself on board the Orient Express and its magical first route – from Paris to Istanbul. Will this busy summer full of memories and adventure bring together two generations, that thought they had so little in common until now?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/tell-me-your-story-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/tell-me-your-story-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel 2 cores / 4 threads @ 2.5Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "Require a dedicated graphic card.",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "RedDeer.Games",
        "Platform": "PC",
        "Game Size": "343 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6yz6ofbskvm5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/tell-me-your-story-preinstalled-steamrip.jpg"
}