{
    "page_url": "https://steamrip.com/tempest-rising-free-download/",
    "title": "Tempest Rising",
    "description": "Classic RTS action meets modern production and performance in Tempest Rising. Inspired by RTS greats of the 90s and 2000s, Tempest Rising is a classic, base-building real time strategy game set in a modern day alternative history war scenario. LUNAR Remastered Collection\nIt features 3 unique factions, each with its own approach to combat and economy and offering a variety of strategies for players of all stripes, deep and rewarding gameplay that keeps a focus on strategy while rewarding skill, and built-in customization options that allow players to approach the game their way in both single player and multiplayer game modes .\nTake on the role of Commander in the highly mobile and advanced peacekeeping corps of the Global Defense Forces or the hard-hitting and desperate Tempest Dynasty in 2 11-mission campaigns that allow the player to customize their army for each mission, as both armies seek to understand and control the mysterious but beneficial Tempest vines that grow unchecked across the war-torn planet Earth. Other dangers wait in the shadows, as the origin of the Tempest is revealed",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/tempest-rising-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/tempest-rising-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or 11 (64 bit)",
        "Processor": "Intel Core i5-8600 / AMD Ryzen 5 1600 or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 1060 3GB/6GB / AMD RX 580 8GB or better",
        "DirectX": "Version 11",
        "Storage": "45 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "Slipgate Ironworks",
        "Platform": "PC",
        "Game Size": "42 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/vjyxzlaagugz",
        "https://datanodes.to/xk9q5b1xkpvq/Tempest-Rising-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/tempest-rising-preinstalled-steamrip.jpg"
}