{
    "page_url": "https://steamrip.com/temtem-swarm-free-download/",
    "title": "Temtem: Swarm",
    "description": "Temtem: Swarm combines the minimalistic gameplay of classic survivor games with Temtem’s strategy-based combat mechanics, giving you the potential to develop a multi-faceted strategy in a vibrant environment alongside creatures you already know and love. Suicide Guy\nUp to 3 friends can face relentless swarms of Tems together. Strategize , share resources(or don’t!), and take down increasingly more powerful bosses. Maximize your attack potential by coordinating gears and skills with precision timing, creating overpowered synergies . The ultimate test of teamwork and survival awaits!\nConquer each stage by defeating challenging mini-bosses and formidable stage bosses with devastating abilities. Strategize, pivot, and prove your skills as you face off against powerful Tems like Gharunder, Yowlar, and Nessla. Only the boldest will emerge victorious – so gear up to defeat them and clear every hand-crafted stage before the swarm overwhelms you!\nYou have incredible power at your command. Choose when to tap into your Tem’s full potential and unleash devastating attacks, defensive abilities, or power-ups that help you and your friends clear the map in one fell swoop . With great power comes great responsibility are you up to the task?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/temtem-swarm-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/temtem-swarm-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bits",
        "Processor": "Intel I3-7100 or similar",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 960",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, RPG, Early Access",
        "Developer": "Crema, GGTech Studios",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "Mr_GOLDBERG emu | Ty samsterrz (csrin) for CSF",
        "Version": "Build 16393994 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/h0dvse3so3pg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/temtem-swarm-preinstalled-steamrip.jpg"
}