{
    "page_url": "https://steamrip.com/terra-nil-free-download-q1/",
    "title": "Terra Nil",
    "description": "Terra Nil is a game about transforming a barren , lifeless landscape into a thriving, vibrant ecosystem. Turn dead soil into fertile grassland, clean polluted oceans, plant sprawling forests, and create the ideal habitat for animals to call home. Then recycle your buildings and leave no trace that you were there. Reclaim the wasteland .\nUse advanced eco-technology to purify the soil, creating plains, wetlands, beaches, rainforests, wildflowers, and more then efficiently recycle everything you’ve built, leaving the environment pristine for its new animal inhabitants. WILD HEARTS\nProcedurally generated landscapes mean no two playthroughs of Terra Nil will ever be the same. Plan your build around randomized, challenging, and unpredictable terrain, including snaking rivers, mountains, lowlands, and oceans.\nEach region of Terra Nil progresses through phases, with the ultimate goal being leaving pristine wilderness behind. Levels are not about infinite growth, but rather balancing and nurturing the environment before leaving it in peace.\nLush hand-painted environments, relaxing music, and an atmospheric ambient soundscape make Terra Nil a peaceful, meditative experience. When you’re done, use Appreciate mode to bask in the natural beauty of the ecosystem you have restored.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/terra-nil-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/terra-nil-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 x64",
        "Processor": "Intel Core i5-4590 / AMD FX-8350",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 760 / Radeon RX 560X",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Strategy",
        "Developer": "Free Lives",
        "Platform": "PC",
        "Game Size": "904 MB",
        "Released By": "RUNE emu",
        "Version": "v1.1.12 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s9alurvdowy2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/terra-nil-preinstalled-steamrip.jpg"
}