{
    "page_url": "https://steamrip.com/terratech-free-download-t2/",
    "title": "TerraTech Free",
    "description": "TerraTech Download PC Game In Direct Link for free on SteamRIP\nTerraTech is an open-world, sandbox adventure game, where you design and build your own creations through a mix of crafting, combat and discovery. Design cars, tanks and planes from a huge library of blocks. Scavenge, craft and buy new parts in order to survive and become the ultimate planetary prospector. Start your career as an Intergalactic prospector in search of profit and glory in Campaign , build to your heart’s content in Creative mode or pit your Techs against the clock in the Gauntlet Challenge.\nTeam up with other intrepid prospectors in Co-op Campaign, build and create together in Co-op Creative, go head-to-head for glory in the Deathmatch Arena or battle for supremacy in Sumo. Using the building blocks, guns, wheels, and wings from several Mining Corporations, you can build varied Techs to suit every purpose. Be it powerful armoured combat vehicles, unstoppable resource gathering machines, sprawling resource processing bases or a hybrid of all three – creativity is your key to exo-planetary success.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/terratech-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/terratech-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core2 Duo T7600 2.33GHz or AMD Athlon 64 FX-60 Dual Core",
        "Memory": "4 GB RAM",
        "Graphics": "nVidia GeForce 520M or Intel HD 4000",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Payload Studios",
        "Platform": "PC",
        "Game Size": "874 MB",
        "Released By": "RUNE emu",
        "Version": "v1.6.7 | Full  + All Addons",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lgn25a759ea7"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/terratech-free-download-preinstalled-steamrip.jpg"
}