{
    "page_url": "https://steamrip.com/terrorbane-free-download-1y/",
    "title": "tERRORbane",
    "description": "In tERRORbane, you’d expect to save a generic fantasy RPG world from evil, right? Instead, the Developer who created the game keeps on commenting on everything you do, funny bugs and glitches keep on popping up everywhere you go and nothing seems to work the way it should?\nWhat’s a good Player to do, but dish out his trusty BUG LIST and use bugs to his advantage to get to the ending credits sequence? Did you really think finishing the game would be enough to finish tERROrbane’s story?\nYour choices shape your journey across the world, delivering you to wildly different sections and environments, going back and choosing differently will usher you to completely different stories and characters, adding new bugs to your collection! Who’s to say you won’t find a way to explore even beyond the ending credit scene The Developer swears the game he has created is the best one ever made, but the sorry state of his code begs for a much needed reassessment of his claims Need for Speed: Porsche Unleashed\nHunt for bugs and glitches, fill your BUG LIST and exploit every loop-hole you can! Only this way you’ll defy all videogaming norms and prove your rights as the ultimate Player, worthy of changing the world of tERRORbane forever.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/terrorbane-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/terrorbane-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 11",
        "Processor": "Intel Core i5, 2.0+ GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA or ATI Radeon, 4GB",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "BitNine Studio",
        "Platform": "PC",
        "Game Size": "938 MB",
        "Released By": "GOLDBERG (cs.rin.ru)",
        "Version": "v1.1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/xppbtbvg5uwg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/terrorbane-preinstalled-steamrip.jpg"
}