{
    "page_url": "https://steamrip.com/tetris-effect-connected-free-download-b3/",
    "title": "Tetris Effect Connected Free",
    "description": "Get Tetris Effect: Connected PC game for free instantly and play pre-installed on SteamRiP\nIncludes the all-new “Zone” mechanic, where players can stop time (and Tetriminos falling) by entering “the Zone” and either get out of a sticky situation that could otherwise lead to “Game Over,” or rack up extra Line Clears for bonus rewards. YuuYuu Jiteki no Yuukarin\nTailored for Steam, capable of running at resolutions of 4K or more with an uncapped framerate (with Vsync disabled) and includes ultra-wide monitor support as well as other expanded game and graphical options not found in the console release for both 2D and VR play (including adjustable particle volume and size, texture filtering, and more).\n“Connected” co-op mode, where up to three players can literally connect their Tetris playfields together and play as one. 10+ single-player Effect modes with varying twists on the classic Tetris formula, designed to evoke different moods the player might be in (or want to be in i.e. chill out with “Relax,” concentrate with, as well as appeal to varying skill levels.\nNostalgic stages based on old-school Tetris games, as well as Classic Score Attack multiplayer mode with the rules and appearance of 8-bit Tetris. Fully featured multiplayer , including cross-platform play with all other platforms, matchmaking for Ranked play, robust options for Friend matches, player progression for unlockable avatars, and more",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/tetris-effect-connected-free-download-crack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/tetris-effect-connected-free-download-preinstalled-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 bit Windows 10 / 8 / 7",
        "Processor": "Intel Core i5-2500K 3.3GHz / AMD FX-8150 3.6GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 550 Ti / Radeon HD 6790 2GB VRAM*",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, VR",
        "Developer": "Monstars Inc., Resonair, Stage Games",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v2.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/oyylniwgdfjc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/tetris-effect-connected-free-download-torrent-steamrip.jpg"
}