{
    "page_url": "https://steamrip.com/thalassa-edge-of-the-abyss-free-download/",
    "title": "Thalassa: Edge of the Abyss",
    "description": "Thalassa is a single player, first person psychological drama set in 1905. You play as Cam, a deep sea diver in a crew of adventurers and pioneers aboard Thalassa. As you prepare to raise a long-forgotten Spanish galleon from the ocean, what should be a great day for history takes a turn for the worst.\nUpon needing to take some time to heal from the event, you discover Thalassa has met a mysterious and unfortunate end. Your former crew mates are gone, and you’ll need to descend into the depths to board the ship once more. Alone in the ocean, with your diving support Bailey guiding you from the surface, it’s up to you to piece together the clues left behind in the wreckage and discover what really happened in the final moments onboard the ship. Thank Goodness You’re Here!\nDiscover a story that delves into the complexities of human emotions and interactions , and learn about the intricate relationships between your crew members. You’ll uncover the personal struggles of each member of Thalassa’s crew and how grief can be experienced in different ways. Loss takes its toll in many shapes and forms, while life marches on.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/thalassa-edge-of-the-abyss-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/thalassa-edge-of-the-abyss-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 4th Gen/ AMD Ryzen 3 4100 4 cores 3.8 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Ti 4GB/ AMD R9 290 HD 4GB",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Sarepta Studio",
        "Platform": "PC",
        "Game Size": "10 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.0-012215 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/YCiYoI",
        "https://megadb.net/3tre9z3ftmyz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/thalassa-edge-of-the-abyss-preinstalled-steamrip.jpg"
}