{
    "page_url": "https://steamrip.com/that-flipping-mountain-free-download-c6/",
    "title": "That Flipping Mountain Direct Free Download",
    "description": "Get That Flipping Mountain v1.0.22 PC game for free instantly and play pre-installed on SteamRiP\n‘That Flipping Mountain’ has controls that are easy to grasp , but challenging to master. The learning curve is about the same as learning to ride a bike. It’ll seem impossible until you get a feel for it, then it’ll become second nature and you’ll be sticking landings without even thinking about it. (That’s when the fun starts) For Those That Like to Read Hey everyone, my name is Jeff Weber . I’ve been making physics games in my spare time for over 10 years.\n‘That Flipping Mountain ‘ is my latest and greatest Like all my physics games, it gets to the point quick with minimal fluff and nonsense. Launch yourself, parkour style, up a single massive mountain full of parkour stones, spring boards, ski slopes, watering holes, and other challenging obstacles. Flip, ski, dive, fall down, rage, get up, parkour on\nThat Flipping Mountain’ are simple in concept, but require some practice to get a feel for the inertia of the flip. The launch and flip mechanic has been honed , tweaked, and iterated-on for over a year to make it smooth and satisfying. Just pull down and back sling-shot style anywhere on the screen and release to launch. Once in the air, mouse down to crouch or release to extend. Stick the landing and repeat.\nInspired by the world of Getting Over It with Bennet Foddy, ‘That Flipping Mountain’ consists of a single large continuous mountain of stuff to struggle over. You will not be artificially teleported back to the start if you fail to stick a landing, you will simply get back up and parkour on. Of course, if you fail to stick the landing in the wrong place, gravity might have a say in where you end up.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/that-flipping-mountain-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/that-flipping-mountain-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Vista, 7, 8, 10",
        "Processor": "2Ghz",
        "Memory": "2 GB RAM",
        "DirectX": "Version 9.0",
        "Storage": "50 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Simulation, Sports",
        "Developer": "Jeff Weber",
        "Platform": "PC",
        "Game Size": "78.25 MB",
        "Repack By": "SEWN",
        "Version": "v1.0.22 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6qhvv34trxfp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/that-flipping-mountain-free-download-preinstalled-steamrip.jpg"
}