{
    "page_url": "https://steamrip.com/the-elder-scrolls-iv-oblivion-goty-free-download-v2/",
    "title": "The Elder Scrolls IV Oblivion GOTY Directly Download",
    "description": "The Elder Scrolls IV: Oblivion Game of the Year Edition presents one of the best RPGs of all time like never before. Step inside the most richly detailed and vibrant game-world ever created. With a powerful combination of freeform gameplay and unprecedented graphics, you can unravel the main quest at your own pace or explore the vast world and find your own challenges.\nAlso included in the Game of the Year edition are Knights of the Nine and the Shivering Isles expansion, adding new and unique quests and content to the already massive world of Oblivion . See why critics called Oblivion the Best Game of 2006. Create and play any character you can imagine, from the noble warrior to the sinister assassin to the wizened sorcerer.\nAn all-new combat and magic system brings first person role-playing to a new level of intensity where you feel every blow This groundbreaking AI system gives Oblivion’s characters full 24/7 schedules and the ability to make their own choices based on the world around them. Non-player characters eat, sleep, and complete goals all on their own. New Lands to Explore In the Shivering Isles expansion, see a world created in Sheogorath’s own image, one divided between Mania and Dementia and unlike anything you’ve experienced in Oblivion.\nBattle the denizens of Shivering Isles, a land filled with hideous insects, Flesh Atronachs, skeletal Shambles, amphibious Grummites, and many more The Knights of the Nine have long been disbanded. Reclaim their former glory as you traverse the far reaches of Cyrodill across an epic quest line. Live the life of a noble warrior in this expansive castle with private quarters, grand dining hall, and a wine cellar.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/the-elder-scrolls-iv-oblivion-goty-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/the-elder-scrolls-iv-oblivion-goty-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Windows 2000, Windows XP 64-Bit",
        "Processor": "2 Ghz Intel Pentium 4 or equivalent",
        "Memory": "512 MB",
        "Graphics": "128 MB Direct3D compatible video card and DirectX 9.0 compatible driver",
        "DirectX": "9.0c",
        "Hard Drive": "4.6 GB"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Hyperstrange",
        "Platform": "PC",
        "Game Size": "5.2 GB",
        "Released By": "GOG",
        "Version": "v1.2.0416 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/7F978CA7FA",
        "https://buzzheavier.com/ztxpf2ql8zlk",
        "https://megadb.net/92mni9g8kl0z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/the-elder-scrolls-iv-oblivion-goty-preinstalled-steamrip.jpg"
}