{
    "page_url": "https://steamrip.com/the-bonfire-2-uncharted-shores-free-download-4y/",
    "title": "The Bonfire 2: Uncharted Shores Download",
    "description": "Get The Bonfire 2: Uncharted Shores for free instantly and play pre-installed on SteamRiP\nThe Bonfire 2: Uncharted Shores is an urban survival strategy game in which you’ll have to build a city, survive, fight monsters and defend the city from evil enemies, and more. In fact, this is a typical city-building simulator in which you propose to build a city and try to provide it and its inhabitants with everything they need. But there are also several important “buts”. The first “but” is that the city will also need to be protected from all kinds of enemies , among which there will be both ordinary bandits and evil spirits.\nThe second is the unusual construction mechanics, which assumes the strategically correct location of buildings – a lot can depend on this. Sequel to the award- winning game The Bonfire: Forsaken Lands, The Bonfire: Uncharted Shores expands on every aspect of the original and brings greater depth.\nDesign your city, manage resources chains and workers with unique personalities, explore procedurally generated world map in ships, trade with free cities, and discover mysterious dungeons . Build a powerful city and gain magical artifacts to defeat an ancient evil. Total War: ROME II Emperor Edition",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/08/the-bonfire-2-uncharted-shores-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/08/the-bonfire-2-uncharted-shores-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista/7/8/10",
        "Processor": "2 Ghz",
        "Memory": "2 GB RAM",
        "Graphics": "1 GB VRAM",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Xigma Games",
        "Platform": "PC",
        "Game Size": "287 MB",
        "Repack By": "CODEX",
        "Version": "v1.0.21 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tuqgvnzvmzk3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/08/the-bonfire-2-uncharted-shores-free-download-torrent-steamrip-1.jpg"
}