{
    "page_url": "https://steamrip.com/the-rise-of-the-golden-idol-free-download/",
    "title": "The Rise of the Golden Idol",
    "description": "The Idol was lost — but not forgotten . In this followup to the award winning detective game The Case of the Golden Idol, you are an observer that must investigate 20 strange cases of crime , death and depravity – all somehow connected. Use your detective skills to make sense of a grand mystery that unfolds across an age of hallucinogens, disco, fax machines and parapsychology. Metro Awakening\n200 YEARS LATER THE IDOL RISES Two hundred years after the unspeakable fate of the Cloudsley family, the Idol’s legend lives on only in whispers and myth… but some are determined for this to change. Discover the mysterious forces connecting a tenacious treasure hunter, a team of scientists, the members of an enlightenment-seeking cult and corporate profiteers drawn to the all-powerful artifact .\nLEAD YOUR OWN INVESTIGATION The Rise of the Golden Idol is a new type of detective game where you freely explore each crime scene at your own pace, using logic to build your own theories. Click to collect clues and analyze each discovery to determine what happened, why, and who was responsible.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/the-rise-of-the-golden-idol-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/the-rise-of-the-golden-idol-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "1.7 GHz Dual Core",
        "Memory": "8 GB RAM",
        "Graphics": "Intel HD  4600",
        "DirectX": "Version 12",
        "Storage": "2500 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Color Gray Games",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "stroopwafel Ty for files (cs.rin.ru)",
        "Version": "Build 16378973 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/iaqm7wfmro2z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/the-rise-of-the-golden-idol-preinstalled-steamrip.jpg"
}