{
    "page_url": "https://steamrip.com/the-jackbox-naughty-pack-free-download/",
    "title": "The Jackbox Naughty Pack",
    "description": "Bring the heat with a threesome of fun in Jackbox Naughty Pack. We know you’ve been begging to burst out of the box. It’s time to set your party aflame with a brand new pack of three adult party games that will bring some harmless heat to your next weekend hang with friends. It’s the perfect pack for your next college party, grown-up game night, bachelor /ette celebration, or hump day gathering. Play with your phone or tablet no special controller required. All three games support 3 to 8 players and 10,000 audience members.\nWe’re spreading the love around the world. All Jackbox Naughty Pack games can be played in English, French, Italian, German, Castilian or Latin American Spanish, and Brazilian Portuguese. Fakin’ It All Night Long (Social Deduction): Fakin’ It returns and this time we’re putting it all out there. Everyone gets a secret task except the Faker, who tries to blend in. Find out which of your friends is the best liar and SO much more! Featuring new categories like “Finger Blast ” and a brand new “remote play” mode. Who doesn’t like a good Finger Blast with their friends? WHAT THE CAR?\nDirty Drawful (Drawing, Guessing): It’s Drawful, but dirty It’s Dirty Drawful. Hosted by the one and only Drawful Owl, as you’ve never seen her before. We’ve taken the game that you love and added prompts to ensure your drawings are both terrible and titillating. This game has everything:, sex, drugs, and other things that we absolutely cannot list here! Also, if you can’t commit to a relationship , or a drawing, we added an undo button just for you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/the-jackbox-naughty-pack-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/the-jackbox-naughty-pack-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10+",
        "Processor": "2.66 Ghz Core 2 Duo or Greater",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce 500+ / Radeon 5000+ or Greater",
        "Network": "Broadband Internet connection",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Casual",
        "Developer": "Jackbox Games, Inc.",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Released By": "Mr_GOLDBERG cs.rin.ru",
        "Version": "Build 15504696 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6kd2chg5bcyc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/the-jackbox-naughty-pack-preinstalled-steamrip.jpg"
}