{
    "page_url": "https://steamrip.com/the-tale-of-bistun-free-download-l1/",
    "title": "The Tale of Bistun",
    "description": "The Tale of Bistun is a story-driven action-adventure game inspired by the 12th Century tragic poem “Khosrow and Shirin.” You play as a stone carver who wakes on Mount Bistun with no memory of anything before that moment. An insidious blight has spread, bringing forth many dangerous foes. You must battle through mythical enemies and travel between the real world and an ethereal place of forgotten memories to discover the secret of your past.\nOn the craggy slopes of Mount Bistun, a stone carver awakens with no memory of who he is nor how he came to be there. He soon discovers that a blight is squeezing the life out of nature, tainting the local wildlife and turning it hostile. Encouraged by a strange, pleading whisper, the man journeys between the real world and the mysterious place of forgotten memories, known as the Revelations Realm, in search of answers.\nBut a colossal ancient evil is watching , waiting, and is not best pleased that its plans are being disrupted. The Tale of Bistun is a compelling tale of sacrifice and self-discovery inspired by the 12th Century poem “Khosrow and Shirin.” The story takes place in an exotic world of Persian myth, where magic and divine influences shape all that you encounter. WARRIORS OROCHI 3 Ultimate Definitive Edition\nAs the stone carver, you must traverse the scenic slopes of Mount Bistun to unravel the mystery of your identity and how you came to be on the mountain. Although beautiful, Mount Bistun has been afflicted by a terrible blight, and dangerous creatures wait for unsuspecting adventurers . As you explore the mountain, sculpt statues to remind you of your hazy past. Then, you can return to a hub area to carve out beautiful engravings detailing your past experiences and encounters.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/the-tale-of-bistun-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/the-tale-of-bistun-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i5 4460 | AMD Athlon X4",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 950 | AMD R7 370",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Black Cube Games",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "FLT",
        "Version": "Build 9099794 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/i2zng7ts9wim"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/the-tale-of-bistun-preinstalled-steamrip.jpg"
}