{
    "page_url": "https://steamrip.com/the-lord-of-the-rings-return-to-moria-free-download-1h/",
    "title": "The Lord of the Rings: Return to Moria",
    "description": "The Lord of the Rings: Return to Moria follows the Dwarves as they embark on a new adventure to reclaim their legendary home of Moria beneath the Misty Mountains. Players will join forces to survive, craft, build and explore the iconic, sprawling mines. Courageous expeditioners will need to be vigilant as mysterious dangers await. Summoned to the Misty Mountains by Lord Gimli Lockbearer , players take control of a company of Dwarves tasked to reclaim the lost spoils from the Dwarven homeland of Moria—known as Khazad-dûm or Dwarrowdelf—in the depths below their very feet. WORLD OF HORROR\nTheir quest will require fortitude, delving deep into the Mines of Moria to recover its treasures. Set in a procedurally generated Dwarven realm of Moria, no two adventures will be alike, and every expedition is traversable either solo or online with companions . Players can mine to craft greater gear and resources, but beware mining makes noise, and noise created in the quiet deep threatens to awaken the dangers below: where there’s clatter, there’s combat. Excavate the mysteries of three legendary mountains, extract precious metals, scrape to survive, and battle unspeakable forces to learn the secret of the Shadow that lurks within.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/the-lord-of-the-rings-return-to-moria-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/the-lord-of-the-rings-return-to-moria-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure game, Action game, Fighting game",
        "Developer": "Free Range Games",
        "Platform": "PC",
        "Game Size": "17 GB",
        "Released By": "RUNE",
        "Version": "v1.3.2.157411 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/47Uj4Q",
        "https://buzzheavier.com/eh8cyj1ztrf1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/the-lord-of-the-rings-return-to-moria-preinstalled-steamrip.jpg"
}