{
    "page_url": "https://steamrip.com/the-matchless-kungfu-free-download-1w/",
    "title": "The Matchless Kungfu",
    "description": "The Matchless KungFu is an open world RPG game based on a WuXia background. You can play any martial arts role you imagine in this wild world. Travel through the great wilderness, or be the leader of the group. The most important thing is, build your own story and live the experience You can build your mini worlds from start to make them meet your needs. Every land block has its unique environment, resource, creature or clans. You can also generate several bigger worlds which already have plenty of land masses for you to challenge\nA new kind of turn-based battle which allows you to release different moves, build your own skill deck to defeat(or not) the enemy in a stylish way The Meridian system allows you to run different kinds of Inner Kungfu, provides various buffs, and ways to deal with inner wounds, hidden diseases, illness and other debuffs. You will “run yourself” like those heroes does in Wuxia novels Tavern, spring, jail and sweet home. Build your structures freely, and make them function Lakeburg Legacies\nDefine your own character for each life! One life is definitely not enough to experience the world of The Matchless Kungfu NO PLOT! Just NPCs that are not simply puppets with well-written plots, but will act spontaneously according to their own personalities , status and goals Burn the house, pet the animals and let them help you, build your own clan, give orders to your fellows, throw the ones you hate into the jail and more We stick to our original intention and develop completely independently, creating only games that people find fun. The world of this game is still in its infancy, but we know it will continue to grow and become the cornerstone of all our future games. We will constantly strive for this and bring everyone a wonderful Wuxia world",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/the-matchless-kungfu-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/the-matchless-kungfu-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel(R) Core(TM) i5-8300H or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia Geforce GTX 1060",
        "DirectX": "Version 12",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "HuanMos Game",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/s78tsgp4u6ae"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/the-matchless-kungfu-preinstalled-steamrip.jpg"
}