{
    "page_url": "https://steamrip.com/the-outer-worlds-free-download-4b/",
    "title": "The Outer Worlds Free Download",
    "description": "Get The Outer Worlds PC game for free instantly and play pre-installed on SteamRiP\nThe Outer Worlds is an award-winning single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable. New to The Outer Worlds is the idea of flaws.\nA compelling hero is made by the flaws they carry with them. While playing The Outer Worlds, the game tracks your experience to find what you aren’t particularly good at. Keep getting attacked by Raptidons? Taking the Raptiphobia flaw gives you a debuff when confronting the vicious creatures, but rewards you with an additional character perk immediately. This optional approach to the game helps you build the character you want while exploring Halcyon. Mafia: Definitive Edition",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/the-outer-worlds-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/the-outer-worlds-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (SP1) 64bit",
        "Processor": "Intel Core i3-3225 or AMD Phenom II X6 1100T",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "Obsidian Entertainment",
        "Platform": "PC",
        "Game Size": "55.53 GB",
        "Repack By": "GOG",
        "Version": "v1.5.1.712 | Updated  + All 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/E78EDB9F72",
        "https://buzzheavier.com/zv0h8umg6hpm",
        "https://1fichier.com/?pvwyvg9bwxxg4icr4aob",
        "https://datanodes.to/25uogfddcewr/The-Outer-Worlds-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/the-outer-worlds-free-download-torrent-steamrip.jpg"
}