{
    "page_url": "https://steamrip.com/the-devourer-hunted-souls-free-download-1y/",
    "title": "The Devourer Hunted Souls",
    "description": "Experience a visually stunning multiplayer horror experience powered by Unreal Engine 5 featuring MetaHuman characters. Investigate the forest with up to 5 players. Use a variety of paranormal investigation gadgets to find paranormal entities or objects. The forest is not just a terrifying place, it has a story to tell. Find out what happened to the people and try to lift the curse that lies on the forest. Play as one of five unique investigators. Each one has their own skills and special ability. Jumanji: Wild Adventures\nBodycam styles add an extra degree of immersion to horror games. You can adjust the strength of your bodycam to suit your preferences. Experience thrilling chases and creepy jumpscares while you investigate the forest and try to find out how to avoid the creatures. Solve puzzles together or alone. Depending on the number of players, you might have to do different things.\nPuzzles dynamically adjust to the number of players, so you don’t have to worry about players leaving mid-game. When you die your soul is taken to another realm. Can you make it out before your fellow investigators die as well? Be prepared for unexpected events. The forest is more than a forest. Find multiple locations and see what they hide.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/the-devourer-hunted-souls-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/the-devourer-hunted-souls-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 Bit)",
        "Processor": "AMD Ryzen 3 1200 ／ Intel Core i5-7500",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon RX 470 with 4GB VRAM ／ NVIDIA GeForce GTX 960 with 4GB VRAM",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "14 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Early Access",
        "Developer": "ZTEK Studio",
        "Platform": "PC",
        "Game Size": "14.1 GB",
        "Cop-op By": "0xdeadc0de",
        "Version": "Build 31102023 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/Sk2OuC",
        "https://megadb.net/4u3ea38014dn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/the-devourer-hunted-souls-preinstalled-steamrip.jpg"
}