{
    "page_url": "https://steamrip.com/the-pale-beyond-free-download-1r/",
    "title": "The Pale Beyond Directly Download",
    "description": "Five years ago, The Viscount and its crew set sail through The Pale Passage in search of absolute magnetic South. The ship and its crew were tragically lost to the ice, never to be seen again. Her sister ship, The Temperance shall follow in her path, hoping to find answers where The Viscount failed. A polar exploration game set in an unforgiving frozen wasteland where you embark on a treacherous voyage across the ice and through the Pale Beyond. Chef Life: A Restaurant Simulator\nIt’s a stunning yet harsh landscape that can change at any moment. As the expedition unfolds and the Polar Winter approaches, every decision you make will have a meaningful impact on the story as you navigate your way across the ice. You didn’t ask to lead this expedition, but here you are. Stuck in the ice, Captain missing, miles from civilisation. Someone has to take charge. Manage your meagre resources , balance safety and morale, make the hard calls, and head in the only direction you can – through The Pale Beyond.\nKeeping the crew (and sled dogs) safe, fed, and warm during the expedition is imperative . Surviving the ice will matter little in the face of a mutiny. Every vote will count. So keep the crew on your side. Featuring original musical compositions, shanties and accordion tunes that will dynamically evolve alongside your journey.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/the-pale-beyond-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/the-pale-beyond-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "1.2GHz processor (Intel Core i5 and up)",
        "Memory": "4 GB RAM",
        "Graphics": "DX10, DX11, DX12 capable.",
        "DirectX": "Version 10",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation, Strategy",
        "Developer": "Bellular Studios",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "GOG",
        "Version": "v1.2.00.00 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2cc0guhd96fm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/the-pale-beyond-preinstalled-steamrip.jpg"
}