{
    "page_url": "https://steamrip.com/the-stone-of-madness-free-download/",
    "title": "The Stone of Madness",
    "description": "From the studio that brought you the Blasphemous series comes The Stone of Madness : a real-time tactical stealth game set in an 18th-century Spanish Monastery. Located in the Pyrenees, this time-worn Jesuit monastery is home to a madhouse and an inquisitorial prison. Five prisoners – plagued by cruel punishment, madness, and despair – pool their skills and resources to face their phobias , stave off insanity, uncover the mysteries of the Monastery, and find a way to escape. The Sims 2 Legacy Collection\nEscaping such a well-guarded monastery is no easy task, but Agnes, Leonora, Eduardo, Amelia, and Alfredo are determined to see it through. Alternate control of all five characters and use their unique upgradable skills to cast spells, assassinate targets, distract enemies, stun evil spirits , explore hard-to-reach areas, and more.\nExplore your surroundings and combine the characters’ abilities to find clues and tools scattered throughout the monastery. Be careful though, if you’re caught being somewhere you shouldn’t be, the guards will not be kind.\nEach playable character possesses a fully realized set of traumas and phobias . To effectively navigate the monastery, you must be mindful of each character’s mental health.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/the-stone-of-madness-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/the-stone-of-madness-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Strategy",
        "Developer": "The Game Kitchen",
        "Platform": "PC",
        "Game Size": "3.1 GB",
        "Released By": "SKIDROW emu",
        "Version": "Build 17062842 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dtolxzp0h5o2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/the-stone-of-madness-preinstalled-steamrip.jpg"
}