{
    "page_url": "https://steamrip.com/the-hundred-line-last-defense-academy-free-download/",
    "title": "The Hundred Line -Last Defense Academy-",
    "description": "Takumi Sumino is a totally average teenager living in the Tokyo Residential Complex, a place where every day is much like the last and nothing bad ever happens. All that changes when freakish monsters attack the town and start wreaking havoc. A strange creature calling himself Sirei appears and offers Takumi the power to protect those he holds dear… All he has to do is stab himself in the chest\nThe next thing he knows, Takumi is in Last Defense Academy, a school in the middle of nowhere surrounded by a wall of otherworldly flames. He and 14 other students have been drafted into the Special Defense Unit, a team tasked with keeping the school safe for the next 100 days. How much are they willing to sacrifice to take back their normal lives and save the world from the grotesque school invaders?\nExtreme Despair-Filled Endings Takumi’s choices will decide his future, but there’s no telling what kind of consequences these decisions might have…\nDefensive Battles When the invaders attack, it’s up to you to protect the school in SRPG battles. Use each student’s unique Specialist Skills to turn the tide of battle in your favor!\nFree Time & Exploration Spend time with your teammates to deepen your bonds, or explore the wilderness and ruins outside the school.\nYou can even use the items you find to craft gifts and get even closer to your allies!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/the-hundred-line-last-defense-academy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/the-hundred-line-last-defense-academy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10/11",
        "Processor": "Intel Core i3-7100 / AMD A10-7850K",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660 / AMD Radeon RX 560",
        "DirectX": "Version 11",
        "Storage": "32 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Simulation",
        "Developer": "Too Kyo Games, Media.Vision Inc.",
        "Platform": "PC",
        "Game Size": "27.9 GB",
        "Released By": "RUNE",
        "Version": "Build 18145851 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/EafKEG",
        "https://buzzheavier.com/e7z7ak9c2bft",
        "https://datanodes.to/fxaixyvv50bc/The-Hundred-Line-LDA-SteamRIP.com.rar",
        "https://1fichier.com/?ptn34fodt1m8i46kvm42"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/the-hundred-line-last-defense-academy-preinstalled-steamrip.jpg"
}