{
    "page_url": "https://steamrip.com/the-tales-of-bayun-free-download-1i/",
    "title": "The Tales of Bayun",
    "description": "The Tales of Bayun is a narrative adventure game with RPG elements in a grim Eastern European and Slavic fantasy setting. A unique world based on fairy tales and legends. Fascinating stories with unexpected plot twists. Authentic characters with their own secrets and motivation.\nTough moral choices with unpredictable consequences. Will you overcome all the twists of fate or go unsung with a knife in your back? Let’s figure this out. The Storona is a challenging place for a reason. Characters from myths and tales live side by side with ordinary people. Earnestness and kindness rub shoulders with betrayal and devilry. Elderand\nSomeone has a stroke of luck and in the shake of a hand turns into a noble person. Another one got kicked in the teeth and thrown to the wolves. Sorrow and happiness, wealth and poverty , good and evil everything is bound so tightly, that those bonds can’t be broken. But don’t be afraid. It’s easy to change someone’s fortune. Much harder to sort oneself out. Those who search for answers should visit Bayun the Cat.\nBut knowledge comes at a price. Bayun might even chuck you down in a single bite if something goes wrong. Two stories with different characters and plots but connected with each other. decide everyone’s fate but ask yourself: does the end justify the means?  All the choices are hard and complex . Should you kill or spare a little lizard? How will this decision affect the story? Should you swear an oath in favor of immediate benefits ? Finish the game and find all the answers",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/the-tales-of-bayun-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/the-tales-of-bayun-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7",
        "Processor": "Pentium 4 1.5 GHz / Athlon XP",
        "Memory": "1 GB RAM",
        "Graphics": "DirectX 9.0c compatible",
        "DirectX": "Version 9.0c",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "FlyinDogs",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "CODEX Emu",
        "Version": "Build 10566887 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ddxycate5nen"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/the-tales-of-bayun-preinstalled-steamrip.jpg"
}