{
    "page_url": "https://steamrip.com/the-void-rains-upon-her-heart-free-download-u1/",
    "title": "The Void Rains Upon Her Heart",
    "description": "An alien girl is trapped in a cave and surrounded by bizarre monsters. She cannot fight those creatures, but she can befriend them with the power of love! Every monster will react in its own violent way, but even the most powerful can be swayed by this ultimate power. Every defeated monster will give her gifts that make her love even stronger. Can her love grow strong enough to fend off The Void itself? Or will her heart be broken once again? Rune Factory 3\nThere are only boss battles in this game. Each stage will present you with a random set of bosses at various difficulty levels. You must choose which battles to face along the way to the Final Boss Each boss has its own range of difficulty levels with different possible attacks at each level. A level 1 boss can have a completely different set of attack patterns than a level 9 version of the same boss!\nAfter a monster has been defeated by love, it will thank you with a set of random gifts! Each gift will grant her heart an upgrade that lasts for the rest of the run. There are hundreds of gifts to find You may not have full control over the gifts you receive, but there are ways to influence the odds in your favor. The achievements in this game are not just for bragging rights. Earning them will unlock new features to the game New monsters, gifts, game modes, and even playable characters are waiting to be unlocked.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/the-void-rains-upon-her-heart-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/the-void-rains-upon-her-heart-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "64bit compatible Dual Core CPU",
        "Memory": "2 GB RAM",
        "Graphics": "DX11 compliant graphics card",
        "DirectX": "Version 11",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Early Access",
        "Developer": "Veyeral Games",
        "Platform": "PC",
        "Game Size": "4.2 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v7.27 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8wpvsvrt927h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/the-void-rains-upon-her-heart-preinstalled-steamrip.jpg"
}