{
    "page_url": "https://steamrip.com/the-cub-free-download-t1/",
    "title": "The Cub",
    "description": "Challenging platform parkour inspired by classic SEGA games of the 90s – The Jungle Book, Aladdin, Lion King – but with modern twists and ideas. Platform parkour through the remains of humanity. Outwit evolved wildlife and dangerous hybrid flora. Crack environmental puzzles that keep you guessing. And stay one step ahead of the wicked humans who pursuing you in a twisted apocalyptic safari hunt. Turnip Boy Robs a Bank\nAfter the Great Ecological Catastrophe, the ultrarich flee to Mars and leave the rest to perish. But among them a small child who developed immunity to the hostile planet remains. Decades pass and those on Mars venture back to Earth to do recon. When they spot a small human child, The Cub, they immediately try to capture it. This sets off a journey of escape, exploration and discovery through the urban ruins of humanity coupled with frantic cat and mouse chases .\nExplore the ruins of humanity after the Great Ecological Catastrophe wipes out most of the civilization and leaves our remains to be reclaimed by an evolved mother nature. The story and clues of how and why humanity fell are strewn throughout the world. Crumbling brutalist tower blocks and abandoned genetics labs. Depleted chemical mines and overgrown battlefields. Each level has a story to tell.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/the-cub-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/the-cub-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2.6 GHz Intel Quad Core",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GT 750M, 2 GB Memory",
        "Storage": "11 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Demagog Studio",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "RUNE",
        "Version": "Build 13206271 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jwn1rfdm6ch0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/the-cub-preinstalled-steamrip.jpg"
}