{
    "page_url": "https://steamrip.com/the-devil-within-satgat-free-download/",
    "title": "The Devil Within: Satgat",
    "description": "An enormous spiked tower of mysterious origins suddenly appears in the land of Joseon. The Pure White Oil that oozed from the Radiant Spire instantly revitalized the drying land of Joseon, providing the catalyst for dazzling technological advancements including Dimensional Gates. However, the Royal Court of Joseon yearned for more and continued their reckless research to further harness the power of the Radiant Spire. In the end, they made a dreadful mistake, summoning hellish demons to ravage this land ICBM: Escalation\nTRUST ONLY YOUR SWORDSMANSHIP In a world decimated by destruction, the majority of its inhabitants have long since been corrupted into demons and roam aimlessly. With just a sword in hand, assume the role of Kim Rip and cut down the numerous demons that threaten both you and the world at large. Employ the power of the demon that resides within you to break past your limits and utterly shatter your foes. One thing is for certain: your blade is needed to navigate this desolate world.\nFIGHT FIERCE BATTLES The fate of the world rests on your shoulders as you face off against hordes of malevolent demons. Make full use of your combat prowess , train your body, and execute strategies to eliminating the mighty demons that stand in your way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/the-devil-within-satgat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/the-devil-within-satgat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 64bit",
        "Processor": "2.4 GHz Quad Core",
        "Memory": "4 GB RAM",
        "Graphics": "2GB Ram, DirectX 11 compliant",
        "DirectX": "Version 11",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Newcore Games",
        "Platform": "PC",
        "Game Size": "7.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.4.82.46571 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cevbby9h413p"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/the-devil-within-satgat-preinstalled-steamrip.jpg"
}