{
    "page_url": "https://steamrip.com/the-walking-dead-saints-sinners-chapter-2-retribution-free-download-t1/",
    "title": "TWD Saints & Sinners Chapter 2 Retribution",
    "description": "Your tour through undead New Orleans continues in this new chapter to the Tourist’s story in The Walking Dead: Saints & Sinners. Hunted by the seemingly unstoppable Axeman and facing off against the Tower’s latest push for total dominance, discover what connects these new threats together before it’s too late. New faces, places, weapons and gear all await you on your journey to a final showdown for the city’s fate. Do you have what it takes to survive it all?\nAll the great features you loved in the original The Walking Dead: Saints & Sinners journey return here, refined and better than ever. Face off against countless walking dead with visceral physics based combat only possible in VR with an ever expanding collection of weapons, improvised or otherwise.\nTake on missions from different characters and factions all across NOLA, gaining resources and loot along the way. Survive your way and choose how you want to handle each new deadly encounter. Be a master of melee, an expert gunslinger, a stealthy shadow, and so much more. Be a Saint or Sinner . Choose to help or hinder who you like and define who you want your Tourist to be to the people of the city.\nBattle against a terrifying new foe more deadly than any walker or desperate survivor . Determined to chop you to bits, you’ll need to fight with all you got or run for your life when this towering pursuer comes for you. Will you be able to solve the mystery of who this post-apocalyptic serial slasher is and put a stop to their reign of terror, or will you be just another victim on the chopping block?\nThe city of New Orleans has much more for you to explore, both day and night Find new locales and meet new locals throughout the New Orleans French Quarter, with all the loot, quests, and all the walkers you could hope to slay Then when your morning journey is complete, prove your survival skills by jumping back on your skiff and exploring the city during the night More loot, more undead, and more opportunities for adventure on every single map.\nMeet an all new faction of survivors in New Orleans. Rejected by the Tower and refusing to join the brutal Reclaimed, these men and women caught in the middle of the chaos can offer you incredible rewards if you take on their daunting tasks and help them establish their claim in this deadly place. Or you could find a way to take their resources by force, if the path of the Sinner is more appealing to you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/the-walking-dead-saints-sinners-chapter-2-retribution-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/the-walking-dead-saints-sinners-chapter-2-retribution-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4590+ / AMD Ryzen 5 1400+",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA RTX 2060+",
        "Storage": "55 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Skydance Interactive",
        "Platform": "PC",
        "Game Size": "55 GB",
        "Released By": "RUNE",
        "Version": "Build 332399 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/dUpX0w",
        "https://buzzheavier.com/17nznht6gzfm",
        "https://datanodes.to/6glte0qsm9mg/TWD-Saints-+Sinners-Ch2-R-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/the-walking-dead-saints-sinners-chapter-2-retribution-preinstalled-steamrip.jpg"
}