{
    "page_url": "https://steamrip.com/the-rpg-free-download/",
    "title": "The RPG",
    "description": "Dungeons are held by the Island’s administration. There is a technical floor, the workers of which make sure that torches are lit, traps are working and monsters are healed after a raid. Gritty secrets are hidden on the lowest floors, which can give you a chance to completely flip the storyline. Static Dread: The Lighthouse\nYou’re stuck on an Adventure Island. There’s a local attraction – the Dungeon, where you can raid, explore, loot, gain experience and level up. Just buy an adventurer’s ticket, pass a turnstile , enter the elevator and choose the floor.\nThe workers of the Island’s administration make sure that traps are working, torches are lit and monsters are healed after raids. At the first glance, everything seems PERFECT for an aspiring adventurer, so why leave?\nTurns out that everything is not as it seems. There’s a dark, dirty secret that the Cool King is hiding. Which is not cool. Monsters are tired of the constant respawn loop, their lives are like a groundhog day.\nBut the main monster, the Glitchy Dragon , went out of control and broke the game’s rules in order to find the right person for his (in)genius plan. Maybe it’s you? It’s up to you to decide",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/the-rpg-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/the-rpg-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "10",
        "Processor": "Intel Core i3 or AMD Ryzen 3",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce RTX 1080 or Radeon RX 5700",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG",
        "Developer": "Dionysus Acroreites",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.004 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nslhz3912szy"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/the-rpg-preinstalled-steamrip.jpg"
}