{
    "page_url": "https://steamrip.com/the-last-hero-of-nostalgaia-free-download-k1/",
    "title": "The Last Hero of Nostalgaia Directly Download",
    "description": "The Last Hero of Nostalgaia is a satirical action-adventure, driven by a dark story, set in an incredibly rich and complex world. Nostalgaia, the world of videogames, is collapsing backwards into a mysterious pixelation, with every particle of fidelity bleeding away. Oblivion seemingly awaits even our most cherished gaming memories. But as the lighting dims and frames diminish , with the world on the brink of extinction, hope emerges to fight back.\nAs the most hideous pixelated hero to ever spawn in Nostalgaia, you must fight through an army of its mindless inhabitants, while being jeered by a cynical narrator who despises your very existence. Featuring hard but fair combat that fans of the genre will relish, along with *full character customization, unique battle armor and engaging narrative mechanics rich in lore, The Last Hero of Nostalgaia’s twisted and wicked tale is prepared to send you headfirst into almost certain death around its every vertex.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/the-last-hero-of-nostalgaia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/the-last-hero-of-nostalgaia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i3 Skylake | AMD FX-6000",
        "Memory": "8 GB RAM",
        "Graphics": "AMD Radeon R7 260X | NVIDIA GeForce GTX 750 Ti",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Over the Moon",
        "Platform": "PC",
        "Game Size": "4 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v3.3.6.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/f2hbwv1gf5rb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/the-last-hero-of-nostalgaia-preinstalled-steamrip.jpg"
}