{
    "page_url": "https://steamrip.com/the-outlast-trials-free-download-q1/",
    "title": "The Outlast Trials Directly Download",
    "description": "Red Barrels invites you to experience mind-numbing terror , this time with friends. Whether you go through the trials alone or in teams, if you survive long enough and complete the therapy, Murkoff will happily let you leave but will you be the same? Set in the era of the Cold War, human guinea pigs are involuntarily recruited by the good folks at the Murkoff Corporation to test advanced methods of brainwashing and mind control .\nIn a world of distrust, fear, and violence, your morals will be challenged, your endurance tested, and your sanity crushed. All in the name of progress, science , and profit. You’re all prisoners of Murkoff trapped inside their facility. You can choose to complete the trials by yourself or you can tackle them in a team of 2, 3, or 4 players. Coop is never forced when it comes to mandatory objectives but working together can be highly beneficial. Whatever the number of players in your party, it’s about surviving and getting out. Car For Sale Simulator 2023\nUltimately, your goal is to complete Murkoff’s therapy and earn the right to be released back into society. In order to do so, you must complete the Trials and the MK-Challenges. Trials are immersive story driven therapies that take a certain time to complete. Mk-Challenges are shorter therapies occurring in modified or redesigned section of an existing map.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/the-outlast-trials-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/the-outlast-trials-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-3770 or AMD Ryzen 5 1400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 Ti, 2 GB or Radeon R7 360, 2 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Early Access",
        "Developer": "Red Barrels",
        "Platform": "PC",
        "Game Size": "20.7 GB",
        "Released By": "0xdeadc0de",
        "Version": "Build 17052023 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://steamrip.com/the-outlast-trials-free-download-q1/"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/the-outlast-trials-preinstalled-steamrip.jpg"
}