{
    "page_url": "https://steamrip.com/the-battle-of-polytopia-free-download-3t/",
    "title": "The Battle of Polytopia Download",
    "description": "The Battle of Polytopia game for free instantly and play pre-installed on SteamRIP\nWelcome friends to The Battle of Polytopia, a unique turn-based strategy game involving strange lands and charismatic tribes, clever technologies, captivating magic where the ultimate goal is to rule the world. Obvs Scene: Enter the Square, the bizarre home planet of the Polytopians, a flat square-shaped landmass drifting in the space of an alternate dimension to ours.\nA relatively simple and curious folk that has a penchant for fighting, the Polytopians are 15 individual tribes spread out across the Square, each with their own characteristics, motivations , strengths and weaknesses. As a player, you will take on the role of the ruler of one of these tribes as you attempt to build your civilization in competition with the other tribes.\nWill you choose to be the leader of the Xin-Xi, reserved yet adventurous traditionalists that are wary of change or outsiders ? Perhaps the Hoodrick, who love archery, nature, mushrooms, and famed for their baked goods! Or maybe the Bardur, where the local tavern is their favorite place and Ullefurgh their drink choice, a delightful concoction of pine needles, hot water and rabbit fat.\nDeeeelicious But beware of the Vengir, purple rhino-pig riding warriors who, in between bouts of pillaging , like to sharpen their swords and vacation at the misty Kithkga Boneyards. You really don’t want to get on their bad side",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/the-battle-of-polytopia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/the-battle-of-polytopia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP SP2 or later",
        "Processor": "Dual Core 2.0 Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "128mb Video Memory",
        "DirectX": "Version 9.0",
        "Storage": "160 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Midjiwan AB",
        "Platform": "PC",
        "Game Size": "129 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 13642795 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8e6oj6fjk3h1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/the-battle-of-polytopia-preinstalled-steamrip.jpg"
}