{
    "page_url": "https://steamrip.com/the-planet-crafter-free-download-1g/",
    "title": "The Planet Crafter",
    "description": "You are sent on an hostile planet with one mission: Make it habitable for Humans . You’ll have to survive, collect resources, build your base and machines in order to heat the planet, create an atmosphere with enough oxygen and eventually geo- engineer an entire planet Gather minerals and resources to survive. Craft all the tools you’ll need in order to fulfill your mission. Imp of the Sun\nThe Planet Crafter is a colony-building simulator on a highly inhospitable planet with a focus on crafting. Your key task will be terraforming with the subsequent creation of a planet suitable for life. Of course, the first thing you need is to establish the extraction of important resources. After that, you will gradually equip the base and even be able to start producing oxygen. Your task is to find a way to heat the planet and create an atmosphere with enough oxygen. All this is not an easy task and requires the player to work long and hard. Explore old crashed ships and ruins and discover a planet full of mystery .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/the-planet-crafter-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/the-planet-crafter-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core2 Duo 2.4GHz or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "2GB VRAM",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure,",
        "Developer": "Miju Games",
        "Platform": "PC",
        "Game Size": "2.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.524 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3fultub4oz8b",
        "https://buzzheavier.com/155ar39rak78"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/the-planet-crafter-preinstalled-steamrip.jpg"
}