{
    "page_url": "https://steamrip.com/the-crush-house-free-download/",
    "title": "The Crush House",
    "description": "Jae has scored the gig of her dreams as the producer on 1999’s hottest reality TV show, The Crush House! The demands are high and the stakes higher as she must cast, film, and produce each season. Play as Jae as you capture the budding romances and explosive drama of each unique season in the iconic Malibu mansion. And no matter what, remember to satiate the demands of your rabid audience or risk cancellation.\nEach season is unique based on your chosen cast and the ever-changing audience demands. The longer you manage to keep your show on air, the more questions start to arise. What’s up with the cast’s dependence on Crush Juice? Where does the Success Slide even go? Clandestine conversations and some good old-fashioned snooping will help you uncover the truth.. providing the Network doesn’t get in your way. Pizza Hero\nCast For Each Season’s Run Choose between twelve eccentric personalities and find your four-person cast for each season’s run. Mix and match conflicting or complementary attractions and watch as tensions run and sparks fly.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/the-crush-house-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/the-crush-house-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64 Bit",
        "Processor": "Intel Core i5-4570T / AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 660 / Radeon HD 7850",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Simulation",
        "Developer": "Nerial",
        "Platform": "PC",
        "Game Size": "660 MB",
        "Released By": "TENOKE",
        "Version": "Build 15319714 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kt480i2w57ns"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/the-crush-house-preinstalled-steamrip.jpg"
}