{
    "page_url": "https://steamrip.com/the-kindeman-remedy-free-download-u1/",
    "title": "The Kindeman Remedy",
    "description": "Doctor Carl Kindeman has lost everything. Scorned and hated by the entire medical community for his “questionable” methods, he accepted a miserable job in an appalling prison . But that is all part of the plan. Here, he will restore his lost reputation. Here, no one will notice his experiments. Do with the inmates as you please. Let them die screaming on the electric chair, or save them only to use them for your research afterward.\nMelt their bones, burn their intestines , or simply maul them to death: you are a genius, and they are just your guinea pigs. It is a lot to handle, but you are not alone. Sister Anna is there for you. Always. And always ready to do just what the doctor ordered. Checkmate Showdown\nA dark story populated with complex characters adds depth to this gut-wrenching experience, raising disturbing moral questions and showing us the other side of evil: humanity . Multiple endings and unlockable events make the game replayable, leaving the destiny of Anna and Carl in the player’s hands. Whether they fail or triumph is up to you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/the-kindeman-remedy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/the-kindeman-remedy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 bit or higher",
        "Processor": "i3-4130 3,40 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce 750",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Simulation",
        "Developer": "Troglobytes Games",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "GOG",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2t8kyiu3hm6s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/the-kindeman-remedy-preinstalled-steamrip.jpg"
}