{
    "page_url": "https://steamrip.com/the-survivalists-free-download-o2/",
    "title": "The Survivalists Free Download Direct Link (v24.06.2021)",
    "description": "The island is alive Your newfound home will change with The Survivalists Steamrip cycles as you explore and uncover its secrets. Hunt animals for food and an array of mythical enemies, who aren’t necessarily pleased to see you. Get quests from a Mysterious Stranger or find them washed up on the shore. Prepare to trek into a procedurally generated wilderness, with a variety of biomes , for an adventure that’s unique to every player. Finding the perils of island life too much or just looking to share your building expertise with friends ?\nThe Survivalists has you covered Complete joint adventures , gain loot, trade and ultimately survive together and as you and up to three fellow castaways explore fantastical islands If you’re in need of a builder, a lumberjack or even a soldier, the monkeys on the island can be tamed and trained to help you with everyday tasks or back you up on raids to a fanatic camp! The Mimic System means a wide variety of functions can be performed by your cheeky new friends, with monkey management becoming key to surviving the island’s challenges.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/the-survivalists-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/the-survivalists-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 Duo E8400 | AMD Phenom II X2 550",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 11  Adapter with 1 GB VRAM"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie",
        "Developer": "Team17",
        "Platform": "PC",
        "Game Size": "2.57 GB",
        "Repack By": "CODEX",
        "Version": "v24.06.2021 (Expeditions Update) | Updated  + DLC: Monkey Business Pack",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yyw7mkmm0yd9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/the-survivalists-free-download-torrent-steamrip-1.jpg"
}