{
    "page_url": "https://steamrip.com/the-tribe-must-survive-free-download/",
    "title": "The Tribe Must Survive",
    "description": "Set in a dark Lovecraftian Stone Age, The Tribe Must Survive is a strategy survival game about growing and protecting your Tribe from lurking dangers. By day, Tribe members work to provide for their community. At night, the faint glow of the campfire becomes your sole defense against what lurks in the dark. Manage Wood, Food and other resources to keep the Tribe going. POOLS\nVarious global disasters will test your Tribe, as internal factions will challenge its cohesion from within. What kind of leader will you become to help the Tribe survive? Each Tribe member’s behavior is dynamic, influenced by their unique traits and needs. You can guide them through work assignments , resource management, and decisions on building and technology upgrades. Ease Fear levels, organize rituals, and make key choices to help your Tribe persevere against upcoming disasters.\nResources near the campfire are limited. Launch Journeys into the Outer World for vital supplies. Successful ventures allow you to establish new outposts and trade routes. Can you afford to take the risk of uncertain expeditions? Or will you do nothing and risk stagnation ? Navigate a number of decisions of risk vs reward, and short term vs long term benefits.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/the-tribe-must-survive-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/the-tribe-must-survive-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 8",
        "Processor": "2,4 GHz Dual-Core",
        "Memory": "4 GB RAM",
        "Graphics": "On-board graphic card",
        "Storage": "1,5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Walking Tree Games GmbH",
        "Platform": "PC",
        "Game Size": "725 MB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/o17a7er8s5c3"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/the-tribe-must-survive-preinstalled-steamrip-1.jpg"
}