{
    "page_url": "https://steamrip.com/the-kraken-wakes-free-download-y1/",
    "title": "The Kraken Wakes Directly Download",
    "description": "You’re on a fishing boat in the Pacific Ocean, on your first assignment as a reporter for the prestigious EBC News, when you witness a showstopper story: mysterious fireballs streaking across the sky and crashing down into the ocean’s depths. Immediately, you’re catapulted to journalistic stardom. But once the waters settle, it becomes clear the fireballs were only the beginning of something far more sinister a deadly threat now lurking in the deep The Kraken Wakes is the exclusive adaptation of John Wyndham’s epic 1950s sci-fi/horror novel.\nIt uses ground breaking conversational gameplay: you type or talk to the game’s characters in natural language, influencing their actions and emotions, and shaping the story as it unfolds. Devise eye-catching headlines, deliver knock-out press conference performances, and negotiate with governments in your mission to uncover the truth about the fireballs before it’s too late. Crab Champions\nThe Kraken Wakes has been created on Charisma .ai’s AI-powered conversation engine. You’ll speak to the game’s characters, and they’ll listen and respond to what you say. There are no multiple-choice options here: you’re free to say what you like, and find out how your words will impact the story. In The Kraken Wakes, NPCs (non-player characters) have personalities, memories, opinions and emotions.\nWhat you say and do will impact a character’s mood and their relationship with you. Befriend your colleagues or compete with them, impress your boss and win over your sources, all through what you choose to say We’ve worked with the audio team at dBs Pro to create an innovative soundtrack for The Kraken Wakes that adapts to the characters’ emotions. If something you say makes a character feel happy, the game audio will become more upbeat, and vice versa. Your words shape not only the story, but also the soundscape of the game.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/the-kraken-wakes-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/the-kraken-wakes-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1060",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Charisma Entertainment Limited",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "SKIDROW",
        "Version": "Build 10894431 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/uiau2r19rjes"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/the-kraken-wakes-preinstalled-steamrip.jpg"
}