{
    "page_url": "https://steamrip.com/the-highrise-free-download-t1/",
    "title": "The Highrise",
    "description": "THE HIGHRISE is a first-person survival game set in a high-rise building that has been sealed off by an alien monster invasion. Gather resources to make fighting weapons and survival tools. You must find and send a rescue signal at the end of your desperate survival. Against the Storm\nPrior to this apocalyptic era, facilities such as shopping malls, offices, and residences, which were previously crowded with people, were very familiar and friendly spaces to us. But, now, they will inspire fear in a sense of emptiness and heterogeneity that no one can find. Furthermore, it is a space created by inspiring real skyscrapers, and the space that is vacated or omitted has been minimized. Players will feel that every floor and facility in the building will have the appearance of a very real space.\nThe monster sniffers responsible for humanity’s extinction have a highly developed sense of hearing and smell. They can detect even the smallest movements, coughs, and gurgling sounds from your stomach . Moreover, if there is a loud noise, such as glass breaking or falling from a great height, the sniffers will rush to the player.\nTo avoid the monster sniffers, the last survivor stayed near the top floor of a building . The player used to be a linker, connecting these survivors to the food court in the building’s basement. Use this knowledge to your advantage. The lower floors you go, the more resources you have and the more efficient you are. However, as they get closer to the ground, the monsters become more powerful and the number of monsters increases. But you never know; you may find any hints to help you escape from the downstairs.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/the-highrise-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/the-highrise-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-7700 @ 3.60GHz",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1660",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "10+ GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "v3.6.5.7.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0q4bzo624aef"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/the-highrise-preinstalled-steamrip.jpg"
}