{
    "page_url": "https://steamrip.com/the-rogue-prince-of-persia-free-download/",
    "title": "The Rogue Prince of Persia",
    "description": "Experience a fast-paced, challenging but accessible roguelite as you master acrobatic moves and flow seamlessly between platforming and combat. Find new weapons, equip trinkets with special effects and upgrade them to make your own builds. Discover new characters, information and areas as you try to find a way to save Persia from a Hun invasion and become the hero you have always wanted to be. JustAxe\nLead the Prince in his fight against a Hun army corrupted by dark shamanic magic and find your place in the royal family as you explore a vibrant reinterpretation of Persia . Put the pieces of the puzzle together and discover new areas as you enter the fight again and again, meeting a cast of colorful characters through non-linear story progression.\nFlow seamlessly between platforming and combat, using your acrobatic moves to outmaneuver and outsmart your enemies. Use the iconic wall-run to open new routes of attack, avoid traps and explore hard to reach areas. Kick and dodge to manage groups of enemies when the odds are against you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/the-rogue-prince-of-persia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/the-rogue-prince-of-persia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core 2 DUO 2.4 GHz / AMD Athlon X2 2.7 GHz",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 650 Ti or AMD HD 7850",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Early Access",
        "Developer": "Evil Empire",
        "Platform": "PC",
        "Game Size": "753 MB",
        "Released By": "RUNE emu",
        "Version": "v0.15.3 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nhzrfj2zudug"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/the-rogue-prince-of-persia-preinstalled-steamrip.jpg"
}