{
    "page_url": "https://steamrip.com/the-last-case-of-benedict-fox-free-download-1o/",
    "title": "The Last Case of Benedict Fox Directly Download",
    "description": "Descend into a limbo of decaying memories as Benedict Fox, a self-proclaimed detective bound to his demon companion. Use that unholy bond to explore the minds of the recently deceased in search of clues as you uncover the mysteries of a massive, decrepit mansion the site to a young couple’s grisly murder , and the disappearance of their child. Ash of Gods: The Way\nImmerse yourself in a dark, intriguing world full of secret organizations, forbidden rituals, and cold-blooded crimes in an arcane adventure brought to life through a fascinating Burton-esque art style. Fight demons, explore the subconscious, and solve elaborate puzzles in a labyrinthian adventure inspired by Lovecraft’s nightmares, noir pulp fiction, and early 20th-century jazz music.\nUse your bond with the demon to explore the minds of the recently deceased in your last chance to get a “testimony”. Jump into surreal worlds where memories, emotions , and traumas take on a physical form. Uncover the secrets of an old mansion where a couple has been found slain, and their child has gone missing.\nGet drawn into a dark, yet intimate intrigue that will have you face the family’s demons – both figuratively and literally. Use your weapons, demon powers, and surroundings in creative combinations to overcome demons, monsters, and cultists – but remember that concentration and a tactical approach are your greatest assets.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/the-last-case-of-benedict-fox-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/the-last-case-of-benedict-fox-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-7400 3.00GHz or AMD Ryzen 5 1400 3.20GHz",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce 1050Ti or AMD equivalent",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Plot Twist",
        "Platform": "PC",
        "Game Size": "9.8 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 11106347 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/eqr7dq3lx19i"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/the-last-case-of-benedict-fox-preinstalled-steamrip.jpg"
}