{
    "page_url": "https://steamrip.com/the-quarry-free-download-1v/",
    "title": "The Quarry",
    "description": "As the sun sets on the last day of summer camp, the teenage counselors of Hackett’s Quarry throw a party to celebrate. No kids. No adults. No rules. Hunted by blood-drenched locals and something far more sinister, the teens’ party plans unravel into an unpredictable night of horror .\nFriendly banter and flirtations give way to life-or-death decisions, as relationships build or break under the strain of unimaginable choices. Play as each of the nine camp counselors in a thrilling cinematic tale, where every decision shapes your unique story from a tangled web of possibilities. Second Front\nAny character can be the star of the showor die before daylight comes. Will you dare to check what’s behind that trap door? Will you investigate the screams echoing from within the forest? Will you save your friends or desperately run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale. Cutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic ensemble cast of Hollywood talent, bring the horrors of Hackett’s Quarry to life in a pulse-pounding, cinematic thrill ride.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/the-quarry-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/the-quarry-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "AMD FX-8350 \\ Intel i5-3570",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 780 / Radeon RX 470",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Supermassive Games",
        "Platform": "PC",
        "Game Size": "46.2 GB",
        "Released By": "SKIDROW",
        "Version": "v1.07 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/16BE3A1C76",
        "https://1fichier.com/?1rjknuy7jxrkjkdf8sg0",
        "https://buzzheavier.com/8c6ol8yg7keu"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/the-quarry-preinstralled-steamrip.jpg"
}