{
    "page_url": "https://steamrip.com/the-universim-free-download-t1/",
    "title": "The Universim Directly Download",
    "description": "Jump straight into managing your own planets as you guide a civilization through the ages. Build the ultimate empire in The Universim, a new breed of God Game in development by Crytivo. Guide a fledgling civilization through the obstacles of life. From humble beginnings, watch as they evolve and advance throughout the ages under your wing. Influence their decisions and punish the unfaithful with a wide range of godly abilities. Interact with objects, create disasters, and launch clueless creatures into orbit .\nThis is your world, and nothing can stop you from having fun. Our goal is to bring back the features you know and love from classic god games and spice them up with fresh ideas, a modern physics engine, and stylized visuals developed by a few of our very own industry heroes. Meet the Nuggets, a fragile and whacky species that relies on your leadership to build, research, and advance. Dishonored\nHelp them, and they will soon begin writing their own history in the stars. Every Nugget is a unique individual with a distinct set of characteristics. Just like any other living creature, Nuggets must have access to a few vital resources in order to survive. This includes water to drink, food to eat, and recreational activities to increase their happiness and quality of life. Recreational activities may include blowing stuff up. You’ve been warned.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/the-universim-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/the-universim-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 bit or Higher",
        "Processor": "2.6 Ghz – 4 Cores Mid Range CPU or Higher",
        "Memory": "12 GB RAM",
        "Graphics": "GTX 780/880M/960/1050Ti/1660/2060 or AMD R9 290 / RX 570. Intel  not supported.",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Crytivo",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "RUNE",
        "Version": "v1.0.00.46017 [Build 13240912] | Full version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/gOFYmH"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/the-universim-preinstalled-steamrip.jpg"
}