{
    "page_url": "https://steamrip.com/the-darkest-tales-free-download-1q/",
    "title": "The Darkest Tales Directly Download",
    "description": "Join a stuffed bear named Teddy on this gloomy and sinister adventure to rescue his owner, Alicia, from the realm of dreams and distorted childhood fantasies. Who else will fight for the life of the girl, now grown-up, if not her long-forgotten and dusty toy? The Darkest Tales is a complex and compelling adventure, full of familiar characters and fairytale landscapes .\nOver the course of the journey , you’ll have to come face-to-face with the difficult  questions of life more than once. You’ll meet familiar characters from your childhood, but the reunion isn’t likely to be a happy one. The gingerbread men are out for blood, Sleeping Beauty seems to be a couple centuries behind on sleep, and the Little Mermaid looks more like a sea witch than an innocent child of the waves. Unusual Findings\nAs it turns out, our hero is a jack-of-all-trades. He crafted a bow and melee weapons from a pair of scissors and uses needles as powerful arrows and grappling hooks. All’s fair in a fight against the forces of evil. Each level takes place in a recognizable , but distorted fairytale world rife with combat, obstacles, and secrets. On this journey you will gain experience, master and branch out your skills , and overcome a multitude of challenges from fighting blood-thirsty rubber duckies to exploring the giants’ castle in the clouds.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/the-darkest-tales-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/the-darkest-tales-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Trinity Team",
        "Platform": "PC",
        "Game Size": "3.9 GB",
        "Released By": "GOG",
        "Version": "v1.04 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pzl40qnujhws"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/the-darkest-tales-preinstalled-steamrip.jpg"
}