{
    "page_url": "https://steamrip.com/the-king-of-fighters-xiii-global-match-free-download/",
    "title": "THE KING OF FIGHTERS XIII GLOBAL MATCH",
    "description": "This enhanced version comes with rollback netcode for exhilarating online play, as well as brand-new online lobbies that allow you to join/spectate matches with multiple players at once. KOF’s greatest-ever 2D graphics come to life as you face off against players online and around the world Choose a default team of 3 characters or make your own team by picking up 3 characters of your choice, and fight against teams until victory! Develop your own team strategy by choosing the best characters for you In this mode, you will experience a variety of background stories not touched upon in the game’s original Arcade Version. Flash Doll\nDiscover the truth about KOF’s “Ash Saga ” and its secrets through the eyes of the main character, Ash Crimson, and oth[/i]er characters who were not directly participating in the tournament. Your decisions and battle results may lead you to discovering new story elements; try out all the different options and every scene.\n“THE KING OF FIGHTERS XIII Steam Edition” now features vastly improved netcode that will provide you with the most comfortable online experience yet! The new netcode features improved communication speeds between you and your opponent , and also tailors your online experience according to your PC environment!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/the-king-of-fighters-xiii-global-match-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/the-king-of-fighters-xiii-global-match-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 770 2GB / AMD Radeon R9 280 3GB",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "SAFARI GAMES",
        "Platform": "PC",
        "Game Size": "2.1 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 16841918 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/95suxl3cfv2w"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/the-king-of-fighters-xiii-global-match-preinstalled-steamrip.jpg"
}