{
    "page_url": "https://steamrip.com/the-pioneers-surviving-desolation-free-download-v1/",
    "title": "The Pioneers Surviving Desolation",
    "description": "The Pioneers: Surviving Desolation is an innovative space simulation game where you play as a crew of specialists that must survive and explore the secrets of the desolated moon, Io. Planet Earth. 2084. It is time to put your mark on history. You are in charge of Io-1, the first inhabited space mission to Io.\nThe dangerous biomes here feature extreme temperatures, intense volcanic and seismic activity and magnetic storms. Retrieve your space station, prep your crew, manage your resources and get ready to face the most hostile environments in the solar system. Each game of The Pioneers offers players a unique challenge. Start with 3 different characters chosen randomly among a pool of 15. Adapt to their strengths and weaknesses and use everything they have at their disposal to survive. Resident Evil / biohazard HD REMASTER\nYour spaceship has wrecked on the surface of Io but you can still use the parts to your advantage . Produce Materials, build modules and engineering systems, craft wearable equipment and make food. Utilize the game’s advanced health system to monitor everyone carefully to keep them alive. Volcanos, seismic activity and magnetic storms will put nearly constant pressure on your crew. Monitor your beacons carefully to avoid dying because of a sulfur wind.\nYour life depends on it. Io may be dangerous but it is also home to beautiful, desolate landscapes. Board a rover or a flying drone and venture out to gather precious resources int he various biomes of Io. Explore the land and collect important scientific data to accomplish your mission.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/the-pioneers-surviving-desolation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/the-pioneers-surviving-desolation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 64-bit",
        "Processor": "Intel i5 4th generation / AMD FX-8300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 1050 / AMD RX 590",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation, Strategy, Early Access",
        "Developer": "Supercube",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "CODEX emu",
        "Version": "v0.35.04 (Build 10570489) | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3fgzwgosfs9o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/the-pioneers-surviving-desolation-preinstalled-steamrip.jpg"
}