{
    "page_url": "https://steamrip.com/the-lord-of-the-rings-gollum-free-download-1g/",
    "title": "The Lord of the Rings Gollum",
    "description": "He has survived dangers most wouldn’t dare talk about, driven by the singular desire to once again hold in his hands what was stolen from him. Although his desperate quest is a central part of the story crafted by J.R.R. Tolkien, it has never been told in detail. For the first time, follow the untold story of Gollum: an experience that stays incredibly faithful to the books. From his flight from Mordor, where he escaped the Mouth of Sauron and the demon-spider Shelob, to the dungeons of the Elvenking Thranduil, Legolas’ father, Gollum has had many adventures and encounters on his extraordinary journey. Star Trek: Resurgence\nAfter being corrupted by the Ring over hundreds of years, Gollum has developed exceptional agility and sharp wits. Use his unique skills to explore and infiltrate legendary locations and dizzying heights. Find your way past the Orcs as you climb the Dark Tower of Barad-dûr and give the Elves the slip in the mysterious Mirkwood .While Gollum is no fighter, he is more than capable of strangling a careless enemy when the opportunity presents itself or of finding a more creative and less risky way of getting out of trouble.\nGollum is one of the most fascinating characters in The Lord of the Rings universe. In 500 years he has experienced events that would destroy the toughest of beings. But Gollum doesn’t break; he bends, he adapts. Tortured by his split personality, he can be vicious and wicked as Gollum, yet friendly and cautious as Smeagol. It’s up to you to decide which of his personalities will triumph in the difficult moral choices that will dictate the future of your precarious alliances.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/the-lord-of-the-rings-gollum-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/the-lord-of-the-rings-gollum-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel Core i5-4690 / AMD Ryzen 3 1300X",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GTX 1060, 6GB / AMD Radeon R9 290X, 4GB",
        "DirectX": "Version 12",
        "Storage": "45 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Daedalic Entertainment",
        "Platform": "PC",
        "Game Size": "44 GB",
        "Released By": "FLT",
        "Version": "v1.2.52488 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/E52DC37134",
        "https://buzzheavier.com/sw2kskjb5vlu",
        "https://1fichier.com/?3azbpszibuhnnsu0zdts"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/the-lord-of-the-rings-gollum-preinstalled-steamrip.jpg"
}