{
    "page_url": "https://steamrip.com/the-callisto-protocol-free-download/",
    "title": "The Callisto Protocol",
    "description": "In this narrative-driven, third-person survival horror game set 300 years in the future, the player will take on the role of Jacob Lee – a victim of fate thrown into Black Iron Prison, a maximum-security penitentiary located on Jupiter’s moon, Callisto. When inmates begin to transform into monstrous creatures, the prison is thrown into chaos. To survive, Jacob must battle his way to safety to escape Black Iron Prison, while uncovering the dark and disturbing secrets buried beneath the surface of Callisto. Necrosmith 2\nUsing a unique blend of shooting and close-quarters combat , Jacob will need to adapt his tactics to combat the rapidly evolving creatures while scavenging to unlock new weapons, gear, and abilities to outrun the growing threat and escape the horrors of Jupiter’s Dead Moon .\nHORROR ENGINEERING The Callisto Protocol is a next-generation take on survival horror from the mind of Glen Schofield. Blending atmosphere, tension, and brutality with terrifying moments of helplessness and humanity, The Callisto Protocol immerses players in a pulse-pounding story where unspeakable horrors lurk around every corner.\nUNCOVER THE SECRETS OF THE UNITED JUPITER COMPANY Set on Jupiter’s dead moon Callisto in the year 2320, The Callisto Protocol casts players as Jacob Lee, an inmate in Black Iron Prison. When a mysterious outbreak throws the moon into chaos, Jacob must face his darkest fears to defeat the bloodthirsty creatures that stalk him as he unravels the dark mysteries at the heart of the powerful United Jupiter Company.\nMASTER BRUTAL, STRATEGIC COMBAT The Callisto Protocol challenges players to master a thrilling blend of hand-to-hand and ranged combat, including a unique gravity weapon once used by Black Iron guards to control the prison population. Players will be forced to get up close and personal with their grotesque opponents, hacking off limbs, blasting off legs, and getting creative with whatever is at their disposal to survive each life-or-death encounter.\nEXPERIENCE THE ISOLATION OF JUPITER’S DEAD MOON One of the most hostile, isolated environments in the universe, Callisto looms large over Jacob’s desperate struggle to survive. Players must not only contend with the horrors of Black Iron Prison, but also the centuries-old secrets that plague Jupiter’s long-dead moon, both above and below the surface.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/the-callisto-protocol-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/the-callisto-protocol-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "Intel® Core™ i5-8400 or AMD Ryzen™ 5 2600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 1060 or AMD Radeon™ RX 580",
        "DirectX": "Version 11",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Striking Distance Studios",
        "Platform": "PC",
        "Game Size": "76 GB",
        "Released By": "RUNE",
        "Version": "Build 13179062 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ybdn7l807975",
        "https://gofile.io/d/Ny88Gn",
        "https://1fichier.com/?kaljnu5o3hlo90vhl88p"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/the-callisto-protocol-preinstalled-steamrip.jpg"
}