{
    "page_url": "https://steamrip.com/the-elder-scrolls-iii-morrowind-goty-free-download-3t/",
    "title": "The Elder Scrolls III: Morrowind GOTY Free Download",
    "description": "The Elder Scrolls III: Morrowind GOTY Download PC Game In Direct Link for free on SteamRIP\nThe Elder Scrolls III: Morrowind Game of the Year Edition includes Morrowind plus all of the content from the Bloodmoon and Tribunal expansions. The original Mod Construction Set is not included in this package. An epic, open-ended single-player RPG , Morrowind allows you to create and play any kind of character imaginable.\nYou can choose to follow the main storyline and find the source of the evil blight that plagues the land, or set off on your own to explore strange locations and develop your character based on their actions throughout the game. Featuring stunning 3D graphics, open-ended gameplay, and an incredible level of detail and interactivity, Morrowind offers a gameplay experience like no other. CUCKOLD SIMULATOR: Life as a Beta Male Cuck\nIn Tribunal, you journey to the capital city of Morrowind, called Mournhold, to meet the other two god-kings of Morrowind, Almalexia and Sotha Sil. Your journey will lead you to the Clockwork City of Sotha Sil and massive, epic-sized dungeons, where strange and deadly creatures await you, including goblins, lich lords, and the mysterious Fabricants.\nBloodmoon takes you to the frozen Island of Solstheim where you’ll experience snow, blizzards, and new creatures, including frost trolls, ice minions, and wolves just to name a few. You’ll have a choice of stories to follow and have the opportunity to defend the colony, take control over how the colony is built up, and eliminate the werewolves. Or, you can decide to join the werewolves and become one of them, opening up a whole new style of gameplay.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/10/the-elder-scrolls-iii-morrowind-game-of-the-year-edition-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/10/the-elder-scrolls-iii-morrowind-game-of-the-year-edition-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows ME/98/XP/2000",
        "Processor": "500 MHz Intel Pentium III, Celeron, or AMD Athlon",
        "Memory": "256 MB",
        "Graphics": "32MB Direct3D Compatible video card with 32-bit color support and DirectX 8.1",
        "DirectX": "8.1",
        "Hard Drive": "1GB free hard disk space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "Bethesda Game Studios",
        "Platform": "PC",
        "Game Size": "1.29 GB",
        "Repack By": "GOG",
        "Version": "v1.6.0.1820 (Game of the Year Edition) | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d2woxgvfk7h9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/the-elder-scrolls-iii-morrowind-game-of-the-year-edition-free-download-preinstalled-steamrip.jpg"
}