{
    "page_url": "https://steamrip.com/the-slormancer-free-download/",
    "title": "The Slormancer",
    "description": "The Slormancer is an epic 2D Action-RPG Dungeon Crawling game following a band of outcasts on their fight against hordes of enemies led by The Slormancer! Play as a Mighty Knight, a Fierce Huntress or a Mischievous Mage, master hundreds of abilities and ancestral powers, gear up, fight for the reputation of your kind and prove your value to the realm. Experience fast-paced gameplay, loads of shiny loot, tons of collectibles, countless hours of content, and carefully crafted pixel art. The Sinking City Remastered\nYou were born with absolutely no skill whatsoever, and yet you find a way to be the last hope of the realm as the enigmatic Slormancer and his incompetent underling try to conquer the world once again. How great. But like your grandfather once told you: “You might not have the talent but you have the will.”\nUnlock and master more than 200 unique Abilities , Upgrades and Passives for every class. Each active Ability has its own skill tree, allowing you to create unique combinations.\nChoose your Legacy and inherit ancient powers among more than 150 Element-related Skills and Passives in the Ancestral Skill Tree. Master Fire and summon powerful elementals, use Ice to freeze your foes, convoke Thunder and create massive storms, embrace the power of Light or make one with Shadow, it’s up to you!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/the-slormancer-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/the-slormancer-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 and Above",
        "Processor": "Dual-Core 1.8 GHZ or equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "512 Mb",
        "DirectX": "Version 9.0",
        "Storage": "450 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Slormite Studios",
        "Platform": "PC",
        "Game Size": "312 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.01a | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/w9zkji4hrd7r"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/the-slormancer-preinstalled-steamrip.jpg"
}