{
    "page_url": "https://steamrip.com/the-holy-gosh-darn-free-download/",
    "title": "The Holy Gosh Darn Directly Download",
    "description": "In just six hours, Heaven will be obliterated—unless you can save it From the team behind Manual Samuel and Helheim Hassle, in The Holy Gosh Darn, you play as the angel Cassiel on a mission to stop the destruction of the afterlife. To do that, you’ll harness the power of time travel by using a mysterious magical clock given to you by Death. Jump freely between past and present as you uncover secrets across Heaven, Hell, Earth, and Helheim. Insights from the future could accelerate events in the past, so make every second count!\nThe Holy Gosh Darn is a riotous narrative adventure built around time-travel as a core mechanic . Wield your trusty time-traveling watch and hop any point during the day, uncovering the secrets of a mysterious artifact created by God himself. Along the way, you’ll meet a hilarious cast of characters and explore ever-shifting locations as you try to prevent an army of Phantoms from overrunning heaven. Which is really annoying, because you live there. Yugo: the non-game\nThis hilarious action-adventure blends time travel with Metroidvania progression, inventive puzzles and over-the-top set pieces. The Holy Gosh Darn will answer life’s most burning questions – like why time travel makes you barf, why why swearing is reserved for angels, and why it’s completely fine to rudely skip dialogue when you’re racing against the clock to save Heaven. The trilogy of The Holy Gosh Darn, Manual Samuel and Helheim Hassle might all be in the same universe , but they can be played in any order you like!",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/the-holy-gosh-darn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/the-holy-gosh-darn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11",
        "Processor": "4th Generation Intel or equivalent AMD",
        "Graphics": "card with DX10 (shader model 4.0) capabilities. 2GB VRAM.",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Perfectly Paranormal",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "Build 15849800 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/rrpwk5gg42ee"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/the-holy-gosh-darn-preinstalled-steamrip.jpg"
}