{
    "page_url": "https://steamrip.com/the-evil-within-2-free-download-10x/",
    "title": "The Evil Within 2 Free Download",
    "description": "The Evil Within 2 v1.05 Download PC Game In Direct Link for free on SteamRIP\nFrom mastermind Shinji Mikami, The Evil Within 2 is the latest evolution of survival horror. Detective Sebastian Castellanos has lost it all. But when given a chance to save his daughter, he must descend once more into the nightmarish world of STEM. Among the Sleep\nHorrifying threats emerge from every corner as the world twists and warps around him. Will Sebastian face adversity head on with weapons and traps, or sneak through the shadows to survive . As for the gameplay, it differs from the gameplay of the first part for literally everyone.\nFirstly, a huge open world awaits you, a city in which you will navigate at your discretion. Here you will have both huge buildings , which you will have to repeatedly wander in search of clues and clues, and the outskirts, crowded with private houses and cottages, each of which you can enter, and much more.\nSecondly, the range of weapons has been significantly expanded and the system for its customization and modification has been redesigned . And thirdly, now much more emphasis is placed on the horror element.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/the-evil-within-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/the-evil-within-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/8.1/10 (64-bit versions)",
        "Processor": "Intel Core i5-2400 / AMD FX-8320 or better",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 660 2GB / AMD HD 7970 3GB or better",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Tango Gameworks",
        "Platform": "PC",
        "Game Size": "26.4 GB",
        "Released By": "PLAZA",
        "Version": "v1.05 | Full  (Latest) + 1 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/u68inlyrl1nb",
        "https://datanodes.to/c5t7b8ansg2i/The-Evil-Within-2-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/the-evil-within-2-preinstalled-steamrip.jpg"
}