{
    "page_url": "https://steamrip.com/the-break-in-free-download-u1/",
    "title": "The Break-In",
    "description": "The Break-In is a 4 player online co-op burglary game about sneaking into houses, stores, and casino vaults to steal everything that isn’t bolted down. (And maybe some of the things which are bolted down)\nIf you can get it into your van, you can sell it for a profit. And you can use the money you make to purchase new thief equipment, to help you take on riskier heists Use a wide range of equipment to help you to extract the most valuable items from your target. Ladders and climbing picks can help you get in, then use attachable items like airbags and pistons to safely get your stolen items to your van. Other items like hammers, firecrackers, and wearable head lampshades can help you deal with any residents, either by knocking them out, distracting them, or hiding from them. The climbing freedom gives you full freedom to get around. Clamber up drainpipes, crawl through windows, or even stealthily make your way to the roof to scout the area Super Intern Story\nJust be careful to make sure that nobody is waiting for you on the other side of the window, it’s a long way down and you didn’t bring a trampoline. Or maybe you did, and this is all part of your plan? VR adds an extra layer of immersion , but you can play fully without it too! Cross-play allows you to play alongside VR players, even in non-VR modeThe keyboard and mouse controls are designed to give non VR players the same level of control as VR players",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/the-break-in-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/the-break-in-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64Bit",
        "Processor": "Intel Core i5-4590 / AMD FX 8350",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GTX 970",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Early Access",
        "Developer": "jorgen games Ltd, Oliver Josh",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Co-op By": "0xdeadc0de",
        "Version": "Build 11818528 | Early Access + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0bmqbkwnhxik"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/the-break-in-preinstalled-steamrip.jpg"
}