{
    "page_url": "https://steamrip.com/the-star-named-eos-free-download/",
    "title": "The Star Named EOS",
    "description": "The Star Named EOS is a story-rich puzzle adventure built around photography. Explore a beautiful hand-drawn world as you photograph some of the most precious yet fleeting moments in life. As you recreate photos from the past, you will slowly uncover the truth of a family mystery, and the love hidden within fragmented memories will eventually become clear. The Operator\nAs the young photographer Dei, the player sets off on a journey following in the footsteps of his absent mother. When he was a young child, Dei received letters from his mother on her travels. They always included a beautiful picture of places she visited. But one day, Dei notices something strange in the photos that threatens to overturn everything he’s ever believed in. With the guidance of his mother’s voice ringing from deep within his heart, he takes the first step on a journey to discover the truth of his mother’s absence. Experience a harmonious mixture of beautiful hand- drawn art and engaging puzzles as you embark on a journey of reminiscence.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/07/the-star-named-eos-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/07/the-star-named-eos-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7, 64-bit",
        "Processor": "Intel Core i3",
        "Memory": "4 GB RAM",
        "Graphics": "1GB RAM, OpenGL 3.3",
        "DirectX": "Version 9.0",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Silver Lining Studio",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "RUNE",
        "Version": "v1.0.0_03 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7d9dok64hb0v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/07/the-star-named-eos-preinstalled-steamrip.jpg"
}