{
    "page_url": "https://steamrip.com/the-invincible-free-download/",
    "title": "The Invincible",
    "description": "You are a highly qualified, sharp-witted astrobiologist named Yasna. Being entangled in a space race, you and your crew end up on the unexplored planet Regis III. The scientific journey quickly turns into a search mission for lost crewmates . Follow its trail, but be fully aware that every decision you make can bring you closer to danger.\nOn her journey , Yasna will face decisions that will shape the outcome of the story. Help her make difficult choices and witness one of 11 possible endings to the deeply philosophical story. KAISERPUNK\nDiscover fragments of what’s lost and report to your Astrogator . Let his voice aid you during hard times when humanity’s greatest threat emerges. The latter will force you to rethink mankind’s ambitions and biases. Go on – make decisions, follow the mystery but remember not to underestimate the brutal simplicity and brilliance of evolution.\nRobots, people Choose whether to interact with different creatures on Regis III or how to do it. Friend, companion? Enemy? You never suspected what these words might really mean before you got here.\nImmerse yourself in the atompunk atmosphere by using various tools, such as a telemeter or a tracker, and drive a vehicle through a stunning landscape . Experience realistic interactions with analogue technologies in a retro futuristic timeline.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/03/the-invincible-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/03/the-invincible-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64-bit)",
        "Processor": "AMD Ryzen 5 3600 (6 core with 3,5 Ghz) or Intel i5-10400F (6 core with 2,9 Ghz)",
        "Memory": "8 GB RAM",
        "Graphics": "AMD R7 260x (2GB) or Nvidia GTX 760 (2GB)",
        "DirectX": "Version 12",
        "Storage": "40 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Starward Industries",
        "Platform": "PC",
        "Game Size": "16.9 GB",
        "Released By": "RUNE emu",
        "Version": "v1.6 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/lceT6a",
        "https://buzzheavier.com/bmfuxfu5knuh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/03/the-invincible-preinstalled-steamrip.jpg"
}