{
    "page_url": "https://steamrip.com/the-precinct-free-download/",
    "title": "The Precinct",
    "description": "You are Officer Nick Cordell Jr. As a rookie beat cop fresh out of the Academy , you’re on the front line of defence for Averno’s citizens. Dive into a world of thrilling car chases, sandbox crimes, and a healthy dose of 1980s noir as you protect the populace and solve the mystery of your father’s murder in the line of duty.\nTake to the Streets\nA love letter to classic cop movies, The Precinct combines police sim with action sandbox spectacle. Patrol the streets and respond to callouts to fight criminals petty and powerful. Choose your own tactics in thrilling chases and shootouts. Feel the shifting power struggles of Averno’s gangs in a living city full of sandbox crimes, from parking infractions to bank heists, street racing to drug deals. Deck of Haunts\nHot Pursuit\nSpeed through the city in intense car and helicopter chases and pursue your mark through twisting alleyways before bringing them to justice. There’s no need to be a lone wolf: You’ve got Averno’s Finest backing you up, with an in-depth support system that allows you to call in squad cars, roadblocks , spike strips, and more.\nA Sleepless City\nExplore the ever-shifting criminal underbelly of Averno City. Deal with yuppies, bums, street vendors and furious taxi drivers from the Projects to the Financial District. Chase perps through neon-lit alleys, rain-soaked streets, and grand, decaying parklands , all subject to a day/night cycle and dynamic weather. This is the 1980s East Coast in all its neon-noir glory.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/the-precinct-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/the-precinct-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5-7600K / AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660Ti / AMD Radeon R7 370",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation",
        "Developer": "Fallen Tree Games Ltd",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Released By": "RUNE emu",
        "Version": "v1.8.1.19077 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/zqCpce",
        "https://datanodes.to/w68iqrzpacnb",
        "https://buzzheavier.com/vslpvv5ds7xp",
        "https://megadb.net/mivw16utewtr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/the-precinct-preinstalled-steamrip.jpg"
}