{
    "page_url": "https://steamrip.com/the-alters-free-download/",
    "title": "The Alters",
    "description": "The Alters is an ambitious sci-fi survival game with a unique twist. You play as Jan Dolski, the lone survivor of a crash-landed expedition on a hostile planet. To survive, you must form a new crew for your mobile base.\nUsing a substance called Rapidium, you create alternative versions of Jan – THE ALTERS – each one shaped by a different crucial decision from the protagonist’s past.\nAs you navigate through survival and moral dilemmas, you will explore a branching narrative filled with captivating character dynamics and challenging decisions.\nAt the same time, you’re challenged to reflect on one of life’s fundamental questions – do we shape our destiny or does it shape us? This makes your bid for survival a deeply personal experience.\nUse the quantum computer onboard your base to simulate alternate outcomes of your past choices and uncover Jan’s different life paths. Each Alter brought to life thanks to the remarkable properties of Rapidium comes with unique skills and emotional depths. These variations offer both opportunities and challenges as you navigate personal struggles and manage the fragile dynamics of your crew.\nTo operate the mobile base, you’ll need to explore the planet’s surface in search of precious resources, like metals and organics. Yet venturing outside the safe haven comes with the risk of exposing you and your Alters to various deadly anomalies as well as the ever-present radiation of the sun. That’s why you must pay attention to the in-game day and night cycle and plan your daily activities wisely! Danganronpa V3: Killing Harmony\nNavigate a narrative rich with moral dilemmas and branching paths. Your choices will shape Jan’s relations with his Alters which then will impact their journey and lead you to multiple outcomes and endings.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/06/the-alters-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/06/the-alters-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later, 64-bit",
        "Processor": "AMD Ryzen 5 1600, Intel Core i7-6700",
        "Memory": "16 GB RAM",
        "Graphics": "AMD Radeon RX 570, nVidia GeForce GTX 1060, Intel Arc A570. 6+ GB video memory",
        "DirectX": "Version 12",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "11 bit studios",
        "Platform": "PC",
        "Game Size": "47.5 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0.1.46 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/BNlJ8L",
        "https://buzzheavier.com/0myp6lhtckao",
        "https://1fichier.com/?h4ouz7ve2hicclncqgao"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/the-alters-preinstalled-steamrip.jpg"
}