{
    "page_url": "https://steamrip.com/the-mobius-machine-free-download/",
    "title": "The Mobius Machine",
    "description": "Carve your path through a vast alien world filled with brutal lifeforms and malfunctioning machines. Explore beyond the Crash Site, through the desolate Spaceship Graveyard, into the depths of the Mining Grounds, and up to the Floating Forests. Taxi Life: A City Driving Simulator\nFight Combat an array of deadly adversaries: the local fauna, infected colonists , and abandoned machines that once worked in the facilities. Defeat more than 80 distinct enemies, including the epic bosses that guard the most precious gear. Shoot Anywhere Designed for both Gamepad or Mouse and Keyboard controls. Run and jump around while shooting in any direction using a tight control system. You can have 2 weapons equipped at any time, and use them as you need.\nEvolve Acquire the gear that will make you more mobile and unlock new areas. Climb walls, dash, dive underwater, glide through the air and evolve the way you interact with the world . Upgrade your arsenalCollect blueprints and craft new weapons and upgrades in order to fight more effectively. Each new item you acquire will give you more options and increase your chances of survival .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/the-mobius-machine-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/the-mobius-machine-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or above (64 bit)",
        "Memory": "8 GB RAM",
        "Graphics": "DirectX 11 compatible with support for Shader Model 5.0 and 1GB VRAM",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Madruga Works",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "Ty CHRONOS",
        "Version": "Build 15742896 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nas7lcpd0al0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/the-mobius-machine-preinstalled-steamrip.jpg"
}