{
    "page_url": "https://steamrip.com/the-mansion-of-the-marcabre-free-download/",
    "title": "The Mansion of The Marcabre",
    "description": "Featuring an ancient evil and occult conspiracy, Cthlulu and his macabre creatures have their grip on the estate in 1920’s Florida Wetlands. You go in freely, but will you leave the same way?\nThe mansion is entombed by the creature on the threshold . Only by defeating an old evil will it release it’s grasp and allow you to escape, but perhaps without your sanity intact Featuring two characters to choose from with an intricately written story, platform elements, puzzle solving and classic 90’s survival horror tropes, explore the mansion of the Crowley Family and find and defeat the underbelly of true evil. Star Trucker\nI am a kept man, I’m also quite a superstitious man with an obsessive personality. My family doctor diagnosed me with a large case of obsessive compulsive disorder along with borderline schizophrenia, but I always shrugged these so called delusions off with the reality of experience.\nFor the past ten years, my obsession with the paranormal had caused my freelance journalism career to change to full time ghost hunter. Upon finishing smoking my favourite brand of cigars, Sterling, of course, I dress in my smartest suit. I received a call this morning, a tip off it seems – A estate known as Crowley Manor had some ‘hauntings’ as of late, and it seems the owner vanished without a trace. I am to get a cab out to the manor this evening and investigate this for myself. Could I prove to everyone and myself that this is all not folly?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/09/the-mansion-of-the-marcabre-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/09/the-mansion-of-the-marcabre-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or higher",
        "Processor": "AMD RYZEN 5 2.9GHz or higher",
        "Memory": "8 GB RAM",
        "Graphics": "Intel UHD 620 / Nvidia GeForce RTX 4060 / AMD Radeon RX 7600",
        "DirectX": "Version 12",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Spacefarer R&D Ltd., Equipe Spacefarer France",
        "Platform": "PC",
        "Game Size": "591 MB",
        "Released By": "GOG",
        "Version": "v1.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hjszb7ytbga8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/09/the-mansion-of-the-marcabre-preinstalled-steamrip.jpg"
}