{
    "page_url": "https://steamrip.com/the-unliving-free-download-1t/",
    "title": "The Unliving Directly Download",
    "description": "The realm of the living has been corrupted to its core and a storm is coming to change the world order. This storm is you, a mighty Necromancer, a sorcerer who denies death and leads the legions of the dead. Clerics and lords hope to hide behind high walls, but there’s no stronghold to cover them from your wrath.\nSmite hundreds of those standing in your way and turn them into your tools on the way to a greater purpose. The Unliving is a dynamic rogue-lite action RPG with strategic elements. Raise the undead, use numerous spells and explore a mystical world, all realised with darkly extravagant pixel-art.\nEach fallen foe can be resurrected and added to your army to create unlimited legions of the dead. These re-animated creatures have their own unique abilities, such as the undead Priest whose blessings in life, will now curse your enemies in death. Meet colorful characters Soulstone Survivors\nQuestion members of your own necromantic cult, force answers out of your enemies and even dialogue your own phylacterium – to gather the lost memories of the Necromancer piece by piece and reveal the nature of his immortality. Who knows, may be you also find out the grim truth about the supreme hierarchies of the Church",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/the-unliving-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/the-unliving-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i3-2100 or AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTS 450, 1 GB or AMD Radeon HD 5750, 1 GB",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Early Access",
        "Developer": "RocketBrush Studio",
        "Platform": "PC",
        "Game Size": "457 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.60 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/aejd7gzglqjr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/the-unliving-preinstalled-steamrip.jpg"
}