{
    "page_url": "https://steamrip.com/the-midnight-walk-free-download/",
    "title": "The Midnight Walk",
    "description": "Embark upon The Midnight Walk in this reverent dark fantasy adventure built in clay, from the minds behind Lost in Random and Fe. Gods vs Horrors\nBecome The Burnt One, befriend a lost lantern creature named Potboy, and use his flame to light your way through a conflicting world of wonder and suspense. Survive and outsmart the many monsters eager to devour your little friend’s flame as you experience five tales of fire and darkness , featuring an incredible cast of odd characters. Marvel at every disturbing detail in a landscape painstakingly handcrafted with real life clay and animated in a stop motion style. Fully playable in both flatscreen and with a VR headset.\nAN UNFORGETTABLE JOURNEY OF LIGHT AND DARK\nJourney with Potboy along the twisted trail of The Midnight Walk. Work with your companion to outsmart monsters, using his flame to distract while you hide from and evade the many threats of The Dark Itself. Encounter new friends and experience awe-inspiring sights as you navigate a path fraught with both peril and affirmation.\nA GRIM AND BEAUTIFUL HANDCRAFTED WORLD\nEverything you see in The Midnight Walk, from the drooling snarl of monsters to the bristling tree tops that line the journey was first sculpted in clay and then 3D scanned to a meticulous level of detail. The result is a uniquely layered fantasy world with an artistic imprint, all realized in breathtaking stop motion. Grab a gamepad and jump into the unknown, or step into the endless night in VR",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/the-midnight-walk-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/the-midnight-walk-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i7 6700k",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1070",
        "Storage": "18 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "MoonHood",
        "Platform": "PC",
        "Game Size": "17 GB",
        "Released By": "TENOKE",
        "Version": "Build 18383361 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/WGwBWj",
        "https://buzzheavier.com/qyt5fhlahz02"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/the-midnight-walk-preinstalled-steamrip.jpg"
}