{
    "page_url": "https://steamrip.com/the-backrooms-lost-tape-free-download-g1/",
    "title": "The Backrooms: Lost Tape Directly Download",
    "description": "Embark on a journey through the mysterious and unsettling world of the Backrooms in this immersive walking simulator. Delve into a series of Liminal Spaces and Backrooms Levels, each separated by Tapes (Chapters) that reveal new mysteries and challenges. In the first Tape. PARANORMASIGHT\nThe Tape of Josh,” you play as an unsuspecting cinema usher who falls into the Backrooms and must unravel the secrets of the strange yellow rooms in order to escape. But beware, as you explore, you’ll encounter malevolent entities that stand in your way.\nWith each tape (DLC Chapters) you progress, new challenges and secrets will be revealed. Are you brave enough to uncover the truth behind this twisted reality? Get ready for a contemplative experience like no other! This game will feature multiple tapes, each with its own tantalizing story and unique characters that will have you on the edge of your seat.\nImmerse yourself in uncharted territories, unraveling mysteries and facing spine-chilling entities that will keep you guessing at every turn. With each new tape comes a world of possibilities to explore and secrets to uncover. Are you ready to explore the most faithful representation of backrooms ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/the-backrooms-lost-tape-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/the-backrooms-lost-tape-screenshots-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i3 8100 or Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1050 2GB or RX 560 2GB",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Cortez Productions",
        "Platform": "PC",
        "Game Size": "7.7 GB",
        "Released By": "TENOKE emu",
        "Version": "v20230224 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/pp4in8cyt7yz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/the-backrooms-lost-tape-preinstalled-steamrip.jpg"
}