{
    "page_url": "https://steamrip.com/the-last-worker-free-download-u1/",
    "title": "The Last Worker",
    "description": "The Last Worker is an immersive narrative adventure centered around a lone worker’s last stand in an increasingly automated world, with a unique blend of work simulation and stealth strategic gameplay.\nThe game is set in a lonely, oppressive but strangely beautiful environment, with characters designed by comics legend Mick McMahon. DREDGE\nKurt works for the world’s largest retailer and is forced to choose between capitalism or activism. Having dedicated his life to work, Kurt’s loyalty is put to the test when a group of activists ask him to dismantle Jüngle from the inside.\nAboard his corporate issued flying JünglePod and armed with his multi-purpose JüngleGun, Kurt dispatches countless products from a fulfilment centre the size of the sunken city of Manhattan .\nKurt (voiced by Ólafur Darri Ólafsson) has dedicated his life to Jüngle, with only his co-bot, Skew (Jason Isaacs) to keep him company. But when S.P.E.A.R., a group of activists, asks Kurt to help dismantle Jüngle from the inside, Kurt is forced to discover his employer’s dark underbelly.\nThe Last Worker delivers an emotional, thought provoking and inspiring story with rich characters performed by an all-star cast starring, Jason Isaacs, Ólafur Darri Ólafsson, Clare-Hope Ashitey, David Hewlett, Zelda Williams and Tommie Earl Jenkins.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/the-last-worker-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/the-last-worker-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 / 11",
        "Processor": "Intel Core i5-2300 | AMD FX-4350",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 570, 1 GB | AMD Radeon HD 7850, 2 GB",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Oiffy, Wolf & Wood Interactive Ltd",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "GOG",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5qutb1rv1ihh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/the-last-worker-preinstalled-steamrip.jpg"
}