{
    "page_url": "https://steamrip.com/the-last-flame-free-download-t1/",
    "title": "The Last Flame",
    "description": "The Last Flame is a roguelike auto-battler which focuses on build creation, strategy and decision making. Every run, you will create amazing builds to progress through the ascension difficulties or attempt to beat your high score in the endless mode! Recruit special heroes, fight deadly encounters , loot and craft powerful gear, discover and create unique synergetic builds First Cut: Samurai Duel\nThe Last Flame offers an incredible amount of build diversity. With over 55 heroes, 250 items, 120 relics and 55 origins, every run will be unique and challenging! Hero and team building have been designed with flexibility and freedom at their core which allows you to discover and create unique synergetic builds every single run\nIn between the automated combats, you will have to cleverly guide your heroes through the adventure by making the smart decisions! Manage your resources, choose the optimal path in the map, make powerful builds, and strategically position and plan the combat phase",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/the-last-flame-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/the-last-flame-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i3-4160 or AMD FX-4350",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 960 or AMD Radeon R9 380",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "Hotloop",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0.3 Hotfix 2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ej0k7e1d9p17"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/the-last-flame-preinstalled-steamrip.jpg"
}