{
    "page_url": "https://steamrip.com/the-caligula-effect-2-free-download-v1/",
    "title": "The Caligula Effect 2",
    "description": "In the world of Redo, Go-Home Club members are in their “redone” forms manifestations of past regrets that have been undone. Each member is trapped in a situation dreadful enough to cause them to turn away from reality. What happened to them? And why are they trying so hard to return to that painful reality? These are only some of the mysteries the player must unravel. Capcom Fighting Collection\nSo tread carefully and choose actions that will leave no regrets. Chain combos in the battle system while predicting the future The battled system is turn-based. Once an action is selected, you can peer into the future and see what it looks like successfully executed. Use this ability wisely to coordinate attacks with allies or cover them during bad situations.\nWhen certain conditions are met in battle, a χ-Jack is activated , in which χ’s singing voice hijacks the battlefield and powers up the Go-Home Club. The effects differ according to the song chosen. This move is powerful enough to completely turn the tide of battle. Use WIRE’s group chat function to discuss club goals or ask allies questions on private chat. You may be surprised by what you can learn from their replies.​\nSome special questions can only be obtained with high affinity or via quests . Even residents of the ideal world Redo have minor gripes and problems to contend with.​ Perhaps these stem from their true selves or personal relationships in reality Complete quests from townsfolk to gather more information and uncover hidden truths .​",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/06/the-caligula-effect-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/06/the-caligula-effect-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows10 64bit",
        "Processor": "Intel(R) Core(TM) 2 Duo E8400 @ 3.00GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 or AMD Radeon HD 7750",
        "DirectX": "Version 11",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "RPG",
        "Developer": "historia Inc., FURYU Corporation",
        "Platform": "PC",
        "Game Size": "1.9 GB",
        "Released By": "DARKSiDERS",
        "Version": "Build 8966446 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qi298kn201ga"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/06/the-caligula-effect-2-preinstalled-steamrip.jpg"
}