{
    "page_url": "https://steamrip.com/the-coin-game-free-download-1w/",
    "title": "The Coin Game",
    "description": "The Coin Game is a fun collection of ticket arcades that are all run by goofy robots on an little island full of things to do. The arcades include highly detailed machines with realistic physics that are inspired by modern arcade machines. There are ticket redemption areas to exchange your counted tickets for all kinds of fun prizes .\nLarry’s Arcade has an in-house animatronic band called Teddy and the Ticket Eaters that would love to play you some tunes while you enjoy the arcade. The most recent addition to Islandville island, UFO Arcade features modern space inspired arcade machines, Lazer Tag and an Indoor Go Kart Race Track.\nMake sure to watch out for the minions , they really love Teddy and his band and they also are pretty good at Lazer Tag. Run out of money? That’s ok. You can work odd jobs around the island to get back on your feet. Got extra prizes? The island has a Pawn Shop that will buy your used prizes for cash so you can go blow it back at the arcade. Tyrant’s Blessing\nThe Coin Game also features a full fledged Traveling Carnival with over 20 classic games, rides and machines to choose from. The carnival also brings new prizes to win, hoard or sell for cash at Barrys pawn shop. The rides are all interactive and are overpriced just like in real life so you better be winning, working or begging Uncle Phil for more spending cash if you want to enjoy them. (Birthday mode is unlimited money for all you lazies out there that just want to live off of Uncle Phils wallet and have a good time. So dont worry he has you covered). But dont get comfy as Survivor Mode is still being developed.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/the-coin-game-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/the-coin-game-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / Windows 8.1 / Windows 10 64-bit (latest Service Pack)",
        "Processor": "Intel Core i3-3225",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, Simulation, Early Access",
        "Developer": "devotid",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "ALI213 (cs.rin.ru)",
        "Version": "Build 7920670 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tp92xmhwpgpd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/the-coin-game-preinstalled-steamrip.jpg"
}