{
    "page_url": "https://steamrip.com/the-immortal-mayor-free-download/",
    "title": "The Immortal Mayor",
    "description": "The Immortal Mayor is a construction & management sim game where you play as a local deity that watches over the land. Befriend other gods and use magic to help your residents build the town, thereby earning the offerings of your people and growing your town. TowerClimb\nAs the local land god, your primary task is to watch over and guide your people as you build the town from scratch. Collect natural resources , build production and living facilities, and produce essential supplies to bring peace and prosperity to your people.\nThe residents have their own preferences and emotions . They are happy when they have nice houses to live in, and will become distressed if they don’t have any entertainment. Try to observe them and build housing, arrange jobs, and provide education and necessary leisure and entertainment. Make their wishes come true to earn their worship and trust.\nAs a local land god, you have access to some basic magic like changing the location of things in town. If you want to use stronger magic, you’ll have to use the offerings of your people to meet other gods that can lend you their power and help develop your town. For example, the Moon Elder can greatly increase your people’s willingness to get married and have kids, while the Weather Master can help you control the weather.\nYou can build and upgrade dozens of different buildings to provide your people with a better living and working environment. In addition, this game also provides hundreds of unique decorations , each with its own style. As you decorate your town, you’ll find that some decorations have unique combination effects. Try out different combinations to trigger effects that will make your town more beautiful and prosperous .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/the-immortal-mayor-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/the-immortal-mayor-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "AMD or Intel, 3 GHz (AMD A10 7850K, Intel i3-2000)",
        "Memory": "8 GB RAM",
        "Graphics": "AMD/NVIDIA dedicated GPU, 4GB dedicated VRAM (Radeon R9 280, Geforce GTX 960)",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Star Chess Studio",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "TENOKE",
        "Version": "v1.1.08 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/76e22w3lhvfi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/the-immortal-mayor-preinstalled-steamrip.jpg"
}