{
    "page_url": "https://steamrip.com/the-stanley-parable-ultra-deluxe-free-download-1i/",
    "title": "The Stanley Parable Ultra Deluxe",
    "description": "The Stanley Parable: Ultra Deluxe is a first person exploration game. It is an expanded re-imagining of the critically acclaimed, award winning indie game The Stanley Parable from 2013. When a simple-minded individual named Stanley discovers that the co-workers in his office have mysteriously vanished, he sets off to find answers. You will play as Stanley, and you will not play as Stanley.\nYou will make a choice, and you will have your choices taken from you. The game will end, the game will never end. Contradiction follows contradiction, the rules of how games should work are broken, then broken again. You are not here to win. The Stanley Parable is a game that plays you. Everything that was in the original Stanley Parable is here, preserved just like it was back in 2013.\nBut The Stanley Parable: Ultra Deluxe also dramatically expands the world of the original game with new content, new choices, and new secrets to uncover. The labyrinth has just gotten bigger. In addition, the game has been visually upgraded to reflect modern technology while faithfully preserving the tone of the original game.\nAccessibility features have also been added to the game, including localization of in-world text, colorblind options, and content warnings. And just as before, the impeccable voicework of Kevan Brighting will accompany you every step of the way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/the-stanley-parable-ultra-deluxe-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/the-stanley-parable-ultra-deluxe-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or higher 64bit",
        "Processor": "Intel Core i3 2.00 GHz or AMD equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce 450 or higher with 1GB Memory",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Sengi Games",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Released By": "CODEX emu",
        "Version": "v1.08 (Build 11106082 ) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/o8fkxr2jbf67"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/the-stanley-parable-ultra-deluxe-preinstalled-steamrip.jpg"
}