{
    "page_url": "https://steamrip.com/the-outbound-ghost-free-download-1m/",
    "title": "The Outbound Ghost Directly Download",
    "description": "The Outbound Ghost is an adventure RPG about helping ghosts ascend to the afterlife. The town of Outbound is, quite literally, a ghost town – a home to troubled spooks with unresolved earthly issues, condemning them to an eternity haunting their old *ahem* haunts. Battle the past, gain new abilities, solve puzzles , and uncover the mysteries of Outbound to help its unliving residents find peace, freeing them from the shackles of their ghostly limbo. Electrician Simulator\nColourful characters: Meet a lovable cast of spooks along the way, each with their own story to unravel Combat encounters: Unlock figments of your past personality, such as Regret, Comradery, and Jealousy and use them as party members in turn-based battles Aspects System: Craft materials earned by winning combat encounters into badges, which can be equipped for various effects and stat boosts A world in 2.5D: Adorable, paper-style characters inhabit a world with depth and detail to create a distinctly eye-catching visual style. In the world of The Outbound Ghost, ghosts are the embodiment of regret.\nMost people go to the afterlife after dying, yet those who were unhappy with their previous lives become ghosts and are forced to haunt the Earth until they right their wrongs. Of course, this is not always possible since doing this as a ghost is orders of magnitude harder than when you are a human. However, some manage to do this and are able to spend the rest of their deaths in the afterlife. In The Outbound Ghost , your task is to help others fix or come to terms with their past lives so that they can enjoy the pleasures of eternal bliss. You must achieve that for yourself too, but it’s not so easy to mend the mistakes of your past life when you don’t even remember them.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/the-outbound-ghost-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/the-outbound-ghost-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5",
        "Graphics": "Integrated",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG",
        "Developer": "Conradical Games",
        "Platform": "PC",
        "Game Size": "3.5 GB",
        "Released By": "GOG",
        "Version": "v1.0.17 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9gfegsuw84jw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/the-outbound-ghost-preinstalled-steamrip.jpg"
}