{
    "page_url": "https://steamrip.com/the-last-of-us-part-ii-remastered/",
    "title": "The Last of Us Part II Remastered",
    "description": "Now experience the critically acclaimed and multi-award-winning narrative of The Last of Us Part II in its ultimate form with the Remastered edition. This version builds upon the original with a suite of technical enhancements , making it the definitive way to immerse yourself in the powerful and emotionally charged story of Ellie and Abby. Discover the winner of over 300 Game of the Year awards, now optimized with features that bring its compelling world and characters to life like never before. Prepare to be captivated by a story that has resonated deeply with players worldwide, now elevated with enhanced fidelity and performance.\nFive years have passed since Ellie and Joel’s perilous trek across a ravaged United States. They have found a semblance of peace and stability within a thriving survivor community in Jackson, Wyoming, despite the ever-present dangers of the infected and desperate human factions. However, this fragile tranquility is shattered by a brutal event, propelling Ellie on a relentless quest for justice and a desperate search for closure. Her journey will take her through harrowing landscapes and force her to confront devastating truths, testing the limits of her resilience and morality in a world consumed by loss and violence .\nThe Last of Us Part II Remastered elevates the original game with a range of enhancements, taking advantage of modern hardware to deliver an unparalleled experience. Enjoy a host of graphical improvements that breathe new life into the game’s beautiful yet perilous environments, with increased detail and visual fidelity. Experience full integration with the PlayStation DualSense controller, utilizing adaptive triggers and haptic feedback to deepen your connection to the gameplay. As you progress through Ellie and Abby’s intertwined stories, earn and collect exciting achievements on Steam, adding another layer of engagement to this unforgettable journey. The game also offers widescreen and Ultrawide support, providing a more expansive and cinematic view of its haunting world. Elroy and the Aliens",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/04/the-last-of-us-part-ii-remastered-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/04/the-last-of-us-part-ii-remasted-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10/11 64-bit (version 1909 or higher)",
        "Processor": "Intel Core i3-8100, AMD Ryzen 3 1300X",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1650, AMD Radeon RX 5500XT",
        "Storage": "150 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Naughty Dog LLC, Nixxes Software, Iron Galaxy Studios",
        "Platform": "PC",
        "Game Size": "103 GB",
        "Released By": "RUNE",
        "Version": "v1.4.10515.636 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/tufbmy2isa3i/The-Last-of-Us-P2R-SteamRIP.com.rar",
        "https://gofile.io/d/gotpPY",
        "https://buzzheavier.com/yvpgw1jjxnu4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/04/the-last-of-us-part-ii-remasted-preinstalled-steamrip.jpg"
}