{
    "page_url": "https://steamrip.com/the-lego-movie-videogame-free-download-d6/",
    "title": "The LEGO Movie Videogame Free Download",
    "description": "Get The LEGO Movie Videogame for free instantly and play pre-installed on SteamRiP\nThe gameplay in The LEGO Movie Videogame is simple, but not boring. At the very beginning, you will be asked to master basic functions such as construction, character control and much more. And then you can go to a huge open world in which you will find adventures, rides on motorcycles, shooting from a special blaster, battles with cowboys, and even a dozen mini-games. In general, the game is quite interesting, but its main feature lies precisely in the world in which you have to survive . Here you have a huge open world, and several unique locations, and painfully familiar characters, and cut scenes, and a lot of humor, and of course action.\nWell, plus to everything, I would also like to say that in this game you will meet a huge number of famous characters, including Gandalf, and Superman, and the Little Mermaid , and even the wizard Professor Dumbledore. Join Emmet and an unlikely group of resistance fighters in their heroic quest to thwart Lord Business’ evil plans—a mission that Emmet is hopelessly and hilariously unprepared for. It’s a wild ride with a surprising mix of over 90 playable characters including Batman , Superman, Wonder Woman , the Green Ninja, Gandalf, Shakespeare, Cleopatra and more. Spiritfarer",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/the-lego-movie-videogame-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/the-lego-movie-videogame-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows®XP SP3, Windows Vista/7/8 with latest service packs and updates installed",
        "Processor": "AMD Athlon 64 X2 EE 3800+ (2*2000 Mhz)",
        "Memory": "2 GB RAM",
        "Graphics": "NVIDIA GeForce 7600 GS or ATI Radeon X1950 Pro or better",
        "DirectX": "Version 10",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "TT Fusion, Traveller’s Tales",
        "Platform": "PC",
        "Game Size": "5.4 GB",
        "Version": "Update 2 | Full  (Latest) + 1 DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/nse49f9tgdc4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/the-lego-movie-videogame-preinstalled-steamrip.jpg"
}