{
    "page_url": "https://steamrip.com/they-are-billions-free-download-u2/",
    "title": "They Are Billions Download",
    "description": "Get They Are Billions for free instantly and play pre-installed on SteamRiP\nThey Are Billions is a strategy game in a distant future about building and managing human colonies after a zombie apocalypse destroyed almost all of human kind. Now there are only a few thousand humans left alive that must struggle to survive under the threat of the infection. Billions of infected roam around the world in massive swarms seeking the last living human colonies. Airport Firefighters – The Simulation\nIn this mode, a random world is generated with its own events, weather, geography, and infected population. You must build a successful colony that must survive for a specific period of time against the swarms of infected. It is a fast and ultra addictive game mode. We plan to release a challenge of the week where all players must play the same random map. The best scores will be published in a leaderboard .\nThis is a real-time strategy game, but don’t get too nervous. You can pause the action to take the best strategic and tactical decisions. In Pause Mode, you can place structures to build, give orders to your army, or consult all of the game’s information. This game is all about strategy, not player performance or the player’s skill to memorize and quickly execute dozens of key commands. Pause the game and take all the time you need Planet Coaster",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/they-are-billions-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/they-are-billions-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 and higher (x64)",
        "Processor": "AMD FX-6100 / Intel i3-3220",
        "RAM": "8 GB",
        "Video card": "AMD Radeon HD 7750 / NVIDIA GeForce GTX 650, DirectX 11",
        "Free space on hard disk": "20 GB"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Numantian Games",
        "Platform": "PC",
        "Game Size": "2.20 GB",
        "Repack By": "GOG",
        "Version": "v1.1.4.10 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/apl1je6fjsxd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/they-are-billions-free-download-preinstalled-steamrip.jpg"
}