{
    "page_url": "https://steamrip.com/this-is-the-president-free-download-9p/",
    "title": "This Is the President Free",
    "description": "This Is the President v1.0c game for free instantly and play pre-installed on SteamRiP\nThis Is the President is a story driven management game. Mechanica In the year 2020 you are elected to be the President of the United States of America. To escape justice for your past crimes as a shady multi-millionaire businessman, you need to ratify Amendment 28 which would grant lifetime immunity to any President. Manage your official and unofficial staff like a real mafioso in order to deal with all the old problems you’ve had in the past, as well as the shiny new problems that come with the office .\nYou’ll battle with your competitors, the establishment , the media and even foreign leaders. In this political thriller-satire mix, the player’s actions will inescapably lead to situations that escalate into absurd, terrifying, tragic and even ridiculous situations. But the road to lifelong immunity is full of pitfalls, and you’ll need to remember to clean up the daily messes that arise. Some might even call these distractions “ presidential duties”.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/this-is-the-president-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/this-is-the-president-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64Bit or higher",
        "Processor": "AMD / Intel CPU running at 2.6 GHz or higher",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA/AMD dedicated graphics card, with at least 1GB of dedicated VRAM",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Simulation, Strategy",
        "Developer": "SuperPAC",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Repack By": "GOG",
        "Version": "v1.0c | full version (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d/4Z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/this-is-the-president-free-download-preinstalled-steamrip.jpg"
}