{
    "page_url": "https://steamrip.com/this-land-is-my-land-free-download-p9/",
    "title": "This Land Is My Land Free",
    "description": "Get This Land Is My Land PC game for free instantly and play pre-installed on SteamRiP\nTake your trusty bow, fast mustang , and take back your lands. Engage with roaming patrols, sneak into forts and settlements, explore the beautiful world, craft weapons, and consumables, hunt animals, lead your loyal companions to victory This Land Is My Land brings you a unique blend of stealth-action and strategy mechanics, allowing you to choose numerous approaches to every problem or threat your tribe will meet on the long path to taking back your land. Explore a never-same 100 sq mi world spread across three unique biomes filled with valuable resources, dangerous animals to hunt, and a number of other tribes wishing to join your resistance.\nEncounter hundreds of enemy settlements with thousands of enemy settlers in them, fight roaming patrols, prevent cities from developing, blow up railways, and do everything you find reasonable, to stop the opposing forces from spreading across your rightful land. Manage and develop your camps, send your warriors to attack, give the orders to craft, create new settlements, and set up semi- autonomous infrastructure which will fight against settlers, without taking time from your deadly business. Experience Realistic Needs – treat diseases caused by not-so-wisely chosen food eaten in the heat of combat or dirty water drunk from the river or have the option to turn this system off if it doesn’t fit your play style.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/this-land-is-my-land-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/this-land-is-my-land-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5 2.8Ghz or AMD equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Geforce GTX 950 or AMD equivalent",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Simulation",
        "Developer": "Game-Labs",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "FLT",
        "Version": "v1.0.3.18972 | Full  + 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bth2y9ncibwf"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/10/this-land-is-my-land-free-download-preinstalled-steamrip.jpg"
}