{
    "page_url": "https://steamrip.com/thunderday-free-download-j1/",
    "title": "Thunderday Directly Download",
    "description": "A twin stick shooter, and for some also a bullet hell, following a group of friends and family traveling to strange worlds and locations fighting their way through hordes of enemies to find and destroy the one responsible for all this destruction. Choose your hero and start your journey. You and your friends, a couple of middle aged game and fantasy nerds are playing the new board game Dungeons and Donders. ForeVR Bowl VR\nThen all of a sudden the ground starts shaking and a loud explosion is heard in the distance, soon after that your family’s house gets destroyed. You jump outside in anger to check if the rest of your neighborhood is still intact but then Suddenly you find yourself in a gunfight with an unknown enemy that looks out of this world Go and take your revenge on the one who demolished this wonderful board game event with your friends.\nOn your journey you’ll venture to all kinds of planets and locations, all with unique enemies and different environments. Can you complete your quest to destroy the one responsible and maybe even a far greater evil? Is an endless version of a Level from Thunderday transformed into a Space Action High Score Game. Stay alive as long as you can by destroying enemy ufo’s and asteroids . Each kill earns you points. Can you get the ultimate high score and show off to your friends?\nThunderday is originally a game made for a group of friends that every year, go on a board game weekend. Each year one of the friends creates a board game to play. We’ve had a papercraft game, a board game made of building blocks and one with big castles that are normally used for aquariums . Last year it was my (Niekoe) turn. The idea was that everytime my friends beated a game board they had to play a level in a video game. So I asked my colleague from work (CrasyBoy) to help create an awesome video game for that board game weekend.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/thunderday-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/thunderday-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Intel Core i3 with 4 cores or better",
        "Memory": "2 GB RAM",
        "Graphics": "Integrated graphics or better",
        "DirectX": "Version 9.0",
        "Storage": "512 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "RobotCat Games",
        "Platform": "PC",
        "Game Size": "133.5 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/vi0wuig6aucv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/thunderday-preinstalled-steamrip.jpg"
}