{
    "page_url": "https://steamrip.com/time-on-frog-island-free-download-j1/",
    "title": "Time On Frog Island",
    "description": "A terrible storm ravages the seas around you, casting your mighty vessel into the perilous rocks of a nearby island. You awake to find your ship in pieces, shipwrecked on a strange island filled with frogs? A spaghetti network of trades will take you all over this strange island as you seek out materials to fix your boat. You will meet a cast of friendly characters, solve head scratching puzzles, find hidden treasures, and much more as you explore the world of Time on Frog Island. Make your own path in this island sandbox, you never know what will be around the next corner Get to know the froggy locals and help out where you can.\nDiscover new items by fishing and farming, and concoct simple brews that will change how you traverse the island. Ask around for the items you need, but bear in mind that you might need to do a frog a favor to get what you want. Solve interesting puzzles to get your hands on required items. Run faster, jump higher, fall slower, anything is possible if you’re holding the right item. Discover different ways to complete those crucial trades. Each object you pick up could end up being the key to something bigger.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/time-on-frog-island-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/time-on-frog-island-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later",
        "Processor": "Intel Core i5",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 970 / Equivalent",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Half Past Yellow",
        "Platform": "PC",
        "Game Size": "221 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 9069507 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/g44cx2nlxi8z"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/time-on-frog-island-preinstalled-steamrip.jpg"
}