{
    "page_url": "https://steamrip.com/time-loader-free-download-3r/",
    "title": "Time Loader Free Download",
    "description": "Time Loader Download PC Game In Direct Link for free on SteamRIP\nTime Loader is a story-driven, physics-based puzzle platformer with a twist. At the helm of a small robot, you’ll travel back to the 90s to prevent a tragic accident. Explore the house of your creator, solve brain-teasing puzzles, acquire unique and powerful upgrades, and see common household items from an entirely new perspective But remember: meddling with time has serious consequences.\nYou may succeed in changing the past, but can you deal with the result of your actions? Boosters , harpoons, screwdrivers choose among dozens of upgrades to tackle each level and get the job done Don’t just relive the past: change it Every choice you make will influence the story and may lead to a different outcome. So do us a favor: change the past responsibly Time Loader features music, references, and items straight out of the ‘90s. Relive your childhood or, if you’re too young for it, just gawk in awe at how primitive humanity used to be back then",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/time-loader-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/11/time-loader-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 / 8.1 / 10",
        "Processor": "i3 Sandy Bridge Dual Core or Equivalent",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 660",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Racing, Simulation",
        "Developer": "Flazm",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "GOG",
        "Version": "v1.0.65 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hxngqorozshj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/time-loader-free-download-preinstalled-steamrip.jpg"
}