{
    "page_url": "https://steamrip.com/tin-hearts-free-download-1m/",
    "title": "Tin Hearts",
    "description": "Behind every brilliant invention, hides a magical story. From members of the team that brought you Fable, comes Tin Hearts – an immersive narrative puzzle adventure game wrapped in a powerful tale of love and compromise. Guide a troop of mischievous tin soldiers through a magical toy-filled world using a variety of whimsical and inventive contraptions to bounce, shoot and glide them to their goal. The Ranch of Rivershine\nMarch through 50+ levels of time-bending, soldier-routing riddles, forge new paths for your toys to follow, and solve increasingly elaborate puzzles to unravel the emotional, thought-provoking story, of Albert J. Butterworth, a genius inventor of Victorian times. Control toy cannons to clear the way ahead, bounce to new heights using trampoline drums, and manipulate balloon inflating machines to help the soldiers reach their destination\nDiscover a deeply emotional story spanning generations and dimensions , masterfully woven into the fabric of this puzzle-filled world. Clues are everywhere, seek them out and you will be rewarded with a heartfelt tale which is beautifully voiced and animated. Feel like a child in a toy store as you immerse yourself in a magical, alternate-timeline Victorian universe full of nostalgic warmth and charm.\nUnlock powers to control objects in the world, from wooden blocks to drums to toy trains. Link objects in interesting ways as you build paths to the exit for your fearless tin soldiers to follow, and slowly reveal the secrets of their past. Pause, fast-forward and rewind time to change the outcome of your actions and complete increasingly intricate puzzles . Take your time working through the relaxing puzzles and enjoy the poignant soundtrack, from award-winning composer Matthew Chastney, whose credits include trailers for ‘JOKER’, ‘Chernobyl’, and ‘Bridgerton’.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/05/tin-hearts-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/05/tin-hearts-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1, Windows 8.1 or later, Windows 10",
        "Processor": "Intel i5-4590 equivalent or better",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 970, AMD Radeon R9 290 equivalent or better",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Rogue Sun",
        "Platform": "PC",
        "Game Size": "9.7 GB",
        "Released By": "FLT",
        "Version": "Build 11243721 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wihpwe3ii6a2"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/05/tin-hearts-preinstalled-steamrip.jpg"
}