{
    "page_url": "https://steamrip.com/tiny-aquarium-social-fishkeeping-free-download/",
    "title": "Tiny Aquarium: Social Fishkeeping",
    "description": "What is Tiny Aquarium ? Bum: Revenge\nJump into a relaxing haven where you nurture vibrant fish, design your dream underwater world, and connect with friends.\nTiny Aquarium is a real-time idle game, meaning the fish keep growing while you’re away – even when you’re offline! Be sure to check in regularly and see how your fishy friends are doing.\nBegin a relaxing journey toward building your dream aquarium. Hatch new fish, customize your aquarium, and interact with your friends.\nCreate the aquarium of your dreams, and place it on your desktop as a companion using Tiny Mode. The fish can keep you company throughout the day, whether you’re working, studying, or just kicking back with some videos!\nDiscover and learn about dozens of real and fantasy fish, with new ones being added regularly so there is always something to look forward to.\nExplore Tiny Aquarium’s exciting online functionalities. Visit strangers, trade fish, and join in on fun new events.\nOr go for a relaxing sea trip with the new fishing minigame ! Grab a rod and kick back – alone, with friends, or even with strangers, chatting and browsing other aquariums as you go. Upgrade your rod and ship and be on the lookout for the most dazzling catch.",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2581950/ss_9b12dece8e0b3992b54034b437ef9c7cdad63690.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2581950/ss_2d8cabc8c050f3de01d25b806a51d0fc2e704864.600x338.jpg",
        "https://buzzheavier.com/26a8qb022ry9"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit",
        "Processor": "x64 architecture with SSE2 instruction set support",
        "Memory": "1 GB RAM",
        "Graphics": "DX11, DX12 capable",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Massively Multiplayer, Simulation",
        "Developer": "Lunheim Studios",
        "Platform": "PC",
        "Game Size": "192.8 MB",
        "Released By": "Goldberg | ty emoris, cs.rin.ru",
        "Version": "Build 19382754",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/26a8qb022ry9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/Tiny-Aquarium-Social-Fishkeeping_featured_final.jpg"
}