{
    "page_url": "https://steamrip.com/tiny-bunny-free-download-7r/",
    "title": "Tiny Bunny Free",
    "description": "Tiny Bunny Download PC Game In Direct Link for free on SteamRIP\nEverything falls into slumber when winter comes, but not this forest. There’s something wandering its snow-covered paths, lurking behind black trees and taking whatever it considers due. It leaves behind bizarre rumors of voices, calling you into the thicket, of faces, looking into your windows, of mysterious prints in the snow and a bunch of “child missing” posters. Those, who have heard the voice of the forest, are beyond help. Their only option is to sink deeper and deeper into the cold embrace of horror to face their final choice in that icy darkness: to stay alive or to stay human?\nThe story takes place in a quiet, unremarkable village lost among the Siberian forest. The protagonist, Anton, had recently moved there with his family and was almost immediately forced to witness and participate in a chain of unsettling events. It’s a place where children go missing. The police are powerless, search teams are combing out the forest, but they find no traces. Deep Rock Galactic\nWhy, then, is Anton repeatedly coming across prints, bloodstains , and scraps of clothing? It almost feels like someone is putting up a show just for him. He is haunted by nightmares at first, which grow more and more frightening and bloody every night. They also grow increasingly real and beckoning .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/tiny-bunny-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/tiny-bunny-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP+ (x86)",
        "Processor": "1.2 GHz or faster processor",
        "Memory": "2 GB RAM",
        "Graphics": "512 MB display memory",
        "DirectX": "Version 9.0",
        "Storage": "800 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, Early Access",
        "Developer": "Saikono",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "RUNE emu",
        "Version": "Episode 1-4 Build 11397870 | Early Access (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d29r0jk4mmib"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/tiny-bunny-preinstalled-steamrip.jpg"
}