{
    "page_url": "https://steamrip.com/tiny-thor-free-download-g1/",
    "title": "Tiny Thor",
    "description": "Tiny Thor features 16-bit graphics and gameplay centered around using Mjölnir , leading our Norse hero through challenging levels filled with all kinds of obstacles. It offers tight controls, fast-paced action and an experience tinged with nostalgia. “It’s your birthday Killer Frequency\nNow take Mjölnir, the hammer that never misses its target” Odin. Everything has been carefully designed around this premise. The hammer can be freely aimed and bounces off surfaces and enemies, enabling all kinds of trick shots.\nTiny Thor will feel familiar to retro fans, but also unique in its own ways. It features true 16-bit pixel art from Henk Nieborg and an original soundtrack by Chris Hülsbeck . Starting as a relatively simple platformer, Tiny Thor unfolds along the way, as you unlock all kinds of abilities that you dreamed of having back in the day.\nThe platforming is punctuated with exhilarating boss battles which will test the son of Odin. Each realm features a set of almighty adversaries who want to stop Thor on his way to becoming a true god. You will need to make use of everything you learned along the way to beat them",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/06/tiny-thor-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/06/tiny-thor-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 x64",
        "Processor": "Intel Core i7-8550U",
        "Memory": "8 GB RAM",
        "Graphics": "Intel UHD  620",
        "DirectX": "Version 9.0",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Asylum Square",
        "Platform": "PC",
        "Game Size": "129 MB",
        "Released By": "GOG",
        "Version": "v6125 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/59r1nz9a1lmo"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/06/tiny-thor-preinstalled-steamrip.jpg"
}