{
    "page_url": "https://steamrip.com/tiny-combat-arena-free-download-1l/",
    "title": "Tiny Combat Arena Free Download",
    "description": "What is the experience of Tiny Combat Arena? Tiny Combat Arena is a labor-of-love combat flight simulator that aims to strike the perfect balance between a simulator and an approachable, customizable, air combat experience. All executed in a stylized look representing a fictional Cold War-era conflict.\nSim-lite combat flight model Tiny Combat Arena is all about the fun factor of flying, dogfighting, and close air support. Simulation elements are added to the game in service of creating engaging and deep gameplay, never just for the sake of realism. Simulation inspired mechanics , such as boosting a missile’s range by launching from above your target, create a new range of tactics for you to explore. Atelier Sophie 2\nQuick Mission Builder Tiny Combat Arena lets you jump in and fly by quickly assembling various types of missions. Take a placid stroll around beautiful scenery, configure a team vs team dogfight against aircraft of your choosing, or strike objectives with ground units to attack and support.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/tiny-combat-arena-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/tiny-combat-arena-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "x86, x64 architecture with SSE2 instruction set support",
        "Memory": "1024 MB RAM",
        "Graphics": "DX10, DX11, DX12 capable",
        "DirectX": "Version 10",
        "Storage": "1024 MB available space"
    },
    "game_info": {
        "Genre": "Action, Simulation, Early Access",
        "Developer": "Why485, MicroProse Software",
        "Platform": "PC",
        "Game Size": "141 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v0.14.1.4 | Early Access (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/97hipltfc27k"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/tiny-combat-arena-preinstalled-steamrip.jpg"
}