{
    "page_url": "https://steamrip.com/tiny-tinas-wonderlands-free-download-o1/",
    "title": "Tiny Tina’s Wonderlands",
    "description": "Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina.\nRoll your own multiclass hero and loot, shoot , slash, and cast your way through outlandish monsters and loot-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone’s welcome, so join the party, throw on your adventuring boots, and be Chaotic Great Pets Hotel\nAN UNPREDICTABLE FANTASY WORLD Tiny Tina is your disorderly guide through an extraordinary tabletop realm where rules rarely apply. Explore a vast overworld spanning majestic cities, dank mushroom forests, foreboding fortresses, and more\nGUNS, SPELLS, AND MORE Blast baddies with powerful guns and devastating spells in frenetic first-person battles. Use your firepower to vanquish legions of enemies, including smack-talking skeletons, land-roaming sharks, and colossal bosses. Then delve deeper into dangerous dungeons for a shot at epic loot\nPARTY UP TO DEFEAT EVIL Joining you at the table are headstrong captain Valentine and rule-obsessed robot Frette. During your quest to defeat the Dragon Lord, you’ll meet a cast of lovable misfits like a lute-wielding Bardbarian and your very own Fairy Punchfather .\nPERSONALIZE YOUR HERO Create the perfect hero with deep customization , including a multiclass system that lets you mix and match six unique character skill trees, all with their own awesome abilities. Level up, refine your build, expand your arsenal, and become the ultimate adventurer.\nBAND TOGETHER IN CHAOTIC CO-OP Enjoy the story solo or start a party with up to three friends in seamless online multiplayer. Share the spoils or rush to get the shiniest loot—how you play is up to you",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/tiny-tinas-wonderlands-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/tiny-tinas-wonderlands-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (latest service pack)",
        "Processor": "AMD FX-8350 (Intel i5-3570)",
        "Memory": "6 GB RAM",
        "Graphics": "AMD Radeon RX470 (NVIDIA GeForce GTX 960 4GB)",
        "Network": "Broadband Internet connection",
        "Storage": "75 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Gearbox Software",
        "Platform": "PC",
        "Game Size": "49.4 GB",
        "Released By": "RUNE",
        "Version": "Build 10922058 | Full  + DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/DCDD493BD0",
        "https://buzzheavier.com/x1bz5v4rjbf6",
        "https://1fichier.com/?myhjgczy6e3lo40s0osc"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/tiny-tinas-wonderlands-preinstalled-steamrip.jpg"
}