{
    "page_url": "https://steamrip.com/titan-quest-ii-free-download/",
    "title": "Titan Quest 2",
    "description": "Return to the classic mythology -inspired setting of Titan Quest and go toe-to-toe with legendary monsters as you journey across a fantastical reimagining of Ancient Greece.\nNemesis, Goddess of Retribution , is out of control. She is corrupting the Threads of Fate and condemning all those who oppose her to Eternal Punishment – including you. Take up your weapon, fight alongside gods, and face some of the most powerful forces in Greek mythology in order to stop Nemesis , free those she’s punished, and weave your own epic tale. Cook Serve Forever\nFrom the creators of SpellForce 3 comes a handcrafted action RPG for a new generation of mythical heroes. Embark on an adventure worthy of the epics that takes you from picturesque beaches, to serene Greek temples, to ruins haunted by shades of the dead, to places where no mortal has ever ventured, including the mysterious realm of the Moirai themselves and beyond.\nBattle classic creatures from Greek myth and the original Titan Quest, including ichthians, centaurs, gryphons, hippokampoi and cyclopes, and prove that the age of heroes is far from over.\nTitan Quest II features a unique handcrafted campaign focused on exploration, and the world is full of mysteries and secrets to discover. Legendary monsters lurk in hidden groves, strange artifacts still carry magic from bygone ages, and you never know when you will end up face-to-face with a god. Every ruin holds a secret, every statue a story.\nVisit memorable towns full of life and intrigue . The conversations you engage in and the items you find along your journey can lead to surprising discoveries. This is your adventure .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/08/titan-quest-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/08/titan-quest-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64bit / Windows 11 64bit",
        "Processor": "Intel Core i5-8600K / AMD Ryzen 5 2600X",
        "Memory": "16 GB RAM",
        "Graphics": "8 GB VRAM, AMD RX 6700 XT or NVIDIA GeForce RTX 2070",
        "DirectX": "Version 12",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG, Early Access",
        "Developer": "Grimlore Games",
        "Platform": "PC",
        "Game Size": "38.8 GB",
        "Released By": "Ty Lanternjoe | Mr_GOLDBERG emu",
        "Version": "v0.1.0 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/u6gmgqly4105",
        "https://buzzheavier.com/twf0sgx9ouz5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/08/titan-quest-2-preinstalled-steamrip.jpg"
}