{
    "page_url": "https://steamrip.com/togges-free-download-1k/",
    "title": "Togges Directly Download",
    "description": "Beneath all the cosmos , in the depths of the galaxy, there is an endless wall, keeping the known universe from the dangers of the unknown. In the formation of the constellations, the leaders of each domain maintain the balance, and the King must protect all existence. This is the story of Togges.\nTake your time to explore these gorgeously crafted worlds and immerse yourself in unimaginable settings with stunning vistas. Discover a futuristic city in the Savannah, to a whole realm made of carrot cake, and get entangled into funny tales all while making friends around the cosmos. Saints Row IV: Re-Elected\nAlong the way, solve puzzles and interact with each environment in playful ways. Packed with fun, find all sorts of collectibles within the handcrafted levels where every corner you turn has something interesting to discover.\nOvercome challenges while combining different Togge colours and their abilities. Find new ways to play by encountering unexpected surprises within a rich sandbox experience – a game designed for players to let their inquisitive minds to freely explore at their own pace. Togges is a game made with love, from a 3D platformer fan to another. A charming revival from the golden era of classic 3D platformers, with a modernized vision taking notes from great classics like Katamari, Pikmin, and Super Mario Galaxy.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/12/togges-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/12/togges-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel i5 2nd generation",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 780",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Regular Studio",
        "Platform": "PC",
        "Game Size": "824 MB",
        "Released By": "GOG",
        "Version": "v1.03 | Full  + Win7 fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/d4lta8236ojs"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/togges-preinstalled-steamrip.jpg"
}