{
    "page_url": "https://steamrip.com/tokyo-necro-free-download-l1/",
    "title": "Tokyo Necro",
    "description": "Tokyo has become a snow-covered wasteland where the dead walk among the living. But in this frozen hellscape people have survived, protected by the guns and cybernetics enhancements of the Living Dead Stalkers.\nDeveloped by Nitro Origin, creators of Song of Saya and Full Metal Daemon Muramasa , Tokyo NECRO dives into the cyberpunk genre and sets a new standard for action visual novels – with fully animated fight scenes and an interactive display where you can see every action your character takes through their own eyes\nIn the future, the world has been engulfed in the bitter cold of an ice age. And yet, Tokyo is surviving with its use of geothermal heat pipes to keep the city habitable. Within this frozen city, So’un and Ethica make their living working for the Karasuzumi Living Dead Stalker Office; contract killers who spend their working days executing necromancers and their undead minions. On one such mission, they discover a mysterious girl who had been kidnapped by a necromancer for reasons unknown. League Manager 2023",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/tokyo-necro-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/tokyo-necro-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "512MB",
        "DirectX": "Version 9.0",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "6.5 GB",
        "Released By": "TENOKE",
        "Version": "v1.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mm97yede2tjb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/tokyo-necro-preinstalled-steamrip.jpg"
}