{
    "page_url": "https://steamrip.com/tom-clancys-splinter-cell-blacklist-free-download/",
    "title": "Tom Clancy’s Splinter Cell Blacklist",
    "description": "The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist – a deadly countdown of escalating attacks on U.S. interests. Postal III\nOperate without Restrictions\nSam is back in his tactical suit and goggles, and he’s more lethal and agile than ever. Granted the freedom to do whatever it takes to stop the Blacklist, Sam flies from exotic locales to U.S. cities as he races against the clock to find out who’s behind this devastating threat.\nOwn Your Play Style\nSplinter Cell Blacklist builds on the stealth roots of the franchise, while exploring new directions to embrace the realms of action and adventure. Players can define their personal play styles and be rewarded for those choices.\nTools of the Trade\nTake down The Engineers by using new gadgets such\nas the upgraded Snake Cam and Micro-trirotor Drone. Splinter Cell Blacklist is also bringing back fan-favorites like the Sticky Shocker and the brutal, curved Karambit knife. Fans of stealth will be happy to make the most of Sam’s sneaking abilities to abduct and carry enemies, while Killing In Motion allows the player to strike with surgical precision by marking and executing multiple enemies in one fluid motion.\nBuild a New Echelon\nSam is building a whole new Echelon unit; his team, his way. Anna “Grim” Grimsdottir is his technical operations manager, CIA operative Isaac Briggs brings additional firepower, and resident hacker Charlie Cole rounds out the crew. 4th Echelon is a fully mobile ops unit with unlimited resources and cutting-edge technology aboard the re-purposed stealth airliner, the Paladin.",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/235600/ss_f247ea23341379037f5d15fb12f9f7f8ce08670e.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/235600/ss_a8c31e928e321154333381c895018dfc3efb95c6.600x338.jpg",
        "https://gofile.io/d/NugmYB",
        "https://buzzheavier.com/h1fg8niidp6p"
    ],
    "system_requirements": {
        "OS *": "Originally released for Windows 7, the game can be played on Windows 10 and Windows 11 OS",
        "Processor": "2.53 GHz Intel® Core™2 Duo E6400 or 2.80 GHz AMD Athlon™ 64 X2 5600+ or better",
        "Memory": "2 GB RAM",
        "Graphics": "512 MB DirectX® 10–compliant with Shader Model 4.0 or higher",
        "DirectX®": "9",
        "Hard Drive": "25 GB HD space",
        "Sound": "DirectX 10–compliant DirectX 9.0c–compliant",
        "Additional": "Peripherals Supported: Windows-compatible keyboard, mouse, headset, optional controller (Xbox 360 Controller for Windows recommended). Requires UPLAY account."
    },
    "game_info": {
        "Genre": "Action, Adventure",
        "Developer": "Ubisoft Toronto",
        "Platform": "PC",
        "Game Size": "19.5 GB",
        "Released By": "LumaPlay + savio CSF, cs.rin.ru",
        "Version": "v1.03 | Build 11456152 | (Unofficial Co-op)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/NugmYB",
        "https://buzzheavier.com/h1fg8niidp6p"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/Tom-Clancys-Splinter-Cell-Blacklist_featured_final.jpg"
}