{
    "page_url": "https://steamrip.com/tom-clancys-splinter-cell-conviction-free-download-6i/",
    "title": "Tom Clancy’s Splinter Cell Conviction Free Download",
    "description": "Get Tom Clancy’s Splinter Cell Conviction PC game for free instantly and play pre-installed on SteamRiP\nAn investigation into his daughter’s death unwittingly leads former agent Sam Fisher to discover he’s been betrayed by his prior agency, the Third Echelon. Now a renegade, Fisher finds himself in a race against time to thwart a deadly terrorist plot that threatens millions. Uniting revolutionary gameplay enhancements with a high-octane, no-holds-barred storyline, Tom Clancy’s Splinter Cell Conviction arms you to the teeth with all the high-tech weaponry and lethal skills of an elite operative and invites you to enter a dangerous world where justice means making your own rules.\nA full arsenal of cutting-edge innovations allows you to outflank foes with the Last Known Position system, tag and eliminate enemies using the Mark and Execute feature, and much more. A unique storytelling style keeps you on the edge of your seat as you navigate the explosive world of a renegade agent where trust is impossible and justice requires you to go above the law.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/tom-clancys-splinter-cell-conviction-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Windows Vista, Windows 7",
        "Processor": "1.8 GHz Intel Core2 Duo or 2.4 GHz AMD Athlon X2 64",
        "Memory": "1.5 GB Windows XP / 2 GB Windows Vista, Windows 7",
        "Graphics": "256 MB DirectX 9.0c–compliant video card (512 MB recommended) (see supported list*)",
        "DirectX": "9.0c",
        "Hard": "Drive:10 GB"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Ubisoft Montreal",
        "Platform": "PC",
        "Game Size": "6.4 GB",
        "Repack By": "CODEX",
        "Version": "v1.04 | Updated",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/965C9B6702",
        "https://buzzheavier.com/7etlicp4glyc",
        "https://megadb.net/eokz7rbv22yh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/tom-clancys-splinter-cell-conviction-free-download-preinstalled-steamrip.jpg"
}