{
    "page_url": "https://steamrip.com/tortuga-a-pirates-tale-free-download-s1/",
    "title": "Tortuga – A Pirate’s Tale",
    "description": "Enlighten me! Is this what you wanted? Is this how you imagined a pirate life? Come on Which of you land rats dared to conceive a rebellion and wanted to shed the blood of the captain in order to seize power on the ship? Draw your saber, scoundrel, or walk on the plank and end your miserable existence at the bottom of the sea Let me repeat what I promised this crew and this ship. WW2 Rebuilder\nI promised adventure and a dangerous life in exchange for loot, riches and eternal glory. We are the terror of the Caribbean. Dead mute, but the creeping fear of becoming our next victim will spread the news of the Pirate Legend like the wind\nRaise anchor , set sails, prepare cannons we are going to hunt for a fleet of Spanish treasures, and we will return to Tortuga with booty Ge-ge-gay, sailors. I bet you are exceedingly curious as to why I have gathered you on deck. Well I’ve heard rumors that you drunken ungrateful how shall I put it are not happy with our deeds. I can smell the mutiny from the lower decks Therefore, I – your humble captain – ask you",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/tortuga-a-pirates-tale-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/tortuga-a-pirates-tale-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "Operating system": "Windows 8.1 (64-bit)",
        "Processor": "Intel Core i5 2400s (2.5 GHz) / AMD FX 4100 (3.6 GHz)",
        "RAM": "8 GB",
        "Video Card": "NVIDIA GeForce GTX 680 / AMD Radeon HD7970 (2GB VRAM), DirectX 11",
        "HDD": "5 GB"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Gaming Minds Studios",
        "Platform": "PC",
        "Game Size": "4.9 GB",
        "Released By": "RUNE",
        "Version": "v1.2.0.59274 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/cw84ts6pip2v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/tortuga-a-pirates-tale-preinstalled-steamrip.jpg"
}