{
    "page_url": "https://steamrip.com/total-war-warhammer-ii-free-download-1n/",
    "title": "Total War WARHAMMER II Download",
    "description": "Total War: WARHAMMER II game for free instantly and play pre-installed on SteamRIP\nEngage in statecraft, diplomacy, exploration and build your empire, turn by turn. Capture, build and manage teeming settlements and recruit vast armies. Level up Legendary Lords and Heroes and arm them with mythical weapons and armour. Negotiate alliances or declare Total War to subjugate any that stand between you and your goal. Command thousands-strong legions of soldiers in intense tactical battles.\nSend forth ferocious, twisted monsters , fire-breathing dragons and harness powerful magic. Utilise military strategies, lay ambushes, or use brute force to turn the tide of combat and lead your forces to victory. The second in a trilogy and sequel to the award-winning Total War: WARHAMMER, Total War: WARHAMMER II brings players a breath-taking new narrative campaign, set across the vast continents of Lustria , Ulthuan, Naggaroth and the Southlands. Model Builder\nThe Great Vortex Campaign builds pace to culminate in a definitive and climactic endgame, an experience unlike any other Total War title to date. Playing as one of 8 Legendary Lords across 4 iconic races from the world of Warhammer Fantasy Battles, players must succeed in performing a series of powerful arcane rituals in order to stabilise or disrupt The Great Vortex, while foiling the progress of the other races.\nEach Legendary Lord has a unique geographical starting position, and each race offers a distinctive new playstyle with unique campaign mechanics, narrative, methods of war, armies, monsters, Lores of Magic, legendary characters, and staggering new battlefield army abilities. Shortly after launch, owners of both the original game and Total War WARHAMMER II will gain access to the colossal third campaign. Exploring a single open-world epic map covering the Old World and the New World, players may embark on monumental campaigns as any owned Race from both titles.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/02/total-war-warhammer-ii-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/02/total-war-warhammer-ii-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64Bit",
        "Processor": "Intel Core 2 Duo 3.0Ghz",
        "Memory": "5 GB RAM",
        "Graphics": "NVIDIA GTX 460 1GB | AMD Radeon HD 5770 1GB | Intel HD4000 720p",
        "DirectX": "Version 11",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action, Strategy",
        "Developer": "CREATIVE ASSEMBLY",
        "Platform": "PC",
        "Game Size": "60 GB",
        "Released By": "EMRESS (DODI Repacks)",
        "Version": "v1.12.0 | Full  (Latest) + 60 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://filecrypt.co/Container/1583E601B6",
        "https://buzzheavier.com/wmtol4jb5hv0",
        "https://1fichier.com/?b4dokbpl4g81lzcssy4l"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/02/total-war-warhammer-ii-preinstalled-steamrip.jpg"
}