{
    "page_url": "https://steamrip.com/tour-de-france-2025-free-download/",
    "title": "Tour de France 2025",
    "description": "The official Tour de France game goes to the next level! Thanks to the Unreal Engine 5, the roads of the Grande Boucle and other iconic races have been brought to life in a whole new way. With completely reworked landscapes and more realistic lighting effects, the Tour de France experience has never been so close to reality. The memorable sites of this discipline are even more faithfully represented: Champs-Elysées, Trouée d’Arenberg, Mont Ventoux, Mur de Huy and many others are to be rediscovered and visited in Tour de France 2025. Rune Factory: Guardians of Azuma\nIn Tour de France 2025, you can now create your own private games and challenge your friends directly on the roads. Create your own settings and game options, choose the type of stage you want and the length of the race, and prove your supremacy on any fields. Choose your two riders, your jersey and elbow your friends to victory in Criterium mode.\nTour de France 2025 introduces an entirely new refuelling mechanism, revolutionizing race strategies. From now on, at the start of your races, you’ll only have access to one type of feed. So it’s crucial to plan your efforts carefully. Once you’ve passed the feed zone, you can choose between Energel and Turbogel and use whichever you like, whenever you like. The Turbogel now gives you immunity for a few seconds, allowing you to attack without losing energy. It’s up to you to make the most of this new mechanic to lead your rider to the victory.",
    "screenshots": [
        "https://shared.cloudflare.steamstatic.com/store_item_assets/steam/apps/2511320/ab60bd87e8f840a97a4c53bc10265b7dbc404951/ss_ab60bd87e8f840a97a4c53bc10265b7dbc404951.600x338.jpg",
        "https://shared.cloudflare.steamstatic.com/store_item_assets/steam/apps/2511320/e8e431282f6288f5b88b4a898a979dced003228c/ss_e8e431282f6288f5b88b4a898a979dced003228c.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-3470 or AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 960, 4 GB or AMD Radeon RX 570, 4 GB or Intel Arc A310, 4 GB",
        "DirectX": "Version 12",
        "Storage": "30 MB available space",
        "Additional Notes": "Shader Model 6.6 or superior required. Intel 7xx and Intel Iris Xe unsupported."
    },
    "game_info": {
        "Genre": "Casual, Racing, Simulation, Sports, Strategy",
        "Developer": "Cyanide Studio",
        "Platform": "PC",
        "Game Size": "24.6 GB",
        "Released By": "TENOKE",
        "Version": "Build 18721637",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/ca33BH",
        "https://buzzheavier.com/09eb89bu3mih",
        "https://datanodes.to/mry2i6dnbazf/Tour-de-Frannce-2025-SteamRIP.com.rar"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/Tour-de-France-2025-preinstalled-steamrip.jpg"
}