{
    "page_url": "https://steamrip.com/tower-dominion-free-download/",
    "title": "Tower Dominion",
    "description": "Your empire faces relentless invasions from the savage Artronids , threatening its very existence. As Commander, you are the last line of defense against the deadly enemy onslaught. In this endlessly replayable experience, every battle presents fresh challenges with unpredictable outcomes. Cash Cleaner Simulator\nTake control of the battlefield by shaping the very ground your enemies march on. Expand and modify terrain tiles to create choke points, forcing enemies into lethal artillery fire or luring them into carefully laid traps. Height and pathing are your greatest weapons—use them wisely to dictate the flow of battle and secure victory .\nEach faction brings its own arsenal to the battlefield , featuring unique biomes, towers, and strategies. Their distinct playstyles shape how you build defenses, deploy units, and control the fight. With 10 unique heroes per faction, each possessing their own strengths and abilities, there are always new tactics to discover and strategies to master.\nWar is unpredictable, but true Commanders adapt. After each wave, select from a set of upgrades and rewards to reinforce your strategy. Assess enemy strengths and weaknesses , adjusting your defenses to counter their advance. No two battles end the same way, as each new tile placement forces you to plan one step ahead.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/05/tower-dominion-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/05/tower-dominion-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2.00 Ghz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1000 series",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Parallel 45 Games",
        "Platform": "PC",
        "Game Size": "454 MB",
        "Released By": "RUNE emu | Ty SpeedyDeathLoads (csrin)",
        "Version": "Build 18378608 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u2sqzfbznpjq"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/05/tower-dominion-preinstalled-steamrip.jpg"
}