{
    "page_url": "https://steamrip.com/train-station-renovation-free-download-q1/",
    "title": "Train Station Renovation",
    "description": "In Train Station Renovation you play as a renovation company specialised in restoring railway stations. The game is set in abandoned and destroyed train stations, you will start with small rural ones to ease in and eventually be challenged with sprawling train stations in metropolitan areas.\nThe game is divided into 15 maps (stations) which gradually teach you new mechanics and help you manage different working environments. Each station needs to be cleaned, fixed and decorated with items and equipment to bring it back to life. Northend Tower Defense\nThe level of difficulty depends on the player’s commitment. The game can be very demanding if you decide to complete each stage one hundred percent but it also can be perfect for beginners if you just want to relax while renovating and simply have a good time. In such a case, you only need to complete half the planned tasks to advance to the next stage . There are many tools and options for repairing and decorating the station.\nWork with basic items such as paint rollers, spray cans, crowbars and repair wrenches or use your in-game tablet to order new materials and items. Some stations will even allow you to repair and renovate the old trains. This means you will be able to take care of the technical condition of those vehicles yourself. An aesthetic development character tree t is available.\nYou will speed up your work time at individual stages and elements of the game by upgrading your skills . You will also get new equipment or unlock new options while renovating. If you happen to enjoy some renovation activities more than others, you will be able to upgrade them during your playthrough.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/train-station-renovation-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/train-station-renovation-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 7/8/10",
        "Processor": "Intel Core i3-4130 / AMD Phenom II X4",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 560 / AMD R7-260X",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Live Motion Games",
        "Platform": "PC",
        "Game Size": "7.5 GB",
        "Released By": "FLT",
        "Version": "v2.2.2 | Full  + Germany DLC",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8gbbtutrnc3o"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/train-station-renovation-preinstalled-steamrip.jpg"
}