{
    "page_url": "https://steamrip.com/transport-fever-2-free-download-i1/",
    "title": "Transport Fever 2",
    "description": "The classic transport simulation genre has a new gold standard with Transport Fever 2. Discover a whole new world by navigating transport routes through land, water and air. May progress and prosperity find their way Provide the world with the transport infrastructure it needs and make a fortune with custom-made transport services. Watch your trains run on rails, your buses and trucks thunder along roads, your ships power through the water, and your planes soar through the skies. Carry people on their way to work or play, and be the reason cities grow and thrive . Deliver raw materials and goods to drive the economy. Experience the greatest logistical challenges from 1850 to the present day, and build a transport empire unrivaled anywhere else on the globe\nFree play offers a huge range of creative possibilities, while campaign mode re-writes transport history across three continents. Transport Fever 2 offers a choice of over 200 vehicles from Europe, America and Asia, modelled in extreme detail; and with the in-game map editor, you can re-create landscapes from three different climate zones. Finally, the realistic transport and economy simulator, along with comprehensive modding support, round off the gameplay experience. A huge game world is waiting for your railroads, road vehicles, aircraft and ships. Intuitive interactive rail construction tools and a modular construction system for stations make it easy to build and expand your transport empire; and thanks to a wide range of configuration options, every free play game provides a new challenge, where completely different strategies can lead to success. Skullgirls 2nd Encore\nThree historic campaigns set in different time periods and located on three separate continents will challenge you with different objectives only transport magnates will manage to complete all the missions! Voiceovers and cutscenes enrich the story and contribute to a thrilling gameplay experience, and even the free play mode will challenge you with different achievements to unlock. It is vital to adapt your company to the needs of the economy and cities: bridges, tunnels, switches, rail signals, one-way streets, light signals, and bus lanes are just some of the possibilities you can use to optimize the transport infrastructure. Even train stations and airports can be expanded with modules in order to meet different requirements; and various data layers help you visualize traffic volumes and emissions, and provide information for further improvements.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/transport-fever-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/transport-fever-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7, 8 or 10 (64-bit)",
        "Processor": "Intel i5-2300 or AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 560 or AMD Radeon HD 7850, 2 GB VRAM",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Urban Games",
        "Platform": "PC",
        "Game Size": "29 GB",
        "Released By": "GOG",
        "Version": "v35720 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/hoJm71",
        "https://buzzheavier.com/30ji143pqm4v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/transport-fever-2-preinstalled-steamrip.jpg"
}