{
    "page_url": "https://steamrip.com/travellers-rest-free-download/",
    "title": "Travellers Rest",
    "description": "Craft, farm, build and cook! In Travellers Rest you will have to use all the available tools to become the best tavern keeper in the realm. Create unique dishes and drinks to please your customers as you discover the world and its colorful characters. Take your establishment to the top in this exciting new adventure !\nYour tavern, your rules Expand and manage your own fantasy tavern. Customize it with furniture and other decorative elements to improve your reputation. Do not stop until you have the tavern of your dreams!\nTend to your customers Hundreds of customers are waiting to be tended to – serve them a nice mug of beer or kick them out if they start to bother the others! Earn mountains of gold and become the best tavern keeper in the land.\nCreate your own style Discover new recipes and create unique dishes and drinks to please your customers. Of course, you will have to get your hands on the best products to keep them satisfied – craft hundreds of items and furniture to take your establishment to the highest level",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/travellers-rest-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/travellers-rest-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 SP1+",
        "Processor": "SSE2 instruction set support",
        "Memory": "8 GB RAM",
        "Graphics": "card with shader model 4.0+",
        "DirectX": "Version 10",
        "Storage": "600 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie, RPG, Simulation, Early Access",
        "Developer": "Isolated Games",
        "Platform": "PC",
        "Game Size": "500 MB",
        "Released By": "GOG",
        "Version": "v0.6.6.6 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u8xcsv5pys6a"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/travellers-rest-preinstalled-steamrip.jpg"
}