{
    "page_url": "https://steamrip.com/triangle-strategy-free-download-1n/",
    "title": "TRIANGLE STRATEGY",
    "description": "Three mighty powers have long waged war on the great continent of Norzelia . This land bears a long and scarred history that includes the Saltiron War, a war that erupted over control of salt and iron resources. A balance of power has been achieved between the Holy State of Hyzante, which controls the salt, the Grand Dutchy of Aesfrost, a land of iron clad in frost and snow, and the forested Kingdom of Glenbook, which lies nestled between the other two powers .\nVarious actions and choices within the game will build up to form your conviction, based on three sets of values Utility, Morality, and Liberty.This will affect your path through the story and which allied units will join your cause. Spiritfall\nImportant decisions that will decide the fate of the protagonist and his allies will be determined through a vote using the Scales of Conviction.For the player to assert their own opinion, they must convince their allies. Choices with a profound impact on the destinies of the group will likewise have a major impact on the story. It will be crucial to use the terrain and differences in elevation to position yourself advantageously .\nEnjoy satisfying and challenging battles and strategy with great depth: with the ability to select from characters with uniquely different traits in your party formation, and gameplay systems that allow flanking the enemy to perform follow-up attacks or using your allies’ abilities to coordinate attacks .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/triangle-strategy-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/triangle-strategy-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 8.1 / 10 64-bit",
        "Processor": "AMD A8-7600 / Intel Core  i3-3210",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon RX 460 / NVIDIA GeForce GTX 950 / Intel Iris Xe  G7",
        "DirectX": "Version 11",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "RPG, Simulation, Strategy",
        "Developer": "Square Enix, ARTDINK",
        "Platform": "PC",
        "Game Size": "8.1 GB",
        "Released By": "TENOKE",
        "Version": "Build 9842040 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/wofn75finax6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/triangle-strategy-preinstalled-steamrip.jpg"
}