{
    "page_url": "https://steamrip.com/tribes-of-midgard-free-download-2i/",
    "title": "Tribes of Midgard Free Download",
    "description": "Season 2: Serpent Saga is now live, pitting you and your Tribe against the perils of the uncharted seas! Sail across the previously unexplored seas to discover new islands and battle their fierce inhabitants. But beware a new Saga Boss awaits you if you can uncover the secrets of its lair.\nEquip powerful new runes, dazzle in new weapons and armors, and put your new-found swimming skills to use to take on these new challenges and earn new season rewards Plus, get in the holiday spirit during our limited-time Yule event from December 14 to January 3 to unlock special cosmetics, pet, and more Tribes of Midgard is a co-op game with a unique blend of action, survival, and roguelite elements.\nPlayers must defend their village from hordes of invaders —deadly spirits and gigantic brutes—that every night threaten to destroy the Seed of Yggdrasil, the sacred tree you’re sworn to protect. Only by protecting the Seed, you and your tribe can stop Ragnarök—the end of the world Venture with your tribe into the untamed wilds of Midgard to gather precious resources, hunt mythical beasts , defeat mighty foes, topple giants, and claim treasures.\nThe further from the village you explore, the greater the challenge and greater the rewards—which you’ll need to stand against the ever-strengthening minions of the apocalypse. But you must return before the sun sets so you can bolster your defenses, craft powerful equipment, and fend off the nightly assaults.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/tribes-of-midgard-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/tribes-of-midgard-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64 Bits",
        "Processor": "Intel Quad Core i5-2300 or AMD FX-6300",
        "Memory": "8 GB RAM",
        "Graphics": "Nvidia GeForce GTX 560 (1GB) or AMD Radeon HD 7770 (1GB)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Norsfell",
        "Platform": "PC",
        "Game Size": "5.7 GB",
        "Co-op By": "Online-fix.me",
        "Version": "v5.01-21622 | full version (Latest) + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/styjb7u0ep3e",
        "https://pixeldrain.com/u/vpaUsAjj"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/tribes-of-midgard-preinstalled-steamrip.jpg"
}