{
    "page_url": "https://steamrip.com/trinity-trigger-free-download-1t/",
    "title": "Trinity Trigger",
    "description": "Step into the world of Trinity Trigger, an all-new action role-playing game combining the look and feel of iconic RPGs of the ‘90s with a modern emphasis on fast-paced, customizable combat . As Cyan, a young man burdened by the gods with the mantle of Warrior of Chaos and an inevitable clash against the Warrior of Order, players will set out on a grand adventure to defy fate and save Trinitia . Kanjozoku Game\nCyan and his companions Elise and Zantis are accompanied by strange creatures known as Triggers that can transform into eight types of weapons, and players can switch freely between the three characters to implement a solo combat strategy , or team up with up to two friends for local co-op.\nSolve puzzles and defeat enemies alone or with friends in local co-op as you traverse the dungeons of each Arma, towers made from the fallen weapons of the gods. Reveal hidden passages by exploring every last bit of Trinitia’s diverse biomes. Chat with townsfolk for clues to uncover the heavily guarded secrets held in these forests, deserts, snowfields , and more.\nMake expert use of the Weapon Wheel in battle to change between eight weapon types on the fly. Every enemy has a weakness finding and exploiting it is the key to victory. Trinity Trigger was inspired by the iconic RPGs of yesteryear, but its accessible and rewarding gameplay incorporates modern flourishes to make it an exciting new adventure for players of all ages.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/trinity-trigger-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/trinity-trigger-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or later",
        "Processor": "Intel® Core™ i5-6600 @ 3.3 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 980",
        "DirectX": "Version 11",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Action, RPG",
        "Developer": "FURYU Corporation",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "SKIDROW emu",
        "Version": "v1.0.5 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gf43v8v6ntwg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/trinity-trigger-preinstalled-steamrip.jpg"
}