{
    "page_url": "https://steamrip.com/trombone-champ-unflattened-free-download/",
    "title": "Trombone Champ Unflattened Directly Download",
    "description": "Trombone Champ: Unflattened, the BAFTA -nominated viral sensation, is back with a fully reimagined VR experience that’s all about letting you take center stage.\nFIND YOUR GROOVE Play the trombone your way—every note, every slide, every majestic honk is yours to control. You’re not just keeping up with the rhythm; you are the rhythm. Fruitbus\nA ROAD PAVED IN BRASS Toot your way through an all-new campaign packed with surprises, unlock fresh challenges, and climb the leaderboards on your way to glory.\nHOARD OF HORNS Amass a treasure trove of trombones, each one wilder than the last. With 20 unique designs at launch and plenty more on the horizon, there’s always another horn to hunt!\nIF YOU PLAY YOUR CARDS RIGHT Build your ultimate deck with 50 Tromboner Cards packed with absurd trivia and legendary trombone lore.\nTrombone Champ: Unflattened lets you wield your virtual trombone across over 50 tracks, spanning anthems , marches, classical bangers, and folk classics. Each piece is handcrafted to keep you honking and sliding to your heart’s content, with plenty of surprises and unlockables along the way to keep you coming back for more. Using both hands—one to slide and the other to “toot” with style—you’ll control every pitch and tone as the music follows your lead. Stick to the melody for high scores, or embrace the freedom to play however you like, anytime. With its all-new campaign, and collectibles, Trombone Champ: Unflattened lets you take center stage and make every note your own.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/trombone-champ-unflattened-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/trombone-champ-unflattened-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or higher",
        "Processor": "Intel i5-4590 / AMD Ryzen 5 1500X or greater",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 / AMD Radeon R9 290 or greater",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Casual, VR",
        "Developer": "Flat2VR Studios, Holy Wow Studios",
        "Platform": "PC",
        "Game Size": "1 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 17240520 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/bl06aqtej1he"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/trombone-champ-unflattened-preinstalled-steamrip.jpg"
}