{
    "page_url": "https://steamrip.com/tron-identity-free-download-1w/",
    "title": "Tron: Identity",
    "description": "In a new Grid, forgotten by its creator and left alone to evolve without User intervention , an unprecedented crime has been committed. The Repository stands at the center of this society. In the aftermath of a break-in, the future of this Grid hangs in the balance. Coal Mining Simulator\nTRON: Identity is a visual novel adventure following Query , a detective program tasked with uncovering the mystery of what was taken and by whom. Finding yourself in a world built on unstable foundations and filled with whispered knowledge, it’s up to you to question suspects and investigate your surroundings to piece together the truth .\nThe decisions you make will actively influence the story, with a multitude of possible outcomes, good and bad – all depending on your carefully chosen words. You’ll interact with a number of intriguing characters, and decide whether to ally with them, spurn them, or even derezz them. However you choose to deal with them, you’ll need to recover their lost memories in your search for answers, puzzling your way through defragging Identity Discs. The world of TRON is growing.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/tron-identity-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/tron-identity-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "1.4 GHz Intel Core i5",
        "Memory": "4 GB RAM",
        "Graphics": "Integrated",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Bithell Games",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "SKIDROW",
        "Version": "Build 10985724 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qiebxpywmmcx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/tron-identity-preinstalled-steamrip.jpg"
}