{
    "page_url": "https://steamrip.com/tunic-free-download-y1/",
    "title": "TUNIC Direct Free Download",
    "description": "Explore a land filled with lost legends, ancient powers , and ferocious monsters in TUNIC, an isometric action game about a small fox on a big adventure. Stranded in a ruined land, and armed with only your own curiosity, you will confront colossal beasts, collect strange and powerful items, and unravel long-lost secrets. Stories say that a great treasure is hidden somewhere in this land. Perhaps it lies beyond the golden door? Or somewhere deep beneath the earth?\nSome tales tell of a palace high above the clouds, and of ancient beings with incredible power. What will you find? During your travels, you’ll reconstruct the game’s Instruction Manual. Page by page, you’ll reveal maps, tips, special techniques, and the deepest of secrets. If you find every last one, maybe something good will happen. Dive into varied, technical combat. Dodge , block, parry, and strike Learn how to conquer a wide cast of monsters, big and small and discover useful new items to help you on your way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/tunic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/tunic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit only)",
        "Processor": "Intel Core i5-4300U or AMD Phenom II X4 975",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 550 Ti or AMD Radeon HD 4890",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Andrew Shouldice",
        "Platform": "PC",
        "Game Size": "1.7 GB",
        "Released By": "CODEX emu",
        "Version": "Build 10371237 |  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5phktofnwm43",
        "https://buzzheavier.com/lqr8wcqgczir"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/tunic-preinstalled-steamrip.jpg"
}