{
    "page_url": "https://steamrip.com/turbo-golf-racing-free-download-1j/",
    "title": "Turbo Golf Racing",
    "description": "Welcome to the future of motorsports . Feel the excitement of fast-paced arcade-style racing as you tee off with your friends in an exhilarating new way. Jump, flip, glide, boost, and dash with Turbo-charged cars and be the first to get your ball in the hole. Race with up to seven other competitors in a Grand -Prix style competition.\nHit the boost pads to charge past your rivals, take secret tunnels to outwit them, and fire missiles to stop them in their tracks. Keep track of your fastest times across all maps in time-trial and multiplayer. Compare your personal bests against friends and globally with course leaderboards Filthy Animals | Heist Simulator\nGet the edge over your rivals by unlocking and equipping Power Cores. Hit your ball further, fly faster, and use unique abilities such as Ground Stomp and Gravitate Ball and Roll. With a wide variety of Power Cores, fine-tune your setup to outwit your friends. Choose the car and ball that makes you stand out from the crowd. Enjoy endless paint options, and change your wheels, spoiler, shield, car body and boosters .\nUse the terrain to your advantage. Launch over the boost pads, and down the fairway. Avoid the rough and the sand traps. Bend your shots around trees and through canyons. Race to the green. Unlock items as you level-up and enjoy an ever-growing game with free regular updates that will bring new courses, new Power Cores, and new cosmetics.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/turbo-golf-racing-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/turbo-golf-racing-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (64 bit)",
        "Processor": "Intel i3-2100 or higher",
        "Memory": "4 GB RAM",
        "Graphics": "GTX 460",
        "Network": "Broadband Internet connection",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Action, Racing, Sports, Early Access",
        "Developer": "Hugecalf Studios",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Multiplayer By": "Online-fix.me",
        "Version": "v17416 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/07im2kud4pwr"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/turbo-golf-racing-preinstalled-steamrip.jpg"
}