{
    "page_url": "https://steamrip.com/twilight-survivors-free-download/",
    "title": "Twilight Survivors",
    "description": "A time-limited survival game infused with rogue-lite elements and an adorable art style! The world has plunged into darkness, and you are its sole beacon of hope. Will you endure until dawn, or succumb to multiple deaths in your quest? Fear not, for it is possible to collect more coins to enhance yourself. Features characters and monsters in full 3D, along with stunning effects. Rock Star Life Simulator\nWith its novel, cute characters and monsters, there are hints of warmth even in the darkness across three different types of terrain. Plains! Snowy mountains ! Deserts! And More Take your time to unlock 20+ weapons, 20+ skills, and combine them to create over 20 super weapons. Mow your enemies down in the most magnificent style possible. Every character has unique weapons and individual Talent Trees, each with their own strengths and weaknesses . Find your favorite character, and challenge yourself by trying out different ones!Spend coins to strengthen your characters with the self-contained Talent Tree, Kwent Card, and Lore system. Create a unique gaming experience that’s yours alone.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/twilight-survivors-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/twilight-survivors-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i3-7400 / AMD Ryzen 1300X",
        "Memory": "8 GB RAM",
        "Graphics": "UHD630 @1080P",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, RPG",
        "Developer": "DORIDORI STUDIO",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kvnihtvrh2cb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/twilight-survivors-preinstalled-steamrip.jpg"
}