{
    "page_url": "https://steamrip.com/two-point-hospital-free-download-1w/",
    "title": "Two Point Hospital Free Download Direct Link",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful – or functional – healthcare operation in the whole of Two Point County. Optimise your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings as you look to get as many patients through the door as possible. Place decorative and functional items around your hospital to improve its prestige, lower patient boredom, increase happiness and keep those end of year awards flowing in.\nDon’t expect Two Point County to be populated with your usual types of patients . In this world, you’ll experience all kinds of unusual illnesses; from Light-headedness to Cubism – each requiring their very own special type of treatment machine. Diagnose illnesses, build the right rooms to handle them, hire the right staff, and then get ready, because curing just one of these illnesses is just the beginning. You can handle a single patient – but can you handle a Pandemic? Once you’ve conquered an illness, research improved cures and machines and turn your hospital into an unstoppable healthcare juggernaut .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/two-point-hospital-freedownload-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/two-point-hospital-freedownload-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64-bit",
        "Processor": "Intel Core i3 6100 or AMD FX-4350",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA Geforce GT 1030, 2GB (Legacy: NVIDIA GeForce GTX 460), AMD RX550, 2GB (Legacy: AMD",
        "Radeon": "HD 6850), Integrated: Intel HD Graphics 630",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Two Point Studios",
        "Platform": "PC",
        "Game Size": "3.8 GB",
        "Released By": "FLT",
        "Version": "v1.29.36 | + 15 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fawxuf811l8h"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/two-point-hospital-free-download-preinstalled-steamrip.jpg"
}