{
    "page_url": "https://steamrip.com/tyrants-blessing-free-download-1v/",
    "title": "Tyrants Blessing",
    "description": "The Tyrant landed in Tyberia bearing promises of a paradise, without war, without suffering and without death. All Tyberians had to do in order to enter his paradise was to simply die at the hands of his Dead Army. The war was over before it even began, with thousands perishing in the Tyrant’s wake, only to be brought into his fold as undying thralls, bound by magic.\nThe few living warriors left are scattered across the remnants of their homeland, tirelessly looking for a way to turn the tables on the tyrannical Tyrant. Lead a great Uprising, defeat the Dead Army, and drive the monstrous overlord back into the depths of the sea from whence he came. Tyrant’s Blessing is a tactical turn-based game where your ability to plan, adapt, and strategize is more important than min-maxing your units or finding the sharpest sword in the hoard. West of Loathing\nSelect battles every day, make challenging choices, and cleverly use the strengths of these rag-tag insurgents to defeat the undead hordes and maybe – just maybe – bring real life back to Tyberia. Before you bring the battle to the Tyrant’s doorstep, you’ll have to make sure you live long enough to reclaim the Island. Decide whether to fight, rescue the living from the Undying, or gather your strength. Every choice matters throughout every day of the Uprising.\nAs you fight your way across the face of Tyberia, face off against random encounters that force difficult decisions. Do you intervene and fight highwaymen, putting your warriors at risk? Do you try to save a child, risking valuable time and resources? Only your morals and ideals hold the answer. Pick your heroic roster carefully. Screeg, the elder wizard advising the Uprising, can only teleport three heroes and a pet at once: Do you send your elite warriors in? Or rookies to train and hold the line? Are they up to the task? Can you handle the consequences?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/08/tyrants-blessing-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/08/tyrants-blessing-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista/7/8/10",
        "Processor": "2 GHz or better",
        "Memory": "1 GB RAM",
        "Graphics": "GPU Intel UHD  630"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Mercury Game Studio",
        "Platform": "PC",
        "Game Size": "645 MB",
        "Released By": "CHRONOS (cs.rin.ru)",
        "Version": "v1.0.588 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6h3rvd57ylnv"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/08/tyrants-blessing-preinstalled-steamrip.jpg"
}