{
    "page_url": "https://steamrip.com/uboat-free-download-u1/",
    "title": "UBOAT",
    "description": "UBOAT is a simulator of a submarine from WWII era, yet different than all you have seen so far. It is a survival sandbox with crew management mechanics while its primary theme is life of German sailors. The boat is their home , but it can become their grave at any time.\nIn UBOAT you control the crew in order to control the boat. You look after their physical and mental health, because if the sailors are hungry, tired and their spirit is low, there’s no chance of winning even a skirmish. Survival\nThe extensive damage system is a foundation of the game’s survival elements. Unprecedented situations are bound to happen as the effect of received damage, testing player’s creativity and ability to stay calm. You can try to save the whole crew or leave someone behind, to save the others.\nWhile your ship travels through the open seas, you will often find yourself being on your own. Use your management skills to spend resources taken on the trip optimally and in special cases try to recover them on the sea, by asking your allies for the help or by looting wreckages of enemy ships.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/08/uboat-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/08/uboat-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 64 Bit / Windows 8 64 Bit / Windows 10 64 Bit / Windows 11 64 Bit",
        "Processor": "Core i3 3.1 GHz or AMD Phenom II X3 2.8 GHz",
        "Memory": "6 GB RAM",
        "Graphics": "GeForce GTX 750 Ti 2GB (1080p Low) or AMD equivalents",
        "DirectX": "Version 11",
        "Storage": "71 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Simulation, Strategy",
        "Developer": "Deep Water Studio",
        "Platform": "PC",
        "Game Size": "27.4 GB",
        "Released By": "RUNE emu",
        "Version": "2025.1 Patch 3 (Build 17092610) | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/6471CDAE87",
        "https://datanodes.to/f7xg6t2allcr/UBOT-SteamRIP.com.rar",
        "https://buzzheavier.com/stih6mtc9v8t"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/08/uboat-preinstalled-steamrip.jpg"
}