{
    "page_url": "https://steamrip.com/ultimate-epic-battle-simulator-2-free-download-h1/",
    "title": "Ultimate Epic Battle Simulator 2",
    "description": "Welcome to Ultimate Epic Battle Simulator 2, the most ridiculous and insane battle simulator in existence Create eye watering battles with hundreds of thousands, and even millions of characters on screen! Sandbox mode will return, with infinite army sizes and far greater flexibility than ever. Command your armies in RTS mode with full drag select army control, or get the job done yourself and play as any one of the units in 3rd or 1st person.\nIn coming updates for early access, jump into multiple story and player driven campaigns or make your own and share them with your friends FPS invasion will also be returning soon, where you play through the eyes of a soldier fighting off hordes of zombies in first person. 911 Operator\nLets not ignore the elephant in the room UEBS2 features revolutionary new crowd rendering and AI technology which uses pure GPU POWER to bring nation size battles to life! Witness the first game to fully utilize full GPU acceleration for every AI individual and all the technology behind the crowd tech. UEBS2 handles 100 times more characters on screen than its predecessor, and in far greater detail and quality. Details were not ignored, every individual has highly advanced decision making and animation, all while working together for a greater goal.\nWe are also working hard on our own ‘mass’ GPU physics engine. Our hope is to bring physics to a scale never before seen, which may allow thousands of ragdolls , and millions of physics based objects. Keep in mind, our physics engine is in very early development so we can’t make any guarantees.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/ultimate-epic-battle-simulator-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/ultimate-epic-battle-simulator-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 Bit Windows Operating System.",
        "Processor": "Intel i5-4590 @ 3.3GHz (4th Generation) or AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "3 GB graphics card – DX 11.1 compatible(See Steam forum for details)",
        "DirectX": "Version 11",
        "Storage": "20 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Casual, Indie, Simulation, Strategy",
        "Developer": "Brilliant Game Studios",
        "Platform": "PC",
        "Game Size": "12.4 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.0 Fix | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tuf5et8zeifj",
        "https://gofile.io/d/3ywoRk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/ultimate-epic-battle-simulator-2-preinstalled-steamrip.jpg"
}