{
    "page_url": "https://steamrip.com/ultimate-admiral-dreadnoughts-free-download-1t/",
    "title": "Ultimate Admiral Dreadnoughts",
    "description": "Ultimate Admiral: Dreadnoughts aims to be the first game of its kind – a true naval warfare game – which offers a unique opportunity to design and build countless variations of realistic looking warships combined with an extremely in-depth and realistic combat model.\nWe are absolutely excited with what we are making and we hope everyone who is interested about the dreadnought era and naval warfare, will join our ambitious project and support us. Become the architect of powerful warships, from small torpedo boats to mighty Battleships Recreate famous ships such as the HMS Dreadnought and countless speculative designs. Pick turret layout, armor scheme, funnel placement, tower variations making each ship look and feel unique. Pikuniku\nTheir hull characteristics, internal upgrade selection and weight distribution not only modifies their speed and maneuverability but also their weapon effectiveness . Every design detail of your warships has a significant effect on the combat capability of your ships. Naval combat becomes immersive and feels even more realistic when your opponent is able to react to your actions with a human-like and unexpected behavior.\nThe AI evaluates the optimal engagement distance, using principles of the “ Immunity Zone” and comparing its own firepower versus your ships. The AI uses ammunition wisely, holding fire when necessary or switching shell types according to the armor protection of the target. Unless there is a special mission directive, the AI will not act suicidally and will attempt to withdraw, if its fleet becomes heavily damaged or it is much weaker than yours.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/ultimate-admiral-dreadnoughts-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/ultimate-admiral-dreadnoughts-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7",
        "Processor": "Intel Core i5-2500K 3.3GHz, AMD Phenom II X4 940",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 660, AMD Radeon HD 7870",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Game-Labs",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.6.0.8 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/m21m5y6l1zvn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/01/ultimate-admiral-dreadnoughts-preinstalled-steamrip.jpg"
}