{
    "page_url": "https://steamrip.com/ultra-age-free-download-1j/",
    "title": "Ultra Age",
    "description": "In a distant future, where ecosystems have been destroyed and resources have become depleted due to the collapse of fusion power generation, Age, a member of Orbit, receives an order to “survey the ground In 3174, when the Earth’s resources have been depleted and ecosystems destroyed by meteors, humans are divided into the ones who escaped the Earth and settled in the space colony ‘ Orbital Arc’ and the others who settled in the Earth’s ‘Shelter’ facility. When all supplies sent from Shelter to Orbital Arc are cut off, humankind begins an experiment to find the last hope. The Stanley Parable: Ultra Deluxe\n‘Age,’ a young, sword -wielding warrior falls from Orbital Arc to Earth, and embarks on a journey with his android ‘Helvis’ to find the essential key to the survival of humanity. Using a variety of blades’ power and agility, you can execute fast, stylish combos and deliver devastating burst attacks to annihilate foes. Flow between a variety of attacks by mixing ground and aerial attacks, including air combos, enemy pulls and more. Quick attribute identification and manipulation are essential to defeat different types of enemies .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/ultra-age-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/ultra-age-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-3470 or AMD FX-8350",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GeForce GTX 770, 2 GB or AMD Radeon R9 280, 3 GB",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG",
        "Developer": "Next Stage Inc., Visual DART Co., Ltd",
        "Platform": "PC",
        "Game Size": "4.8 GB",
        "Released By": "FLT",
        "Version": "Build 8630330 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/0hdibeut6ku6"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/ultra-age-preinstalled-steamrip.jpg"
}