{
    "page_url": "https://steamrip.com/ultros-free-download-u1/",
    "title": "Ultros",
    "description": "You wake up stranded, after seemingly crashing your ship on The Sarcophagus — a giant , space-drifting, cosmic uterus holding an ancient demonic being known as ULTROS. Trapped in the eternal loop of a black hole, you will have to explore The Sarcophagus and meet its inhabitants to understand the part you play.\nULTROS is set in a multifaceted realm – a vast alien landscape teeming with life. Grounded in science fiction, ULTROS comes wrapped in an eccentric art style and a mystical soundtrack from the visionary El Huervo, renowned for his work on Hotline Miami. ULTROS explores meta-themes of mental health, life, death, and karmic cycles through deep lore and environmental storytelling .\nExperience brutal, intimate, close-quarter combat with cosmic lifeforms, driven by a sense of urgency – where precision is paramount and every cut of your blade counts. Yet this intense combat is juxtaposed with cultivating the greenery and tending to plant life in The Sarcophagus, providing precious moments of contemplation and peace. In turn, this grants deeper access to obscured paths.\nThe rich world of ULTROS holds many secrets for those curious enough — and fearless enough — to seek them out. A unique loop-based mechanic will allow you to start over at key moments in the story, providing opportunities to unfold such secrets, unlock different areas of the world and new abilities on a branching skill tree. Experiment with and master your own specific fighting style as you explore the world of ULTROS. Each loop brings you closer to the truth",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/ultros-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/ultros-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core i5 (5th Gen)",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GT 750M",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Hadoque",
        "Platform": "PC",
        "Game Size": "2.8 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 13312373 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/adnc42byu06v"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/ultros-preinstalled-steamrip.jpg"
}