{
    "page_url": "https://steamrip.com/uncharted-legacy-of-thieves-collection-free-download-h1/",
    "title": "UNCHARTED LOTC Directly Download",
    "description": "Seek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection . Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, and over the top moments of the beloved thieves – Nathan Drake and Chloe Frazer.\nIn an experience delivered by award winning developer Naughty Dog, the UNCHARTED: Legacy of Thieves Collection includes the two critically-acclaimed, globe-trotting single player adventures from UNCHARTED 4: A Thief’s End and UNCHARTED: The Lost Legacy. Each story is filled with laughs, drama , high octane combat, and a sense of wonder – remastered to be even more immersive.\nDiscover the breath-taking sights\nFrom thick jungles to snow-capped mountains , exotic islands to rain-soaked streets, explore every inch of stunningly beautiful environments in spectacular detail. Immerse yourself in the cinematic storytelling with super-sharp 4K resolution, and Ultra-Wide Monitor support. Enjoy a host of enhanced graphical adjustment features such as adjustable Texture and Model Quality, Anisotropic Filtering, Shadows, Reflections and Ambient Occlusion.\nFeel the thrilling gameplay in your hands\nExperience haptic feedback and dynamic trigger effects designed for UNCHARTED: Legacy of Thieves Collection by playing with the DualSense controller through a wired connection to your PC. For those that want to brighten things up even more, try out RGB support for Razer Chroma peripherals and Chroma Link compatible devices, as well as for Logitech models. You can also check previous posted game Potionomics .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/uncharted-screenshot-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/uncharted-screenshot-1-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel i5-4330, AMD Ryzen 3 1200",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 960 (4 GB), AMD R9 290X (4 GB)",
        "Storage": "126 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Shooter, Third-person",
        "Developer": "Naughty Dog LLC, Iron Galaxy Studios",
        "Platform": "PC",
        "Game Size": "80 GB",
        "Released By": "CODEX Emu + Steamless (Ty InsaneRamZes)",
        "Version": "v1.3.20900.0 (Build 10158704) | Full  Direct play + Update",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/1D517835CA",
        "https://buzzheavier.com/lnbo0bforf7e",
        "https://1fichier.com/?s5xpo0e6gu8szw1sc4sa"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/uncharted-featured-image-steamrip.jpg"
}