{
    "page_url": "https://steamrip.com/uncle-chops-rocket-shop-free-download/",
    "title": "Uncle Chop’s Rocket Shop",
    "description": "On an asteroid-bound service station in an unfrequented space lane, Wilbur carves out a paltry living as a mechanic, repairing as many ships as he can to afford the ever-rising R.E.N.T payments to his corporate overlord, Uncle Chop. Where most of his customers find meaning in pastimes like worshipping deranged space gods, feeding random crap to a sentient black hole, endlessly digging for The Treasure or mentally enslaving donut shop workers, Wilbur lives a more humble life, fixing the galaxy’s ills one broken ship module at a time.\nFix Stuff Using a range of tools, diagnostic devices, parts and workshop appliances, you’ll be correcting faults in the modules of procedurally generated spaceships . From simple refuel jobs to total overhauls, get ready to frantically fumble, slice, loosen, tighten, grab and drop as you try to complete as many jobs as you can within each daily time limit. With a huge variety of ships and modules , your hands are gonna get real dirty real fast, in some real unusual places. Symphonia\nRead Stuff Flaunt your basic literacy by consulting manual pages for guidance on diagnosing and correcting faults in spaceship modules, as well as operating workshop appliances. And if basic literacy isn’t your bag, then at least you’ve got pretty diagrams to gawp at! All your IKEA furniture-assembly training has led to this moment.\nUpgrade Stuff Using whatever hard-earned pennies Uncle Chop doesn’t take from you, expand your workshop and kit it out with a range of workstations. From industrial devices to esoteric altars, these workstations will allow you to fix bigger and more lucrative ships.\nTalk About Stuff Interact with a diverse range of oddballs as you engage with both anthology-style storytelling and a multiple-ending, overarching narrative. The lore is (*consults notes*) ‘deep and rich and good’, with different factions you can choose to ingratiate yourself with – each with their own inane agendas .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/uncle-chops-rocket-shop-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/uncle-chops-rocket-shop-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "Intel Core i5 (Quad Core)",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA Geforce GTX 1050",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation",
        "Developer": "Beard Envy",
        "Platform": "PC",
        "Game Size": "2.2 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.4 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/5npd4lqpn6tt",
        "https://buzzheavier.com/4xp8hzqgq0np"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/uncle-chops-rocket-shop-preinstalled-steamrip.jpg"
}