{
    "page_url": "https://steamrip.com/underground-blossom-free-download-1l/",
    "title": "Underground Blossom Directly Download",
    "description": "Descend into the Rusty Lake Underground and travel through the life and memories of Laura Vanderboom Travel from station to station, each metro stop symbolising a piece of Laura’s past and future. Solve various puzzles, find the correct metro to board and uncover one of Laura’s timelines, while simultaneously helping her make sense of her life and escape the corruption of her mind Underground Blossom is a new point-and-click adventure developed by the creators of the Cube Escape & Rusty Lake series. SUPER BOMBERMAN R 2\nEnjoy a classic Rusty Lake point-and-click puzzle adventure with a gripping story full of mysteries and, of course, puzzles. Travel to 7 unique metro stations, each station a representation of Laura Vanderboom’s life, memories and potential future. The estimated travel time is 2 hours. Unravel the potential secrets hidden in each metro station, earn achievements and who knows what else you might stumble upon At each metro stop you will be greeted by an atmospheric soundtrack by Victor Butzelaar , including a cellist performance by Sebastiaan van Halsema",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/underground-blossom-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/underground-blossom-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft® Windows® 7,8, 10 or later",
        "Processor": "2.4GHz Dual Core",
        "Memory": "1 GB RAM",
        "Graphics": "Direct X 9.0c compatible video card",
        "DirectX": "Version 9.0c",
        "Storage": "200 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Rusty Lake",
        "Platform": "PC",
        "Game Size": "207 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.1.13 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3ggyp6ej99kz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/underground-blossom-preinstalled-steamrip.jpg"
}