{
    "page_url": "https://steamrip.com/undying-free-download-u1/",
    "title": "UNDYING",
    "description": "Caught amid the zombie apocalypse and with time running out, Anling will stop at nothing to ensure her son, Cody, gets to safety. Enduring countless perils, including the zombie infection that’s beginning to take over her body, not to mention teaching Cody how to survive their harsh new reality. As Anling and Cody explore the world they’ll come across an ensemble of characters that present unique challenges. HoloParade\nHow Anling and Cody handle each one determines their fates, some may die, some may live, and some may become staunch allies or even an archnemesis . Will humanity truly prevail? With everyone trying to survive, whether you help others or not can lead to devastating consequences. Everyone has their secrets, which begs the question… Who can you really trust?\nEvery decision you make changes the outcome of your story, what will your ending look like? It’s not a survival game if there’s no crafting and now, with so many things to craft and enhance, it’s a wonder if there’ll even be enough resources How you use the crafting system will determine if you survive or not, and how easy it will be.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/12/undying-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/12/undying-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 SP1, Windows 8.1 or Windows 10",
        "Processor": "Intel® i3-3220, AMD FX 6300 equivalent or better",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce® GTX 650 equivalent or better",
        "Storage": "1500 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Vanimals",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "TENOKE",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/50u6yicnfrpz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/12/undying-preinstalled-steamrip.jpg"
}