{
    "page_url": "https://steamrip.com/unity-of-command-ii-free-download-o1/",
    "title": "Unity of Command 2",
    "description": "Built on a brand new bespoke 3D engine, the game retains Unity of Command’s signature art style and delivers highly polished fluid gameplay. Easily accessible yet hard to master, Unity of Command II is the highly anticipated sequel to the cult classic that’s been turning novice players into battle-hardened grognards since 2011. Unity of Command II lets you take command of Western Allies during the Second World War.\nYou will manage your army’s divisions as well as their supply and logistics . For the first time in Unity of Command you will face Fog of War. Reveal the unknown by capturing enemy soldiers and launching recon to gather intel on enemy troop positions. Enemy panzers will seek to capture your units’ stragglers — regroup and strike back Dynamic Campaign — Rewrite the history of the Second World War with a branching campaign where no two playthroughs are alike. Legends of Kingdom Rush\nHeadquarters — This new feature places army headquarters on the map, from which you will direct unit reorganization, bridging and resupply. Headquarters are not only essential to reinforcing and recovering lost unit strength, but are also able to deploy special abilities such as Emergency Supply, Motorizing units using HQ trucks, and many more.\nTheater Assets — This feature from the original game is greatly expanded in Unity of Command II. Wreak havoc behind enemy lines by sabotaging infrastructure. Order your aircraft to provide aerial recon, deliver devastating bombing runs, or sustain units behind enemy lines using air supply assets.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/unity-of-command-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/unity-of-command-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10 or newer (64-bit)",
        "Processor": "Dual core processor",
        "Memory": "4 GB RAM",
        "Graphics": "OpenGL 3.3+ supporting GPU with 1GB VRAM",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "2×2 Games, Croteam",
        "Platform": "PC",
        "Game Size": "2 GB",
        "Released By": "FLT",
        "Version": "Build 9107189 | Full  + Update 18 + 5 DLCs + 2 Bonus Soundtracks + Windows 7 Fix",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/kewmjuis6ro1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/unity-of-command-2-preinstalled-steamrip.jpg"
}