{
    "page_url": "https://steamrip.com/united-penguin-kingdom-free-download/",
    "title": "United Penguin Kingdom",
    "description": "Build your settlement and satisfy the needs of your penguins with better food, elegant decorations, entertainment venues , high-tech coolers, and luxury houses while dealing with killer whales and thief seals.\nDesign your penguin settlement Shape a settlement worthy of your penguins. Set up new energy generators to activate more houses, workplaces, and coolers. Build workplaces to produce materials, food , and medicine. New Star GP\nProtect your settlement Build defense towers against killer whales and thief seals. Killer whales attack your buildings and try to destroy them. Seals come to the food storages to steal food.\nHappy and educated penguins Build some entertainment venues and let your penguins enjoy skating in the ice rinks, watching films at cinemas, playing video games in the game centers, racing in the karting tracks, exercising at gyms and in the fight clubs, visiting the museums, doing yoga, etc. Don’t forget to focus on the spirituality of your penguins and increase their happiness with shrines and wishing wells. Focus on education and provide enough seats for your penguins at schools, high schools, and libraries. Make a huddle-up call to gather all your penguins and celebrate together.\nFocus on economy Please be careful with spending your gold and focus on finding ways to earn more. Purchase or make barter to reach rare resources, sell your products to increase wealth, and grow your settlement . If you become the king, you can use continuous trades with the help of your bazaars .\nBecome the King Reputation score is the overall evaluation of your settlement in the kingdom . Meet the requirements, improve your reputation, and cheer up your penguins to level up from a village to a king. Become the king to explore new lands, find new settlements, and decide their joining approval to the kingdom.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/united-penguin-kingdom-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/united-penguin-kingdom-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7 64-bit | Windows 8 64-bit | Windows 10 64-bit",
        "Processor": "Intel Core i3-6100T | AMD FX-6100",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 650 | AMD Radeon R7-250X",
        "Storage": "850 MB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "Turquoise Revival Games",
        "Platform": "PC",
        "Game Size": "982 MB",
        "Released By": "Goldberg Emu",
        "Version": "v1.004",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/u36vjbl111lk"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/united-penguin-kingdom-preinstalled-steamrip.jpg"
}