{
    "page_url": "https://steamrip.com/universe-for-sale-free-download-n1/",
    "title": "Universe For Sale Directly Download",
    "description": "A space station nestled in the clouds of Jupiter . A bizarre bazaar where a young, worried woman crafts entire universes in the palm of her hand. A mysterious cultist who’s stripped the flesh from his bones in order to reach enlightenment. Here, there’s a universe for sale. You buying? Bluey: The Videogame\nUniverse for Sale is a hand-drawn adventure game set in the dense clouds of Jupiter, where sapient orangutans work as dockhands and mysterious cultists strip the flesh from their bones in order to reach enlightenment.\nExplore all the nooks and crannies of a ramshackle colony on Jupiter. Rickety tea houses, strange oddity shops, and overworked mechanics garages abound in the picturesque and infamous shantytown that’s cropped up around the abandoned mine. Every new face, whether human, simian, skeletal or robotic, has a unique story to tell as they do their best to survive the acid rain pouring down.\nThe nameless master, intrigued by stories of Lila’s ability to create universes, finds her on a rainy night to discuss the unique power that she has. For something so awe-inspiring, she explains it like she’d explain how to brew coffee. But it isn’t just the master who wants to know more about Lila, who threatens to unravel the mystery at the heart of Universe for Sale.\nSo, choose a cup, find some ingredients and Lila will craft a universe down to your particular specifications. Only question is: You buying?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/11/universe-for-sale-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/11/universe-for-sale-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel Core i-3",
        "Memory": "4 GB RAM",
        "Graphics": "Any  card with more than 2GB of Storage Space.",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Tmesis Studio",
        "Platform": "PC",
        "Game Size": "1.2 GB",
        "Released By": "GOG",
        "Version": "Build 12716261 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ayg2i4k2hrdt"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/11/universe-for-sale-preinstalled-steamrip.jpg"
}