{
    "page_url": "https://steamrip.com/unrailed-2-back-on-track-free-download/",
    "title": "Unrailed 2: Back on Track",
    "description": "Unrailed 2: Back on Track brings chaotic local and online multiplayer track-building action to the next level – band together with friends to collaborate and build your track across new procedurally generated worlds – WHILST the train is running! So think fast, with more freedom than ever before, and conquer new obstacles in your way – before your trains becomes a trainwreck METAL GEAR SOLID V: GROUND ZEROES\nYOUR JOURNEY GETS BETTER AND BETTER\nEvery excursion your crew undertakes feels increasingly meaningful, with new rewards and permanent upgrades granting you character with gameplay-modifying abilities, as well as new train engines, wagons and extensions to unlock, giving you the tools to build a multitude of train configurations to play and experiment with. Each locomotive loss is an opportunity to rebuild and get back on track!\nCHOOSE YOUR TRACK\nThe game offers five biomes in total at launch. Each biome has it’s own unique game mechanics and a boss to beat at the end. On your journey you can find a whole bunch of different kinds of stations to upgrade your train with new wagons or by equipping cartridges to get access to new abilites. And of course there’s a bunch of characters and equipment to unlock.\nCREATE, SHARE AND PLAY WITH THE COMMUNITY\nThe all-new Terrain Conductor mode allows you unleash your imagination to create your very own custom maps and share these with the Unrailed community – with highlights being featured by the developers. Or if creating isn’t your thing, browse the limitless creations other players have built, so the frantic fun never ends",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/11/unrailed-2-back-on-track-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/11/unrailed-2-back-on-track-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel i5-6200U or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "Intel HD  520 or equivalent",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Casual, Indie, Simulation, Strategy, Early Access",
        "Developer": "Indoor Astronaut",
        "Platform": "PC",
        "Game Size": "380 MB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "Build 18112024 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fnqn6oz4iutg"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/11/unrailed-2-back-on-track-preinstalled-steamrip.jpg"
}