{
    "page_url": "https://steamrip.com/until-then-free-download/",
    "title": "Until Then",
    "description": "Until Then is sold by its developers as a mystery game of sorts. Its synopsis says that Mark, the game’s main character, finds himself caught in a chain of events where he must figure out a mysterious truth amidst strange disappearances and unreliable memories .\nHowever, after playing the game to completion, I must admit that I am confused by this choice of description . There is some truth in that there are unknown reasons for certain things happening within the plot, but it is such a minuscule part of the story that it never felt like it was actually important. If anything it feels more like a subplot that takes a back seat to the overarching point the game is really trying to make. Lords and Villeins\nAnd what’s that point you may ask? Well, I’d say that Until Then was meant to teach us the different ways people deal with feelings such as loss, loneliness , and abuse, especially during particularly trying times, and how there really isn’t a right way to do so.\nThe exploration of these themes is where this game truly shines. It does a fantastic job of mirroring the same emotions in different ways through its various characters. It also takes its time giving them depth and unraveling them, so that when the twists happen you are left feeling like, “Oh I didn’t see this coming but it makes sense.”\nNow, what makes the game succeed is the same thing that bogs it down, which is quite unfortunate. What I mean by this is that you start the game kind of expecting this overarching mystery , but the story is very slow to pick up and it really doesn’t begin to have much of a connection until chapter three and beyond.\nInstead, you are treated to individual moments with Mark and his friends that lead to their growth or deeper understanding of their feelings, but you don’t appreciate how important this exposure is until after you find out the twists at the end of the story.\nI’d say that as a mystery, this game would come off as poorly written, but as a coming-of-age story where you’re meant to come to terms with your demons and so are those around you, it’s great.\nIn terms of characters, it’s hard to properly gauge most of them because while a lot of them are introduced, the story really only focuses on four of them. The four it does focus on I really liked. Cathy , Mark’s best friend, was a particular favorite and her arc had me in tears by the end. Louise and Nicole both felt like similar characters to me. Hard to understand even when they tried to express themselves, but their interactions with Mark were really meaningful and I enjoyed the way they got him to open up.\nMark himself was a great main character and his revelation near the end actually took me by surprise . It was great to see his growth. Even if it took him to painful places, he was always willing to try which made me want to root for him. There were plenty of honorable mention characters like Sofia and Ridel, but they are given little screen time as far as the story goes so all I can say is I liked them when I did see them.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/until-then-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/until-then-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows 7",
        "Processor": "Intel Core i5-4460 / AMD FX-8320",
        "Memory": "4 GB RAM",
        "Graphics": "GeForce GTX 750 Ti / Radeon R7 260",
        "Storage": "3 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Polychroma Games",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "Build 16523932 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/8h1df3e1qxf9",
        "https://buzzheavier.com/w1rtoqdvnmsd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/until-then-preinstalled-steamrip.jpg"
}