{
    "page_url": "https://steamrip.com/untitled-goose-game-free-download-1j/",
    "title": "Untitled Goose Game Download",
    "description": "Get Untitled Goose Game PC game for free instantly and play pre-installed on SteamRiP\nIt’s a lovely morning in the village and you are a horrible goose. Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples’ back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day. You can now enjoy Untitled Goose Game with a friend, in a new two-player cooperative mode.\nPlay through the whole game as two horrible geese, honking twice as much, teaming up to plan pranks, and generally ruining everyone’s day, together . You have a huge village at your disposal, with streets, inhabitants, their gardens and yards, houses and more. What are you going to do? Would you like to steal the laundry from the rope in the yard, or have a lunch prepared by a young couple? You can do whatever you want, and it is in your power to spoil the life of the farmers so much that after a while they will all dream of catching you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/07/untitled-goose-game-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/07/untitled-goose-game-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 SP1 64-Bit",
        "DirectX": "Version 10",
        "Storage": "830 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "House House",
        "Platform": "PC",
        "Game Size": "357 MB",
        "Released By": "DRM-Free",
        "Version": "v1.1.4 | Updated Version",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/sxctnbjhkmu9"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/07/untitled-goose-game-free-download-torrent-steamrip.jpg"
}