{
    "page_url": "https://steamrip.com/until-dawn-free-download/",
    "title": "Until Dawn",
    "description": "When eight friends return to the isolated lodge where two of their group vanished a year prior, fear tightens its icy grip, and their mountain retreat descends into a nightmare with no escape. Face your fears and determine who survives Until Dawn in this seminal horror classic, rebuilt and enhanced for PC.\nCult horror rebuilt Immerse yourself in a gripping slasher horror rebuilt from the ground up with stunning visuals in Unreal Engine 5. Enhanced by movie-like cinematography, refined gameplay mechanics and more, venture into a thrilling exploration of an isolated mountain where nothing is as it seems. KILL KNIGHT\nTheir fate in your hands Create your own gripping tale as you control a group of unique characters portrayed by an all-star cast, including Hayden Panettiere, Brett Dalton, and more, and decide their fate through your choices. Through dynamic animations and nuanced facial-capture performances , learn what makes each character tick, and who among the group has what it takes to survive .\nTerror never looked so good Explore a rich and detailed environment that will leave you breathless with every step. With new visual enhancements for PC, the original game has been rebuilt from the ground up – utilizing cutting-edge visual technology to bring the nightmare to life.\nRebuilt for a new generation Discover new collectibles, all-new environments to investigate , and re-cut narrative sequences that deepen the mystery further. Get closer to the action with an all-new, immersive third-person camera, and enjoy a brand-new musical score and reauthored audio that’ll keep you on the edge of your seat throughout the journey.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/until-dawn-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/until-dawn-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10, 11",
        "Processor": "Intel Core i7 4790K / AMD Ryzen 5 1500x (or similar processor with AVX support)",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1660 / Radeon RX 470 (or equivalent card with minimum 6GB VRAM)",
        "Storage": "70 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Ballistic Moon",
        "Platform": "PC",
        "Game Size": "58.6 GB",
        "Released By": "RUNE emu",
        "Version": "v1.08 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/dGBfUU",
        "https://datanodes.to/qro14f27tat4/Until-Dawn-SteamRIP.com.rar",
        "https://buzzheavier.com/2rjqj0fvgd0f"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/until-dawn-preintalled-steamrip.jpg"
}