{
    "page_url": "https://steamrip.com/until-we-die-free-download-1d/",
    "title": "Until We Die Download Direct Link",
    "description": "Until We Die is a base defense strategy game. Your base is the subway station, it’s underground part. You’ll have to defend it against all sorts of things, brought in by meteorites. To win, you have to survive for about 30 game days, fending off all the attacks on the base. At first, it’ll be small packs of creatures, and by the end, you’ll have to fight a sweeping horde of mutants . Also, the game will end early if our hero, Ivan, dies or if the power generator, the heart of the base, is destroyed. Until We Die is not a conventional strategy game.\nHere you have to run around as Ivan and dispense ass-kicking valuable orders to your subjects. There’s no advanced AI. Humans are reluctant to take the initiative, and those lazy bastards don’t want to do anything on their own. And there’s a lot to do: building fortifications, researching technology to build even stronger fortifications and defend more effectively, sending expeditions to the surface, attacking mutant lairs to secure new land for farms and tents, gathering supplies from crates, and extracting food from mushrooms and anything else that looks edible wasn’t there a fat rat running down the tracks?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/until-we-die-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/until-we-die-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7",
        "Processor": "2.4 GHz Dual Core CPU",
        "Memory": "1 GB RAM",
        "Graphics": "GeForce GTX 660, Radeon R7 370 or equivalent with 2 GB of video RAM",
        "DirectX": "Version 9.0c",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Simulation, Strategy",
        "Developer": "Pixeye Games",
        "Platform": "PC",
        "Game Size": "300 MB",
        "Repack By": "N/A",
        "Version": "v2021.07.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/9tml8caltsma"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/until-we-die-free-download-pc-steamrip.jpg"
}