{
    "page_url": "https://steamrip.com/until-you-fall-free-download-1t/",
    "title": "Until You Fall Free",
    "description": "Get Until You Fall PC game for free instantly and play pre-installed on SteamRiP\nFrom the team behind I Expect You To Die, this arcade-inspired VR hack-and-slash roguelite will force you to find and master your own fighting style for hours of frantic, kinetic fun. Fight . Fall. Rise Again. Prepare for the fight of your life. Move your arms and body to the synthwave soundtrack as you attack, block, cast spells and dodge your way deeper into the heart of a neon fantasy world filled with magic-infused monsters. Dungreed\nEquip yourself with a variety of gameplay-altering weapons as you continue to gain strength and strike down the monstrosities that lurk within Rokar. Rokar has fallen. Once a civilization fueled by a magical power called Aether, the Rokari have been destroyed by a Calamity of unknown origins. Now, monsters and twisted spirits wander these crystallized ruins. As the last remaining Rune Knight, you alone can fight back these horrors. With the help of a mysterious Runesmith, you will forge the weapons needed to complete your campaign. Are you the Champion that Rokar needs?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/11/until-you-fall-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4590 or equivalent",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GTX 970 or equivalent",
        "DirectX": "Version 11",
        "Storage": "4 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Schell Games",
        "Platform": "PC",
        "Game Size": "1.60 GB",
        "Repack By": "SEWN",
        "Version": "v0.4.1.143049 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/qugbb0pdsw55"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/11/until-you-fall-free-download-preinstalled-steamrip.jpg"
}