{
    "page_url": "https://steamrip.com/unusual-findings-free-download-1p/",
    "title": "Unusual Findings Directly Download",
    "description": "It’s the 80s and the Christmas is coming, Vinny , Nick and Tony are young and their new cable signal descrambler just arrived. That same night while trying to decrypt a pay per view adult channel, they pick up the distress signal of an alien spaceship crash-landing in the woods near their town Things only get weirder as they realize that the towering alien is killing very specific members of their community LEGO Bricktales\nExplore the world oozing with nostalgia, check the Video Buster Store for clues, challenge other kids at the Laser Llamas Arcades, go learn a new trick at The Emerald Sword comic store, try to get along with the punk looking Lost Boys at their hideout or even dare to ask THE BULL, the quintessential 80s Action hero, for some help Follow the story that pays tribute to 80s classics like The Goonies, The Explorers, Monster Squad, The Lost Boys, They Live, Terminator, and Aliens among others and a gameplay that combines mechanics of Point and Clicks masterpieces like Full Throttle with its own unique twist and more.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/10/unusual-findings-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/10/unusual-findings-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 / 8 / 8.1 / 10",
        "Processor": "2.5 GHz (Single Core) or 2 GHz (Dual Core)",
        "Memory": "2 GB RAM",
        "Graphics": "ATI Radeon HD 4850, NVIDIA GeForce GT 120, Intel HD 3000",
        "DirectX": "Version 9.0",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Epic Llama Games",
        "Platform": "PC",
        "Game Size": "867 MB",
        "Released By": "Mr_GOLDBERG emu",
        "Version": "v1.0.24 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1xdf0g3n8wc5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/10/unusual-findings-preinstalled-steamrip.jpg"
}