{
    "page_url": "https://steamrip.com/urban-myth-dissolution-center-free-download/",
    "title": "Urban Myth Dissolution Center",
    "description": "The Urban Myth Dissolution Center – your one-stop solution for dissolving and dealing with cursed relics, monstrous oddities, and dimensional anomalies . Take on cases revolving around urban myths as Azami Fukurai, the heroine, under the supervision of Ayumu Meguriya, Level S psychic and Center Director. The game takes you on an episodic digital mystery adventure, exploring various urban myths that haunt the internet, all presented in stunning psychedelic pixel art. Panelka\nThe player takes control of Azami for the detective legwork, collecting circumstantial evidence and social network posts to unravel the truth behind each urban myth, as well as the hidden pasts of each client, and why they came to encounter each oddity. The dissolution of each urban myth leads to unexpected consequences and hidden truths. The Urban Myth Dissolution Center is a privately owned institution specializing in adaptive researchーboth onsite and onlineー, collection, and psychic divination , led by Center Director Ayumu Meguriya, focusing on the numerous urban myths that roam the offline and online worlds.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/urban-myth-dissolution-center-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/urban-myth-dissolution-center-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "windows10",
        "Processor": "Intel Core i3",
        "Graphics": "Intel HD  4000",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Adventure",
        "Developer": "Hakababunko",
        "Platform": "PC",
        "Game Size": "516 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v1.0.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/frka8gwn47kh"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/urban-myth-dissolution-center-preinstallled-steamrip.jpg"
}