{
    "page_url": "https://steamrip.com/v-rising-free-download-i1/",
    "title": "V Rising",
    "description": "Awaken as a weakened vampire after centuries of slumber . Hunt for blood to regain your strength while hiding from the scorching sun to survive. Rebuild your castle and convert humans into your loyal servants in a quest to raise your vampire empire. Make allies or enemies online or play solo locally, fend off holy soldiers, and wage war in a world of conflict.\nExplore a vast world teeming with mythical horrors and danger. Travel through lush forests, open countryside, and dark caverns to discover valuable resources, meeting friends and foes alike along the way. Traverse the world with vampire comrades or hunt solo as you pillage villages, raid bandits, and delve into the domains of supernatural beasts. Before The Last Hour\nStick to the shadows during the daytime, or the burning sunlight will turn you to ashes. Roam the night and prey on your victims in the darkness. As a vampire , you must quench your thirst for blood while planning your strategies around the day and nighttime. Gather resources and discover ancient techniques to gain dark powers.\nUse your newly acquired knowledge to build a castle where you can store your loot and grow your army of darkness. Personalize your domain, exhibit your vampiric style and make sure to craft coffins for servants and friends. Strengthen your castle to protect your treasure hoard from vampire rivals.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/v-rising-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/v-rising-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel Core i5-6600, 3.3 GHz or AMD Ryzen 5 1500X, 3.5 GHz",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750 Ti, 2 GB or AMD Radeon R7 360, 2 GB",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "7 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Massively Multiplayer",
        "Developer": "Stunlock Studios",
        "Platform": "PC",
        "Game Size": "6.6 GB",
        "Multiplayer By": "0xdeadc0de",
        "Version": "v1.1.1.0 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/E9x3pi",
        "https://megadb.net/h4rgx7qjf1po"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/v-rising-preinstalled-steamrip.jpg"
}