{
    "page_url": "https://steamrip.com/venture-to-the-vile-free-download/",
    "title": "Venture to the Vile",
    "description": "Venture to the Vile is a spooky 2.5D Metroidvania set in the strange town of Rainybrook, which has been overrun by a mysterious entity known as the Vile. Absorb the Vile’s powers, fight through treacherous grounds that were once your home, and find your lost friend Ella before it’s too late Ships At Sea\n2.5D ACTION-PACKED PLATFORMER\nJump, swing, and fight your way through dangerous enemies as you explore a carefully crafted 2.5D world full of puzzles to solve and secrets to discover. Unlock new abilities to overcome the Vile’s monstrosities — even if it means losing your humanity . Every new ability helps you uncover new dynamic areas, find new unique bosses, 2.5D environments to explore, and be rewarded with upgrades as you go.\nA STORY-RICH WORLD TO EXPLORE\nExplore the quaint seaside town of Rainybrook which has been infested with the Vile’s monsters . Meet the good yet peculiar townsfolk, help them with various quests to discover their stories, and uncover clues that might lead to your lost friend Ella.\nThe ending of this story is up to you – will you solve the mystery and best the Vile? Whether it’s helping the townsfolk with unusual sidequests or discovering hidden secrets in the world around, there’s more than meets the eye in the haunting and mysterious Rainybrook .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/05/venture-to-the-vile-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/05/venture-to-the-vile-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-7400 3.00GHz or AMD Ryzen 5 1400 3.20GHz",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce 1050Ti or AMD equivalent",
        "Storage": "8 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation, Strategy",
        "Developer": "Voracious Games",
        "Platform": "PC",
        "Game Size": "9.9 GB",
        "Released By": "FLT",
        "Version": "v1.0.1 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/r2mFkq",
        "https://megadb.net/18hzzi9clzj1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/05/venture-to-the-vile-preinstalled-steamrip.jpg"
}