{
    "page_url": "https://steamrip.com/vertical-kingdom-free-download/",
    "title": "Vertical Kingdom",
    "description": "Vertical Kingdom is set in a world devastated by a war that lasted for an entire generation. The once great Empire is in shambles and it’s up to the Great Architect to rebuild toward its former glory brick by brick. Travel the land, embark on randomized, roguelite-style expeditions, and build new cities with a fresh card-based building system combined with an intricate resource economy. Project Demigod\nRebuild an Empire, not through force of arms or devious politics, but brick and mortar Raise towering cities using a card-based system. Pick five decks each turn, then play the cards to build upwards. Manage resources like food, water, bricks, wood, stone, and metal, all needed to ensure the city has room to grow and play new cards.\nAs the Great Architect, it’s your job to rebuild the Empire, one building and one region at a time. Undertake great expeditions to raise new cities in the Emperor’s name and deal with the challenges of each region: Treacherous terrain, resource shortages, and ever-limited building space.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/04/vertical-kingdom-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/04/vertical-kingdom-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "AMD FX-4350 / Intel® Core™ i3-3210",
        "Memory": "4 GB RAM",
        "Graphics": "AMD Radeon™ R7 260X (2GB VRAM) / NVIDIA® GeForce® GTX 750(2GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Farlight Games Industry",
        "Platform": "PC",
        "Game Size": "848 MB",
        "Released By": "TENOKE",
        "Version": "Build 14056036 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/ns4xu1fejbid"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/04/vertical-kingdom-preinstalled-steamrip.jpg"
}