{
    "page_url": "https://steamrip.com/vine-free-download-1r/",
    "title": "VINE",
    "description": "To revive the desolate Earth after a nuclear war, humans created the Poro through genetic engineering. However, despite leaving the Poro on Earth, the planet did not recover, so humanity embarked into space to find a new world. One day, 700 years after humans had left, Rick the frog woke up from his slumber and immediately started searching for insects to satisfy his hunger . You are Rick, the yellow frog, and using his extending tongue for rope maneuvers, you must solve puzzles and journey towards the insect-filled paradise.Rick’s tongue stretches infinitely and can be attached to boxes, vines, etc. to perform rope maneuvers and move objects.\nIn VINE, the laws of physics are very important, and if you understand gravity acceleration, centrifugal force, Rck can swing ike Tarzan. Once you become familiar with the rope mechanic, you journey to Cosmos. The Cosmos building is old and dilapidated, with treacherous paths. If you are smart, you can solve the puzzles and easily reach Paradise. However, it won’t be easy.\nWith over 200 puzzles awaiting, it will still be quite challenging. Depending on your abilities, Rick will be able to consume many insects. Moreover, if you come across Uru’s journals hidden throughout Cosmos, you will learn about the events that unfolded. For some unknown reason, there are many hazardous contraptions inside the Cosmos building. Will Rick be able to reach Paradise ?",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/vine-screenshots-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/vine-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "2.0 Ghz",
        "Memory": "1 GB RAM",
        "Graphics": "GeForce 7600 GT (256 MB)",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "FrogParty",
        "Platform": "PC",
        "Game Size": "1.1 GB",
        "Released By": "TENOKE emu",
        "Version": "Build 11588656 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/gnkqtxkdnsvz"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/vine-preinstalled-steamrip.jpg"
}