{
    "page_url": "https://steamrip.com/void-war-free-download/",
    "title": "Void War",
    "description": "Command an ancient starship and fight your way to the heart of a dying Empire. Fend off attacks from demented cultists, craven space pirates, and xenophobic Imperial soldiers. Discover powerful artifacts and use them to build your ship into a fearsome war engine. Your starship is a mighty and terrible vessel, brimming with arcane technology and devastating weapons. Harness your ship’s weapons, modules, and reactor power to maximize your combat potential. Arrange your upgrades into powerful combos and use them to surgically dismantle your enemies. But watch out. They can do exactly the same to you. Mindseye\nEnlist crew from six different factions. Customize them with a vast array of wargear and engage in bloody, strategic boarding actions against enemy craft. Watch them crush their foes or die horrifically in the frenzy of void warfare. Experience hundreds of randomly generated encounters. Navigate through a brutal and unrelenting galaxy, weaving together a new story with every run. Meet technocultist magi, Imperial deserters, demon lords and more. Recruit them, fight them, and make choices that impact the state of your ship and the lives of your crew.",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2853590/ss_c814960006ef6c22caf868ef90f0578c64603022.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2853590/ss_0acc06188e0af19ad2cdf9bea4e6839ddde3321e.600x338.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Dual Core 2.4 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "1GB VRAM",
        "Storage": "250 MB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation, Strategy",
        "Developer": "Tundra",
        "Platform": "PC",
        "Game Size": "303 MB",
        "Released By": "DRM-Free (Ty teknova for csf, csrin)",
        "Version": "v1.0.0",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/1LvRhs",
        "https://megadb.net/byfpev0ezd33",
        "https://buzzheavier.com/0ycmf4z3mkvx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/06/void-war-preinstalled-steamrip.jpg"
}