{
    "page_url": "https://steamrip.com/voidwrought-free-download/",
    "title": "Voidwrought",
    "description": "The coming of the Red Star heralds a new age. Emerging from its cocoon, the Simulacrum is driven to collect Ichor, the blood of the gods, from the monstrosities who hoard it. Voidwrought is a fast-paced action-platformer with tight traversal, varied abilities, and formidable boss battles. Find and equip powerful Relics and Souls to customize your playstyle. Excavate into the rubble of the Gray City to construct a shrine filled with loyal followers. Travellers Rest\nDelve Beneath the Surface Descend below the star-scorched surface and explore the multidimensional depths below. Witness the corrupted revelry of the Court, lose yourself in the icy tunnels of the Old Waters, and discover the grim fate of the Abandoned Expedition. With sharp controls, engaging exploration, and deep lore to discover, Voidwrought is a dynamic addition to the modern Metroidvania genre.\nUnleash Ancient Artifacts The world is filled with treasures sought by the learned, the brave, and the mad. Scour the halls of your shrine, rend the corpses of defeated deities, and hunt in the hidden corners of the cosmos to find objects capable of granting unique powers.\nBuild your Shrine Some still cling to the original faith. From a tiny cult, expand your influence and excavate further into the ruins. As you expand your shrine and followers, new secrets , rewards, and horrors come to light.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/voidwrought-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/voidwrought-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-4670 / AMD Ryzen 3 120",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce 1050 / Radeon RX 570",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Powersnake",
        "Platform": "PC",
        "Game Size": "1.5 GB",
        "Released By": "TENOKE",
        "Version": "v0.27.56 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6ywfmo2zp91s"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/voidwrought-preinstalled-steamrip.jpg"
}