{
    "page_url": "https://steamrip.com/volcanoids-free-download-1p/",
    "title": "Volcanoids",
    "description": "Get Volcanoids for free instantly and play pre-installed on SteamRiP\nIn Volcanoids you’ll take on an expedition to a forsaken island that you once called home. But sudden eruptions triggered by mechanical beings turned the wondrous place into an apocalyptic wasteland. In order to survive the island’s natural elements, you have to outsmart these creatures and capture one of their drillships. Use their own technology against them as you upgrade the machinery and reclaim your homeland. Take the vantage point, stay safe underground or choose a material -rich location and explore. Outer Wilds\nThe drillship is a one of a kind base that serves as a factory and armored mobile base Experience the tension and thrill of surviving volcanic eruptions that turn the island into an apocalyptic wasteland. Time between each eruption is your most valuable resource. Use it to roam the island gathering materials, finding new technology and utilizing production. Deal with a hostile race of robots that use the volcano as a source of energy and resources.\nTheir units are scattered all around the island’s surface as well as below it. Take control over your drillship with many different stations and gadgets. Automate production, research technologies, set up defenses and turn the drillship into an unbroachable powerhouse.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/09/volcanoids-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/09/volcanoids-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 64bit (Service Pack 1)",
        "Processor": "Intel Core i5-2500K / AMD FX-6300",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GTX 470 / AMD RadeonHD 5850",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Simulation, Early Access",
        "Developer": "Volcanoid",
        "Platform": "PC",
        "Game Size": "3.4 GB",
        "Released By": "CODEX emu",
        "Version": "v1.31.580.0 | Steam Early Access (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n588hqltpf6u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/09/volcanoids-free-download-preinstalled-steamrip.jpg"
}