{
    "page_url": "https://steamrip.com/volcano-princess-free-download-1m/",
    "title": "Volcano Princess",
    "description": "The Volcano Goddess has blessed the land of her people. She brought prosperity to a country flourishing in a medieval era. After the death of your late wife, you are left alone to parent your daughter. So the question remains, how will you raise her, and what kind of life will the choices you make lead her to?\nAs your daughter’s sole guardian , it’s up to you to make sure she has everything she needs to be happy in her daily life and studies. Explore new hobbies and interests with her; your child is always learning so it’s important to try different jobs and activities. Despite all the growth and change you experience together, the most important lesson you must teach is that the bonds of family can never be broken. Dungeon Defenders\nThe sunlight filters softly through the trees, and the streets of the Volcano Kingdom are filled with whimsical tunes Besides enjoying the delicacies and delights of the land with your darling daughter, players can also interact with a curious cast of characters.\nFocusing on familial growth, you will be responsible for raising a spunky preteen who will gradually learn how to better engage with people, and practice prim & proper etiquette. You will be be able to arrange for her to attend one of four major colleges in the Volcano Kingdom . There she can learn music, take up painting, or become proficient in martial arts and combat. But take care if you neglect her, things may go astray .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/volcano-princess-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/volcano-princess-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 or higher",
        "Processor": "1.7 GHz Dual Core CPU",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 260, ATI Radeon 4870 HD, or equivalent card with at least 512 MB VRAM",
        "DirectX": "Version 9.0c",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Simulation",
        "Developer": "养蛋人工作室 Egg Hatcher",
        "Platform": "PC",
        "Game Size": "1.6 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v2.02.01 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/p0byi0ar9l4u"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/volcano-princess-preinstalled-steamrip.jpg"
}