{
    "page_url": "https://steamrip.com/wall-world-free-download-1o/",
    "title": "Wall World Directly Download",
    "description": "Welcome to the Wall World, a mining rogue-lite with tower defense elements. Explore procedurally generated mines and discover fantastical biomes. Find resources and technologies for purchasing valuable upgrades. Fight off hordes of aggressive monsters using your mobile base. Roam the Wall freely day and night, in various weather conditions.\nFind traces of “the others” and boldly mine where no man has mined before. Burrow deep into the Wall in different places. Look for resources and technologies for upgrades, discover new biomes in the mines but don’t forget to return to your robospider in time for the next monster attack.\nFight Shoot and hack at the nightmarish creatures with a variety of weapons, from simple machine guns to homing missiles. Increase your chances of survival by breaking camp instantly and continuing the fight on the go.\nUpgrade Modernize your exosuit with resources and technologies you find to move faster in mines and break through ever harder rocks. Upgrade your robospider’s combat stats to deal with the increasingly dangerous enemies that await you on the endless Wall. TRIANGLE STRATEGY\nBuild Build automatic turrets, repair stations and resource harvesters and upgrade buildings to maximize your chances of success. But first you’ll have to find the blueprints in the depths of the Wall.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/wall-world-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/wall-world-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 or later",
        "Processor": "Intel Core i5 or equvalent",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GTX 650 or equvalent",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy",
        "Developer": "Alawar Premium",
        "Platform": "PC",
        "Game Size": "299 MB",
        "Released By": "GOG",
        "Version": "v1.2.4.486 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1p9sc7c6j0ru"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/wall-world-preinstalled-steamrip.jpg"
}