{
    "page_url": "https://steamrip.com/wandering-sword-free-download-h1/",
    "title": "Wandering Sword",
    "description": "Journey through over 75 breathtaking locations across 5 diverse regions, each echoing the richness and allure of ancient China’s tradition and landscape. Explore a world filled with bustling ancient Chinese towns, scenic mountains, picturesque rivers, dangerous lairs, treacherous terrains and more Utilizing Unreal Engine 4, Wandering Sword portrays a captivating blend of traditional pixel art graphics seamlessly layered onto immersive 3D landscapes. Drawing upon the charm of classic pixel-based martial arts games, the game infuses modern visual effects to elevate every moment in its Wuxia world. The Rewinder\nWandering Sword introduces an innovative combat system that operates on a tiled board and offers players the flexibility to switch between turn-based and real-time mode. This dual mode approach caters to both traditional RPG players who prefer a slower pace and those who enjoy real-time action that demands quick reflexes. Wandering Sword brings to life a diverse array of martial arts moves and weaponry.\nAs you traverse the land, you’ll unravel hundreds of martial arts techniques and weapon styles. Cultivate your energy through meridian points, gain expertise in both external and internal forms, and achieve true mastery of martial prowess.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/09/wandering-sword-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/09/wandering-sword-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 7 SP1 / 8.1 / 10 64-bit",
        "Processor": "AMD FX-4350 / Intel® Core™ i3-3210",
        "Memory": "8 GB RAM",
        "Graphics": "[Integrated graphics not supported]AMD Radeon™ RX 560 (4GB VRAM)",
        "DirectX": "Version 11",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Strategy",
        "Developer": "The Swordman Studio",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.24.23 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/xwysx0056zi6",
        "https://megadb.net/7pjvsnqr9ib1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/09/wandering-sword-preinstalled-steamrip.jpg"
}