{
    "page_url": "https://steamrip.com/war-hospital-free-download-w1/",
    "title": "War Hospital",
    "description": "War Hospital puts you in charge of treating soldiers pulled from the trenches of the First World War. With only a small team of overworked but dedicated medics, nurses, and doctors, you need to save as many lives as possible while maintaining the well-bveing and morale of your staff. 11 patients are spread among three surgeons at the CCS in War Hospital The building that you’re likely to visit the most is the Casualty Clearing Station , located between the Operating Ward and the Cemetery. Unstoppable\nThis is where patients are assigned to doctors for treatment. A patient’s condition will deteriorate over time, and if they aren’t treated they will eventually die. Patients can still be brought to the Casualty Clearing Station even if there aren’t enough beds. Patients who don’t have a bed cannot be treated by nurses and will deteriorate faster as a result. To assign a patient to a doctor, drag their card into that doctor’s queue. Doctors will treat patients one at a time, in order from left to right on their queue. Use the information on the patients’ cards to decide on the order in which they should be treated .\nOnce you’ve researched Amputation Tools and Oxygen Inhalation , you can use them to speed up Surgery and Chemical procedures, respectively. Right-clicking a patient’s card in the CCS will mark or unmark them for Amputation or Oxygen. These procedures cost half the normal resources and are twice as fast, but the patient must be released from military service at the end of their rehabilitation.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/01/war-hospital-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/01/war-hospital-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-3770 or AMD Ryzen 5 1500X",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 750, 2 GB or AMD Radeon R7 360, 2 GB",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Brave Lamb Studio S.A.",
        "Platform": "PC",
        "Game Size": "4.8 GB",
        "Released By": "RUNE",
        "Version": "Build 13157162 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/mturq4gpfnx1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/01/war-hospital-preinstalled-steamrip.jpg"
}