{
    "page_url": "https://steamrip.com/wargroove-2-free-download-u1/",
    "title": "Wargroove 2 Directly Download",
    "description": "Wargroove is back! Embark on an all-new adventure, filled with unlikely friendships , unknown adversaries, and ugly revenge plots. Wage war against your foes with a cast of new Commanders and utilise their new tiered ‘groove’ ability system to sway the fight in your favour. Design and share maps, cutscenes, and campaigns with easy-to-use editors and in-depth customization tools. Thief Simulator 2\nThree years have passed since Queen Mercia and her allies defeated the ancient adversaries and restored peace to Aurania. Now, an ambitious foreign faction is unearthing forbidden technologies that could have catastrophic consequences for the land and its people. Battle your way through 3 Campaigns following 1 interweaving story. Only bold decisions, smart resourcing, and tactical know-how can repair a fractured realm\nTake down your enemies and deliver the final blow with your Commander’s ‘Groove’, a special skill unique to each Commander that can turn the tides of battle. Wargroove 2 introduces a new Groove system to the mix. Increase your chances of victory by supercharging your Commander’s Groove ability to unleash an even more powerful attack\nA nation of curious mouse-folk has landed in Aurania on a scholarly expedition. What the Faahri Republic lacks in military experience, they more than make up for with academic theory. Equipped with mysterious crystal technology, Commanders Lytra, Pistil, and Rhomb must work together in pursuit of information for their mysterious benefactors.\nConquest is a brand new roguelike single-player game mode. In these quick-paced, bite-sized battles every choice is permanent. Gold and health carry from skirmish to skirmish, and no unit is dispensable. Choose your Commander, starting troops and plan your route to victory Sick of the rules? Change ‘em! Want to write a soul-wrenching novella about forbidden love in a war-torn land? Eat your heart out! There’s something for everyone. Using the in-game editor you can create custom maps, cutscenes and campaigns, and even share them with the community",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/10/wargroove-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/10/wargroove-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Core i3 or equivalent",
        "Memory": "2 GB RAM",
        "Graphics": "DirectX 11 and/or OpenGL 3.3 compatible video card",
        "DirectX": "Version 11",
        "Storage": "1 GB available space"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Chucklefish, Robotality",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "TENOKE",
        "Version": "v1.2.7c | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/yecnmr0e0vlm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/10/wargroove-2-preinstalled-steamrip.jpg"
}