{
    "page_url": "https://steamrip.com/warhammer-40000-dawn-of-war-ii-free-download/",
    "title": "Warhammer 40,000: Dawn of War II",
    "description": "With a focus on fast-action RTS gameplay, Dawn of War II brings to life the science fiction universe of Warhammer 40,000 like never before. Experience the intimate brutality of battle as you play through your chosen race’s epic campaign. Clash with the enemies on battlefield ablaze with visceral melee and ranged combat. Lead and develop your squads from raw recruits into the most battle hardened veterans in the galaxy. Grounded 2\nBrutal Frontline Action & Tactics\nGet straight into the action to experience intense melee and devastating ranged combat. Use vicious melee sync-kills to obliterate your enemies. Outsmart your opponents using dynamic and destructible environments to suppress, flank and destroy your foes.\nNon-Linear Single Player Campaign\nCommand an elite strike force, developing the skills and abilities of your squads and commander as you progress through the game.\nBespoke RTS Engine\nUtilizing Relic’s proprietary Essence Engine 2.0 Dawn of War II delivers cinematic visuals, detailed graphics and amazing special effects.\nIn Dawn of War II: Chaos Rising you will take command of the Blood Ravens and defend the sector against the Chaos Space Marines of the Black Legion. Purge the Chaos filth and hold the chapter together as traitorous forces work from within to try bring down the Blood Ravens.\nNew Single Player Missions\nContinue your fight against the enemies of the Emperor and use your squads’ wargear, abilities, and experience to battle against Chaos in 15 new missions",
    "screenshots": [
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/15620/ss_e1bb0dd6a434816032d5d95969b7a502989e95b2.600x338.jpg",
        "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/15620/ss_a42253522436151ce21a90cae55ad4a845cbff01.600x338.jpg",
        "https://gofile.io/d/sbqIo8",
        "https://buzzheavier.com/yrkhzf2q25ow"
    ],
    "system_requirements": {
        "OS *": "Windows XP SP2 or Windows Vista SP1",
        "Processor": "P4 3.2 GHz (single core) or any Dual Core processor",
        "Memory": "1 GB RAM (XP), 1.5 GB RAM (Vista)",
        "Graphics": "A 128MB Video Card (Shader Model 3) – Nvidia GeForce 6600 GT / ATI X1600, or equivalent",
        "Hard Drive": "6.5 GB of uncompressed Hard Drive space",
        "REQUIRED FOR MULTIPLAYER": "INTERNET: Cable modem, DSL modem, or 56.6kbps modem for online multiplayer play: Network: TCP/IP compliant network"
    },
    "game_info": {
        "Genre": "Strategy",
        "Developer": "Relic Entertainment",
        "Platform": "PC",
        "Game Size": "6.3 GB",
        "Released By": "Goldberg + lanternjoe CSF, cs.in.ru",
        "Version": "Build 3346774",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/sbqIo8",
        "https://buzzheavier.com/yrkhzf2q25ow"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/07/Warhammer-40000-Dawn-of-War-II-Anniversary-Edition_featured_final.jpg"
}