{
    "page_url": "https://steamrip.com/warlord-britannia-free-download-u1/",
    "title": "Warlord Britannia",
    "description": "Warlord: Britannia is the first entry, in a new series of immersive- strategy games, created by Solo developer Darkmatter Games. Step into the shoes of a Roman General given direct command of a Legion, with orders from the Emperor to conquer an entire island. A unique combination of first-person strategy elements places Warlord: Britannia in a genre of its own. Immersive-Strategy fixes the player in the first-person perspective of their character. Lead a large army, construct bases, conquer settlements, and disrupt enemy forces in the open world entirely from this Immersive-Strategy perspective.\nTurn the tide of battle by participating directly in the action and fighting alongside your own troops, all in real-time. The world of Warlord: Britannia is an island more than 45 square kilometers in size, divided by latitude into three visually distinct geographic zones. Start your occupation in the densely forested Lowlands, then march north to the rolling hills and farms of the Midlands. Finally, push further north into the imposing and desolate Highlands. All three zones flow seamlessly together, and never subject the player to a loading screen.\nTravel the roads cautiously and keep your eyes on the treelines, as trading convoys and roaming warbands criss-cross the open world in real-time. The local population quickly spreads word of your exploits, so choose your actions carefully. Manage the population’s unrest levels and prepare for uprisings and raids on your camp. Enemies will react aggressively to repeated attacks and transgressions by the Roman invading force. Recruit up to 9 Roman centuries and their officers to fully staff your Legion. Hundreds of Romans and Barbarians will clash and die on the battlefield. Use your legionaries to attack local strongholds and towns, pillage and loot settlements, impose draconian taxes, and send the population back to Rome in chains. Golfie",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/warlord-britannia-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/warlord-britannia-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista 64-bit",
        "Processor": "i5 Quad Core",
        "Memory": "8 GB RAM",
        "Graphics": "GTX 1050 Ti",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Strategy",
        "Developer": "Darkmatter Games",
        "Platform": "PC",
        "Game Size": "1.8 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v7.021 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6tn8h8cregd4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/warlord-britannia-preinstalled-steamrip.jpg"
}