{
    "page_url": "https://steamrip.com/warno-free-download/",
    "title": "WARNO",
    "description": "Deploy into an authentic, expansive, and meticulously researched Cold War real-time strategy game with WARNO. As the spiritual successor to the acclaimed Wargame series, WARNO is the ultimate next-gen World War III battle simulator. Hob\nTwo years have passed since Gorbachev’s overthrow in a coup by hardline communists , and now, in the dark summer days of 1989, the Cold War finally turns hot. The armies of NATO and Warsaw Pact have deployed in a divided and tense Germany. Conflict is imminent. The only thing left is to wait for the inevitable Warning Order that will begin it all. War is coming home, commanders\nWARNO – Warning Order – lets you command your customized battlegroup and lead hundreds of Cold War-era units to victory on dynamic, tactical battlefields. Choose between the arsenals of NATO or the Warsaw Pact, and fight across a multitude of solo and online modes against challenging AI or human opponents in massive 10v10 battles. Show your mettle as a strategic commander in the turn-based Army General campaigns depicting a devastating, techno-thrilling World War III in Western Europe.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/06/warno-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/06/warno-screeenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: 64-bit Windows 11 / 10 / 8.1 / 7 with Service Pack 1",
        "Processor": "2 cores Intel (Intel Celeron G6900, G4920 or i3-2100) | AMD CPU (AMD Athlon 200GE)",
        "Memory": "4 GB RAM",
        "Graphics": "Nvidia GeForce GT 1030 (Legacy: Nvidia GeForce GTS 450), AMD Radeon RX 460 (Legacy: ATI Radeon HD 5570)",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, Simulation, Strategy",
        "Developer": "Eugen Systems",
        "Platform": "PC",
        "Game Size": "43 GB",
        "Released By": "RUNE emu",
        "Version": "v141373 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://datanodes.to/bkkknbczyx78/WARNO-SteamRIP.com.rar",
        "https://buzzheavier.com/uio9zst2jiv0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/06/warno-preinstalled-steamrip.jpg"
}