{
    "page_url": "https://steamrip.com/wars-and-roses-free-download-x1/",
    "title": "Wars and Roses Direct Free Download",
    "description": "Wars and Roses game for free instantly and play pre-installed on SteamRiP\nDo you like military girls? Do you like tactical shooters? Do you like dating sims? Then this game is for you. Wars and Roses is a one-of-a-kind intense tactical FPS where you fight battles alongside female officers and interact with those beauties in a 3D dating sim. Rescue captured officers, gain affection by dating in various scenarios to unlock unique interactions and fight side-by-side on an anti-terrorism campaign .\nRecently, it has become fashionable to surprise players with an unusual combination of genres. At the same time, it is important to combine genres not just for show, but to try to perform each genre perfectly. Wars and Roses is an action-packed first-person shooter and dating sim with an erotic twist. The plot of the game begins with the fact that you were instructed to free the Black Rose Special Forces (a squad of sexy military girls).\nRescue the girls and take command. Complete a variety of tasks to neutralize terrorists around the world, and between missions go on a date with the girl you like. The better you show yourself in battle, the better you make an impression on the girls. Most importantly, the developers have tried to make both directions of the genre not for show. You are waiting for interesting and varied missions, a lot of weapons, Fuga: Melodies of Steel",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/01/wars-and-roses-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/01/wars-and-roses-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7",
        "Processor": "Intel Core i5 3210M CPU",
        "Memory": "8 GB RAM",
        "Graphics": "4 GB VRAM",
        "Storage": "15 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "Blaze Worlds",
        "Platform": "PC",
        "Game Size": "10.4 GB",
        "Released By": "GOLDBERG",
        "Version": "v1.070 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/tak024r400em"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/01/wars-and-roses-preinstalled-steamrip.jpg"
}