{
    "page_url": "https://steamrip.com/wayfinder-free-download/",
    "title": "Wayfinder",
    "description": "This is the all-new Wayfinder, A 3 player Co-Op Action RPG. Featuring intense combat, deep customization, a huge world to explore and tons of loot to collect – for you and your house. It’s Only Money\nThe World of Evenor is shattered. You must harness the power of a Wayfinder to Control the Chaos that has overrun your world. Join forces with 2 other friends to strengthen your powers. Control your adventures with mutators—customization modifiers that shape your exploration of an immersive world—to collect valuable gear and loot!\nBecome a Wayfinder Control and harness the power of a mighty Wayfinder! Wield a variety of unique abilities ranging from ebbing arcane magic and tech to lethal martial prowess , catering to your preferred playstyle. Traverse an immersive world with other Wayfinders and shape your adventures the way you want. Control what you explore and what enemies you fight to best customize how you want to play your Wayfinder.\nExplore and Collect On every hunt and expedition into the Gloom you’ll discover new locations, monsters and gear. Collect every set of armor, each unique weapon, and hundreds of apartment decorations as you mend the various regions of a broken world.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/wayfinder-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/wayfinder-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64-bit",
        "Processor": "AMD Ryzen 5 3600 / Intel i7 6700",
        "Memory": "16 GB RAM",
        "Graphics": "AMD Radeon RX 5600 XT / Nvidia GTX 1650 Super",
        "DirectX": "Version 12",
        "Storage": "50 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Airship Syndicate",
        "Platform": "PC",
        "Game Size": "47.5 GB",
        "Released By": "RUNE",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/UGTGC8",
        "https://buzzheavier.com/ucpy5khm8egi"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/wayfinder-preinstalled-steamrip.jpg"
}