{
    "page_url": "https://steamrip.com/wayward-strand-free-download-z1/",
    "title": "Wayward Strand Directly Download",
    "description": "It’s the summer of 1978, and Casey Beaumaris is trying to make the most of her holidays, when her mum asks her to spend a long weekend helping out at the airborne hospital where she works. Casey prefers the company of books to people, but she agrees, secretly planning to write an article about her visit for the school newspaper. With her trusty notebook at the ready, Casey arrives on board the airship. The staff are overworked as they prepare for the visit of an important official, while the patients react to grief , or deal with active trauma.\nIn the midst of these and many other interlocking and overlapping stories, Casey spends time with the patients, learning about their lives, and, as the stories unfold, discovering what she can do to help. Within the world of Wayward Strand, time passes for everyone – characters continue their lives without waiting for you to interact with them. In Wayward Strand’s unique narrative structure, the stories of over a dozen characters constantly unfold around you in real time, as you, as Casey, roam freely throughout each day. Choose which story to be a part of by following people, having conversations, and exploring the hospital. Return to Monkey Island",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/09/wayward-strand-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/09/wayward-strand-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "2.0GHz",
        "Memory": "2 GB RAM",
        "Graphics": "DX10 compatible or better",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie, RPG, Simulation",
        "Developer": "ghost pattern",
        "Platform": "PC",
        "Game Size": "2.5 GB",
        "Released By": "Mr_Goldberg + SSE emu",
        "Version": "v1.0.2 | Full  + Bonus OST",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/1fok2vrrwxw8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/09/wayward-strand-preinstalled-steamrip.jpg"
}