{
    "page_url": "https://steamrip.com/we-are-football-free-download-3a/",
    "title": "WE ARE FOOTBALL Free Download Direct Link",
    "description": "As a manager and trainer in WE ARE FOOTBALL, you’ll come face to face with the latest trends in the world of football , experiencing all the emotional highs and lows of your favorite club. For the first time ever, this modern football manager game also offers a women’s football game mode, featuring all the same functionality as well as many unique gameplay elements. To maintain and ensure the highest quality across all game modes, WE ARE FOOTBALL has been developed with experienced football management veterans such as Gerald Köhler, Rolf Langenberg, and Dirk Winter. UNO\nYou’ll get immediate feedback for every decision, big and small. You’ll have to plan out your deadlines effectively in the game, and will only be truly successful in the club by working together with your colleagues. WE ARE FOOTBALL focuses on real management tasks. The goal of the game is to build up the club over the long haul, including growing the team, colleagues , infrastructure, fans, and more. As a result, the football players in the game are individual personalities who spin their own stories.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/we-are-football-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/we-are-football-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7 / 8 / 10",
        "Processor": "AMD / Intel processor running at 2.6 GHz or higher",
        "Memory": "4 GB RAM",
        "Graphics": "AMD/NVIDIA dedicated graphics card, with at least 1GB of dedicated VRAM",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Simulation, Sports, Strategy",
        "Developer": "Winning Streak Games",
        "Platform": "PC",
        "Game Size": "4 GB",
        "Repack By": "SKIDROW",
        "Version": "v1.21 | Full  + 2 DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6lgcbx9o22a8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/we-are-football-free-download-preinstalled-steamrip.jpg"
}