{
    "page_url": "https://steamrip.com/we-happy-few-free-download-y1/",
    "title": "We Happy Few",
    "description": "We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. In this alternative 1960s England, conformity is key. You’ll have to fight or blend in with the drug-addled inhabitants , most of whom don’t take kindly to people who won’t abide by their not-so-normal rules .\nDiscover the retrofuturistic city’s dark history as you play through the intertwined narratives of three quietly rebellious citizens of Wellington Wells, each with their own strengths and weaknesses, as they face their pasts, prepare for the future, and engage in activities that aren’t exactly status quo in the artificially enthused society. Set in retrofuturistic 1960s England , you will find a city ravaged by war and rebuilt by delusionally happy people. Everything appears joyful in Wellington Wells, including its roads, its people, and its omnipresent television personality: Uncle Jack But, it’s actually a world on the brink of collapse. Melatonin\nCome unveil its dark history, and discover how and why its residents came to be so beguilingly happy. Play as three flawed characters who explore their own connections to the events surrounding the rebuilding of Wellington Wells. They each have a unique storyline in which they interpret and react to the events around them in different ways. As you hide, conform, or fight back as each of them, you will encounter dark humour, a spot of hope, and even some redemption along the way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/01/we-happy-few-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/01/we-happy-few-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64 bit, Windows 7 and above",
        "Processor": "Triple-core Intel or AMD, 2.0 GHz or faster",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce 460 GTX",
        "DirectX": "Version 11",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie",
        "Developer": "Compulsion Games",
        "Platform": "PC",
        "Game Size": "12.7 GB",
        "Released By": "CODEX",
        "Version": "v1.9.88966 | Full  + All DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dx70131pdchx"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/12/we-happy-few-preinstalled-steamrip.jpg"
}