{
    "page_url": "https://steamrip.com/we-were-here-forever-free-download-p1/",
    "title": "We Were Here Forever",
    "description": "You and your fellow prisoner are trapped in the realm of Castle Rock – were you betrayed, or simply not that clever? To escape, you must explore the sinister castle for puzzles and plot your escape together. Secrets and riddles are hidden in the shadows. Just be aware that nothing is what it seems in this mysterious Antarctic adventure.\nCan you two escape together, or will you be trapped forever? Locked up in the dungeons, deep in the bowels of Castle Rock, you and a fellow prisoner must seek a way out and return to stand again beneath the icy Antarctic skies – but escaping this nightmare will not be so easy, let alone escaping the castle itself. Freeing yourselves from your cells and escaping the Keep is only the beginning – but does one truly escape Castle Rock?\nFresh mysteries await, and you’ll have to make some choices about how to proceed. Your journey leads from the dark prison through the royal halls to the outside. Outside the Keep, you will discover the story of Rockbury, it’s inhabitants , and plans of a resistance formed against the King to escape this icy place. Hope will lead you on to an eerie Graveyard and have you descend down into the dark waters of the Foundry. River City Girls\nYou two have been brought here for a purpose. You might even be the missing piece of a puzzle set in motion long ago, in a time long forgotten. But someone, or something, desperately seeks to solve that puzzle, by any means necessary. Only an unshakeable bond with your partner will give you any hope of survival in the face of such dreadful desire.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/05/we-were-here-forever-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/05/we-were-here-forever-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 64 bit",
        "Processor": "Intel Core i3 4000 series or equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "Nvidia GTX 750TI or equivalent, integrated graphics not supported",
        "DirectX": "Version 11",
        "Network": "Broadband Internet connection",
        "Storage": "25 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Casual, Indie",
        "Developer": "Total Mayhem Games",
        "Platform": "PC",
        "Game Size": "10.7 GB",
        "Released By": "Online-fix.me",
        "Version": "v1.0.29 | Full  + Co-op",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/7mCLb5",
        "https://megadb.net/lr3qco6pmgx0"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/05/we-were-here-forever-preinstalled-steamrip.jpg"
}