{
    "page_url": "https://steamrip.com/we-who-are-about-to-die-free-download-j1/",
    "title": "We Who Are About To Die",
    "description": "Get ready to re-learn how to fight. This game features a physics based combat system with directional attacks. It’ll take time to master Don’t worry, gladiators exist to be sacrificed . You control your character fully, at all times, based on complex inputs  you will never sit there while an animation plays. This game’s combat will take practice: at first you will find it hard to even hit anything properly. Backrooms: Escape Together\nTo win and master combat you will have to slow down and pay attention, pressing random buttons in a panic will only send your gladiator to an even earlier grave. You will learn how to move, how to use momentum to hit HARD, how to hit targeted weak spots and eventually, you will make up your own moves and fight in your own style. Take control of a gladiator with a single life, that you lead to an inevitable dea I mean, to victory and glory! Fight from the Pits to the Arena into the Stadium, pleasing larger and larger crowds until you finally become a legend of the Grand Stadium.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/we-who-are-about-to-die-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/we-who-are-about-to-die-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "64-bit Windows 7 / Windows 10",
        "Processor": "Intel Core i5-750, 2.66 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce™ GTX 670",
        "Storage": "6000 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG, Simulation, Strategy, Early Access",
        "Developer": "Jordy Lakiere",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.25 | Steam Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3v7g5cby49tw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/we-who-are-about-to-die-preinstalled-steamrip.jpg"
}