{
    "page_url": "https://steamrip.com/weed-shop-3-free-download-1k/",
    "title": "Weed Shop 3",
    "description": "Can you turn an out-of-business dildo shop into a profitable Cannabis empire? Probably not, but there’s only one way to find out.. Weed Shop 3 is a recreational marijuana dispensary simulator with business management mechanics, FPS action, and a crazy storyline you’d come to expect from the guys who most definitely didn’t smoke crack with Kevin from Tenderloin. You start your Marijuana-infused adventure just like the last time: broke and clueless. Marvel’s Guardians of the Galaxy\nHow broke? Grow your weed in the toilet, look for singles in the trash, smoke roaches, deal ditch weed to burnouts type of broke. The journey to the top will be a long and grindy one, but hey at least you still got your kidneys and a little bit of weed, so start growing and work your way up the Ganja ladder Deal weed on the streets or sell it in your shop and use the proceeds to expand your operation. Upgrade your grow setup and grow larger quantities of more potent strains. Improve the visual appearance of the shop to attract higher-paying clientele. Make and sell your own pre-rolld’s as well as various paraphernalia.\nOnce your grow op becomes too much for one stoner to handle, get more! Hire staff and have them specialize in selective fields such as farming, promoting, sales, etc. as they gain more experience. Having experienced staff will allow you to outsource most of the daily grind so you can focus on bigger things. Now since you got some free time on your hands and, hopefully, a whole lot of cash in the safe, why not open up a second facility and start experimenting with cross-breeding new strains? Breeding a new more potent hybrid strain will take a lot of trial and error unless you get to know the right people, that is.\nGot them hybrids growing in your brand new field already? Perfect All you need now is some hash extractors, heated dab presses, and cart fillers and you’ll be producing solventless concentrates with the highest THC in town, Congrats you’ve finally almost made it sort of. All you need is some brand recognition and, fortunately for you, Sunless Beach is crawling with various influencers. Hire them to promote your products, gain their respect, and turn them into high-paying customers who will then promote your shop for free.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/07/weed-shop-3-steamrip-1.jpg",
        "https://steamrip.com/wp-content/uploads/2022/07/weed-shop-3-screenshots-steamrip-1.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7/8",
        "Processor": "Intel i7-4770k / AMD Ryzen 5 1600",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 770 / AMD Radeon R9 270X",
        "DirectX": "Version 11",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "Weed Games",
        "Platform": "PC",
        "Game Size": "3.7 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 10562557 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/2bnckm6y3xo1"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/07/weed-shop-3-preinstalled-steamrip.jpg"
}