{
    "page_url": "https://steamrip.com/weird-west-free-download-1s/",
    "title": "Weird West",
    "description": "Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the story of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken – a series of high stakes adventures where everything counts and the world reacts to the choices you make.\nForm a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own. Weird West: Dark Fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures, each playing with their own rules and their own peculiar motives.\nIntertwined Destinies : Discover the world through origin stories of different characters, moving from one character’s journey to the next until all converge in a final chapter. Bespoke Experience: Each playthrough is unique as the game tailors the story to the player’s actions and past choices for an ideal dramatic arc. Immersive Sim: Weird West supports different styles of play in a simulated sandbox world where characters, factions, and even places react to a player’s decisions. Street Fighter V: Champion Edition",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/weird-west-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/weird-west-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-2380 or equivalent / AMD FX-6100 (6 * 3300) or equivalent",
        "Memory": "6 GB RAM",
        "Graphics": "GeForce GTX 650 Ti (1024 MB) / Radeon HD 7770 (1024 MB) or equivalent",
        "Storage": "16 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, RPG, Simulation",
        "Developer": "WolfEye Studios",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Released By": "FLT",
        "Version": "v1.05B.77786 A | DLC (Weird West – Calamity’s Horse)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/79dxo8h34v1n"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/weird-west-preinstalled-steamrip.jpg"
}