{
    "page_url": "https://steamrip.com/welcome-to-paradize-free-download-w1/",
    "title": "Welcome to ParadiZe",
    "description": "Do you want your very own zombie companion ? A faithful friend that protects you from its peers and accompanies you on all your adventures? At ParadiZe, we make it happen Here, the zombies do all the dirty work. Brothers: A Tale of Two Sons Remake\nIn the beautiful country of ParadiZe , ingenious survivors are testing a technology that can be used to control the zombies that have overrun the world. Once hacked, they become invaluable allies, even though they are not that smart and sometimes rather unstable.It’s not all rosy in ParadiZe, but if you’re reasonably clever and handy, maybe you’ll manage to survive\nExplore ParadiZe and meet a colourful cast of extraordinary characters. The unusual flora and fauna will surprise you at every turn. Set out on adventure, in the snow or desert, alone or with your Zombot companions, and feel free to get rid of any pests that try to disturb your stay with us. Fancy an expedition into the wilderness or would you prefer to laze about at your camp? It’s your choice, so tailor your stay as you see fit However, we recommend not getting too close to the locals: they can be somewhat aggressive .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/03/welcome-to-paradize-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/03/welcome-to-paradize-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i7-3770 or AMD Ryzen 5 1400",
        "Memory": "12 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 Ti, 4 GB or AMD Radeon RX 6400, 6 GB or Intel Arc A380, 6 GB",
        "DirectX": "Version 12",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "Eko Software",
        "Platform": "PC",
        "Game Size": "15.7 GB",
        "Released By": "RUNE",
        "Version": "Build 13750047 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://buzzheavier.com/ak17flztl8rv",
        "https://megadb.net/v2unv75j5jhm"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/03/welcome-to-paradize-preinstalled-steamrip.jpg"
}