{
    "page_url": "https://steamrip.com/what-remains-of-edith-finch-free-download-1u/",
    "title": "What Remains of Edith Finch",
    "description": "Winner of Best Game at the 2018 BAFTA Game Awards, as well as Best Narrative awards at the GDC 2018 Choice Awards, 2018 SXSW Gaming Awards, and The Game Awards 2017, What Remains of Edith Finch is a collection of strange tales about a family in Washington state. Active Soccer 2023\nAs Edith, you’ll explore the colossal Finch house, searching for stories as she explores her family history and tries to figure out why she’s the last one in her family left alive. Each story you find lets you experience the life of a new family member on the day of their death, with stories ranging from the distant past to the present day.\nThe gameplay and tone of the stories are as varied as the Finches themselves. The only constants are that each is played from a first-person perspective and that each story ends with that family member’s death. Ultimately, it’s a game about what it feels like to be humbled and astonished by the vast and unknowable world around us. Created by Giant Sparrow, the team behind the first-person painting game The Unfinished Swan.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/07/what-remains-of-edith-finch-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/07/what-remains-of-edith-finch-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows Vista SP2 64-bit or later",
        "Processor": "Intel i3 2125 3.30 GHz or later",
        "Memory": "2 GB RAM",
        "Graphics": "GeForce GTX 750/AMD Radeon 7790 or later",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, Indie",
        "Developer": "Giant Sparrow",
        "Platform": "PC",
        "Game Size": "2.3 GB",
        "Released By": "GOG",
        "Version": "v1.0.0.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/7c07berue6q4"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/07/what-remains-of-edith-finch-preinstalled-steamrip.jpg"
}