{
    "page_url": "https://steamrip.com/wildermyth-free-download-1j/",
    "title": "Wildermyth Directly Download",
    "description": "Wildermyth is a character-driven, procedurally-generated tactical RPG. Like the best tabletop roleplaying experiences, Wildermyth gives you choices and answers your every decision with consequences that drive your characters forward. Lead a band of heroes as they grow from reluctant farmers into unique, legendary fighters. Combat unexpected threats and strange monsters across interactive battlefields . Unravel mysteries and share pensive moments in an ever-new fantasy setting that blends hard truths and sacrifice with humor and personal storytelling. Soccer Story\nThe Yondering Lands, where the game is set, is a richly layered world populated with hand-painted 2D characters and scenery. We’ve paid loving attention to breaking molds and exploring new ideas: no orcs, elves, or goblins here—but watch out for the telepathic insect-dragons and the clockwork undead. Each of your heroes has their own unique generated history, personality, and appearance , and will form relationships with your other heroes. All of these elements change and develop over the course of a playthrough, as characters age, encounter mysteries , and overcome challenges.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/11/wildermyth-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/11/wildermyth-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7+",
        "Processor": "i3 or better",
        "Memory": "3 GB RAM",
        "Graphics": "Open GL 3.2",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, RPG, Strategy",
        "Developer": "Worldwalker Games LLC",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Released By": "TENOKE emu",
        "Version": "v1.16.559 | Full  + DLCs",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/dts9d7k0cvkn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/11/wildermyth-preinstalled-steamrip.jpg"
}