{
    "page_url": "https://steamrip.com/wild-west-dynasty-free-download-1k/",
    "title": "Wild West Dynasty",
    "description": "Cowboys, Settlers & Gunslingers – Prepare to explore, survive and build in the Wild West and write your own story! Will you manage to start a ‘Wild West Dynasty’ or end up on the gallows? Wild West Dynasty is a story-driven mix of RPG, City Builder, Life Simulation and Survival set in the American 1800’s. As a lone survivor, you have to find a place to call your own and build the foundations of your settlement for generations to come.\nCraft, gather, grow crops, recruit pioneers craftsmen and prospectors, survive the harsh environments landscapes and uncover the mysteries of your family’s history. Explore an open world, travel by foot or on horseback and experience unique environments , each filled with dangers, treasures, secrets and lots of space to realize your city-building dreams. Gather, craft, hunt, rear livestock and survive in the unforgiving wilderness .\nAvoid scorching midday temperatures, stay warm during freezing cold nights, and beware of dangerous wildlife. Bandits lurk at every corner, so you better learn to use weapons and defend yourself, your trading caravans as well as the township. From rags to riches: start as a settler, build your own ranch and expand it into a thriving, prosperous town. Create it any way you can imagine and build iconic western locations to realize your vision, from saloons and sheriff offices to blacksmiths and even hotels. Angel’s Gear",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/02/wild-west-dynasty-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/02/wild-west-dynasty-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10 (x64)",
        "Processor": "Intel Core i5-6600 (3.3 GHz), AMD Ryzen 5 1400 (3.2 GHz)",
        "Memory": "16 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1060, AMD Radeon RX 590",
        "DirectX": "Version 11",
        "Storage": "30 GB available space"
    },
    "game_info": {
        "Genre": "Adventure, RPG, Simulation",
        "Developer": "Moon Punch Studio",
        "Platform": "PC",
        "Game Size": "5.3 GB",
        "Released By": "RUNE",
        "Version": "v1.0.9064 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/fj5yfqaryo68"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/02/wild-west-dynasty-preinstalled-steamrip.jpg"
}