{
    "page_url": "https://steamrip.com/wildfrost-free-download-1f/",
    "title": "Wildfrost Directly Download",
    "description": "The world has succumbed to the Wildfrost. Now only Snowdwell and its survivors stand as the last bastion against an eternal winter Build up a deck of powerful card companions and elemental items, as you battle to banish the frost once and for all Perfect your card battling and deck-building skills, and set out on a quest to bring an end to The Wildfrost Begin each journey with your chosen tribe Leader, each gifted with different randomised skills and stats, before mapping out your chosen path into the unforgiving frosty landscape .\nRescue and recruit frozen companions you find along the way, unearth lost treasures, and spend your hard-earned blings with travelling merchants. The decisions you make and routes you take during each run will help craft a powerful deck, unique to you each time you play. Collect a huge array of cute, but mighty card companions, as well as handy items and clunker cards to aid you in battle. Experiment with different elemental card combinations to find your winning formula. Wartales\nYour companion cards aren’t just disposable minions for dealing out damage; upgrade and customise your favourites by adding wobbly charms to enhance their powers, making your deck a powerful (and adorable) force to be reckoned with Plan ahead with the help of a dynamic counter system to map out your next move and fend off frosty foes. While Wildfrost battles are turn-based, cards don’t attack every turn. Instead they have a ‘counter’ which counts down the amount of turns until they’re ready to automatically make their move By keeping an eye on enemy monsters ’ counters, you can plot ahead your perfect play. Buff your companions? Stall an enemy attack? Or maybe count down your own timer to wreak havoc fast! It’s up to you to strategically turn the tide in your favour.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/04/wildfrost-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/04/wildfrost-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7/10/11",
        "Processor": "4GHz",
        "Memory": "4 GB RAM",
        "Graphics": "2GB Dedicated GPU Memory",
        "DirectX": "Version 10",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Strategy",
        "Developer": "Deadpan Games, Gaziter",
        "Platform": "PC",
        "Game Size": "263 MB",
        "Released By": "CHRONOS",
        "Version": "v1.1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/3b13c9kvtw06"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/04/wildfrost-preinstalled-steamrip.jpg"
}