{
    "page_url": "https://steamrip.com/will-you-snail-free-download-1z/",
    "title": "Will You Snail?",
    "description": "Fast paced precision platforming. AI spawned traps. Cocky voice lines. Combat. Puzzles. Snails. Unicorns. A story about artificial intelligence and a dark secret to uncover. The evil AI Squid tries to predict your movement a few seconds ahead of time and uses that information in an attempt to stop you from reaching the end of the level.\nWill you win that intellectual battle or will Squid find yet another reason to make fun of you? A lot of levels in Will You Snail are relatively empty by default. The challenge comes from the interactions with the evil AI. You can change the difficulty at any time or let the game decide which one is the best one for you.\nSolve some easy puzzles to calm down from the action. There are some more difficult puzzles as well, but every single puzzle in Will You Snail is completely optional and can be skipped if you want to. Find secrets , collect clues and try to piece together where you are and what happened. Submerged: Hidden Depths\nWill You Snail tells a rather crazy story about artificial intelligence , simulation theory and the future of humanity. It is in my best interest to make sure you’re happy with your purchase decision as I want to keep the reviews on this game as positive as possible. Follow the instructions below to figure out if this game is for you.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/03/will-you-snail-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/03/will-you-snail-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (or newer)",
        "Processor": "Intel Core i3 4th generation or similar",
        "Memory": "4 GB RAM",
        "Graphics": "Intel HD 520 or similar",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Action, Indie",
        "Developer": "Jonas Tyroller",
        "Platform": "PC",
        "Game Size": "200 MB",
        "Released By": "SmartSteam",
        "Version": "Build 8337062 | Full  (Latest)",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/n1x7v0shnkaw"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/03/will-you-snail-preinstalled-steamrip.jpg"
}