{
    "page_url": "https://steamrip.com/winter-ember-free-download-1j/",
    "title": "Winter Ember",
    "description": "You are Arthur Artorias – the sole survivor of a massacre that devastated your family’s legacy and tore them out of the history books. Thought to be dead, you emerge from exile 8 years later, the faceless man kindled by the flame and seeking vengeance. Embark on an adventure unravelling a dark tale filled with twisted characters, centered around a militant religion hell bent on keeping control\nAs Arthur, you must stick to the shadows, infiltrate homes and explore hidden passageways; but, be careful not to be spotted Choose your playstyle: knocking out enemies may keep them quiet for some time, but they will eventually wake up; a quick slice to the throat may be a more permanent solution, but the bloodstain you leave on the carpet might be a dead giveaway! Keep your wits about you, dispose of bodies, peek through keyholes and pickpocket unsuspecting victims. Prepare for your mission by planning your loadout.\nWith over 30 arrows to craft, experimentation is key to your success! Do you craft a smoke arrow to blind your opponent, or do you add on a poison element to create poisonious gas? Use your arrows offensively or defensively: break down weak walls with a blunt arrow to surprise your enemy, or use a rope arrow to reach a higher place and take out your enemies from a distance. Mr.President!\nCustomize your playstyle from 3 distinct skill trees – stealth, combat, and utility. Unlock over 70 unique passive and active skills to choose from and seek vengeance your way. Return home to the cold Victorian town of Anargal, on the verge of technological breakthrough. Infiltrate and explore vast environments brimming with treasure and mystery. From rival gangs to unique characters, approach each scenario in a myriad of ways. Take advantage of the environment, find solutions to every problem, and move past any challenge standing in your way.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/winter-ember-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/winter-ember-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-6400",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 960",
        "DirectX": "Version 12",
        "Storage": "10 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Strategy",
        "Developer": "Sky Machine Studios",
        "Platform": "PC",
        "Game Size": "3.3 GB",
        "Released By": "GOG",
        "Version": "v1.6.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/voxn9zma1lp5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/winter-ember-preinstalled-steamrip.jpg"
}