{
    "page_url": "https://steamrip.com/winter-resort-simulator-2-anniversary-free-download-0u/",
    "title": "Winter Resort Simulator 2 Riedstein Edition Free",
    "description": "Winter Resort Simulator 2 Complete + Riedstein Edition game for free play pre-installed on SteamRiP\nIts is a realistic and authentic simulation of a ski resort with all its exciting technical facilities and vehicles. Experience the various everyday life of the ski resort manager Prepare the steepest slopes with originally licensed snowcats and operate various types of ropeways. FIGHT KNIGHT\nEarn money and invest in new facilities to make your own ski resort the very best Thanks to the new multiplayer mode, you can finally grab your friends and enjoy the game together Split the work and operate cable cars, prepare slopes and handle snow cannons. Or just join your friends’ vehicles on the passenger seat and throw a snowball Invite your friends to your map and operate the resort together in the multiplayer.\nCustomize your character and vehicles to fit them better in your overall ski resort theme! To top it all off, the overall performance of the game has been improved. The enhanced, more realistic snow system and improved vehicle controls make the game experience even more exciting than before. You want to build your own resort? No problem! includes a powerful in-game world editor, which allows you to modify the world any time in-game.\nBuild additional ropeways, design your own slopes or create your completely own ski resort You still want more? Check out the Steam Workshop and download new ropeways , missions, vehicles and whole ski resorts created by other players! The comprehensive modding support provides you with almost no limits for new content and features. And the best of it: All of the mod content can be used both in singleplayer or multiplayer – so create the ski resort of your dreams and enjoy it together with your friends",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/12/winter-resort-simulator-2-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/12/winter-resort-simulator-2-free-download-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Microsoft Windows 7 / 8 / 10 (64bit)",
        "Processor": "Dual Core with 3,0 GHz and Hyper Threading",
        "Memory": "8 GB RAM",
        "Graphics": "4 GB VRAM, Shader Model 5.1",
        "DirectX": "Version 11",
        "Storage": "12 GB available space"
    },
    "game_info": {
        "Genre": "Casual, Indie, Simulation",
        "Developer": "HR Innoways",
        "Platform": "PC",
        "Game Size": "2.4 GB",
        "Repack By": "SKIDROW",
        "Version": "v1.2.4 | Full  (Latest) Complete + Riedstein Edition",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/jsg2owet7c45"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/12/winter-resort-simulator-2-free-download-preinstalled-steamrip.jpg"
}