{
    "page_url": "https://steamrip.com/witchhand-free-download-w1/",
    "title": "WitchHand",
    "description": "In WitchHand, you use cards to build your empire of witches. Maximize the production of your villages and use your resources strategically to upgrade and expand. Focus on trade, alchemy research, or war in order to secure your coven’s place amongst the Council of Fates, influencing the destiny of all. River Town Factory\nWork with your neighbors to secure a better future or crush them and use their bones to fuel your spells. When the witching hour comes each night, your witch’s powers are at their strongest, while unseen forces work against you. You must expand and manage your coven to new heights if you are to withstand the coming darkness.\nWitchHand folds the 4X strategy formula into card-based gameplay. You’ll perform strategic actions like exploring, expanding, and exterminating through real-time card placement. Manage worker placement, village production, and research in order to advance the strength and reach of your coven.\nEach witch has a unique selection of spells, buildings, and units that defines them. Empower your villages and production with the Celestial Witch. Overpower your enemies with the might of the Chaos Witch. Cook delicious, stat-boosting meals with the Chef Witch. Choose the witch that best suits your playstyle and have full control over your research paths to further personalize your playthrough.\nThe Council of Fates does not have faith in your expedition to the Ninth. Make alliances with rival factions or declare war and take their resources for your own. Manage your relationships through trade and gifts or with a well-placed fireball spell. Grow your coven to new heights and prove the Council wrong.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/02/witchhand-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/02/witchhand-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: Windows XP and above",
        "Processor": "1.2Ghz",
        "Memory": "1024 MB RAM",
        "Graphics": "512MB",
        "Storage": "500 MB available space"
    },
    "game_info": {
        "Genre": "Simulation, Strategy",
        "Developer": "Jon Nielsen",
        "Platform": "PC",
        "Game Size": "302 MB",
        "Released By": "Mr_GOLDBERG",
        "Version": "Build 16703495 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/lfexvzg3rk6q"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/02/witchhand-preinstalled-steamrip.jpg"
}