{
    "page_url": "https://steamrip.com/wizard-of-legend-2-free-download/",
    "title": "Wizard of Legend 2",
    "description": "In an age of myth and magic, ambitious wizards from around the world have assembled to undertake the perilous Trials of Legend in the Floating Lands. Many will try. Most will fail. Only those who have truly mastered the chaotic, shifting elemental forces of Arcana will become a Wizard of Legend\nPrepare to face an all-new series of unpredictably perilous trials in Wizard of Legend 2*—the action-packed follow-up to the acclaimed dungeon -delving original, featuring vibrant new 3D visuals and fast-paced 2-player online co-op (with up to 4-player co-op at full launch). Wield familiar and new Arcana, experiment with devious new spell combinations , and seek immortality as you return again and again (and again) to master ever-changing rogue-lite challenges. SWORD ART ONLINE Fractured Daydream\nPut your spellcraft skills to the test in the Floating Lands—a shifting sorcerous gauntlet conjured forth by Hieronymus, Lanova’s wizard supreme to find a wizard worthy of legend. Get to know the peculiar and powerful members of the wizarding council as they oversee, guide, or throw a twist into your trials.\nHarness the power of familiar and new Arcana —attacks that tame the land’s magical chaotic forces into the form of fiery projectiles, magical melee strikes, swirling tempests, and more. Discover powers during your trial that change your Arcana (and your play) in unexpected ways. Mix, match, experiment, and master your favorite combinations until you find a new favorite on your next run .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/10/wizard-of-legend-2-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/10/wizard-of-legend-2-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5 3570 or AMD FX 8350",
        "Memory": "8 GB RAM",
        "Graphics": "NVIDIA GeForce GTX 1050 2GB or AMD RX 460 2GB",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Action, Indie, RPG",
        "Developer": "Dead Mage",
        "Platform": "PC",
        "Game Size": "3.2 GB",
        "Released By": "RUNE emu",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/6tq5psha81bp"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/10/wizard-of-legend-2-preinstalled-steamrip.jpg"
}