{
    "page_url": "https://steamrip.com/wo-long-fallen-dynasty-free-download-1s/",
    "title": "Wo Long: Fallen Dynasty Directly Download",
    "description": "A new dark fantasy Three Kingdoms action RPG from Team NINJA, the developers of Nioh. 184 AD, Later Han Dynasty China. The land is overcome by chaos and destruction .\nThe imperial dynasty that prospered for many years is now about to collapse. Wo Long: Fallen Dynasty is a dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Gone Rogue\nPlayers fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within. Wo Long refers to a crouching dragon, and also refers to a hero or person of greatness who is not yet known. This is the story of officers, who will later become heroes, during their ‘unknown’ period, and also the story of a protagonist’s rise from being a ‘nobody’. A dark fantasy set during the chaotic\nThree Kingdoms period, the narrative vividly tells the tale of a militia soldier’s strenuous fight for survival during a Later Han Dynasty infested with demons. It’s madness in the Three Kingdoms like never before Defeat deadly enemies to boost morale and awaken the power from within Overcome adversity through unique new strategies, including battle styles based on the “Five Phases ”",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2023/03/wo-long-fallen-dynasty-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2023/03/wo-long-fallen-dynasty-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows® 10, Windows® 11, 64bit",
        "Processor": "Intel® Core™ i5-8400、AMD Ryzen™ 5 3400G",
        "Memory": "8 GB RAM",
        "Graphics": "GeForce GTX 1650 4GB、Radeon RX 570 4GB",
        "DirectX": "Version 12",
        "Network": "Broadband Internet connection",
        "Storage": "60 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, RPG",
        "Developer": "KOEI TECMO GAMES CO., LTD.",
        "Platform": "PC",
        "Game Size": "54 GB",
        "Released By": "RUNE emu",
        "Version": "v1.201 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://gofile.io/d/X3pkus",
        "https://buzzheavier.com/pa2nmn2p085z",
        "https://1fichier.com/?5h2ni0qbafz6fjmi8tnd"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2023/03/wo-long-fallen-dynasty-preinstalled-steamrip.jpg"
}