{
    "page_url": "https://steamrip.com/wolfenstein-2009-free-download-f4/",
    "title": "Wolfenstein Free Download (2009) Direct Link",
    "description": "The game takes place in a town called Eisenstadt, where the legendary BJ Blaskowitz is sent on an extraordinary mission. But upon arriving at his destination, BJ is trapped. He does not have time to get to the headquarters and is eventually forced to flee. It is from this moment that all the fun begins. In his role, you will have to go on a long journey in which magic , a portal to another world, and much more awaits you.\nWolfenstein is an FPS action set in the fictional town of Isenstadt during World War II, which the Nazis have enforced martial law in order to excavate rare Nachtsonne crystals necessary to access the “Black Sun” dimension. In an introduction sequence special agent William “B.J.” Blazkowicz steals a medallion from a general on the German battleship Tirpitz. Discovered and captured, he unwittingly unleashes the power of the medallion , which kills all his foes for him. You will face many obstacles along with a great story line in this addition to the Wolfenstein series.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2021/06/wolfenstein-2009-free-download-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2021/06/wolfenstein-2009-free-download-crack-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows XP, Vista, or newer",
        "Processor": "Intel Pentium 4 3.2 GHz or better",
        "Memory": "1 GB RAM",
        "Graphics": "Video card must be 256 MB or better and should be a DirectX 9-compatible with support",
        "Storage": "6 GB available space"
    },
    "game_info": {
        "Genre": "Action, Shooter",
        "Developer": "Raven Software and Endrant Studios",
        "Platform": "PC",
        "Game Size": "5.5 GB",
        "Repack By": "RG Mechanics",
        "Version": "v1.2 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/t76z549iyhfx",
        "https://buzzheavier.com/ewillksvhalb"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2021/06/wolfenstein-2009-free-download-torrent-steamrip.jpg"
}