{
    "page_url": "https://steamrip.com/wolfenstein-the-old-blood-free-download/",
    "title": "Wolfenstein: The Old Blood",
    "description": "The year is 1946 and the Nazis are on the brink of winning World War II. In an effort to turn the tide in the allies’ favor, B.J. Blazkowicz must embark on an epic, two-part mission deep within Bavaria\nPart one of Wolfenstein: The Old Blood – Rudi Jäger and the Den of Wolves – pits BJ Blazkowicz against a maniacal prison warden as he breaks into Castle Wolfenstein in an attempt to steal the coordinates to General Deathshead’s compound. In part two – The Dark Secrets of Helga Von Schabbs – our hero’s search for the coordinates leads him to the city of Wulfburg where an obsessed Nazi archaeologist is exhuming mysterious artifacts that threaten to unleash a dark and ancient power. Trombone Champ: Unflattened\nThe Action Experience MachineGames’ intense first-person combat as you brandish all-new Nazi-inspired weapons such as the bolt-action rifle, 1946 shotgun, and the grenade-launching Kampfpistole . Unlock your potential with a new set of perks for hi-octane action and vicious stealth take-downs.\nThe Adventure Explore breath-taking set pieces featuring rural Germanic towns, sprawling valleys tangled with cable cars and bridges, ghostly catacombs, as well as a return to the iconic Castle Wolfenstein. Use dual-wielding metal pipes to navigate the world with brand new wall-climbing abilities.\nThe Terror Go up against a new cast of vicious villains and enemies, including legions of hulking new Super Soldiers, elite shock troops, drones and the darkest and most terrifying Nazi creations yet.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2024/12/wolfenstein-the-old-blood-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2024/12/wolfenstein-the-old-blood-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "*: 64-bit Windows 7/Windows 8",
        "Processor": "Intel® Core™ i5-2500 @ 3.3 GHz / AMD FX-8320 @ 3.5 GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA® GeForce® GTX 560 / AMD Radeon™ HD 6870 (1GB VRAM)",
        "Storage": "38 GB available space"
    },
    "game_info": {
        "Genre": "Action",
        "Developer": "MachineGames",
        "Platform": "PC",
        "Game Size": "35.7 GB",
        "Released By": "GOG",
        "Version": "v1.0 | Full",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://www.filecrypt.cc/Container/B6C8D4ED7B",
        "https://datanodes.to/18hd25sa3vtn/Wolfenstein-The-Old-Blood-SteamRIP.com.rar",
        "https://buzzheavier.com/lgv7xv1e1ovn"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2024/12/wolfenstein-the-old-blood-preinstalled-steamrip.jpg"
}