{
    "page_url": "https://steamrip.com/workers-resources-soviet-republic-free-download-1h/",
    "title": "Workers & Resources Soviet Republic",
    "description": "You have many options for how you will manage resources and goods transportation. If you get raw iron ore from a mine, you need to process it. Then you need to transport it somehow into a steel mill to produce steel. You can build the processing plant and steel mill near to the mine and transport it all by conveyors, or you can transport iron ore into a steel mill by train fora longer distance.\nIt is up to you to decide from where the workers will go into the factories. You can create residential zones and transport workers by buses or trains to industrial areas. You can also build residential buildings near the factories so that workers will able to walk to the factory. But don’t forget that a worker will need to purchase food and enjoy their free time, so again it is up to you to decide whether to build those facilities near their home or whether you will transport them somehow to shops or places to spend their free time.\nThere are, right now, over 30 commodities you can mine, transport and manufacture . If you want to get clothes you will first need to get resources to create a fabric, then you will need a clothing factory where the clothes will be manufactured from this fabric. You can then transport the finished clothes into shops where your citizens can buy them. PopSlinger\nEvery commodity has a specific requirement,so if you would like to load oil into the tank train-car you will need a special pumping loading station. If you need to load gravel into a dumper truck you need a special loading station where the gravel comes from conveyors into the truck. Liquid resources like oil or fuel can be stored only in tanks, while resources like wood, steel, or prefabricated concrete panels can be stored outside in the open space. Using a crane for these will increase loading/unloading speed.\nGoods like clothes, food, etc. can be stored in warehouses. Every worker/citizen goes to work each day. If they work for you, they have demands. At the start of the game they are satisfied just with food, but as a time goes on they may have more demands like meat, clothes, alcohol or electronics . Also, to have happy workers you need places where they can spend their leisure time – cinema, playgrounds, taverns, etc.\nEvery worker has an education level. They can go to school or college to improve this level. If their education is too low they cannot work; if their education is high enough they can be a teacher, or researcher, or work in factories with special requirements.",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2022/04/workers-resources-soviet-republic-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2022/04/workers-resources-soviet-republic-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 7 (64-bit), Windows 8 (64-bit), Windows 10 (64-bit)",
        "Processor": "2,5 GHz Dual Core",
        "Memory": "8 GB RAM",
        "Graphics": "DirectX 11 compatible gaming graphics card (2GB RAM or more).",
        "Storage": "5 GB available space"
    },
    "game_info": {
        "Genre": "Indie, Simulation, Strategy",
        "Developer": "3Division",
        "Platform": "PC",
        "Game Size": "5.7 GB",
        "Released By": "RUNE emu",
        "Version": "v1.1.0.12 | Full  + OST",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/q5r6j3skcjz8"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2022/04/workers-resources-soviet-republic-preinstalled-steamrip.jpg"
}