{
    "page_url": "https://steamrip.com/zort-free-download/",
    "title": "Zort",
    "description": "In this game, which can be played with up to 4 players, you can have fun, be scared, and enjoy the atmosphere while searching for an exit with your friends across different maps . You can collect items around and enjoy mini-games. Look for ways to escape from creatures and approach the end of the level. Try to survive with your friends and just have fun. There are some fun mechanics that we’re sure you’ve never seen before.\nOur game is a horror survival game that can be played with up to 4 players. While the game can be played solo, we recommend playing with 4 players. Playing with 4 people allows you to feel more immersed in the game and get scared with your friends. Night in the Woods\nThe in-game proximity voice chat feature allows you to communicate with your friends. Additionally, changing voice filters based on the atmosphere will make you feel more involved in the game. So we encourage you to use it.\nThere are multiple levels. You need to survive until you complete each level. Be wary of deadly creatures in those levels, as well as traps and other unexpected things on the map, that can lead to your death .\nYou must collect necessary items, overcome the creatures on the map, and finish the level without dying. Additionally, with our sanity system, you will need to pay attention to many things to maintain your mental health, even if you avoid environmental factors .",
    "screenshots": [
        "https://steamrip.com/wp-content/uploads/2025/02/zort-steamrip.jpg",
        "https://steamrip.com/wp-content/uploads/2025/02/zort-screenshots-steamrip.jpg"
    ],
    "system_requirements": {
        "OS": "Windows 10",
        "Processor": "Intel Core i5-7400 CPU @ 3.00GHz",
        "Memory": "4 GB RAM",
        "Graphics": "NVIDIA GForce GTX 1050",
        "DirectX": "Version 11",
        "Storage": "2 GB available space"
    },
    "game_info": {
        "Genre": "Action, Adventure, Indie, Early Access",
        "Developer": "Londer Software",
        "Platform": "PC",
        "Game Size": "1.3 GB",
        "Released By": "Mr_GOLDBERG",
        "Version": "v0.3.4 | Early Access",
        "Pre-Installed Game": ""
    },
    "download_links": [
        "https://megadb.net/hlbiq8fx6hc5",
        "https://buzzheavier.com/4kpzhs2doyc5"
    ],
    "cover_image": "https://steamrip.com/wp-content/uploads/2025/02/zort-preinstalled-steamrip.jpg"
}